<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>U</B></font><FONT color="#000000" size=2 face="arial"><B>n Paseo por Nuestra Historia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Aventuras AD. La cuna de la aventura en España
</FONT>
</H3>

</P>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
Como lo prometido es deuda en este n&uacute;mero de Macedonia vamos hablar del m&iacute;tico y personal&iacute;simo sello espa&ntilde;ol <B>Aventuras AD</B> sin duda, la casa m&aacute;s importante que existi&oacute; en nuestro pa&iacute;s en el campo de las aventuras conversacionales. Cuando un servidor se pone a recordar su juventud, su infancia, pasan por delante de sus ojos multitud de compa&ntilde;&iacute;as, tanto espa&ntilde;olas como extranjeras. De las espa&ntilde;olas se guardan muy buenos recuerdos pero, quiz&aacute;s, algo injustos pues siempre recordamos los cuatro o cinco nombres m&aacute;s importantes y nos olvidamos por completo de los sellos que, en muchas ocasiones, "alimentaban" a las primeras. Aventuras AD (que no AD como intentar&eacute; aclarar m&aacute;s adelante), comenz&oacute; su andadura en el panorama inform&aacute;tico como una casa que, trazando un sabio plan de producci&oacute;n, fue capaz de sentar un "est&aacute;ndar" dentro de la creaci&oacute;n aventurera espa&ntilde;ola que es lo mismo que decir que aguantaron hasta el final, hasta cuando ya no es que no funcionara el g&eacute;nero aventurero sino que los que pon&iacute;an el dinero, ya no lo ten&iacute;an. Pero vayamos por partes...</P>
</FONT><FONT FACE="Arial">
<H4>¿Es AD o Aventuras AD?</H4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Esta pregunta es vital para comenzar a describir el nacimiento de esta legendaria compa&ntilde;&iacute;a ya que, antes de que lo que hoy en d&iacute;a conocemos por Aventuras AD hiciera acto de presencia y sentara "c&aacute;tedra" existi&oacute; otra cosa llamada AD que poco tiene, en el significado, que ver con la primera.</P>
<P ALIGN="JUSTIFY">Vamos a situarnos. Estamos en la &eacute;poca en la que <B>Dinamic</B> <I>hac&iacute;a juegos </I>y era conocida por la calidad de los mismos, estamos en la &eacute;poca de los <I>aut&eacute;nticos</I> hermanos <B>Ruiz</B>. Por aquellas fechas, las aventuras conversacionales en Espa&ntilde;a eran m&aacute;s o menos algo desconocido, reservado a una minor&iacute;a que las adquir&iacute;a v&iacute;a importaci&oacute;n con el "&uacute;nico" consuelo de tener una joya del soft entre sus manos pero, tambi&eacute;n, tener que enfrentarse a un buen mont&oacute;n de pantallas en ingl&eacute;s, est&aacute; claro que por aquellas fechas lo que mandaba era la v&iacute;deo - aventura y los arcades. Sin embargo, Espa&ntilde;a tambi&eacute;n era, como todos sabemos, una fuente muy importante de producci&oacute;n dentro de Europa y no tardando se comenzaron a realizar aventuras conversacionales en nuestro pa&iacute;s. </P>
<P ALIGN="JUSTIFY">Como no pod&iacute;a ser de otro modo, fue Dinamic la que se llev&oacute; "el gato al agua" con t&iacute;tulos <B>como El Quijote</B>, Los p&aacute;jaros de <B>Bangkok, Megacorp</B> (t&iacute;tulo inspirado, en gran parte, en la gran obra aventurera, <B>Rebel Planet</B>) o, la parodia, <B>La guerra de las Vajill</B>as. Estos t&iacute;tulos salieron bajo un sello espec&iacute;fico de Dinamic llamado AD, esto es, <B>Aventuras Dinamic</B>. Como pod&eacute;is apreciar, Aventuras AD, a&uacute;n no ha hecho acto de presencia "tan s&oacute;lo", tenemos unos pocos t&iacute;tulos que Dinamic produjo bajo un sello espec&iacute;fico, AD. Este sello, se caracterizaba por no tener un grupo de desarrollo concreto, es decir, AD, lo eran todas aquellos sellos distintos que, habiendo realizado una aventura, vend&iacute;an sus derechos a Dinamic public&aacute;ndolos, esta &uacute;ltima, bajo el sello AD. Creo que es muy importante volver sobre el hecho de que, aunque en Espa&ntilde;a se hac&iacute;an aventuras, estas no ten&iacute;an una base de producci&oacute;n s&oacute;lida en el sentido de que no hab&iacute;a una o varias entidades con suficiente "peso" y determinaci&oacute;n para especializarse en su producci&oacute;n de un modo continuado. Sin embargo, aparecer&aacute; un se&ntilde;or llamado Andr&eacute;s Samudio, el padre de Aventuras AD y una de las m&aacute;ximas personalidades (por no decir la m&aacute;xima) del mundo de la aventura de nuestro pa&iacute;s.</P>
<P ALIGN="JUSTIFY">S&iacute;, es en el a&ntilde;o 1988 cuando <B>Andr&eacute;s Samudio</B>, despu&eacute;s de crear, junto al programador <B>Manolo Mart&iacute;nez </B>y el grafista <B>Carlos Marqu&eacute;s</B>, su propia versi&oacute;n de <B>La Aventura Original</B> decide darla a conocer. Antes de proseguir con la explicaci&oacute;n, hay que a&ntilde;adir que, si bien, la Aventura Original servir&iacute;a como "carta de presentaci&oacute;n" a Samudio &eacute;ste, ya habr&iacute;a creado otra aventura con anterioridad (remarcando, a&uacute;n m&aacute;s, la experiencia de esta persona en el mundo de la aventura), se trataba de <B>La Diosa de Cozumel</B>, t&iacute;tulo al que se retornar&iacute;a en un futuro... <BR>
<BR>
Volviendo al punto en el que nos encontr&aacute;bamos, La Aventura Orignal servir&iacute;a para dar a conocer el trabajo del peque&ntilde;o gran grupo <B>Samusoft</B>. El camino m&aacute;s l&oacute;gico ser&iacute;a el de acudir a los hermanos Ruiz de Dinamic ofreci&eacute;ndoles la distribuci&oacute;n del producto. Es, en este punto, cuando podemos hablar de que est&aacute; naciendo Aventuras AD ya que, a ra&iacute;z de la distribuci&oacute;n de la Aventura Original, Samusoft<I>,</I> que era el sello de Andr&eacute;s Samudio, y Dinamic se van a sentar a conversar. As&iacute;, mediante un acuerdo, Dinamic se va a comprometer a sacar a la venta aventuras conversacionales realizadas, en exclusiva, por un nuevo sello con ubicaci&oacute;n en Valencia, dicho nuevo sello, capitaneado por el irrepetible Samudio, tomar&aacute; el nombre de Aventuras AD pero, y esto es muy importante, por pura estrategia de mercado, es decir, Dinamic ya hab&iacute;a abierto una brecha en el sector aventurero mediante la "denominaci&oacute;n" AD, as&iacute; que, para aprovechar todo el posible "marqueting" que ya se hab&iacute;a construido, se decidi&oacute; a&ntilde;adir al nombre la coletilla AD por pura estrategia de mercado. Por tanto, recordad, que el grupo valenciano se llamar&aacute; Aventuras AD, no significaba que perteneciera a Dinamic. Aventuras AD, fue un sello independiente que "utilizaba" a Dinamic como distribuidora (algo igual a lo que est&aacute; ocurriendo en nuestros d&iacute;as con casas como <I>P&eacute;ndulo Studios, Efecto Caos, Balance</I>, etc,), es decir, Aventuras AD hac&iacute;a los juegos y Dinamic se encargaba de todas las cuestiones econ&oacute;micas mediante la distribuci&oacute;n y la puesta de "material". Es muy importante tener esto bien claro ya que son temas muy delicados...</P>
</FONT><FONT FACE="Arial">
<H4>Andr&eacute;s Samudio y ese irrepetible equipo llamado Aventuras AD.</H4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Como coment&aacute;bamos m&aacute;s arriba, Aventuras AD estuvo formada inicialmente <B>por <I>Andr&eacute;s Samudio</I>, <I>Manolo Mart&iacute;nez</I> y <I>Carlos Marqu&eacute;s</B></I> sin embargo, era a todas luces, un equipo insuficiente si lo que se pretend&iacute;a era sacar t&iacute;tulos en plan mucho m&aacute;s serio y con una l&iacute;nea de producci&oacute;n constante y creciente, es decir, t&iacute;tulos profesionales y capaces de competir con la multitud de juegos que inundaban aquellos tiempos de 8 bits.</P>
<P ALIGN="JUSTIFY">Progresivamente y una vez "abiertas" las oficinas de Aventuras AD en Valencia, se fueron incorporando m&aacute;s personas a la plantilla de este m&iacute;tico grupo, as&iacute;, tenemos a <B><I>Juan Manuel Medina</B></I> que cubri&oacute; la parte programadora despu&eacute;s de la ida de <I>Manolo Mart&iacute;nez</I>, esto es, la segunda y &uacute;ltima etapa de Aventuras AD, <B><I>Juan J. Mu&ntilde;oz</B></I>, con la importante tarea de colaborar codo con codo con Andr&eacute;s en todo lo referente a guiones y texto (y el director del <B>CAAD</B>, club del que se hablar&aacute; despu&eacute;s) y ya, cuando los ordenadores de 16 bits empezaron a asomar su cabeza fue otro grafista el que se encargaba de trabajar con ellos, este era <B><I>Carlos Darder</I>.</B> </P>

<P ALIGN="JUSTIFY">Estas personas configuraron el equipo principal, la "columna vertebral" de Aventuras AD sin embargo, tambi&eacute;n hab&iacute;a una gran cantidad de colaboradores y dem&aacute;s personal encargado en depurar el trabajo de ellos mediante las imperdonables etapas de testeo (cosa normal en toda producci&oacute;n que se precie), apuntar nuevas ideas o colaborar en alg&uacute;n tema de producci&oacute;n del producto en s&iacute;, como por ejemplo, los aspectos gr&aacute;ficos y aqu&iacute; deber&iacute;amos de citar a dos estupendos dibujantes como son <B><I>Paco Zarco</I> y <I>Vicente Misas.</B> </P>
</I><P ALIGN="JUSTIFY">Como dato anecd&oacute;tico, en la labor de testeo se volcaba todo el equipo de Aventuras AD y, en especial, hay que rese&ntilde;ar la importante participaci&oacute;n de <B><I>Eva</I> <I>Samitier</B></I>, la secretaria de Aventuras AD, y las hijas de Andr&eacute;s, <B><I>M&oacute;nica</I> y <I>Guisela</B></I>. </P>
<br><br>
<CENTER><TABLE><td>
<center><img src="jpg/e_ad.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<center>
<b>En la foto, una parte muy importante de Aventuras AD:<br>
Empezando por la izquierda Eva Samitier, secretaria y<br>
betatester, luego Juan Antonio Darder, grafista de 16 bits, Carlos Marqués,<br>
grafista de 8 bits, Juanjo Muñoz guionista y director actual del CAAD,<br> Paco
Zarco y Vicente Misas, dibujantes y finalmente Andrés Samudio, director de Aventuras AD
</b>
</center></td>
</table></center>
<p align = justify>
<br><br>

<P ALIGN="JUSTIFY">
Antes de dejar este apartado dedicado a comentar la plantilla de Aventuras AD, me gustar&iacute;a hacer menci&oacute;n especial, otra vez, a Andr&eacute;s Samudio que fue no s&oacute;lo el motor de esta compa&ntilde;&iacute;a sino que se convirti&oacute;, por m&eacute;ritos propios, en uno de los personajes no s&oacute;lo m&aacute;s importantes (o el que m&aacute;s) del panorama aventurero espa&ntilde;ol, sino que tambi&eacute;n lo fue en todo el conjunto global de la &eacute;poca de los 8 bits. ¿Qui&eacute;n no recuerda los estupendos art&iacute;culos de Samudio en la desaparecida y controvertida (al menos en su etapa final) <B>MicroHobby</B>?, art&iacute;culos, todos ellos, cargados de una gran personalidad y profundidad que, ahora que soy "m&aacute;s "mayorcito", vuelvo a leer cuando la nostalgia se apodera de mi. A Samudio se le puede considerar como una de las personalidades de aquella &eacute;poca de los 8 bits, como una de las figuras claves dentro de todo lo que lleg&oacute; a ser nuestra industria. A &eacute;l se le deben muchas cosas, entre otras, las activas colaboraciones en revistas del sector y cuando digo revistas, no s&oacute;lo estoy pensando en la a&ntilde;orada por muchos y criticada por otros, MicroHobby sino que tambi&eacute;n lo hago en <B>MegaOcio,</B> publicaci&oacute;n que contaba con Andr&eacute;s Samudio para llevar adelante una secci&oacute;n dedicada a ayudar a toda la legi&oacute;n de aventureros que hab&iacute;a en nuestro pa&iacute;s. Creo que queda claro la importancia de Samudio no s&oacute;lo como el padre de Aventuras AD sino que tambi&eacute;n como uno de <I>las <B>5 o 6</B> <B>figuras espa&ntilde;olas claves de nuestra &eacute;poca oro dentro del software de entretenimiento.</P>
</B></I></FONT><FONT FACE="Arial">
<H4>Un repaso a los t&iacute;tulos de Aventuras AD.</H4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Durante todo el tiempo que Aventuras AD estuvo en funcionamiento, que fueron <B>5 a&ntilde;os</B>, se produjeron <B>6 t&iacute;tulos</B>, muchos de los cuales son considerados ya como aut&eacute;nticas obras de culto. Uno de los aspectos que se podr&iacute;an destacar acerca de la l&iacute;nea de producci&oacute;n del grupo valenciano ser&iacute;a la de haber comenzado tocando guiones y desarrollos distintos para acabar realizando una impecable triolog&iacute;a que, l&oacute;gicamente, supon&iacute;an una continuidad en cuanto a la l&iacute;nea de producci&oacute;n que anteriormente mencionaba.</P>
<P ALIGN="JUSTIFY">La primera aventura que sali&oacute; con la denominaci&oacute;n de Aventuras AD fue su propia versi&oacute;n de <B>La Aventura Original</B>. Para los que no lo sepan, decir que la pr&aacute;ctica totalidad del "universo aventurero" comparte la idea de que la primera aventura conversacional fue <B>Colossal Cave</B> programa que se escribi&oacute; a finales de los a&ntilde;os 60 por <B><I>Crowther y Woods</B></I>. Dicha aventura fue escrita totalmente en Fortran (el lenguaje est&aacute;ndar pues a&uacute;n el C no estaba desarrollado, entre otras cosas porque el sistema operativo para el que se construir&iacute;a, esto es, el Unix –1969-, a&uacute;n no hab&iacute;a sido desarrollado por entero) y sent&oacute; c&aacute;tedra pues todas las aventuras que se crear&iacute;an despu&eacute;s iban a ser variaciones sobre el cl&aacute;sico de Crowther y Woods. En el caso de Aventuras AD, la primera parte del juego consist&iacute;a en hallar la entrada a las grutas, mientras que la segunda se basaba por completo en el robo y posterior huida del infierno subterr&aacute;neo. La Aventura Original fue, sin duda alguna, un forma estupenda de entrar en escena para el grupo valenciano.</P>
<CENTER><table>
<td><img src="jpg/adori.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><CENTER><b>Pantalla de la Aventura Original</CENTER></b></td>
</table></CENTER>

<P ALIGN="JUSTIFY">A la Aventura Original le seguir&iacute;a, un a&ntilde;ito despu&eacute;s, en el 89 <B>Jabato</B> uno de los juegos que m&aacute;s expectaci&oacute;n caus&oacute; pues se trataba del primer producto totalmente "made in Aventuras AD", al no estar inspirado en ninguna aventura anterior. Jabato a muchos de vosotros os sonar&aacute; pues se trataba de un conocido personaje del c&oacute;mic. En el juego de Aventuras AD, deber&iacute;amos de escapar de una mazmorra romana para encontrar a nuestra (c&oacute;mo no) amada a trav&eacute;s de todo el Imperio Romano y Egipto. Pese a que Jabato fue el segundo programa de Aventuras AD tambi&eacute;n puede ser considerado como la consagraci&oacute;n del grupo ya que, como veremos a continuaci&oacute;n, la experiencia fue ampliamente asentada y al siguiente a&ntilde;o, esto es, en el 90 podr&iacute;amos disfrutar nada menos que de dos nuevas e importantes aventuras.</P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/cozumel.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b>Portada de Cozumel</b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
<P ALIGN="JUSTIFY">La primera de las aventuras con las que Aventuras AD abri&oacute; su particular a&ntilde;o 1990 fue la conocida <B>Cozumel</B>, aventura que supondr&iacute;a un aut&eacute;ntico punto de inflexi&oacute;n en su producci&oacute;n ya que constitu&iacute;a la primera parte de su famosa triolog&iacute;a. Hay que tener en cuenta que, este t&iacute;tulo era realmente <B>La Diosa de Cozumel</B> original de Andr&eacute;s y que fue renombrada a Cozumel, debido a que se pensaba traducirla y exportarla al extranjero, resultando por tanto un t&iacute;tulo mucho m&aacute;s "comprensible". <BR>
</P>
<P ALIGN="JUSTIFY">En la Cozumel, nos introduc&iacute;amos en la piel de <B>Doc Monro</B> el cual, tras llegar a la isla de Cozumel a causa de un terrible naufragio de su expedici&oacute;n destinada a explorar los restos de la civilizaci&oacute;n maya, se encuentra en serios apuros y deber&aacute; de ingeni&aacute;rselas para sobrevivir al tiempo que intentar llegar a su destino sin nadie de su expedici&oacute;n. </P>
<P ALIGN="JUSTIFY">Despu&eacute;s de Cozumel, vendr&iacute;a y en el mismo 1990, como ya apunt&eacute; m&aacute;s arriba, una producci&oacute;n que se "escapaba" de la tem&aacute;tica m&aacute;s o menos general de todas sus creaciones. Se trataba de la <B>Aventura Espacial</B> (s&iacute;, la de la portada con aquella chica tan... ;-) ) en esta aventura, pertenec&iacute;amos a un reducido y selecto grupo formado por la &eacute;lite de las razas interestelares, nuestro objetivo era el de detener una sonda que amenazaba con destruir todo el universo habitado. De la Aventura Original decir que, tal vez, no obtuvo tanto &eacute;xito cr&iacute;tico como las anteriores producciones ahora bien, contaba al igual que cont&oacute; La Diosa de Cozumel con unos gr&aacute;ficos magn&iacute;ficos para las versiones de 16 bits. Est&aacute;bamos asistiendo ya a una evoluci&oacute;n l&oacute;gica de Aventuras AD. ¡Qu&eacute; l&aacute;stima que no pudieran seguir as&iacute;!....</P>
<P ALIGN="JUSTIFY">Las dos &uacute;ltimas grandes producciones de Aventuras AD ser&iacute;an las que cerrar&iacute;an la triolog&iacute;a iniciada con Cozumel. As&iacute;, en el 91 podr&iacute;amos jugar con <B>Los Templos Sagrados</B> y en el 92 con <B>Chich&eacute;n Itz&aacute;</B>, final de las aventuras de Doc Monro y final, tambi&eacute;n, de nuestra querida Aventuras AD. </P>
<P ALIGN="JUSTIFY">Antes de dar por acabado el recorrido por los t&iacute;tulos de Aventuras AD, habr&iacute;a que se&ntilde;alar que, en realidad, el sello Valenciano hizo m&aacute;s aventuras adem&aacute;s de las seis conocidas. Se hicieron <B>versiones para Atari ST</B> de <B>Los P&aacute;jaros de Bangkok y Don Quijote</B>, que nunca vieron la luz, as&iacute; como otra aventura de Spectrum <B>Supervivencia</B>, m&aacute;s conocida como <B>El Fifurcio</B>. Esta &uacute;ltima se hizo especialmente para la revista MicroHobby, y consist&iacute;a en la aventura demo del parser <B>PAW</B>, traducida, mejorada y con m&aacute;s localidades y problemas. </P>
</FONT><FONT FACE="Arial">
<H4>Y otra m&aacute;s que se nos fue...</H4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Quiz&aacute;s muchos opinen que la desaparici&oacute;n de Aventuras AD se debi&oacute; simplemente al hecho de que "no vend&iacute;an", es decir, que el g&eacute;nero de las aventuras conversacionales era algo totalmente muerto. En parte, sea cierto que, como en todas las cosas hay que avanzar y, concretamente en el caso de las aventuras, estaban ya empezando a sonar aires con nombres como <B>Sierra On-Line o LucasFilm Games</B> dispuestos a poner "patas arriba" este sector y a "reeducar" a los jugadores Europeos. Quiz&aacute;s, Aventuras AD se deber&iacute;a de haber "actualizado" antes y dejar de trabajar sobre aventuras de texto. Sin embargo, el que piense as&iacute; se equivoca o, mejor dicho, el que piense as&iacute; es que realmente conoce poco la historia del soft espa&ntilde;ol. </P>
<P ALIGN="JUSTIFY">Por aquel 1992, las trompetas que anunciaban la desaparici&oacute;n de las casas de 8 bits eran ya un hecho, sin embargo, hab&iacute;a un grave problema, en Espa&ntilde;a <B>a&uacute;n se &quot;vend&iacute;a&quot; en formato de 8 bits</B> y, por otro lado, el producir para los 16 bits, sobre todo Amiga y Atari no era rentable, es decir, se perd&iacute;a dinero, m&aacute;s que haciendo lo mismo para los 8 bits. Como nuestras casas desarrolladoras "no viv&iacute;an del aire", no pod&iacute;an permitirse el lujo de cambiar a una plataforma de la que s&iacute;, estaba el futuro, pero no a corto plazo. Este hecho, obligo a tener que seguir produciendo para una gran cantidad de plataformas distintas e imposibilit&oacute; el hecho de invertir en desarrollo de "nuevas tecnolog&iacute;as" tales como un sistema gr&aacute;fico para el desarrollo de aventuras. Pero, ¡c&oacute;mo se puede pensar que Aventuras AD no quisiera realizar sus aventuras lo m&aacute;s avanzadas tecnol&oacute;gicamente posibles!, creo que pensar as&iacute; es una total equivocaci&oacute;n. La verdadera causa del adi&oacute;s repentino y llorado a Aventuras AD se debi&oacute; &uacute;nica y exclusivamente a la muerte de la industria en nuestro pa&iacute;s, a la ca&iacute;da de grandes "imperios" econ&oacute;micos como fueran <B>Dinamic</B>, <B>Opera, Zigurat o Topo</B> que llevaron tras de s&iacute; al resto de casas que deb&iacute;an de "amamantarse" econ&oacute;micamente de estas. Una de las cosas que estoy aprendiendo despu&eacute;s de hablar, gracias a Macedonia, con personalidades de aquella &eacute;poca es a quitar aquel concepto del "en Espa&ntilde;a nuestros programadores no fueron capaces de adaptarse a la tecnolog&iacute;a de 16 bits" ya que s&iacute; que hubieran sido capaces de eso y mucho m&aacute;s, como se demostr&oacute; con algunas representaciones m&aacute;s que dignas. Lo que propici&oacute; esa desaparici&oacute;n fue, el ya citado, "cochino" dinero que de la noche a la ma&ntilde;ana se "trag&oacute;" a todas nues
tras casas y, entre ellas, a Aventuras AD. No hace falta preguntarles mucho a las personas que crearon los juegos con los que crecimos muchos de nosotros para ver como a&uacute;n recuerdan las ilusiones que ten&iacute;an puestas con todos los nuevos proyectos que estaban preparando para llevar a cabo y que, por falta de recursos econ&oacute;micos, finalmente no pudieron abordar. </P>
<P ALIGN="JUSTIFY">En el caso de Aventuras AD, esta suspensi&oacute;n de pagos desde Dinamic, hizo que jam&aacute;s pudi&eacute;ramos ver una aventura gr&aacute;fica suya M&Aacute;S :,-(.</P>
</FONT><FONT FACE="Arial">
<H4>Sin embargo el esp&iacute;ritu de Aventuras AD sigue vivo...</H4>
</FONT><FONT FACE="Arial" SIZE=2>
<table align="left">
<td><img src="jpg/ad20.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Portada de un especial del CAAD</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
<P ALIGN="JUSTIFY">S&iacute;, est&aacute; claro que no volver&aacute; a existir una casa en el panorama nacional capaz de generar seguidores y m&aacute;s concretamente un club de personas dispuestas a levantar a su compa&ntilde;&iacute;a preferida hasta la cima. Este es el caso del <B>CAAD</B>, o m&aacute;s formalmente, <B>Club de Aventuras AD</B> que, antes de la desaparici&oacute;n de la primera se asent&oacute; y empez&oacute; a funcionar como una publicaci&oacute;n aventurera en la que los jugadores y seguidores de Aventuras AD ten&iacute;an un lugar para "reunirse" y charlar de lo que realmente les gustaba, los juegos de Aventuras.</P>
<P ALIGN="JUSTIFY">El CAAD fue ideado por <B>Juan J. Mu&ntilde;oz</B> (s&iacute;, uno de los miembros de Aventuras AD) en el a&ntilde;o <B>1988</B> y, un a&ntilde;o despu&eacute;s, esto es en el 89 sac&oacute; su primer n&uacute;mero. Y es que hablar del CAAD ocupar&iacute;a montones de p&aacute;ginas como esta. S&oacute;lo tienes que acudir a su WEB y perderte durante toda una tarde (o todas las que te hagan falta) en sus archivos y textos, algo imprescindible para cualquier jugador con un m&iacute;nimo concepto de lo que debe ser un juego de ordenador.</P>
<P ALIGN="JUSTIFY">En la actualidad, el CAAD ya va por el n&uacute;mero 33 y dentro de poco tendremos la suerte de asistir a su primer aniversario s&iacute;, el CAAD est&aacute; apuntito de cumplir 10 a&ntilde;os, toda una aut&eacute;ntica demostraci&oacute;n de lo que debe ser un fanzine. Yo, personalmente, me arrepiento de mi ignorancia por haber estado viviendo por estos mundos sin haberme atrevido a preguntar, hasta no hace excesivamente poco tiempo ¿qu&eacute; es eso llamado el CAAD?. Si es t&uacute; caso, por favor, </FONT><A HREF="http://www.arrakis.es/~caad"><FONT FACE="Arial" SIZE=2>p&aacute;sate por su p&aacute;gina</FONT></A>.</P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Puedes saber m&aacute;s del CAAD, </FONT><A HREF="juanjo.htm"><FONT FACE="Arial" SIZE=2>consultando la entrevista</FONT></A><FONT FACE="Arial" SIZE=2> que hicimos, en el n&uacute;mero 3 de Macedonia, a su director Juan J. Mu&ntilde;oz el cual, por cierto, ha sido de vital ayuda para la realizaci&oacute;n de este extenso art&iacute;culo.</P>
<P ALIGN="JUSTIFY">En fin, amigos, Aventuras AD desapareci&oacute; pero s&oacute;lo como entidad ya que, en la actualidad, existe una cosa llamada el CAAD que es un de los centros m&aacute;s importantes del panorama aventurero. Nuestro amigo y director del CAAD, Juanjo Mu&ntilde;oz, no se cansa de repetirnos que, con el d&eacute;cimo a&ntilde;o del CAAD, la aventura en Espa&ntilde;a promete volver a renacer, ¿qu&eacute; que me parece?, pues que est&aacute; en lo cierto, s&oacute;lo ten&eacute;is que sentiros inmerso en este "mundo de la aventura" participando en &eacute;l. Una forma bien sencilla es mediante el <B>concurso de creaci&oacute;n de aventuras m&aacute;s importante que hay en</B> <B>Espa&ntilde;a</B> y que est&aacute; convocado, como no pod&iacute;a ser de otro modo, por el CAAD. <BR>
Si quieres obtener m&aacute;s informaci&oacute;n sobre el mismo, puedes consultar las <B>bases</B> desde Macedonia pulsando </FONT><A HREF="caad1.htm"><FONT FACE="Arial" SIZE=2>aqu&iacute;</FONT></A><FONT FACE="Arial" SIZE=2> o bien, dirigi&eacute;ndote directamente a la p&aacute;gina del </FONT><A HREF="http://www.arrakis.es/~caad"><FONT FACE="Arial" SIZE=2>CAAD</FONT></A><FONT FACE="Arial" SIZE=2>. </P>
<B><P ALIGN="JUSTIFY">Documentaci&oacute;n de apoyo:</P>
</B><P ALIGN="JUSTIFY">CAAD<BR>
</FONT><A HREF="http://www.arrakis.es/~caad"><B><FONT FACE="Arial" SIZE=2>http://www.arrakis.es/~caad</B></FONT></A><FONT FACE="Arial" SIZE=2> </P>
</FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsb.htm"><font FACE="ARIAL"><B>[Un paseo por nuestra historia]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

