<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>U</B></font><FONT color="#000000" size=2 face="arial"><B>n Paseo por Nuestra Historia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>U</B></font><FONT color="#000000" size=2 face="arial"><B>n Paseo por Nuestra Historia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>


<FONT color="#000000" face="arial">        
<H3>
Dinamic, una historia plagada de &eacute;xitos.
</H3>
<H4>La aut&eacute;ntica Dinamic.</h4>
</FONT>



<FONT color="#000000" face="arial" size=2>        
<P ALIGN=justify>
Si me tuviera que quedar con alguna compa&ntilde;&iacute;a espa&ntilde;ola que en la d&eacute;cada de
los 80 fuese capaz de plantar cara a las grandes del panorama internacional,
que cada t&iacute;tulo fuese esperado siempre con la m&aacute;xima espectaci&oacute;n, que se
preocupara de promover la programaci&oacute;n en nuestro pa&iacute;s, en definitiva, que
brillara siempre por encima de las dem&aacute;s, esa ser&iacute;a sin dudas Dinamic, la
de los hermanos Ruiz, la que consigui&oacute; que all&aacute; por Inglaterra, Francia y
Alemania, la gente nos mirara de modo bien diferente.
<br>
<br>
Antes de continuar quiero se&ntilde;alaros que, en este art&iacute;culo voy a hablaros
de la Dinamic de los 80, no de la Dinamic de finales de los 97 (la actual
Dinamic), ya que la actual Dinamic no tiene el espíritu de la
anterior, por desgracia.
<br>
<br>

<table align = right>
<td><img src="gif/saima.gif"></td>
<tr><td><center>
<FONT color="#000000" size=1 >
<b>Saimazoon fue el primero de Dinamic.</b>
</center></td></center>
</table>
<p align=justify>
Por aquellos 80 dos hermanos, en su propia habitaci&oacute;n crean lo que es
la actual Dinamic Multimedia (s&iacute;, la creadora de los PC Futbol), con much&iacute;sima
ilusi&oacute;n pero con pocos medios, los Ruiz, comienzan a darle a los Spectrum y
Amstrad CPC,
y su talento quedar&aacute; patente en t&iacute;tulos de la talla del
Video Olympic, Saimazoon, Babaliba, West Bank o en genial Abu Simbel Profanation.

Toda esta colecci&oacute;n de t&iacute;tulos sellar&aacute;n la primera etapa como compa&ntilde;&iacute;a, siendo
todos ellos aut&eacute;nticos cl&aacute;sicos y obras de culto para los nost&aacute;lgicos.
<br>
<br>
<P ALIGN=justify>
<FONT color="#000000" size=2 face=arial>
Si bien, es ahora cuando Dinamic alcanzar&aacute; la consagraci&oacute;n o madurez como
casa desarrolladora de juegos para los 8 bits, y es que los t&iacute;tulos que
empiezan a producir son todos de una calidad suprema, y no s&oacute;lo ser&aacute;n 
jugados en nuestro pa&iacute;s, sino que mediante Electronic Arts y Ocean llegar&aacute;n
al resto de paises extranjeros, alcanzando unas estupendas puntuaciones
en todas las revistas del sector.
<br><br>
<table align = left>
<td><img src="gif/fhms.gif"></td>
<tr><td><center>
<FONT color="#000000" size=1 >
<b>Freddy fue uno de los personajes<br> más carismáticos de Dinamic.</b>
</center></td></center>
</table><p align=justify>
Los t&iacute;tulos con los que consiguieron tales
aza&ntilde;as fueron juegos tan
innolvidables como el Camelot Warriors, Army Moves,
el Navy Moves, Hundra, el super genial Fernando Mart&iacute;n (lo siento pero es que
era fant&aacute;stico), el Game Over, el Freddy Hardest, Sat&aacute;n o Capit&aacute;n Trueno entre
otros. Hasta aqu&iacute; habr&iacute;amos citados los t&iacute;tulos m&aacute;s importantes de la
d&eacute;cada de los 80.
<br>
<br>
Como es lógico y tal como pasó con Aventuras AD (de la que hablaremos más adelante), todos
estos juegos no estuvieron creados por el equipo principal o el núcleo de Dinamic. Las
compañías freelance jugaban un papel fundamental y buena parte de los grandes éxitos
de las compañías "madres" que hubo en España, con Dinamic a la cabeza, fueron creados
por estas freelances.
<br>
<br>

El empezar los 90, va a suponer un cambio de tecnolog&iacute;a, ya que los 16 bits
empiezan a penetrar en el mercado y Dinamic intenta no quedarse fuera del
barco de las grandes, si bien, ya nunca volver&aacute; a ser lo que fue en los a&ntilde;os
en que trabajaba con los 8 bits. Retomando el hilo, Dinamic no quiere quedarse
fuera del tren de los 16 bits, y empieza a convertir t&iacute;tulos de 8 a 16 bits,
como es el caso de AMC o After the War, si bien, Tambi&eacute;n se empezar&aacute;n a 
elaborar los t&iacute;tulos exclusivos para los 16 bits, el ejemplo m&aacute;s claro lo
tendremos en el Narco Police, que desarrollaron junto a la compa&ntilde;&iacute;a Argentina
Iron Byte (si mal no recuerdo) y que contaba con una excelente animaci&oacute;n y gr&aacute;ficos,
sobretodo en su versi&oacute;n de Amiga, tanto es as&iacute; que fue candidato a un premio
de la ECTS (los Oscar de los videojuegos) en el a&ntilde;o de su lanzamiento a mejor
animaci&oacute;n. 
<br>
<br>
<center><table>
<td><img src="gif/ctrue.gif"></td>
<tr><td><center>
<FONT color="#000000" size=1 >
<b>El Capitán Trueno fue uno de los últimos<br> grandes juegos de Dinamic.<br> De nuevo los
freelance españoles daban<br> toda una lección.</b>
</center></td></center>
</table></center>
<p align="justify">
Otro de los t&iacute;tulos de 16 bits notables y que cerrar&aacute; de forma definitiva
la Dinamic &quot;imperial&quot; ser&aacute; el Risky Woods, que tard&oacute; un tiempo exajerado
en sacarse a la venta, principalmente por las pegas que EA pon&iacute;a a Dinamic
para su distribuci&oacute;n en el extranjero. Finalmente lleg&oacute; incluso a realizarse
una conversi&oacute;n a la Megadrive del t&iacute;tulo.
<br>
Despu&eacute;s de Risky Woods, ya nada volvera a ser lo mismo....
</p>
<H4>Otros campos que abarc&oacute; Dinamic y mención especial a AD.</h4>
<img src="jpg/cozumel.jpg" align ="left" border=1>
<p align=justify>
Quiero intentar remarcaros la trayectoria de dedicaci&oacute;n que siempre ha ido
re&ntilde;ida a esta compa&ntilde;&iacute;a. No s&oacute;lo se contentaron con producir algunos de los
t&iacute;tulos de mayor historia de los 8 bits, sino que abarcaron, dentro del software
de entretenimiento, terrenos en los que quedaba patente su superioridad. De
esta forma crearon, dentro de Dinamic, sellos en los que apoyaban a los
programadores Nóveles, mediante la publicaci&oacute;n de sus juegos como es el
caso del sello Future Stars (ojal&aacute; ahora existiese algo as&iacute;). El sello m&aacute;s 
importante con el que cont&oacute; Dinamic fue, sin duda, AD (Aventuras Dinamic), bajo
el cual se creaban aventuras conversacionales (las madres de las actuales
aventuras gr&aacute;ficas) de una important&iacute;sima calidad, como es el caso de Aventura
Original, Jabato o la serie de la Diosa Cozumel. 
<br><br>
Pero... quizás sea demasiado injusto hablar de AD como una compañía más, de las freelance
que existieron por aquella época ya que, AD no fué en absoluto eso. Esta "fábrica" de
imaginación llamada Aventuras AD, sólo contó con el apoyo ecónomico de Dinamic, en 
ningún caso la primera se encargaba de "dictar" lo que esta tenía que hacer, es decir,
estamos hablando de una compañía prácticamente independiente y que no debe, ni muchísimo menos,
ser ligada a la historia de Dinamic como "sello". Aventuras AD, tuvo un peso muy específico
en la época de los 8 bits en España, fué, sin duda, la casa que "más caló" entre los
aficionados nacionales (sólo tenéis que ver el <A HREF="www.arrakis.es/~caad" target="_new">CAAD</A> (Club de Aventuras AD) que lleva
desde el 88 dando guerra... estamos hablando del primer y único club creado
entorno a una compañía de juegos en España...).<br>
Aventuras AD, en definitiva, se perfiló como una casa independiente, con personalidad
propia y que se merece todo una artículo dedicado a ella.
<br>
<br>
Haciendo este oblidado inciso, continuaremos diciendo que otro de los caminos en los que se atrevieron a indagar, los chicos
de Dinamic, fue en el de las m&aacute;quinas
recreativas, de tal modo, que llevaron a los salones arcade dos t&iacute;tulos, el
Hammer Boy y el After de War.
<br>
<br>
En definitiva, que si Dinamic hubiera podido mantener el tipo en la transici&oacute;n
a los 16 bits, ahora mismo tendr&iacute;amos en nuestro pa&iacute;s a una de las compa&ntilde;&iacute;as 
m&aacute;s importantes de Europa. De todas formas recordar que Dinamic es actualmente
una de las compa&ntilde;&iacute;as m&aacute;s antiguas y con m&aacute;s presigio del panorama internacional.<br>
Ahora bien, las cosas ya no son como las de antes, por desgracia.

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsb.htm"><font FACE="ARIAL"><B>[Un paseo por nuestra historia]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
