<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>quellos Maravillosos Bits</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez.</A>
<br><font size=1>Con la colaboración de <br>Fernando Rodríguez y Alejandro Santacreu</font>
</b></FONT>


<br><br>



<BR><BR><BR><BR><BR>

<h3>
<font face="arial"><font color="#000000">Documental 'La Edad de Oro del Soft Espa&ntilde;ol' (1985 - 1991)</font></font></h3>

<img SRC="gif/ks001.gif" BORDER=0 NATURALSIZEFLAG="3" height=120 width=160 align="left"></h3>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Por fin la historia
del videojuego se vio reflejada en el todopoderoso mundo de los medios
de comunicaci&oacute;n, m&aacute;s concretamente en el de la televisi&oacute;n.
Aunque de momento en un canal minoritario al ser 'digital'.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Este principio
necesario se llam&oacute; 'La Edad de Oro del Soft Espa&ntilde;ol' y se
trat&oacute; de un documental de m&aacute;s o menos una hora de&nbsp; duraci&oacute;n
en el que se repas&oacute; el software hecho aqu&iacute; en Espa&ntilde;a
durante la era de los 8 bits.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>En l&iacute;neas
generales estuvo realmente bien. No se puede negar que el tema tratado
nos toca la fibra sensible, pero... &iquest;qu&eacute; le vamos a hacer?.</font></font></font>
<CENTER>
<img SRC="gif/ks022.gif" HSPACE=5 VSPACE=5 BORDER=1 NATURALSIZEFLAG="3" height=120 width=160>
<br>
<font size=1 face=arial>También hubo una merecida presencia de <br>MicroHobby a través de su exdirector, Domingo Gómez.</font>
</CENTER>

<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Se podr&iacute;a
decir que desde el principio se mantiene en el aire un gui&oacute;n convertido
casi en trama que comienza con una breve descripci&oacute;n y termina con
el triste desenlace final, quiz&aacute; excesivamente dramatizado.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>El repaso por
los a&ntilde;os 80 del videojuego espa&ntilde;ol est&aacute; acompa&ntilde;ado
en todo momento por las canciones m&aacute;s emblem&aacute;ticas de aquella
&eacute;poca dorada. Este acierto, lejos de ser anecd&oacute;tico, queda
como un s&oacute;lido acierto para una imaginaria puntuaci&oacute;n final.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Los videojuegos
no son simplemente enumerados y descritos. Tras trazar una l&iacute;nea
del tiempo y colocar las principales compa&ntilde;&iacute;as espa&ntilde;olas
en ella, la gente de C: va sacando poco a poco los t&iacute;tulos m&aacute;s
destacados, tanto para bien como para mal, haciendo incisos en los TOP10,
como por ejemplo 'La Abad&iacute;a del Crimen'.</font></font></font>
<P><center>
<img SRC="gif/ks008.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM><img SRC="gif/ks060.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM><img SRC="gif/ks056.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM>
<br>
<font size=1 face=arial>Gabriel Nieto (director de Topo Soft) en el centro</font>
</center>

<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Lejos de un aburrido
documental descriptivo, el enfoque global trata de ser lo m&aacute;s vivo
posible, sacando a los personajes TOP de aquella &eacute;poca hablando
de sus experiencias y opinando sobre los temas principales, de vez en cuando
acompa&ntilde;ados de una voz en off.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>A pesar de la
auto-delimitaci&oacute;n que el propio t&iacute;tulo ya crea, varios temas
externos son tratados por encima. Por ejemplo, el del mundo de la emulaci&oacute;n.</font></font></font>

<P align="justify">
<table align="left">
<td >
<img SRC="gif/ks014.gif" HSPACE=5 VSPACE=5 BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 >
</td>
<tr>
<td>
<center>
<font size=1 face=arial>Gonzalo Suárez (Opera Soft <br>y actualmente Pyro Studios)</font></center>
</td>
</table>
<font face="arial"><font color="#000000"><font size=-1>Aunque el conjunto
global de informaci&oacute;n incluida en el documental es muy grande, algunas
cosas quedan en el aire. Falta mucho Commodore 64 y mucho MSX y sobran
bastantes escapadas a temas del extrarradio.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>La conclusi&oacute;n
que se puede sacar despu&eacute;s de ver el documental es que ya era hora
de que alguien tratara un tema tan importante como el del origen del software
nacional de entretenimiento, algo que actualmente emerge con fuerza, con
mucha fuerza.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Atreverse con
un proyecto as&iacute;, tiene mucho m&eacute;rito. Y han salido del paso
con nota, desde luego. Pero sabe a poco. A pesar de su larga duraci&oacute;n
te quedas algo insatisfecho. Quiz&aacute; sea adem&aacute;s de por el tema,
por su buena realizaci&oacute;n t&eacute;cnica y por su elaborado gui&oacute;n.
Y es que lo bueno pasa r&aacute;pido.</font></font></font>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Un aplauso para
una iniciativa tan interesante como necesaria. Esperemos que no sea la
&uacute;ltima...</font></font></font>
<br><br><br>
<hr width="70%" align="left">
<font face="arial" color="#000000" size=2><b><font color="#cc0000">B</font>reve comentario de <a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodr&iacute;guez</b></a></font>
<br><br>
<P align="justify"><font face="arial"><font color="#000000"><font size=-1>Antes de nada
debo de reconocer que no ten&iacute;a muchas esperanzas puestas en el reportaje.
Mis mejores previsiones auguraban no m&aacute;s de 30 minutos de programa.
Afortunadamente, estaba totalmente equivocado y el reportaje no s&oacute;lo
dur&oacute; m&aacute;s de 30 minutos (1 hora), sino que fue de una calidad
m&aacute;s que notable. El hecho de contar con gente tan representativa
de lo que ha sido la historia del soft espa&ntilde;ol, hace de este documento
un punto de obligada referencia para todos los amantes de la historia de
los videojuegos en Espa&ntilde;a.</font></font></font>
<br><br>
<center><img SRC="gif/ks034.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM><img SRC="gif/ks065.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM><img SRC="gif/ks016.gif" BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 align=BOTTOM></center><P align="justify">

<P align="justify"><font face="arial"><font color="#000000"><font size=-1>En l&iacute;neas
generales, el reportaje recoge las sensaciones de algunas de las personas
m&aacute;s representativas de aquella &eacute;poca. Gente como Victor Ru&iacute;z
(Dinamic), Jorge Granados (Zigurat), Gonzalo Su&aacute;rez (Opera), Andr&eacute;s
Samudio (Aventuras AD), Gabriel Nieto&nbsp;

<table align="left">
<td >
<img SRC="gif/ks047.gif" HSPACE=5 VSPACE=5 BORDER=1 NATURALSIZEFLAG="3" height=120 width=160 >
</td>
<tr>
<td>
<center>
<font size=1 face=arial>Andrés Samudio (Aventuras AD)</font></center>
</td>
</table>
<P align="justify">

(Topo)
o Javier F&aacute;fula (Zafiro, Dinamic, Topo...), comentan las experiencias vividas en aquella &eacute;poca contrast&aacute;ndolas, algunos, con su situaci&oacute;n actual. Este hecho resulta de especial inter&eacute;s dentro del apartado en el que se habla de Aventuras AD. Andr&eacute;s Samudio muestra, quiz&aacute;s, el lado real de lo que es, a d&iacute;a de hoy, el mundo de los videojuegos. Me dio un poco de rabia ver como un maestro de la creaci&oacute;n como Samudio dejaba claro que los videojuegos, para &eacute;l, ya hab&iacute;an acabado. Tampoco resulta una novedad el saber que grandes creadores de la &eacute;poca de los 8 bits ya han perdido la onda de este mundo de forma definitiva. En la entrevista que realizamos a Opera se dejo clara constancia de ello. El escuchar esas opiniones despu&eacute;s de haber construido gran parte de la infancia en base a sus creaciones, sirve para eliminar toda la posible ingenuidad que pudieras tener entorno a los videojuegos descubriendo, quiz&aacute;s, el lado m&aacute;s real de este competitivo mercado. Y perder la ingenuidad no significa perder la ilusi&oacute;n. Son dos cosas totalmente distintas.</font></font></font> <P align="justify"><font face="arial"><font color="#000000"><font size=-1>Sin querer extenderme m&aacute;s, pues esto es s&oacute;lo un breve comentario personal, concluir que el documento resulta imprescindible. Cada uno deber&aacute; de sacar  sus propias conclusiones (y os aseguro que se pueden sacar muchas conclusiones). 
<br>
En l&iacute;neas generales, el reportaje constata la cruda realidad de lo que fue la desaparici&oacute;n de esa industria del videojuego que tuvimos, de que los &eacute;xitos no vinieron solos o de carambola, que hubo siempre un ingente trabajo y que, en la actualidad, est&aacute; en manos de todos los que nos consideramos entusiastas de este maravilloso mundo de los videojuegos, que la producci&oacute;n en Espa&ntilde;a vuelva a alcanzar, o a superar, a la de aquellos tiempos.</font></font></font> <br><br><br>
<hr width="70%" align="left">
<font face="arial" color="#000000" size=2><b><font color="#cc0000">C</font>ómo lo vio <a href="mailto:auryn@retemail.es">Alejandro Santacreu "Auryn" </a></b></font>
<br><br>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Yo v&iacute; el programa y desde luego se necesita una caja de pa&ntilde;uelos... ¡snif! bueno,</FONT><FONT SIZE=2> </FONT><FONT FACE="Arial" SIZE=2>para la mayor&iacute;a de vosotros aquellos ser&iacute;an realmente "vuestros a&ntilde;os</FONT><FONT SIZE=2> </FONT><FONT FACE="Arial" SIZE=2>dorados", para m&iacute; quedaron m&aacute;s bien como "los a&ntilde;os dorados de aquellos</FONT><FONT SIZE=2> </FONT><FONT FACE="Arial" SIZE=2>gigantones de 7º EGB / 2ºBUP" puede que para llegar al teclado me fuese imprescindible una silla pero... jugu&eacute;... y mucho. En programaci&oacute;n no pas&eacute; de las resultonas representaciones gr&aacute;ficas que el BASIC de mi Oric - 1 /Commodore 16 me permit&iacute;an pero... cuando v&iacute; a los integrantes de AD, Dinamic, Topo... con sus ordenadores guardados como reliquias (yo tambi&eacute;n los conservo, aunque debo reconocer que me deshice del m&aacute;s "moderno", aquel8086 Invescom que no hab&iacute;a donde meterlo) probando sus juegos, cargando(aquel "load" / "loadrun") sus viejos juegos de los que la marca de chicles Sonrics, quiz&aacute;s lo record&eacute;is, regalaba pegatinas con las car&aacute;tulas en suschicles cil&iacute;ndricos... aquel Capit&aacute;n Trueno, la pulga... los listados interminables de la Hobby, los Syntax Error in line tres millones (que luego estaba bien copiada y que al mes siguiente aparec&iacute;a, o no, en los listados de "Fe de errores..."). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El programa ha estado muy bien, quiz&aacute;s no se lo parezca a alguien ajeno al mundillo, quiz&aacute;s, y sin quiz&aacute;s tambi&eacute;n, han desperdiciado la oportunidad de hacer algo realmente delicioso y "romantic&oacute;n" pero la misma imaginaci&oacute;n con la que supl&iacute;amos las carencias de aquellas inmersivas aventuras conversacionales nos sirve para subsanar inconscientemente las carencias del reportaje y corregir con nuestros recuerdos una &eacute;poca entra&ntilde;able...</FONT><FONT SIZE=2> </P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">M&aacute;s que comentar el programa me he involucrado pero... es inevitable. De todas formas, el futuro lo seguimos escribiendo y programando nosotros(bueno, yo no programo pero s&iacute; escribo :-D) y creo que la RED vuelve a dar una oportunidad no s&oacute;lo al software espa&ntilde;ol sino al universal programador independiente: freeware, shareware, consejos, trucos, modificaciones, reproductores caseros de MP3, decodificadores de... bueno, ya sab&eacute;is...nuestro mundillo siempre tendr&aacute; una segunda juventud ¿eh?.</FONT><FONT SIZE=2> <BR>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsa.htm"><font FACE="ARIAL"><B>[Aquellos maravillosos bits]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER></HTML>










