<HTML>

<BASE TARGET="TEXTO">

<body BGCOLOR="FFFFFF">

<BR>

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>muladores</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:PTS@arrakis.es">José Antonio Albero "PTS".</A>

</b></FONT>

<br><br>



<BR><BR><BR><BR><BR>



<H3>

<FONT color="#000000" face="arial">        
Manual de iniciación a los emuladores

</FONT>

</H3>



<FONT color="#000000" size=2 face=arial>

<P ALIGN=JUSTIFY>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Hace algo as&iacute; como 5 a&ntilde;os atr&aacute;s cay&oacute; en mis manos un extra&ntilde;o programa que dec&iacute;an que era un emulador de Super Nintendo. Lo de "extra&ntilde;o" era porque hasta entonces no hab&iacute;a o&iacute;do hablar ni tan solo una palabra de lo que eran los emuladores. Tal fue la fascinaci&oacute;n que me produjo dicho programa que poco a poco y casi sin darme cuenta me vi completamente inmerso en el fant&aacute;stico mundo de la emulaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para aquellos de vosotros que no sep&aacute;is qu&eacute; es un emulador y para que no teng&aacute;is que esperar los a&ntilde;os que yo lo tuve que hacer, aqu&iacute; os doy mi propia definici&oacute;n: Un emulador es un programa que intenta realizar las funciones de la m&aacute;quina a la que imita, de la mejor forma posible. La emulaci&oacute;n es un intento de imitar el dise&ntilde;o interno de un determinado dispositivo (ordenador, m&aacute;quina arcade, calculadora, consola de videojuegos,...). Por ejemplo, un programa que ejecute el juego SONIC de la consola MEGADRIVE en un dispositivo distinto a &eacute;ste, por ejemplo un PC o un Mac, ser&iacute;a un emulador.  Si alguno de vosotros sigue leyendo por aqu&iacute; seguro que se estar&aacute; preguntando que cuales son los "aparatejos" que est&aacute;n emulados en la actualidad. La verdad es que me ser&iacute;a imposible deciroslos todos ya que hay alguno de ellos que se me escapa pero si que voy a haceros una buena recopilaci&oacute;n y a contaros un poco de historia de cada uno.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h3>Arcades</h3>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Callus.</B> </P>
<P ALIGN="JUSTIFY"></P>
<img src="gif/8emu2_1.gif" align="left"><P ALIGN="JUSTIFY">Es un emulador de la placa System 1 de CAPCOM y es uno de los mejores emuladores de arcade (las m&aacute;quinas de los recreativos) que existen en la actualidad. Hay dos versiones, una que funciona bajo MS DOS y otra bajo Windows 9x. Las caracter&iacute;sticas m&aacute;s destacables es que permite el juego enRED en la versi&oacute;n de Windows 9x y partidas multijugador (hasta 4 jugadores simult&aacute;neamente). Soporta juegos tan impresionantes como Final Fight, Street Fighter 2, Strider, U.N. Squadron, Carrier Air Wings, 3 Wonders , Captain Commando, Willow, etc. hasta un total de 50. Funciona perfectamente a partir de un P200. Para conseguir los emuladores deb&eacute;is pasaros por esta direcci&oacute;n </FONT><A HREF="http://www.emulatronia.com/frames.htm?a=izq-rec.htm?b=arcade/callus.htm"><FONT FACE="Arial" SIZE=2>http://www.emulatronia.com/frames.htm?a=izq-rec.htm?b=arcade/callus.htm</FONT></A><FONT FACE="Arial" SIZE=2>, y para conocer m&aacute;s detalles sobre el mismo leed el readme.txt que lo acompa&ntilde;a.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">HIVE. </P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es el emulador multiarcade m&aacute;s joven que existe, ya que es de reciente aparici&oacute;n. Soporta juegos como el GALAGA, PACMAN, GAPLUS... y que funciona bajo Windows 9x. La caracter&iacute;stica m&aacute;s importante es su VELOCIDAD, ya que funciona perfectamente en un 486 a 66 Mhz. La interfaz gr&aacute;fica que posee es sensacional. Su p&aacute;gina WEB es </FONT><A HREF="http://hive.speedhost.com/"><FONT FACE="Arial" SIZE=2>http://hive.speedhost.com/</FONT></A><FONT FACE="Arial" SIZE=2> . All&iacute; encontrar&aacute;s dos versiones, una en castellano y la otra en ingl&eacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">MAME</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MAME es un emulador multiarcade (Multiple Arcade Machine Emulator) en el que participa gente de todo el mundo en su programaci&oacute;n. Podr&iacute;amos decir que es el emulador m&aacute;s conocido, usado e impactante ya que emula la nada despreciable cantidad de m&aacute;s de 1250 juegos arcade. El c&oacute;digo fuente del mismo est&aacute; disponible para todo el aquel que quiera perfeccionar el emulador por su cuenta o bien unirse al proyecto. Pod&eacute;is encontrar versiones para DOS, Windows 9x, MAC, Unix y derivados... La p&aacute;gina web del MAME la encontrareis en esta direcci&oacute;n: </FONT><A HREF="http://mame.retrogames.com/"><FONT FACE="Arial" SIZE=2>http://mame.retrogames.com.</FONT></A><FONT FACE="Arial" SIZE=2> </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Raine</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Especializado en las placas que montan un M68000 o un M68020 como microprocesador central. La mayor&iacute;a de los juegos emulados son de las compa&ntilde;&iacute;as Taito y Jaleco. Raine funciona bajo MSDOS.</P>
<P ALIGN="JUSTIFY">Dispone de una interfaz gr&aacute;fica que nos ayuda a configurarlo de una forma muy f&aacute;cil e intuitiva. Alguno de los juegos mas famosos que emula son: Cabal, Darius Gaiden, Ninja Gaiden, Rastan, Rastan Saga, Toki, Terra Force, Snow Bross 1 y 2, .... La &uacute;ltima versi&oacute;n, la 0.20, emula m&aacute;s de 100 m&aacute;quinas arcade. Funciona decentemente a partir de un P200, aunque la calidad del sonido tiene que mejorar. Junto con Callus y MAME es uno de los preferidos por la mayor&iacute;a de la gente. Para m&aacute;s detalle no dej&eacute;is de visitar su p&aacute;gina WEB que se encuentra en esta direcci&oacute;n: http://www.rainemu.com</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">System16</B> .</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Emulador de la placa SYSTEM16 de SEGA muy utilizada por esta compa&ntilde;&iacute;a durante los a&ntilde;os</P>
<center><img src="gif/8emu2_4.gif"></center>
<P ALIGN="JUSTIFY">1987 y 1989. Juegos como Shinobi, Golden Axe, Out Run, Altered Beast, Alien Syndrome y muchos m&aacute;s son completamente jugables con este emulador. La verdad es que este emulador se ha quedado un poco retrasado respecto a los grandes. Lo podr&eacute;is encontrar en versiones DOS, LINUX y Windows 9x. Su p&aacute;gina en internet est&aacute; aqu&iacute;: </FONT><A HREF="http://www.system16.com/system16.html"><FONT FACE="Arial" SIZE=2>http://www.system16.com/system16.html</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Consolas </P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Game Boy. </P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los tres mejores emuladores de esta consola son DBOY, NO$GMB y VIRTUAL GB. Los tres</P>
<P ALIGN="JUSTIFY">emulan la Game Boy, la Game Boy Color, la Super Game Boy y la Super Game Boy Color (dispositivo no aparecido en Espa&ntilde;a, que sirve para utilizar los juegos de la GB Color en la Super Nintendo). El DBOY es gratuito, funciona bajo DOS, es muy r&aacute;pido y no dispone de una interfaz gr&aacute;fica para su configuraci&oacute;n y manejo, por lo que se hace imprescindible la utilizaci&oacute;n de uno de los muchos frontends que se han dise&ntilde;ado para &eacute;l. El Virtual GB es gratuito en todas las versiones(Linux, Solaris, SunOS, Amiga, MAC, OS2, DOS ...) excepto la de Windows 9x. Lo m&aacute;s novedoso es que emula el Rumble Pack. El NO$GMB era el favorito de mucha gente hasta que se hizo shareware. La verdad es que es el emulador m&aacute;s completo ya que es el que m&aacute;s opciones presenta. Funciona bajo DOS, aunque tiene una interfaz gr&aacute;fica impresionante.</P>
<P ALIGN="JUSTIFY"></P>
<P>DBOY -&gt; </FONT><A HREF="http://members.xoom.com/foo01/"><FONT FACE="Arial" SIZE=2>http://members.xoom.com/foo01/</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P >VGB -&gt; </FONT><A HREF="http://www.komkon.org/fms/VGB/"><FONT FACE="Arial" SIZE=2>http://www.komkon.org/fms/VGB/</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P >NO$GMB -&gt; </FONT><A HREF="http://www.work.de/nocash/gmb.htm"><FONT FACE="Arial" SIZE=2>http://www.work.de/nocash/gmb.htm</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Game Gear y Master System. </P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como internamente estas dos consolas tienen el mismo dise&ntilde;o los emuladores existentes que funcionan juegos de una lo hacen de la otra. MEKA, que es de reciente aparici&oacute;n, es mi preferido, por ser el que m&aacute;s juegos ejecuta, por tener la interfaz m&aacute;s bonita y original y porque ha roto esquemas a la hora de presentar un emulador. Funciona bajo DOS. Hay otros dos emuladores muy buenos, el BRSMS y el MASSAGE. La verdad es que estas dos consolas est&aacute;n casi perfectamente emuladas. Si quer&eacute;is saber m&aacute;s sobre estos tres emuladores pas&aacute;ros por sus WEBs.</P>
<P ALIGN="JUSTIFY"></P>
<P>MEKA -&gt; </FONT><A HREF="http://www.classicgaming.com/meka/"><FONT FACE="Arial" SIZE=2>http://www.classicgaming.com/meka/</FONT></A></P>
<FONT SIZE=2><P></FONT><FONT FACE="Arial" SIZE=2>BRSMS -&gt; </FONT><A HREF="http://www.lsi.usp.br/~ricardo/brsms.htm"><FONT FACE="Arial" SIZE=2>http://www.lsi.usp.br/~ricardo/brsms.htm</FONT></A></P>
<FONT SIZE=2><P></FONT><FONT FACE="Arial" SIZE=2>MASSAGE -&gt; </FONT><A HREF="http://www.enterspace.org/world/massage.htm"><FONT FACE="Arial" SIZE=2>http://www.enterspace.org/world/massage.htm</FONT></A></P>
<FONT SIZE=2><P></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Megadrive. </B></P>
<P ALIGN="JUSTIFY"></P>
<img src="gif/8emu2_3.gif" align="left"><P ALIGN="JUSTIFY">Genecyst y Kgen son los dos mejores emuladores de esta consola y encima son gratuitos. Si me tuviese que decantar por uno de los dos lo har&iacute;a por el kgen debido a que el sonido lo emula a la perfecci&oacute;n (incluso dir&iacute;a que suena mejor que en la Megadrive) aunque el Genecyst es tambi&eacute;n soberbio. Los dos funcionan bajo MSDOS y disponen de un entorno gr&aacute;fico para su configuraci&oacute;n y uso. El 95% de los juegos existentes de la consola Megadrive funcionan con estos dos programas. El equipo m&iacute;nimo para ejecutarlo sin problemas de ralentizaci&oacute;n ser&aacute; un P200. Podr&aacute;s encontrar los emuladores y m&aacute;s informaci&oacute;n sobre ellos en la siguiente direcci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></FONT><A HREF="http://www.emulatronia.com/frames.htm?a=izq-con.htm?b=consolas/md.htm"><FONT FACE="Arial" SIZE=2>http://www.emulatronia.com/frames.htm?a=izq-con.htm?b=consolas/md.htm.</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Neogeo. </B></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los fan&aacute;ticos de los juegos de lucha en 2D seguro que conoc&eacute;is esta consola. El primer emulador que sali&oacute; de Neogeo, el Geko, arm&oacute; un gran revuelo, ya que hab&iacute;a sido muy esperado. S&oacute;lo dur&oacute; un par de d&iacute;as en las p&aacute;ginas de Internet ya que sus programadores dijeron que fuese retirado debido a que hab&iacute;an firmado un contrato con SNK para desarrollar un emulador comercial, que por cierto todav&iacute;a no ha visto la luz. Despu&eacute;s sali&oacute; el NEORAGE, que es un muy r&aacute;pido, funciona bajo dos, aunque no emula el sonido ni la m&uacute;sica. Como la gente del MAME todo lo que se propone lo consigue, decidieron emular el MAME con sonido y m&uacute;sica, y lo han conseguido a la perfecci&oacute;n. Al hacer el c&oacute;digo fuente de dominio p&uacute;blico mucha gente ha hecho su propia versi&oacute;n del MAME que s&oacute;lo ofrece soporte para juegos de NEOGEO (KBMAME, P3MAME, VR32MAME, ..) que incluso superan al original en muchos aspectos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un grupo de programadores espa&ntilde;oles han desarrollado el NEOGEM, que es tambi&eacute;n un estupendo emulador. Funciona bajo DOS, es muy r&aacute;pido, ejecuta la mayor&iacute;a de los juegos de esta consola, y emula m&uacute;sica  y sonido, aunque les falta afinar un poco en este aspecto.</P>
<P ALIGN="JUSTIFY">La &uacute;ltima maravilla que ha salido se llama NEORAGEX, funciona bajo Windows 9x y necesita las DirectX. Es el emulador perfecto para los novatos, ya que es muy f&aacute;cil de manejar, visualmente muy atractivo, r&aacute;pido, y emula m&uacute;sica y sonido. Deciros que ha sido programado por los mismos autores del NEORAGE.</P>
<P ALIGN="JUSTIFY"></P>
<P>KBMAME -&gt; </FONT><A HREF="http://members.xoom.com/Deimos0/"><FONT FACE="Arial" SIZE=2>http://members.xoom.com/Deimos0/</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P>MAME -&gt; </FONT><A HREF="http://mame.retrogames.com/"><FONT FACE="Arial" SIZE=2>http://mame.retrogames.com</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P>NEOGEM -&gt; </FONT><A HREF="http://www.emuspain.com/neogem/index.htm"><FONT FACE="Arial" SIZE=2>http://www.emuspain.com/neogem/index.htm</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></FONT><FONT FACE="Arial" SIZE=2>NEORAGE -&gt; </FONT><A HREF="http://home5.swipnet.se/~w-50884/emulator/rage.htm"><FONT FACE="Arial" SIZE=2>http://home5.swipnet.se/~w-50884/emulator/rage.htm</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Nintendo.</B></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quiz&aacute;s este sea el soporte que m&aacute;s veces ha sido emulado y como ser&iacute;a un poco largo hablaros de todos los emuladores que existen, me voy a centrar en los que yo considero los dos mejores, el Nesticle y el FWNES. El nesticle es un emulador gratuito, del que hay dos versiones una para DOS y otra para Windows 9x. Hace funcionar el 98% de los juegos existentes de la Nintendo. Tiene un entorno gr&aacute;fico muy manejable y pr&aacute;ctico. Lo m&aacute;s avanzado de este emulador es que 2 jugadores pueden estar disfrutando del mismo juego conectando a trav&eacute;s de internet, siempre que dicho juego soporte la opci&oacute;n de 2 jugadores. Del FWNES hay dos versiones, una para DOS y la otra para LINUX. Ofrece m&aacute;s compatibilidad que el nesticle (99%), y es m&aacute;s completo en cuanto a men&uacute;s, opciones de configuraci&oacute;n y soporte de formatos, aunque es un pel&iacute;n menos manejable.</P>
<P ALIGN="JUSTIFY"></P>
<p>FWNES -&gt;</FONT><A HREF="http://members.xoom.com/nes_stuff/fwnes/"><FONT FACE="Arial" SIZE=2>http://members.xoom.com/nes_stuff/fwnes/</FONT></A></P>
<FONT SIZE=2><p></FONT><FONT FACE="Arial" SIZE=2>NESTICLE -&gt; </FONT><A HREF="http://www.emulatronia.com/frames.htm?a=izq-con.htm?b=consolas/nes.htm"><FONT FACE="Arial" SIZE=2>http://www.emulatronia.com/frames.htm?a=izq-con.htm?b=consolas/nes.htm</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Nintendo 64. </B></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que s&iacute;, que lo has le&iacute;do bien, que no est&aacute;s so&ntilde;ando, que actualmente ya existe un emulador de N64 que hace funcionar casi perfectamente unos 50 juegos de esta consola entre los que destacan SUPER MARIO 64, THE LEGEND OF ZELDA: OCARINA OF TIME, STAR FOX 64, DOOM 64 . Se llama ultraHLE, funciona bajo Windows 9x y necesita una tarjeta con el chip 3DFX para que funcione, aunque existe una versi&oacute;n de este emulador (no oficial) que utiliza las direct3d . Para que los juegos funcionen al 100% de la velocidad original, con sonido y m&uacute;sica, necesitar&aacute;s como m&iacute;nimo un P2 350 Mhz, aunque puedes disfrutar con &eacute;l a partir de un p233 MMX.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">UltraHLE -&gt; </FONT><A HREF="http://www.emuunlim.com/UltraHLE"><FONT FACE="Arial" SIZE=2>http://www.emuunlim.com/UltraHLE</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></FONT><FONT FACE="Arial" SIZE=2>UltraHLE D3D -&gt; </FONT><A HREF="http://www.emuhq.com/french/"><FONT FACE="Arial" SIZE=2>http://www.emuhq.com/french/</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>PC Engine. </B></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seguro que muchos de vosotros os estar&eacute;is preguntando que qu&eacute; es eso. La PC Engine, tambi&eacute;n conocida como TurboGrafx 16 es una consola que en Espa&ntilde;a no tuvo mucho &eacute;xito aunque en Jap&oacute;n se codeo con las grandes del momento, la Super Nintendo y la Megadrive. La primera vez que vi un emulador para esta m&aacute;quina me qued&eacute; alucinado. El sonido era perfecto. En un 486 funcionaba perfectamente y ejecutaba la mayor parte de los juegos. El emulador es el Magic Engine y en la &uacute;ltima versi&oacute;n ofrece soporte para los juegos en CD de esta consola. Entra en </FONT><A HREF="http://joyce.eng.yale.edu/~bt/turbo/emu/"><FONT FACE="Arial" SIZE=2>http://joyce.eng.yale.edu/~bt/turbo/emu/</FONT></A><FONT FACE="Arial" SIZE=2> para obtenerlo aunque tendr&aacute;s que pagar si quieres la versi&oacute;n registrada. Si por el contrario quieres un buen emulador de esta consola y no quieres gastarte ni un duro, deber&aacute;s optar por el HU6280, que est&aacute; disponible en versiones DOS y Windows 9x, aunque &uacute;ltimamente los programadores parece que han abandonado la versi&oacute;n DOS y s&oacute;lo se dedican a actualizar la de Windows 9x. En las &uacute;ltimas actualizaciones se ha pasado el c&oacute;digo a ensamblador por lo que la velocidad de proceso ha aumentado considerablemente. </FONT><A HREF="http://www.hu6280.com/"><FONT FACE="Arial" SIZE=2>http://www.hu6280.com</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Play Station.</B> </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tenemos 3 grandes emuladores de esta consola, BLEEM!, PSEmu Pro y Virtual Game Station. Los dos primeros son para PC y el &uacute;ltimo para los MAC. BLEEM es el m&aacute;s avanzado de todos. Es shareware, por lo que tendr&aacute;s que pagar 24,95$ para conseguir la versi&oacute;n registrada. Funciona bajo Windows 9x. Ofrece soporte para tarjetas aceleradoras 3D (utilizando las direct 3d) . Tambi&eacute;n contempla las extensiones MMX y 3DNOW. Si antes de comprarlo que eres probarlo, se encuentra disponible una demo en su p&aacute;gina http://www.bleem.com. El PSEmu Pro, fue el primer emulador de PSX. Al principio funcionaba bajo DOS pero pronto fue pasado a</P>
<P ALIGN="JUSTIFY">Windows 9x. Es gratuito, soporta aceleraci&oacute;n 3D a trav&eacute;s de GLIDE, OPEN GL y D3D. No es tan compatible como el bleem aunque a&uacute;n as&iacute; ejecuta muchos juegos (con sonido en todos y m&uacute;sica en algunos).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Virtual Game Station es otro emulador shareware. Soporta el 50% de los juegos de PSX.</P>
<P ALIGN="JUSTIFY">Bleem -&gt; </FONT><A HREF="http://www.bleem.com/"><FONT FACE="Arial" SIZE=2>http://www.bleem.com</FONT></A></P>
<FONT SIZE=2><P></FONT><FONT FACE="Arial" SIZE=2>PSEmu Pro -&gt; </FONT><A HREF="http://www.psemu.com/"><FONT FACE="Arial" SIZE=2>http://www.psemu.com</FONT></A></P>
<FONT SIZE=2><P></FONT><FONT FACE="Arial" SIZE=2>Virtual Game Station -&gt; </FONT><A HREF="http://www.virtualgamestation.com/"><FONT FACE="Arial" SIZE=2>http://www.virtualgamestation.com/</FONT></A></P>
<FONT SIZE=2><P></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Super Nintendo. </B></P>
<img src="gif/8emu2_2.gif" align="left"><P ALIGN="JUSTIFY">Esta consola ha sido la que m&aacute;s rivalidad ha provocado entre aquellos que la intentaban emular aunque ahora los tiempos han cambiado y ha pasado a un segundo plano, cobrando m&aacute;s protagonismo los emuladores de Arcade, PSX  y N64. El ZSNES es el mejor emulador de SNES. Funciona bajo DOS, es muy r&aacute;pido y dispone de una interfaz gr&aacute;fica. Fue el primero en emular los chips DSP( Mario Kart y Pilot Wings, ..) FX (Super Mario World 2, Star Fox, Stunt Race FX, ..) y SA-1, que lo incorpora el juego Mario RPG. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A muy poca distancia le siguen el SNES9X y el NLKE. El SNES 9x fue el mejor emulador de SNES durante mucho tiempo, pero sus programadores tuvieron un problema interno y lo abandonaron, dejando el proyecto en otras manos, que aunque lo han continuado decentemente, no han logrado que se convirtiera de nuevo en el REY. De este emulador podemos encontrar versiones para DOS, Windows 9x, Linux y MAC. Es tambi&eacute;n muy r&aacute;pido, aunque es menos compatible que el zsnes y tiene menos opciones. El NLKE esta programado por dos espa&ntilde;oles , Carlos Lozano y Miguel Angel Pastor. Es el resultado de la fusi&oacute;n de dos antiguos emuladores de snes, el ESNES y el NERLASKA. Funciona bajo DOS, pero dispone de una interfaz gr&aacute;fica para facilitarnos su utilizaci&oacute;n y uso. Es uno de los que m&aacute;s juegos ejecuta.</P>

ZSNES -&gt; </FONT><A HREF="http://www.csoft.net/zsnes/"><FONT FACE="Arial" SIZE=2>http://www.csoft.net/zsnes/</FONT></A></P>
<FONT SIZE=2></FONT><FONT FACE="Arial" SIZE=2>SNES 9x-&gt; </FONT><A HREF="http://www.snes9x.com/"><FONT FACE="Arial" SIZE=2>http://www.snes9x.com/</FONT></A></P>
<FONT SIZE=2></FONT><FONT FACE="Arial" SIZE=2>NLKE -&gt; </FONT><A HREF="http://www.gsyc.inf.uc3m.es/~calb/nlke/"><FONT FACE="Arial" SIZE=2>http://www.gsyc.inf.uc3m.es/~calb/nlke/</FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Si despu&eacute;s de haber le&iacute;do este art&iacute;culo os consider&aacute;is unos iniciados en la materia y quer&eacute;is ampliar conocimientos, no dej&eacute;is de visitar la siguiente p&aacute;gina , </FONT><A HREF="http://www.emulatronia.com/"><B><FONT FACE="Arial" SIZE=2>http://www.emulatronia.com</B></FONT></A><FONT FACE="Arial" SIZE=2>, y leedla de PE a PA.</P></FONT>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>

<HR>

<A HREF="8bitse.htm"><font FACE="ARIAL"><B>[Emuladores]</B></font></a> <BR>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>

