<HTML>

<BASE TARGET="TEXTO">

<body BGCOLOR="FFFFFF">

<BR>

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>muladores</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:PTS@arrakis.es">José Antonio Albero "PTS".</A>

</b></FONT>

<br><br>



<BR><BR><BR><BR><BR>



<H3>

<FONT color="#000000" face="arial">        

Trío de ases

</FONT>

</H3>



<FONT color="#000000" size=2 face=arial>

<P ALIGN=JUSTIFY>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Hasta hace un dos ten&iacute;a muy claro cual era el REY de los emuladores, aunque los &uacute;ltimos acontecimientos acaecidos en el mundo de la emulaci&oacute;n han hecho que no sepa decidirme por una de las tres BESTIAS existentes. Estoy hablando del FUSION, BLEEM y ULTRAHLE.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El FUSION es un emulador de MAC que funciona bajo MSDOS y que no requiere de un superordenador para ejecutarlo (486 de CPU, 8 Mb RAM, 20 Mb de disco duro, VESA 1.2, el SO de MAC versi&oacute;n 7.1 o superior, y la rom de los MAC). Si ya quiero disfrutar de sonido, poder utilizar el CD y usar dispositivos SCSI, necesitar&eacute; los drivers apropiados de MSDOS. Cuando lo vi por primera vez funcionando, despu&eacute;s de un proceso laborioso de instalaci&oacute;n, no daba cr&eacute;dito a lo que estaban viendo mis ojos. Todos los programas funcionaban perfectamente (compresores, photoshop, juegos, ...) y a la misma velocidad que en un MAC en mi P200 MMX. Despu&eacute;s decid&iacute; someterlo a dos pruebas bastante duras. La primera fue utilizar un emulador de Game Boy para MAC y ver si era capaz de ejecutarlo. Prob&eacute; diez juegos y todos ellos funcionaron, m&uacute;sica incluida. La velocidad no era muy alta, pero es que el emulador estaba destinado a los POWER PC, y el Fusion todav&iacute;a no los emula. La segunda prueba fue navegar por internet con el NAVIGATOR de MAC. Todo funcion&oacute; a la perfecci&oacute;n. Si quer&eacute;is conseguir la versi&oacute;n shareware del fusi&oacute;n pasaros por esta p&aacute;gina: </FONT><A HREF="http://www.microcode-solutions.com/pc/fusion/fusion.html"><FONT FACE="Arial" SIZE=2>http://www.microcode-solutions.com/pc/fusion/fusion.html</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El BLEEM es un emulador de Play Station que funciona con W95/98 y Directx. La versi&oacute;n beta que he podido probar es ya muy buena, y eso que no tiene nada ver con lo que prometen sus programadores en la versi&oacute;n final (aceleraci&oacute;n 3D a trav&eacute;s de DIRECTX, soporte para las tecnolog&iacute;as MMX y  AMD 3DNOW, hasta 32 bits de profundidad de color, soporte Multi-Monitor en W98, emulaci&oacute;n completa de operaciones con GPU, sonido est&eacute;reo 16 bits, video a pantalla completa (MDEC), CD audio en est&eacute;reo y mucho m&aacute;s ).</P>
<P ALIGN="JUSTIFY">De los 11 juegos que prob&eacute; de psx 10 de ellos funcionaron sin ning&uacute;n problema. Los videos se reproduc&iacute;an en blanco y negro y el sonido estaba desactivado, aunque en algunos juegos si que sonaba la m&uacute;sica. El programa no hac&iacute;a uso de ninguna tarjeta aceleradora 3D y a&uacute;n as&iacute; funcionaba decentemente en mi p200 mmx. El disponer de una buena tarjeta aceleradora 2D hac&iacute;a que la calidad de imagen subiese muchos enteros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al principio de que se supo de este emulador, nadie daba un duro por &eacute;l, porque s&oacute;lo hab&iacute;a im&aacute;genes de juegos de PSX funcionando, pero ninguna beta del programa. Posteriormente el programador del bleem le envi&oacute; una copia al webmaster de una p&aacute;gina de emulaci&oacute;n y a partir de este momento es cuando ya se empez&oacute; a creer en que era real. Tres semanas despu&eacute;s  alguien &quot;rob&oacute;&quot; una versi&oacute;n privada a uno de los betatesters y la difundi&oacute; por internet, y as&iacute;, una gran mayor&iacute;a pudimos disfrutar de las virtudes de este fant&aacute;stico emulador, que por cierto s&oacute;lo dur&oacute; 2 d&iacute;as en la RED, ya que sus programadores pidieron que se quitara. Si quer&eacute;is m&aacute;s informaci&oacute;n pasaros por su home. </FONT><A HREF="http://www.bleem.com/"><FONT FACE="Arial" SIZE=2>www.bleem.com</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El ULTRAHLE es un emulador de Nintendo 64 que funciona bajo Windows 95/98, y utiliza las librer&iacute;as GLIDE (espec&iacute;ficas de las tarjetas aceleradoras 3D que llevan el chip 3DFX). Hasta ese momento todos los emuladores de N64 que exist&iacute;an no ejecutaban ning&uacute;n juego comercial, s&oacute;lo algunas demos y no muy deprisa. El ultrahle dio un giro de 360º a lo que eran los emuladores de N64 ya que era capaz de hacer funcionar algunos juegos comerciales (SUPER MARIO 64, THE LEGEND OF ZELDA: OCARINA OF TIME, STAR FOX 64, DOOM 64, .....) incluso con sonido. Para ello s&oacute;lo hac&iacute;a falta un ordenador bastante potente (P266 MMX m&iacute;nimo) y una tarjeta con el chip 3DFX, aunque el n&uacute;mero de frames por segundo mostrados disminuye en funci&oacute;n de la complejidad del juego. Nunca en la vida hab&iacute;a visto una REVOLUCI&Oacute;N tan grande dentro de la emuscene. Las p&aacute;ginas de emuladores se colapsaron (yo pas&eacute; de 3000 visitas diarias a 6000) y eso que el emulador s&oacute;lo dur&oacute; un d&iacute;a en internet ya que los programadores se dieron cuenta de que pod&iacute;an perjudicar much&iacute;simo a NINTENDO y pidieron a todo el mundo que lo quitasen de sus p&aacute;ginas. La verdad es que la emulaci&oacute;n se estaba transformando en pirater&iacute;a ......, aunque eso es otra historia de la que ya hablar&eacute; en otro n&uacute;mero.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">S&oacute;lo deciros que los programadores abandonaron el proyecto por iniciativa propia y por las presiones de NINTENDO. Espero que alg&uacute;n d&iacute;a puedan retomar el proyecto y terminar esa peque&ntilde;a joya de la emulaci&oacute;n que abandonaron un xx de Enero de 1999.</P>





<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>

<HR>

<A HREF="8bitse.htm"><font FACE="ARIAL"><B>[Emuladores]</B></font></a> <BR>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>

