<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Ghosts 'n Goblins
</FONT>
</H3>

<P ALIGN=justify>
<table align="left">
<td><img src="gif/gouls1.gif" ></td>
<tr>
<td><FONT color="#000000" size=1><center><b>Que maravilla... sinff</b></center></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
¡R&aacute;pido Dirk!. &iexcl;Ponte la armadura, hay que salvar
a tu amada y matar a esa maldita g&aacute;rgola que la ha raptado!. Esa
era la introducci&oacute;n que nos ofrec&iacute;a como gancho la nueva
conversi&oacute;n de ELITE bas&aacute;ndose en un gui&oacute;n muy t&iacute;pico.
Y muchos nos dejamos seducir tambi&eacute;n por su pl&aacute;stica que
a primeras era m&aacute;s que atrayente...

<P ALIGN="JUSTIFY">Tambi&eacute;n conviene no olvidar que todo juego salido de una m&aacute;quina
recreativa de &eacute;xito ten&iacute;a un lugar asegurado en las listas
de superventas. Unas listas que comparadas con las actuales dar&iacute;a,
cuanto menos, risa.


<P ALIGN="JUSTIFY">El punto fuerte de este Arcade Total era el que este tipo de juego sab&iacute;a
explotar como ninguno, la adicci&oacute;n. Ghosts'n Goblins ten&iacute;a
dos importantes cualidades que no muchos consiguieron atesorar, el nivel
de dificultad exacto y una magia dif&iacute;cil de explicar.
<BR>&nbsp;
<BR>Su nombre indicaba, en gran medida, lo que te pod&iacute;as encontrar
una vez el juego estaba cargado, ni m&aacute;s ni menos que fantasmas y
duendes. Y mucha m&aacute;s pe&ntilde;a, s&iacute; se&ntilde;or... Si algo
ten&iacute;an todos en com&uacute;n era su af&aacute;n de eliminarte de
este mundo. Pero Dirk emprend&iacute;a la misi&oacute;n muy bien preparado.
Una vieja pero robusta armadura y una peque&ntilde;a lanza eran sus acompa&ntilde;antes.
Eso de la lanza era muy relativo ya que durante el juego se pod&iacute;a
combiar de arma. Ese fue otro de los rasgos que carateriz&oacute; a este
juego, las tres armas: lanza, cuchillo y fuego. En su segunda parte explotaron
&eacute;sto, a&ntilde;adiendo el hacha, el disco y la espada.


<table align="right">
<td><img src="gif/gouls2.gif" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center></center></b></td>
</tr>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
<P ALIGN="JUSTIFY">Pasando al tema enemigos, los zombies eran poca cosa, con un impacto
ya eran producto de gusanos (por segunda vez). Los duendes tambi&eacute;n,
aunque eran veloces y muy escurridizos. Y no nos olvidemos de los cuervos,
dif&iacute;ciles de eliminar. Otra cosa eran las g&aacute;rgolas, a las
que hab&iacute;a que lanzar un arsenal de lanzas o dagas. De la misma manera,
el resto de feroces monstruos. Si ten&iacute;as la antorcha estabas perdido.
Todas estas cosillas daban vida al juego.
<BR>&nbsp;
<BR>Los decorados, siempre l&uacute;gubres, eran varios, el cementerio,
la ciudad y el castillo.

<P ALIGN="JUSTIFY">T&eacute;cnicamente, el juego variaba sustancialmente entre versiones.
La del Spectrum aprovechaba la definici&oacute;n, velocidad y jugabilidad.
Como puntos negativos destacaron la falta de m&uacute;sica y la no total
fidelidad con el desarrollo de la recreativa. Otras versiones como la del
Amstrad CPC no tuvieron esos problemas pero quiz&aacute; por ello dejaron
de lado otras cosas m&aacute;s importantes como la programaci&oacute;n
de un fluido scroll o un movimiento algo m&aacute;s suave. Fuese lo que
fuese, en todos los casos daba una grat&iacute;sima sensaci&oacute;n en
cuanto nos pon&iacute;amos a jugar.

<P ALIGN="JUSTIFY">Desde el primer momento en el que la recreativa sali&oacute; al mercado
'Ghosts'n Goblins' empez&oacute; a verse en multitud de bares y salones
recreativos. En poco tiempo se populariz&oacute; enormemente. La conversi&oacute;n
a otros formatos estaba en mente de muchas empresas de aquel entonces.
Pero fue ELITE la que tuvo el privilegio de programarla y lo hizo con categor&iacute;a,
sin decepcionar nisiquiera al m&aacute;s exigente.
<BR>&nbsp;
<center><table>
<td><img src="gif/gouls4.gif" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center></center></b></td>
</tr>
</table>
<FONT color="#000000" size=2 face=arial>
</center>
<P ALIGN=justify>
<BR>Tras mucha espectaci&oacute;n, por fin los que ten&iacute;amos ordenadores
de 8 bits pudimos disfrutar en nuestras propias casas de esta maravilla
de juego. Un acierto en todos los aspectos. Uno de los pocos t&iacute;tulos
que ser&aacute;n recordados en el TOP de los mejores. Fue, es y ser&aacute;
un firme candidato a medalla en el juicio final...

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
