<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>U</B></font><FONT color="#000000" size=2 face="arial"><B>n Paseo por Nuestra Historia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>


<FONT color="#000000" face="arial">        
<H3>
Repaso a las compa&ntilde;&iacute;as espa&ntilde;olas
</H3>
</FONT>

<FONT color="#000000" face="arial" size=2>        <P ALIGN=justify>
Durante la &eacute;poca de los 8 bits, el software de entretenimiento que se realizaba 
dentro de nuestras fronteras, era considerado como uno de los pilares m&aacute;s importantes
con los que contaban aquellas estupendas m&aacute;quinas, que eran los Spectrum, Amstrad, MSX o
Comodore 64. 
<br>
<br>
Durante los 8 a&ntilde;os que dur&oacute; el reinado de los 8 bits, el software de entretenimiento creado
en nuestro pa&iacute;s, brillaba con luz propia y era mirado con respeto y admiraci&oacute;n en el resto
de Europa. La verdad es que dudo mucho que se vuelva a repetir lo que ocurrio durante los
80, y es que, fueron muchas las compa&ntilde;&iacute;as espa&ntilde;olas que surgieron y fuer&oacute;n 
capaces de tratarse de &quot;t&uacute; a t&uacute;&quot; con las grandes casas de soft extranjeras.
<br>
<br>
Como ser&iacute;a injusto hablar s&oacute;lo de algunas de las compa&ntilde;&iacute;as m&aacute;s importantes de
aquella &eacute;poca, lease Dinamic, Topo, Opera o Zigurat, tambi&eacute;n os citaremos
el resto de compa&ntilde;&iacute;as nacionales que, si bien no consiguieron un &eacute;xito como
las cuatro anteriores, si intentaron llevar a lo m&aacute;s alto el est&aacute;ndarte de la 
programaci&oacute;n nacional.
<br>
<br>
Los productos nacionales brillaron siempre por ser originales y representativos
del caracter &quot;hispano&quot; y ahora mismo estoy recordando los t&iacute;picos t&iacute;tulos de
Made in Spain, Zigurat u Opera, sin dejar de lado la profesionalidad y la calidad 
de programaci&oacute;n como pueden ser los t&iacute;tulos de Dinamic o Topo.
<br>
<br>
Sin m&aacute;s dilaciones, os ponemos la relaci&oacute;n hist&oacute;rica de las compa&ntilde;&iacute;as nacionales
ordenadas por orden decreciente de antiguedad:
</P>
<h4> AÑO 1984 </H4>
<P ALIGN=justify>
<b>Dinamic.</b><BR>
Esta ha sido, siendo objetivos, la compa&ntilde;&iacute;a m&aacute;s importante que ha existido
nunca en el panorama de software de entretenimiento de nuestro pa&iacute;s. Fue la
primera que se cre&oacute;, y a&uacute;n hoy sigue con el puesto de l&iacute;der (en espera de lo
que pueda hacer -y har&aacute;- Rebel Act Studios). De forma general, deciros que Dinamic
ha creado juegos que, en su gran mayor&iacute;a, han coseguido colocarse el t&iacute;tulo
de cl&aacute;sicos de los 8 bits. Apoyaron de manera incesante a los creadores noveles
as&iacute; como cualquier otra iniciativa dentro del mundo de la programaci&oacute;n de juegos.
En la actualidad, ha logrado salvarse de la &quot;quema&quot; gracias a la serie de &quot;juegos&quot;
PC Futbol, con muchos admiradores y detractores. De todas formas dudo mucho que
volvamos a ver a una Dinamic como la que ve&iacute;amos en aquella &eacute;poca: GRANDIOSA.
<BR><BR>
<b>Indescomp.</b><BR>
En un principio Indescomp se estableci&oacute; como compa&ntilde;&iacute;a oficial de la 
distribuci&oacute;n de los equipos ZX Spectrum y Amstrad CPC. Sin embargo, el aspecto
m&aacute;s destacable de todos fue el hecho de la distribuici&oacute;n de dos de los juegos
m&aacute;s importantes de la historia nacional, estos fueron La Pulga y Fred. Los
creadores de estos dos t&iacute;tulos constitur&iacute;an poco despu&eacute;s las compa&ntilde;&iacute;as Opera
y Made in Spain respectivamente.
</P>
<h4> A&ntilde;o 1986 </H4>
<P ALIGN=justify>
<b>Opera.</b><BR>
Opera destac&oacute; siempre por la producci&oacute;n de t&iacute;tulos altamente originales,
frente a los t&iacute;tulos con grandes aportaciones t&eacute;cnicas de otras compa&ntilde;&iacute;as. Opera
realiz&oacute; multitud de t&iacute;tulos en toda su carrera como compa&ntilde;&iacute;a de juegos, con lo
que su lista es muy larga. Sin embargo, no hay que pasar sin mencionar el t&iacute;tulo
que muy probablemente sea el m&aacute;s importante desarrollado dentro de nuestro
pa&iacute;s y uno de los mejores juegos de toda la historia de los 8 bits, estoy
hablando del Abad&iacute;a del Crimen, una aut&eacute;ntica lecci&oacute;n de profesionalidad.
Otra de las sagas estandarte de esta compa&ntilde;&iacute;as fue la de Liviston Supongo,
dos partes de pura y dura videoaventura con la que muchos de nosotros pasamos
largas tardes totalmente viciados.
<BR><BR>
<b>Made in Spain.</b><BR>
Artesan&iacute;a, esa es la palabra que puede definir toda la historia de esta
genial compa&ntilde;&iacute;a. Muy pocos t&iacute;tulos sacaron, una media de 2 al a&ntilde;o, pero todos
ellos han sido de una gran calidad y considerados por la cr&iacute;tica como grandes
entre los grandes, baste decir que t&iacute;tulos como Sir Fred, El Misterio del Nilo,
Afteroids, Humphrey y Paris Dakar alcanzar&oacute;n las puntuaciones m&aacute;s altas en las 
revistas. En definitiva, una aut&eacute;ntica cl&aacute;sica.
<BR><BR>
<B>Resto de compa&ntilde;&iacute;as aparecidas en esta &eacute;poca.</B><BR><br>
<b>Erbe.</b><BR>
Con t&iacute;tulos como el de Las Tres Luces de Glaurung se atrev&oacute; a asomarse
al mundo de la producci&oacute;n de software, si bien, como todos sab&eacute;is es en
el panorama de la distribuci&oacute;n donde manda.<br>
<BR>
<b>Diabolic.</b><BR> con el afamado Nuclear Bowls entre otros.
</P>
<h4> A&ntilde;o 1987 </H4>
<P ALIGN=justify>
<b>Topo.</b><BR>
El a&ntilde;o 1987 ser&aacute; recordado como el a&ntilde;o de la aparici&oacute;n de las &uacute;ltimas
grandes empresas de desarrollo, una de ellas ser&aacute; Topo. Como ya he dicho, se
apunt&oacute; algo m&aacute;s rezagada que el resto de sus competidoras nacionales, al
carro de la programaci&oacute;n de juegos, sin embargo, r&aacute;pidamente acort&oacute; distancias
con t&iacute;tulos muy ambiciosos y en los que se dejaba ver una gran calidad, desde
el punto de vista, del cuidado con el que hac&iacute;an todas y cada una de las cosas.
Algunos de sus juegos, alcanzaron el list&oacute;n de cl&aacute;sicos, caso del Mad Mix Game.
Por otro lado, Topo fue siempre la compa&ntilde;&iacute;a espa&ntilde;ola que m&aacute;s arriesg&oacute;, como
demuestra la compra de los derechos de Gremlins 2. Finalizando este peque&ntilde;o
&quot;avistamiento&quot;, decir que de seguir viva Topo en nuestros d&iacute;as, el panorama
actual del software de entretenimiento nacional, no se parecer&iacute;a absolutamente
nada a lo que es hoy en d&iacute;a.
<BR><BR>
<b>Zigurat.</b><BR>
Zigurat fue, junto con Topo, la &uacute;ltima gran compa&ntilde;&iacute;a que se cre&oacute;. Descendiente
directa de la, ya desaparecida, Made in Spain, Zigurat aglutin&oacute; a una serie de
programadores freelance que, con su experiencia ya obtenida, les permit&oacute; consagrarse
dentro del mercado l&uacute;dico, con sus primeros lanzamientos. Personalmente os 
dir&eacute; que Zigurat ten&iacute;a ese toque que tienen las grandes compa&ntilde;&iacute;as y que
hace que cuando ves sus juegos, aciertes a decir quien lo ha hecho, sin saber
el fabricante. Algunos t&iacute;tulos con los que cont&oacute; fueron de corte deportivo,
mediante el fichaje de conocidos deportistas espa&ntilde;oles, caso de Carlos Sainz,
pero tambi&eacute;n contaron con grandes videoaventuras, caso del super divertido
Jungle Warriors. En resumen, un sobresaliente para lo que signific&oacute; 
Zigurat.
<BR><BR>
<B>Resto de compa&ntilde;&iacute;as aparecidas en esta &eacute;poca.</B><BR><br>
<b>Mister Chip</b>. <BR>Que s&oacute;lo produjo dos t&iacute;tulos: Startbyte y Rex Hard<br><BR>
<b>Dro.</b> <BR>Como el t&iacute;tulo m&aacute;s destacado El Cid. Dro fue sin embargo, una de las
mejores (para el que escribe mejor) distribuidora de juegos. Actualmente
su fusi&oacute;n con EA, la ha hecho desparecer como independiente. 
</P>
<h4> A&ntilde;o 1988 </H4>
<P ALIGN=justify>
<B>Compa&ntilde;&iacute;as de esta &eacute;poca.</B><BR>
Durante este a&ntilde;o no fueron excesivas la compa&ntilde;&iacute;as que se crearon, por lo
que pondremos s&oacute;lo el nombre de las fundadas y alg&uacute;n que otro t&iacute;tulo:<br><BR>
<b>Ibsa</b>.<BR> Que no cont&oacute; con t&iacute;tulos muy notables, si bien podemos citar el Megachess como
el &uacute;ltimo de los que sacaron.<br><BR>
<b>Spe.</b><BR> Que fue bastante parecida a la anterior en todo lo referente al n&uacute;mero de
t&iacute;tulos, ya que ambas sacaron 3 en toda su corta historia. Uno de los que
publico Spe fue el &quot;Underground&quot;.<br><BR>
<b>Proein.</b><BR> Al igual que Erbe y Dro, Proein hizo una peque&ntilde;a incrusi&oacute;n en el mundo
de la producci&oacute;n de juegos, antes de pasar a lo que es hoy en d&iacute;a, una notable
empresa de distribuci&oacute;n de juegos en nuestro pa&iacute;s.
</P>
<h4> A&ntilde;o 1989 </H4>
<P ALIGN=justify>
<b>Iber.</b><BR>
Iber supuso el toque m&aacute;s picaresco (con permiso de algunas portadas
de Dinamic), en los juegos de ordenador. As&iacute; podemos recordar la pantalla
de la playa en el Toy Acid Game, o el Sabrina, etc. Su permanencia no fue
demasiado exitosa.<BR><BR>
</P>
<h4> A&ntilde;o 1990 y el adios a nuestro pequeño gran imperio</H4>
<P ALIGN=justify>
Durante este a&ntilde;o, se crean las &uacute;ltimas compa&ntilde;&iacute;as espa&ntilde;olas, ya que el
software en 8 bits, ya no da para m&aacute;s. Las &uacute;ltimas valientes fueron:
<br><br>
<b>Animagic.</b><br> Esta compa&ntilde;&iacute;a desapareci&oacute; incomprensiblemente, y digo esto &uacute;ltimo
porque despu&eacute;s de jugar a su Mortadelo 2, se ve que contaban con una plantilla
estupenda, ya que el citado juego era una at&eacute;ntica maravilla de la diversi&oacute;n.<br><br>
<b>Delta.</b><br> Sacaron unos cuantos t&iacute;tulos y vendieron cara su muerte. El m&aacute;s emblem&aacute;tico
es el de Los Inhumanos, basado en la mascota de ese popular grupo musical.<br><br>
<b>Positive.</b><br> La verdad es que sacaron t&iacute;tulos bastante notables y originales, prueba de
ello es el Amo del Mundo, que por desgracia, contrastaban con otros muy mal
llevados a cabo caso del Genghis Khan.<br><br>
<b>GLL.</b><br> Esta fue la &uacute;ltima compa&ntilde;&iacute;a que se cre&oacute; en nuestro pa&iacute;s, alguno de sus t&iacute;tulos
fueron Buccaneers, Corrupt, etc creo que me faltan 2 m&aacute;s.

<br><br>
Y esta es la historia de las compa&ntilde;&iacute;as espa&ntilde;olas, eso s&iacute;, expuesta de forma
muy muy r&aacute;pida e injusta si nos paramos a pensar las horas de diversi&oacute;n y
orgullo que nos daban cada nuevo t&iacute;tulo que sacaban. De todas formas, nos
comprometemos a ir sacando, poco a poco, un art&iacute;culo independiente de cada
compa&ntilde;&iacute;a por separado.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsb.htm"><font FACE="ARIAL"><B>[Un paseo por nuestra historia]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


