<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Myth, "History in the Making".
</FONT>
</H3>

<P ALIGN=justify>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
<table align="left">
<td><img src="jpg/myth1.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b>Portada del Myth</b></td>
</table>
<FONT color="#000000" size=2 face=arial>

<P ALIGN=JUSTIFY>
<P ALIGN=justify>Iniciamos un nuevo apartado en "Recuerdos de 8 bits". A partir de ahora nos pondremos a recordar aquellos juegos legendarios que nos acompa&ntilde;aron a lo largo de nuestra infancia inform&aacute;tica. Quiz&aacute;s el juego con el que abrimos esta secci&oacute;n no sea el esperado por el veterano en estas lides pero, ¿y por qu&eacute; no? me dije. Vamos a ser originales y a comentar un producto que no lleve el nombre de Ultimate u Ocean en su caja... vamos a comentar uno de los juegos m&aacute;s fant&aacute;sticos de la &uacute;ltima etapa de los 8 bits, el <B>Myth</B> un juego que <B>Neil Bobwell</B> realiz&oacute; para <B>System 3</B>.</P>
<P ALIGN="JUSTIFY">Este programa, aterriz&oacute; en nuestro pa&iacute;s y pas&oacute; bastante desapercibido. Es curioso que un juego con la calidad del Myth recibiera un total abandono por parte de su distribuidora sin embargo, as&iacute; fue. Mi encuentro con este juego se puede considerar de casual si tenemos en cuenta que, cuando me hice con &eacute;l, realmente no sab&iacute;a qu&eacute; estaba comprando... </P>
<P ALIGN="JUSTIFY">Recuerdo que ten&iacute;a que comprar mi ineludible "juego del mes" y me encontr&eacute; en medio de la tienda con la mirada atenta del dependiente... <I>"Bueno muchacho, este mes no nos han llegado muchas novedades, tan solo tenemos una conversi&oacute;n de Ocean y este t&iacute;tulo que recib&iacute; hace pocos d&iacute;as...."</I>. – me dijo mientras se&ntilde;alaba al estante d&oacute;nde se encontraba el Myth -. <I>"En fin, te dejo que tengo que atender a m&aacute;s gente. Cuando te decidas me avisas ¿eh?"</I>. La verdad, es que por aquellas fechas ya estaba un poco saturado de las conversiones de Ocean y, por otro lado, no hab&iacute;a ido a la tienda con ning&uacute;n t&iacute;tulo como objetivo n&uacute;mero 1. Despu&eacute;s de muchas vueltas y poner el estante del buen hombre hecho un adefesio ;-), decid&iacute; llevarme el Myth. <I>"Todo sea por la.... "curiosidad"</I> del mes", me dije (aunque realmente, me estaba quemando el dinero en el bolsillo ;-) ).</P>
<P ALIGN="JUSTIFY">Fue llegar a casa y no esperar ni un minuto para ponerlo. <I>"Uhmm, un juego basado en viajes a lo largo del tiempo, mitolog&iacute;a, objetos que recoger.... una v&iacute;deo - aventura"</I>, pens&eacute;... Y, mientras cavilaba m&aacute;s con la caja y las instrucciones en mano, la cinta lleg&oacute; al final. El resto fue tan excitante que aquella tarde la recuerdo como una de las m&aacute;s divertidas y entretenidas de mi etapa como usuario del Spectrum, de esos momentos en los que descubres un juego que te hace olvidar, de repente, los cientos de t&iacute;tulos que ya han pasado por delante de tus ojos, al verlo y disfrutarlo como si del primer videojuego de tu vida se tratara.</P>
<P ALIGN="JUSTIFY">Lo primero que apreci&eacute;, cuando jugu&eacute; al Myth, fueron montones de peque&ntilde;os detalles, gr&aacute;ficos mimados hasta l&iacute;mites insospechados y, una calidad t&eacute;cnica, muy por encima de la media a la que est&aacute;bamos acostumbrados en el mundo de las v&iacute;deo - aventuras. Realmente el juego ten&iacute;a sabor cl&aacute;sico. </P>
<P ALIGN=justify>El primer sitio en d&oacute;nde aparec&iacute;amos era en un infierno muy bien dise&ntilde;ado y, hasta cierto punto, claustrof&oacute;bico. Lo primero que sent&iacute;amos era el deseo de observar el decorado en el que irrump&iacute;amos. Ese primer contacto con el Myth, era lo que te dejaba totalmente enganchado ya que no te esperabas, ni por asomo, que aquella cinta guardara semejante calidad. Nada m&aacute;s comenzar, te ve&iacute;as rodeado de cofres, vasijas y objetos de toda &iacute;ndole. Eso sin contar los esqueletos que se encontraban colgados y que, al "rozarles" les provocabas un suave y perfecto balanceo digno de los mejores elogios para el programador.</P>
<center>
<table>
<td><img src="jpg/myth2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Unos decorados de quitarse el sombrero.</center></b></td>
</table></center>
<FONT color="#000000" size=2 face=arial>

<P ALIGN="JUSTIFY">

<P ALIGN="JUSTIFY">Para poder avanzar, deb&iacute;amos de utilizar las cl&aacute;sicas bazas de toda buena v&iacute;deo – aventura, esto es, ingenio y habilidad de forma totalmente equilibrada. </P>
<P ALIGN="JUSTIFY">En el Myth, deb&iacute;amos de atravesar cinco largas y misteriosas fases que guardaban relaci&oacute;n con cinco periodos distintos de la historia. En cada una de estas &eacute;pocas diferentes ten&iacute;amos que recoger cinco esferas que, al unirlas, configuraban un m&eacute;todo de teletransporte a otra &eacute;poca distinta (otra fase). Nuestro objetivo final era llegar a enfrentarnos al dios Damer&oacute;n. </P>
<P ALIGN="JUSTIFY">Durante el juego, ten&iacute;amos a nuestra disposici&oacute;n la realizaci&oacute;n de una gran cantidad de acciones e, incluso, pose&iacute;amos de las "virtudes" de todo un se&ntilde;or inventario en d&oacute;nde ir alojando los objetos que nos encontr&aacute;ramos. Dichos objetos, que descubr&iacute;amos y recog&iacute;amos a lo largo de lo que duraba la aventura, siempre serv&iacute;an para poder "avanzar", esto es, deb&iacute;amos de utilizarlos en ciertas partes de la aventura. Adem&aacute;s, dispon&iacute;amos de distintas armas para combatir a nuestros enemigos. Una de las m&aacute;s espectaculares era, sin duda, la bola de fuego (que era recogida como un "item" al romper las vasijas y cofres). Dicha arma, pose&iacute;a unos efectos visuales realmente incre&iacute;bles. Pero tampoco hay que desmerecer al resto de "herramientas de trabajo". Las animaciones que nuestro personaje consegu&iacute;a portando escudos y espadas era magistral, casi de lo mejorcito que se pudo ver en el Spectrum.</P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/myth3.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El primer gran enemigo</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Los enemigos, as&iacute; mismo, eran muy variados y destacaban por encima de todo los de final de fase. Sin ir m&aacute;s lejos, recuerdo como el drag&oacute;n que guardaba la primera de las pantallas pose&iacute;a un tama&ntilde;o que casi ocupaba la totalidad de la pantalla, adem&aacute;s de estar adornado con montones de peque&ntilde;os detalles dignos de todo elogio por parte del jugador "exquisito". (como pod&eacute;is ver el captura que he realizado)</P>
<P ALIGN="JUSTIFY">Del Myth, se podr&iacute;an alabar la sabia mezcla entre calidad gr&aacute;fica, dificultad y nivel t&eacute;cnico en la programaci&oacute;n. Realmente era un juego que, teniendo en cuenta sus maravillosas caracter&iacute;sticas, deber&iacute;a de haber pasado a la historia de un modo m&aacute;s especial. Quiz&aacute;s la mayor culpa la tuviera la casa distribuidora o quiz&aacute;s, fue el hecho de haber sido lanzado cuando a nadie le interesaba ya dar demasiada relevancia a los t&iacute;tulos de los 8 bits. </P>
<P ALIGN="JUSTIFY">Opiniones a parte, el Myth fue uno de los mejores t&iacute;tulos que salieron en la recta final de la vida de aquellos micros. Derrochaba una gran calidad en cada uno de los dise&ntilde;os y personajes del juego como dragones, esqueletos, guardianes, dioses y dem&aacute;s seres mitol&oacute;gicos con los que nos ten&iacute;amos que encarar. El Myth era ese tipo juego que te enganchaba, ten&iacute;a esa "magia" que atra&iacute;a al jugador irremediablemente hasta que este lo concluyera, en definitiva, toda una delicia para el jugador de finales de los 80. </P>
<P ALIGN="JUSTIFY">El creador de esta peque&ntilde;a obra de arte fue Neil Bobwell al que m&aacute;s tarde, en los ordenadores de 16 bits, vimos detr&aacute;s de una producci&oacute;n llamada Dremweb. Juego con un alto &iacute;ndice de violencia pero que result&oacute; ser una v&iacute;deo - aventura (nuevamente) muy interesante. </P>
<P ALIGN="JUSTIFY">Con este peque&ntilde;o recuerdo, rindo homenaje a este t&iacute;tulo que, pese a pasar casi de puntillas, deb&iacute;a de haber ocupado un puesto de honor en los recuerdos de muchos de los jugadores de aquella &eacute;poca de los 8 bits. Sirva la inauguraci&oacute;n de esta secci&oacute;n con &eacute;l. </P></FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

