<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>quellos Maravillosos Bits</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:oscarg@salleurl.edu">Oscar García "Kokopus"</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Aquellos maravillosos "packs".
</FONT>
</H3>

<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">



<P ALIGN=JUSTIFY>
Qui&eacute;n no recuerda la ilusi&oacute;n del primer d&iacute;a ante el flamante Spectrum ZX 48k, el Amstrad CPC 464 o los MSX y Commodore 64. Y mas teniendo en cuenta los 3 meses que te hab&iacute;a costado convencer a tus padres de que seguro que lo que menos har&iacute;as con tan preciada maquina seria jugar...ehem...;).</P>
<P ALIGN="JUSTIFY">Yo recuerdo con especial ilusi&oacute;n el "pack" de juegos que sol&iacute;as recibir con tu estupenda compra...desde luego el primer uso del pack era el convencimiento de tus propios padres...:</P>
<I><P ALIGN="JUSTIFY">"Papa, mama, pero si no os vais a gastar ni un duro en juegos que ya vienen con el ordenador!!!, adem&aacute;s vienen diez juegos con el o sea que tendr&eacute; para al menos un a&ntilde;o jugando (jua jua jua...mas quisieran)...venga por favor, de verdad que me servir&aacute; mucho para estudiar y solo jugare con el "pack" de regalo..."</P>
</I><P ALIGN="JUSTIFY">Morri&ntilde;a verdad, a mi si que me entra una poquita lo reconozco.</P>
<P ALIGN="JUSTIFY">Situ&eacute;monos en la punta de la pir&aacute;mide, como no, el Spectrum. ¿Os acord&aacute;is del pack de juegos que venia con el en los primeros a&ntilde;os?, era una colecci&oacute;n nada despreciable compuesta por juegos de compa&ntilde;&iacute;as como PSION e IMAGINE-KONAMI.</P>
<P ALIGN="JUSTIFY">Vaya noche la del primer d&iacute;a jugando a la saga HORACE...ya se ya que aquello era la simplicidad pura pero no me cansaba de repetir y repetir escenarios, a cuatro colores y con pitidos a modo de m&uacute;sica de fondo. Me estoy refiriendo a "Horace goes skiing", "Horace &amp; the spiders" y "Hungry Horace". Un particular personajillo consistente en una especie de circulo con dos ojos en medio y alg&uacute;n que otro ap&eacute;ndice como extremidad. Saltaba y corr&iacute;a para que no se lo comieran las ara&ntilde;as, esquiaba cuesta abajo y a trav&eacute;s de una autopista o se hinchaba a comer...Eran juegos capaces de provocar que todos los amiguetes y papas "asociados" se congregaran en torno del peque&ntilde;o ordenador cantando las divinidades de tan "magn&aacute;nime tecnolog&iacute;a".</P>
<P ALIGN="JUSTIFY">Eso si, luego aparec&iacute;a un vecino diciendo que se hab&iacute;a comprado un MSX y que tenia los juegos en cartucho, que le tardaban mucho menos en cargar y que eran mas largos y de mas calidad....hombre tampoco le faltaba mucha raz&oacute;n y es que el progreso es el progreso no?.</P>
<P ALIGN="JUSTIFY">Para maravilla hardware el chip de sonido del Commodore 64, precursor del chip incluido con el Amiga, aquello era el para&iacute;so.</P>
<P ALIGN="JUSTIFY">A mi personalmente fueron esos los juegos que me introdujeron en este mundillo, los del pack de regalo. Recuerdo tambi&eacute;n que a veces, y si tenias suerte, te pod&iacute;a caer el "Ping Pong" de Konami, versionado por Imagine. Vaya tela!!!...eso ya era todo un lujo...si es que parec&iacute;a que la m&uacute;sica tenia melod&iacute;a y todo !!! y adem&aacute;s ya conociendo las maquinitas del bar de enfrente donde te dejabas los dedos a manotazos para que el "atleta" corriera mas...vamos que me sent&iacute;a como due&ntilde;o del bar y de la maquina y encima sin pagar por cada partidilla.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s estaban los juegos que probabas los &uacute;ltimos y porque no tenias mas. Normalmente los acababa disfrutando tu padre si es que le convenc&iacute;as para que pulsara alguna tecla de a&ntilde;o en a&ntilde;o. Me refiero a juegos tipo "Chess" o "Reversi". Siempre venia alguno en el pack, siempre!!!...y es que claro, nosotros con once a&ntilde;os y con ganas de pilotar coches o destrozar naves marcianas no estabamos para comprar juegos "pela-cerebros". De todas formas no niego que alguna partidilla si que llegue a echar, eso si cuando mis amiguetes no me ve&iacute;an.....8).</P>
<P ALIGN="JUSTIFY">¿Marcianos he dicho antes?, por supuesto, pero estos juegos ya nos los sab&iacute;amos de memoria de las recreativas.....que os vos a decir yo, el "Ave Fenix", "Asteroids".....tambi&eacute;n sol&iacute;an caer entre nuestros dedos de manos del famoso pack de juegos de regalo....mil bichos de 4 pixels en el cielo, tres murallitas cuadradas para protegernos y nuestra superpoderosa "Starfighter" de 12 pixels con movimiento lateral y bolitas a modo de l&aacute;ser...ni cuando fui al cine a ver la segunda parte de "La Guerra de las Galaxias" alucine tanto!!!</P>
<P ALIGN="JUSTIFY">Pero tres meses despu&eacute;s de haber comprado el ZX, el pack quedaba relegado a su caj&oacute;n de por vida. La lucha por conseguir t&iacute;tulos y mas t&iacute;tulos y la incesante lluvia de juegos...y las mejoras tecnol&oacute;gicas que se introduc&iacute;an, &eacute;ramos de todo menos poco exigentes. De todas formas el que nace fiel al pack lo sigue siendo. Recuerdo packs de ensue&ntilde;o de Dinamic y de Topo. Uno de esta ultima compa&ntilde;&iacute;a recuerdo que incluso lo llegaron a anunciar por televisi&oacute;n y que inclu&iacute;a tambi&eacute;n el "Psycho Pigs Uxb" de Ocean.</P>
<P ALIGN="JUSTIFY">Era la &eacute;poca de los t&iacute;tulos a 875 pesetas y de la pirater&iacute;a descontrolada (¿alguien la controla ahora?, yo creo que algo mas si...). Llego tras esto el Atari ST y el Amiga...vaya con el Amiga!!!....este si que tra&iacute;a un pack de lujo con el "F29 Retaliator" de Ocean, a mi juicio uno de los mejores simuladores de todos los tiempos. Y estaba la disputa entre, el que no se hab&iacute;a enterado y se hab&iacute;a comprado el ordenador sin pack, y tu, que cauto te hab&iacute;as agenciado un pack de 8 juegos por el mismo precio...</P>
<P ALIGN="JUSTIFY">De todas maneras a todos nos gusta lo barato y lo gratis aun mas, claro. Los packs nunca morir&aacute;n y sino que nos lo digan a los fan&aacute;ticos de LucasArts y sus "The LucasArts archives vol. I, II, III", o de Sierra con sus estupendas compilaciones de series de aventuras gr&aacute;ficas...</P>
<B><I><P ALIGN="JUSTIFY">Si hay algo que siempre sobrevivir&aacute; es el pack</B></I>. Naci&oacute; con el primer d&iacute;a y morir&aacute; con el ultimo. Ya todos nos encanta porque nos concede muchos juegos de golpe a un buen precio.</P>
<B><I><P ALIGN="JUSTIFY">Viva la gente y el pack !</B></I>, quiz&aacute;s la mejor de las estrategias de marketing que jamas se invento.</P></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsa.htm"><font FACE="ARIAL"><B>[Aquellos maravillosos bits]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER></HTML>
