<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Rick Dangerous.
</FONT>
</H3>

<P ALIGN=justify>
<table align="left">
<td><img src="jpg/8rick1.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b>Portada del Rick Dangerous</b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>Me juego algo a que si este juego lleg&oacute; a caer 
en tus manos result&oacute; ser uno de los m&aacute;s adictivos a los que 
jugaste en tú vida. Desde luego, yo no me encontr&eacute; con ning&uacute;n otro
juego, salvo el &quot;Raibow Islands&quot;, que m&aacute;s 
me enganchar&aacute; al Spectrum. Y es que, este &quot;<B>Rick 
Dangerous</B>&quot;, era uno de esos títulos que crean afición.Ten&iacute;a una dificultad, originalidad y adici&oacute;n dif&iacute;cilmente superables.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego no era m&aacute;s que un arcade en el que deb&iacute;amos de tomar el papel de una especie de Indiana Jones, es decir, era una parodia al aventurero por antonomasia pero chicos, creo que Indy puede sentirse muy orgulloso de que un juego como lo que fue &quot;Rick Dangerous&quot;, se encargara de parodiarle.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Rick Dangerous, fue editado en el a&ntilde;o 1989 y supuso el regreso de una casa, <B>Firebird</B>, que llevaba bastante tiempo sin publicar nada. Puede decirse que este juego volvi&oacute; a traer a la casa del &quot;Ave Phoenyx&quot; a las primeras posiciones del panorama Europeo. El juego se vendi&oacute; bien, recibi&oacute; cr&iacute;ticas excelentes y, c&oacute;mo no, gener&oacute; una segunda parte que, por cierto, sali&oacute; cuando comenzaba la agon&iacute;a de los 8 bits. Cabe decir que, en estos tiempos en los que fue editado el &quot;Rick Dangerous&quot;, los distintos g&eacute;neros reinantes empezaban a tender, descaradamente, hacia la v&iacute;deo aventura. Se empezaban a crear arcades en los que hab&iacute;a que hacer algo adem&aacute;s de acabar con unos cuantos sprites y el &quot;Rick Dangerous&quot; fue un juego que se situ&oacute; a medio camino entre el m&aacute;s endiablado arcade de plataformas y habilidad y la m&aacute;s retadora video aventura. Fue un juego magn&iacute;fico en todos los sentidos. Pero vamos a examinar, m&aacute;s de cerca, este t&iacute;tulo.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Adictivo 100%</h4>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">S&iacute;, como dec&iacute;a m&aacute;s arriba, este juego se caracterizaba por mezclar dos g&eacute;neros b&aacute;sicos en todo lo que fue la trayectoria de los 8 bits: arcade plataformas y v&iacute;deo aventura, sin bien, no a partes iguales. Hab&iacute;a mucho m&aacute;s arcade que v&iacute;deo aventura. </P>
<P ALIGN="JUSTIFY">Manej&aacute;bamos a un &quot;peque&ntilde;o&quot; aventurero llamado &quot;Rick Dangerous&quot; por tres fases distintas. En cada una de las tres fases hab&iacute;a infinidad de pantallas a superar, es decir, era el &quot;t&iacute;pico&quot; juego en el que se te presentaba una pantalla con una serie de dificultades particulares. En unas ocasiones deb&iacute;amos de utilizar nuestra habilidad y reflejos (y me acuerdo de alg&uacute;n que otro joystick que no vivio para contarlo...) y en otras nuestro ingenio. Siempre hab&iacute;a una soluci&oacute;n pese a que algunas pantallas parec&iacute;an realmente imposibles. Quiz&aacute;s la mayor virtud de este juego era la capacidad que ten&iacute;a para atraer la atenci&oacute;n del jugador. Derrepente te ve&iacute;as corriendo a todo meter y matando y esquivando enemigos como un poseso para llegar a salvo al final de la pantalla mientras que en otras, ten&iacute;as que estudiar al mil&iacute;metro los movimientos que deb&iacute;as de hacer en cuanto estuvieses dispuesto a atravesar la pantalla como un aut&eacute;ntico India... esteee &quot;Rick Dangerous&quot; ;-).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sin ir m&aacute;s lejos, nada m&aacute;s comenzar la partida y avanzar apenas unos pasos, sal&iacute;a detr&aacute;s de ti una enorme bola de piedra rodando sin parar. Obviamente ten&iacute;as que salir pitando para que no te pillar&aacute;, no pod&iacute;as detenerte ni un momento y, justo cuando hab&iacute;as atravesado 2 o 3 pantallas, ten&iacute;as que saltar al &quot;vaci&oacute;&quot; y evitar que la piedra de espachurrara. Os estar&eacute;is acordando de &quot;<I>Indiana Jones en Busca del Arca Perdida</I>&quot;, ¿no?.</P>
<P ALIGN="JUSTIFY"></P>
<table align=right>
<td><img src="jpg/8rick2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Los personajes eran muy "graciosos".</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>

<P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">Para remarcar m&aacute;s el car&aacute;cter semi-c&oacute;mico del juego, los personajes eran peque&ntilde;os y regordetes, es decir, parec&iacute;an aut&eacute;nticos &quot;monigotes&quot; y hasta su expresi&oacute;n era graciosa. Los escenarios estaban realizados en perfecta sinton&iacute;a con lo que deb&iacute;a de transmitir el juego, es decir, estaban muy bien pero no por ello eran, por as&iacute; decirlo, excelentes. Cumpl&iacute;an su cometido pero, la verdad, es que daban igual las posibles excelencias gr&aacute;ficas porque el &quot;Rick Dangerous&quot; era de esos juegos en los que la persona que lo est&aacute; probando no se fija en los gr&aacute;ficos sino en el juego en s&iacute;. Pod&iacute;as estar horas tras horas intentando pasar de fase, llegando a la dichosa pantalla que siempre te mataban porque no sab&iacute;as muy bien c&oacute;mo hacer para lograr superarla, te pod&iacute;a poner de mal humor (ahhh mi joystick  :-), en fin, era un juego de esos que se com&iacute;an nuestras tardes de fin de semana sin que nos di&eacute;ramos cuenta...</P>
<P ALIGN="JUSTIFY"></P>
<h4>Desarrollo</h4>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">C&oacute;mo ya coment&eacute;, el  &quot;Rick Dangerous&quot;, se basaba por entero en ir atravesando pantalla tras pantalla. Unas veces se iba r&aacute;pido porque eran, b&aacute;sicamente, de acci&oacute;n, es decir, ten&iacute;as que saber saltar r&aacute;pidamente y matar a cuantos estuvieran delante de ti haciendo cada una de las acciones casi de memoria. En otras, sin embargo, deb&iacute;as de parar y meditar qu&eacute; hacer antes de llevar a acabo tus acciones. El juego provocaba que el jugado pensara y ejecutara movimientos &quot;milim&eacute;tricos&quot; que requer&iacute;an una alta habilidad. Era realmente dif&iacute;cil.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para poder avanzar en nuestra aventura el bueno de Rick dispon&iacute;a de una especie de estaca de madera con la que poner fuera de &oacute;rbita a sus enemigos, eso sin contar con sus espectaculares saltos que bien val&iacute;an un 50% del &eacute;xito en nuestro avance. Otras de las &quot;facilidades&quot; con las que cont&aacute;bamos era nuestra pistola que ten&iacute;a balas limitadas con lo que deb&iacute;amos de ir encontrando munici&oacute;n por el camino (bastante escasa, por cierto...). Adem&aacute;s de la pistola, tambi&eacute;n dispon&iacute;amos de cartuchos de dinamita. S&iacute;, por supuesto limitados...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego ten&iacute;a tres grandes fases. La primera transcurr&iacute;a en un templo Azteca, la segunda en una pir&aacute;mide Egipcia y la tercera en un castillo nac&iacute;. En cada una de ellas, deb&iacute;amos de conseguir un determinado objeto o realizar una acci&oacute;n espec&iacute;fica. Todo esto ven&iacute;a a dar este toque &quot;video aventurero&quot; al juego aunque este no llegara al 50% del mismo.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Un gran &eacute;xito.</h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">S&iacute;, el &quot;Rick Dangerous&quot; fue un &eacute;xito claro tanto que se hizo una segunda parte en relativamente poco tiempo. En la segunda entrega, Rick, deb&iacute;a de enfrentarse con los extraterrestres. </P>
<P ALIGN="JUSTIFY">Pues qu&eacute; os voy a decir. M&aacute;s, mucho m&aacute;s de lo mismo pero ni por asomo, repetitivo. Volv&iacute;amos a tener montones de pantallas para poner a prueba nuestros nervios, nuestra habilidad y nuestra capacidad de control... y es que, de nuevo, Rick lograba arrebatarnos tarde tras tarde sin que apenas nos diese tiempo. Un gran juego otra vez.</P>

<FONT color="#000000" size=2 face=arial>
<P ALIGN="JUSTIFY">

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muy pocos juegos han logrado tener tan alta adicci&oacute;n. Bueno, la verdad es que los que comentamos aqu&iacute; fueron y son grandes cl&aacute;sicos y excelentes en todos los aspectos. Del &quot;Rick Dangerous&quot; cualquiera que lo haya jugado, suficientemente, recordar&aacute; algo &uacute;nico. No se qu&eacute; ten&iacute;a este juego pero lograba, sin quererlo, absorberte por completo. Quiz&aacute;s el motivo sea que era el t&iacute;pico juego que no te esperas que de tanto de s&iacute;, que no ven&iacute;a anunciado a &quot;bombo y platillo&quot;, en definitiva, un juego incre&iacute;blemente dif&iacute;cil y adictivo y, por supuesto, digno de aparecer en un &quot;Museo sobre Videojuegos&quot;.</P>

<P ALIGN=justify>
</P>


</FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

