<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Rainbow Islands.
</FONT>
</H3>

<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
<FONT color="#000000" size=2 face=arial>

Sin lugar a dudas, el arcade es el g&eacute;nero que m&aacute;s horas
de diversi&oacute;n nos ha proporcionado. S&iacute;, s&iacute;,&nbsp; digo
bien. Ning&uacute;n otro g&eacute;nero lo consigue de manera tan r&aacute;pida
y en cantidades tan considerables... El juego del que vamos a hablar es
un claro ejemplo de lo que aqu&iacute; se expone. Y es que la palabra que
m&aacute;s se adapta a este tipo de juegos es la de 'DIVERSI&Oacute;N'
en may&uacute;sculas...
<br><br>
<table align="left">
<td><img src="gif/rainbow1.gif" ></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Salido directamente de la m&aacute;quina recreativa, la conversi&oacute;n
realizada por OCEAN y TAITO result&oacute;&nbsp;
ser perfecta. El aspecto gr&aacute;fico no se pod&iacute;a comparar al aut&eacute;ntico,
desde luego, pero la acci&oacute;n se traslad&oacute; magistralmente...

<P ALIGN=justify>La sensaci&oacute;n de que la adrenalina te fluyera por las venas, las
manos sudaran hasta el punto de tener que sec&aacute;rtelas en el pantal&oacute;n
a mitad de partida, los ojos fijos en la televisi&oacute;n, posici&oacute;n
aerodin&aacute;mica como si fu&eacute;ramos a despegar, saltos bruscos
en momentos de peligro, tremendas ganas de ir al ba&ntilde;o pero aguantando
para no perder la racha (o por no encontrar la tecla de pausa)... Todo
esto hizo que el 'Rainbow Islands' y pocos m&aacute;s, se coronaran en
lo m&aacute;s alto que un juego pudiera hacerlo jam&aacute;s...

<P ALIGN=justify>Creo que ha quedado claro que la esencia del arcade estaba &iacute;ntegra
en este juegazo...

<P>
<table align="right">
<td><IMG SRC="gif/rainbow3.gif" HEIGHT=196 WIDTH=260 ALIGN=RIGHT></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Pero, &iquest;c&oacute;mo era este 'Rainbow Islands'?. Pues ni m&aacute;s
ni menos que lo que sigue: Scroll vertical,&nbsp; protagonista
peque&ntilde;o y regordete con t&iacute;picos rasgos de personaje manga,
plataformas y m&aacute;s plataformas, enemigos tales como insectos, vampiros
y dem&aacute;s fauna, mundos / islas compuestas por varias fases, enemigos
gigantes en cada final de isla y como no... muchos arco iris...
<BR>&nbsp;
<BR>El objetivo final pasaba por llegar a lo m&aacute;s alto de cada nivel
saltando o subiendo por los arco iris. Como siempre, no era tarea sencilla.
Abundantes enemigos poblaban el decorado con intenciones muy alejadas a
la de hacer amistades. Menos mal que nuestro peque&ntilde;o protagonista
pod&iacute;a utilizar los arco iris como arma letal. Lo peor era las prisas
que te met&iacute;an cuando se acababa el tiempo. O acelerabas cuanto te
avisaban o el agua te alcanzaba ahog&aacute;ndote sin remedio...

<P ALIGN=justify>Se pod&iacute;a incrementar el poder del prota con unos recipientes
m&aacute;gicos de colores. O lanzabas m&aacute;s r&aacute;pido los arco
iris o se incrementaba el n&uacute;mero de ellos. Todo seg&uacute;n el
color. En el caso de que cogieras las botas m&aacute;gicas, pasabas de
andar a correr.

<P ALIGN=justify>
<table align="left">
<td><IMG SRC="gif/rainbow2.gif" HEIGHT=198 WIDTH=260 ALIGN=LEFT></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
La forma de conseguir los recipientes y las botas era matar a los enemigos
con la estela de un arco&nbsp; iris
roto o con la explosi&oacute;n de una estrella m&aacute;gica... De esta
forma te pod&iacute;as asegurar uno de estos 'premios' o un diamante. &iquest;Qu&eacute;
era un diamante?. Pues eso, un diamante. Pero... &iquest;qu&eacute; era
lo que hac&iacute;a?. Si consegu&iacute;as reunir todos los diamantes de
distintos colores te daban una maravillosa y &uacute;til vida extra...

<P ALIGN=justify>Ante este simple argumento s&oacute;lo nos quedaba ponernos a jugar.
Pasar de fase, pasar de fase, pasar de fase... era la &uacute;nica obsesi&oacute;n
que ten&iacute;as tras haber jugado los 5 primeros minutos. El tiempo pasaba
sin darte cuenta. En realidad no te importaba porque lo estabas empleando
en algo que te gustaba de verdad, en un juego de 8 bits, en el 'Rainbow
Islands'.
<BR>&nbsp;
<BR>En definitiva, 'Rainbow Islands' acab&oacute; siendo de esas 'peque&ntilde;as'
cosas que nos uni&oacute; a los usuarios de Spectrum, Commodore 64, Amstrad
CPC y MSX, coincidiendo todos en un mismo pensamiento, que era el mejor
juego que hab&iacute;amos jugado nunca...



<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

