<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>quellos Maravillosos Bits</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>


<br><br>



<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Sam Coup&eacute;; la falsa esperanza de los 8 bits.
</FONT>
</H3>
<FONT color="#000000" face="arial" SIZE=2>        
<P ALIGN="JUSTIFY">Corr&iacute;a finales del a&ntilde;o 1991 y el Spectrum y, en general, todos los ordenadores de 8 bits, estaban ya acorralados. Por un lado, los equipos de 16 bits, avalados por la prensa especializada, se hab&iacute;an alojado en un buen n&uacute;mero de hogares y, por otro, las consolas, aut&eacute;ntico &quot;boom&quot; del entretenimiento a principio de los 90, hab&iacute;an terminado por producir deserciones en las filas de incondicionales de los Spectrum, Amstrad, MSX o Commodore. ¿Qu&eacute; esperanza hab&iacute;a, pues, para los que a&uacute;n se resist&iacute;an por desprenderse de los ordenadores con los que crecieron?. A decir verdad, la &uacute;nica esperanza se llamaba SAM Coup&eacute; pero, como ver&eacute;is, al final las compa&ntilde;&iacute;as productoras de software, la prensa especilizada y, por supuesto, las distribuidoras, terminaron por hundirlo.</P>
<P ALIGN="JUSTIFY"></P>
<CENTER><TABLE WIDTH="200">
<TD><IMG SRC="jpg/sam01.jpg"></TD>
<TR>
<TD><FONT SIZE=1 FACE=ARIAL><CENTER>Ahí tenéis al bueno del SAM</CENTER></FONT></TD>
</TABLE></CENTER>
<P ALIGN="JUSTIFY">El SAM Coup&eacute;, era un ordenador compatible con la arquitectura Spectrum (usaba un microprocesador Z80b a 6 Mhz) que fue lanzado all&aacute; por el a&ntilde;o 89/90 en Inglaterra. Su particularidad resid&iacute;a en el hecho de que, aunque era un equipo de 8 bits, pose&iacute;a unas caracter&iacute;sticas mucho m&aacute;s elevadas que cualquier otro modelo equivalente de la &eacute;poca. Partiendo de un dise&ntilde;o bastante moderno, el SAM iba claramente dirigido al mercado familiar, m&aacute;s concretamente, a cerrar el hueco de programas educativos y de uso general que faltaba en el Spectrum (ven&iacute;a a representar un equilibrio entre la faceta recreativa del Speccy y la seria de ordenadores de m&aacute;s elevadas prestaciones). Algunas de las caracter&iacute;sticas t&eacute;cnicas m&aacute;s sobresalientes del SAM, la constitu&iacute;a la memoria RAM de 512 K (ampliable a 1 MB), la unidad de disco de 3 ½ de 720 Kb, la paleta de 128 colores con posibilidad de representarse simult&aacute;neamente en pantalla o el chip de sonido est&eacute;reo con seis canales independientes. Como veis, el SAM era una evoluci&oacute;n m&aacute;s que grande sobre el tradicional Spectrum. Aunque, eso s&iacute;, segu&iacute;a siendo un equipo de 8 bits.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La compa&ntilde;&iacute;a que se encarg&oacute; de desarrollar el SAM fue &quot;Miles Gordon Technology&quot;. Esta casa, ya hab&iacute;a introducido el SAM dos a&ntilde;os antes en Inglaterra, sin embargo, los resultados que all&iacute; obtuvieron no fueron demasiado buenos. No olvidemos que en el mercado brit&aacute;nico (cuna del videojuego en Europa), el modelo Amiga termin&oacute; por arraigar con una fuerza incre&iacute;ble que, no s&oacute;lo desbanc&oacute; a los equipos de 8 bits, sino que termin&oacute; por afianzarse como el modelo est&aacute;ndar antes de que las casas norteamericanas empezaran a entrar en Europa y a imponer el PC. Despu&eacute;s de los malos resultados del SAM en Inglaterra, los creadores del mismo tuvieron que refugiarse en mercados m&aacute;s minoritarios, pero seguros, como los que constitu&iacute;an los pa&iacute;ses del Este de Europa. Espa&ntilde;a era, desde el principio, el segundo mercado m&aacute;s importante del viejo continente para el SAM pero los malos resultados de Inglaterra, convert&iacute;an la introducci&oacute;n en nuestro pa&iacute;s del equipo en algo particularmente arriesgado. De ah&iacute;, buena parte de la raz&oacute;n de la tardanza en su llegada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y as&iacute;, pese a que fue el verano de 1992 la fecha elegida para la salida del SAM en Espa&ntilde;a, finalmente el equipo no vio la luz. Realmente, los continuos retrasos en el lanzamiento del ordenador no fueron gratuitos. El a&ntilde;o 1992 fue el a&ntilde;o de la despedida a los ordenadores y juegos de 8 bits. Se cerraba el primer cap&iacute;tulo de la historia de los videojuegos. Quiz&aacute;s, si el lanzamiento del SAM se hubiera hecho simult&aacute;neamente en los pa&iacute;ses consumidores de 8 bits m&aacute;s importantes de Europa, el resultado hubiera sido bien distinto. Falt&oacute;, indudablemente, valent&iacute;a desde el primer momento.</P>
<P ALIGN="JUSTIFY"></P>
<CENTER><TABLE WIDTH="200">
<TD><IMG SRC="jpg/sam02.jpg"></TD>
<TR>
<TD><FONT SIZE=1 FACE=ARIAL><CENTER>La calidad del SAM para ofrecer gráficos, estaba fuera de toda duda.</CENTER></FONT></TD>
</TABLE></CENTER>

<P ALIGN="JUSTIFY">La pregunta es ¿qu&eacute; hubiera pasado si el SAM no se hubiera hundido?. La verdad es que si el SAM hubiera logrado triunfar en Espa&ntilde;a, quiz&aacute;s alguna que otra compa&ntilde;&iacute;a nacional hubiera podido adaptarse en el cambio hacia los 16 bits; es decir, podr&iacute;a haber seguido haciendo cosas para el mercado del Amiga, Atari y PC teniendo como salvaguardia la producci&oacute;n de t&iacute;tulos para el SAM. Otra posibilidad ser&iacute;a que, quiz&aacute;s, el mercado espa&ntilde;ol hubiera perdido unos cuantos a&ntilde;os de evoluci&oacute;n tecnol&oacute;gica frente al resto de los pa&iacute;ses que comenzaron a volcarse, &uacute;nicamente, en equipos de gama alta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Elucubraciones a parte, una cosa est&aacute; clara, el SAM fue bastante maltratado en Inglaterra y eso sesg&oacute; su expansi&oacute;n y crecimiento. Mala fecha fue a elegir el SAM para salir. En fin, despu&eacute;s de todo, fue una verdadera l&aacute;stima y una total injusticia que no se le diese, ni siquiera, una oportunidad.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsa.htm"><font FACE="ARIAL"><B>[Aquellos maravillosos bits]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER></HTML>










