<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>quellos Maravillosos Bits</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Un se&ntilde;or llamado Clive Sinclair.
</FONT>
</H3>


<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
<img src="jpg/clive.jpg" align=left border=0><P ALIGN=justify>Creo que ser&iacute;a injusto no incluir un peque&ntilde;o homenaje al &quot;tio 
Clive&quot; en esta
secci&oacute;n de Macedonia. Si hay que buscar el punto de arranque
de la inform&aacute;tica dom&eacute;stica, este se encuentra en las ideas 
innovadoras que,
este g&eacute;nio y visionario de la inform&aacute;tica, 
llev&oacute; a la pr&aacute;ctica.
<br>
<br>
Clive Sinclair naci&oacute; en Surrey, Inglaterra, en el a&ntilde;o 1940.  
Al parecer el hombre ya
estaba hecho un &quot;calcul&iacute;n&quot; desde su tierna infancia ya que 
llegó a idear el sistema
binario, aunque claro, cuando dio a conocer la noticia "le contaron" que ya
estaba inventado. Siempre le atrajo todo lo relacionado con 
la electr&oacute;nica y
como buen apasionado de lo que le gustaba, decidio no estudiar en la Universidad
y dedicarse a aprender de forma autodidacta, argumentado que 
as&iacute; ser&iacute;a la forma con la que m&aacute;s aprender&iacute;a (Cuanta razón tenías Clive...). 
<br>
<br>
Sinclair logr&oacute; trabajar en varias revistas y compa&ntilde;&iacute;as 
hasta conseguir reunir
el dinero suficiente para fundar, en 1962, lo que ser&iacute;a la Sinclair 
Radionics Ltd.
Con la experiencia en la creaci&oacute;n de equipos 
electr&oacute;nicos miniatuarizados Clive
pudo, en 1980, sacar a la venta el m&aacute;s peque&ntilde;o y barato 
ordenador conocido entonces. Era el Sinclair ZX-80. Su primer ordenador pod&iacute;a 
conectarse a cualquier televisor y su
precio era muy asequible. Esto permitó que el &eacute;xito en toda Europa
fuera increiblemente alto y su nombre empezara a coger mucho prestigio y fama.
<br>
<br>
En el 81 y con el dinero obtenido con su ZX-80, Clive saca la siguiente versi&oacute;n,
el ZX-81 que, al contrario que su antecesor, s&iacute; puede manipular toda clase de
n&uacute;meros as&iacute; como disponer de un sistema operativo (basado en el BASIC). Pero
eso no era la mayor novedad. La mayor aportaci&oacute;n resid&iacute;a en la memoria, ya
que ofrec&iacute;a la inmensa cantidad de 1K que, por aquella &eacute;poca, era algo muy
considerable. El resultado de todas estas prestaciones fueron m&aacute;s de 300.000
unidades vendidas y la expansi&oacute;n por miles de hogares Europeos de &quot;su m&aacute;quina&quot;. 
<br>
<br>
Ya en el 1982 se empiezan a sacar la serie de ordenadores cl&aacute;sicos de Sinclair,
estos es, se empiezan a vender el ZX Spectrum con 16K y 48K los cuales, al
venir equipados con el procesador Zilog Z80 de 8 bits, pod&iacute;an realizar operaciones 
muy superiores a las de los dos ZX primeros. En pantalla pod&iacute;an mostrar hasta 
8 colores simult&aacute;neos y la carga de los programas se realizaba en cassette y, 
aunque la espera era realmente larga, merec&iacute;a la pena estarse
delante de la pantalla para poder saborear esas maravillas que eran los Spectrum.
<br>
<br>
<p align=justify>
Todo esto convirtio al Spectrum en el ordenador m&aacute;s popular de la d&eacute;cada de
los 80 ya que, durante este periodo, las ventas en toda Europa se contaban
por millones y la cantidad de programas en miles. Es por esto que la gran
aportaci&oacute;n de este hombre no fue la creaci&oacute;n del Spectrum en s&iacute;, sino la 
introducci&oacute;n de la inform&aacute;tica en el hogar.
<br>
<br>
A finales de los 80 la mala suerte cae sobre el genio al abandonar su
propio barco mediante la venta de su compa&ntilde;&iacute;a a Alan Sugar, presidente de
Amstrad (tradicional rival del Spectrum), para trabajar en otros proyectos,
como fueron el coche el&eacute;ctrico, el C5 o el ordenador QL. Todos estos proyectos 
resultaron ser un fracaso y consiguieron, por desgracia, retirar a Sinclair del panorama
inform&aacute;tico hasta nuestros d&iacute;as en los que, ojalá, volviera con alguna idea
revolucionaria.


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsa.htm"><font FACE="ARIAL"><B>[Aquellos maravillosos bits]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER></HTML>


