<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Back to Skool, Skool Daze 2
</FONT>
</H3>

<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
Dicen en el cine que segundas partes nunca fueron buenas. Muchas veces
se aplic&oacute; este principio a la inform&aacute;tica del entretenimiento.
Normalmente esto se cumpl&iacute;a. Pero de vez en cuando no...

<P ALIGN="JUSTIFY">Se trata de uno de los mejores juegos de la d&eacute;cada de los 80.
&iquest;En qu&eacute; me fundamento para afirmar tan rotunda frase?. Pues
para empezar en que esta maravilla de la programaci&oacute;n reuni&oacute;
varias de las caracter&iacute;sticas m&aacute;s valoradas por los cr&iacute;ticos
de la &eacute;poca y de la mayor&iacute;a de los usuarios: adictividad,
originalidad y calidad.

<P ALIGN="JUSTIFY">Microsphere no era consciente de lo que hab&iacute;a creado en aquellos
momentos con 'Skool Daze'. Aunque en un breve plazo de tiempo, y ayudados
por las maravillosas cr&iacute;ticas de la prensa especializada, se dieron
cuenta de las posibilidades de aquello. Enseguida empezaron a pensar en
nuevas formas de ampliar y crear nuevos elementos que enriquecieran el
producto final. Un producto final que se llam&oacute; 'Back to Skool',
la vuelta a clase...

<P ALIGN="JUSTIFY">Pero, &iquest;c&oacute;mo era el juego?. Bueno, basta de rodeos y empecemos
a extraer lo fundamental de esas artesanales 48K.

<P ALIGN="JUSTIFY">Eric es uno de esos ni&ntilde;os que no paran de hacer travesuras. &iquest;Qu&eacute;
mejor lugar de desarrollo de la aventura que un colegio?. Ya se empieza
a ver que era un producto original que nunca antes se hab&iacute;a hecho
y que a&uacute;n sigue sin ser explotado...
<table align="right">
<td><img src="gif/skool2.gif" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>¿Algo fuera de lo normal...? ;)</center></b></td>
</tr>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Partiendo de este eje, una gran cantidad de personajes, objetos y situaciones
giran en torno a &eacute;l. Todo se pod&iacute;a encontrar all&iacute;.
El empoll&oacute;n de la clase con sus gordas gafas y su af&aacute;n de
chivarse de las travesuras de nuestro protagonista, el mat&oacute;n, el
gamberro, los peque&ntilde;os del colegio, la guapita, el calvo profesor
de ciencias, el viejo profesor de historia, el inflexible director, la
asustadiza profesora, el jardinero, una biblioteca, un laboratorio, un
lavabo, un comedor, pizarras, pupitres, pistolas de agua, bombas f&eacute;tidas,
ratones, tizas, tirachinas, ...etc.&nbsp; &iquest;Alguien da m&aacute;s?.

<P ALIGN="JUSTIFY">La 'simple' misi&oacute;n de Eric era la de robar el expediente de la
caja fuerte del director. Nada m&aacute;s empezar las clases ya se hab&iacute;a
metido en multitud de l&iacute;os. Si el expediente llegaba a manos de
sus padres estaba perdido. Este a&ntilde;o nuevamente iba a estar repleto
de arriesgadas aventuras...

<P ALIGN="JUSTIFY">La forma de hacerlo no era nada f&aacute;cil. Para dar una idea dir&eacute;
que todo empezaba por llenar las copas de exposici&oacute;n de agua y tirarlas
para que les diera a los profesores en la cabeza y as&iacute;, aturdidos,
soltaran el n&uacute;mero que cada uno memorizaba. No quedaba la cosa as&iacute;,
ni mucho menos...

<P ALIGN="JUSTIFY">Todo se complicaba ya que si te escapabas y no acud&iacute;as a alguna
clase, el empoll&oacute;n se chivaba y el profesor te buscaba por todas
partes hasta encontrarte para machacarte a l&iacute;neas. Una forma de
liberarte de esas l&iacute;neas era besando a la guapita del colegio femenino.
Pero sin pasarse que si no te soltaba un guantazo. S&iacute;, s&iacute;,
el colegio femenino fue una de las novedades en esta segunda parte. Y si
luego volv&iacute;as para pegar al empoll&oacute;n &eacute;ste se chivaba
y te mandaban m&aacute;s lineas. Incluso a veces te acusaba sin haber hecho
nada. Gracias a que los profesores, de vez en cuando, se daban cuenta de
sus malas intenciones y entonces el castigo iba a &eacute;l.
<center><td><img src="gif/skool3.gif"></td></center>
<P ALIGN="JUSTIFY">&iquest;Qu&eacute; cu&aacute;ndo llegaba el GAME OVER?. Pues desde luego
no te mataban. Todo acababa si las l&iacute;neas que te mandaban superaban
las 10.000, el director te persegu&iacute;a hasta decirte la palabra maldita:
EXPULSADO y no hab&iacute;a m&aacute;s remedio que irse. Ese era el fin.

<P ALIGN="JUSTIFY">La gran variedad de acciones de Eric se ve&iacute;an reflejadas en la
gran cantidad de teclas que se pod&iacute;an usar. Repartidas por todo
el teclado, la 'f', por ejemplo, era tirar con el tirachinas, la 'h' era
soltar un pu&ntilde;etazo, la 'w' era escribir en la pizarra, ...etc. Si
te fijabas un poco te dabas cuenta de que la inicial de la palabra en ingl&eacute;s
era la tecla: 'f' de fire, 'h' de hit y 'w' de write.

<P ALIGN="JUSTIFY">La pistola de agua y las bombas f&eacute;tidas estaban escondidas en
los pupitres. Los ratones estaban en la biblioteca y en las clases de los
alrededores. &Eacute;sta serv&iacute;a para soltarla en el bloque del colegio
en el que estaban las chicas. As&iacute; todas se pon&iacute;an a dar saltitos,
incluida la profesora, consiguiendo paralelamente realizar una de las partes
de la misi&oacute;n.

<P ALIGN="JUSTIFY">Algo que engrandeci&oacute; al juego fue la posibilidad de poner los
nombre que uno quisiera a los personajes haciendo esta aventura un poco
m&aacute;s propia. Uno a uno iban pasando los principales, par&aacute;ndose
en mitad esperando su nuevo nombre. Estos peque&ntilde;os detalles eran
los que hac&iacute;an a un juego grande, siempre que la calidad los respaldara,
claro...

<P ALIGN="JUSTIFY">Pero no todo iba a ser perfecto. Y es que s&oacute;lo los usuarios del
Spectrum tuvimos el privilegio de jugar a semejante maravilla. De todas
formas, pasar&aacute; a la posteridad como uno de los grandes de los 8
bits, no hay duda...


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
