<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>quellos Maravillosos Bits</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:perota082@mx3.redestb.es">Pedro Ferrera "BaDBoY"</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>



<FONT color="#000000" FACE=ARIAL size=2>

<H3>Un sueño hecho realidad.</h3>
<P ALIGN=justify>
Cuando yo tuve uso de raz&oacute;n mi padre ya ten&iacute;a el Amstrad. Tanto es as&iacute;, que mis primeros recuerdos tienen forma de p&iacute;xel verde. Recuerdo perfectamente c&oacute;mo jug&aacute;bamos los tres, mi hermano, mi padre y, ocasionalmente yo, con ese ordenador. Los juegos del Amstrad nos un&iacute;an. Aquellos juegos maravillosos tienen, y tendr&aacute;n siempre, un gran valor nost&aacute;lgico para mi. Yo me implicaba mucho emocionalmente hasta cuando no era yo el que jugaba. Sufr&iacute;a, me alegraba, lo que le suced&iacute;a al protagonista era como si me estuviese sucediendo a m&iacute;.  Supongo que eso sucede porque cuando eres peque&ntilde;o eres muy susceptible, te marcan mucho las cosas, y a la vez eres muy receptivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No sabr&iacute;a decir cu&aacute;l fue el primer juego de Amstrad que vi. Pero creo que el primero que tuvimos fue un pack de cuatro de <B>OCEAN</B> y <B>US GOLD </B>en el cual ven&iacute;an: el <B>BEACH-HEAD</B>, el <B>JET SET WILLY</B>, el <B>SABRE WULF </B>y el <B>DALEY THOMPSON'S DECATHLON</B>. </P>
<P ALIGN="JUSTIFY">¿ Qui&eacute;n no recuerda el <B>JET SET WILLY </B>? Era uno de nuestros juegos favoritos, hab&iacute;a tantas habitaciones por explorar que nunca las vimos todas. Confi&aacute;bamos en que alg&uacute;n d&iacute;a recoger&iacute;amos todos los &iacute;tems y llegar&iacute;amos al dormitorio, pero recientemente he descubierto que ... ¡ es imposible acabar el juego ! El programador ocult&oacute; dos &iacute;tems de manera que fuese imposible cogerlos. Tonto no era, el t&iacute;o.</P>
<P ALIGN="JUSTIFY"> ¿ Hay alguien que no haya jugado con el <B>SABRE WULF </B>? En ese juego s&iacute; que me implicaba emocionalmente. Cuando lleg&aacute;bamos a un sitio donde aparec&iacute;a un lobo, me asustaba porque nunca sab&iacute;as cu&aacute;ndo iba a aparecer,  y tampoco se pod&iacute;a luchar contra &eacute;l, te ten&iacute;as que esconder. Fueron tantas las veces en que mi padre y mi hermano arriesgaron y se encontraron al lobo delante... vaya sustos me pegaban. Y luego hab&iacute;a el brujo. No s&eacute; c&oacute;mo, mi padre hab&iacute;a descubierto un camino que llevaba a  un brujo, una especie de cham&aacute;n. Y el camino no era precisamente f&aacute;cil, estos d&iacute;as he tardado horas en volver a encontrar el camino correcto. El brujo s&iacute; que me asustaba, no pod&iacute;a verlo, les suplicaba que no llegasen, pero lo hac&iacute;an y a medida que me fui haciendo grande tuve m&aacute;s ganas de ver bien el brujo. Cuando era peque&ntilde;o ten&iacute;a la idea de que era un brujo enorme, de que ocupaba toda la pantalla. Hace pocos d&iacute;as he podido comprobar que tiene el mismo tama&ntilde;o que el protagonista, vamos que es un enano. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los a&ntilde;os fueron pasando y nos compramos much&iacute;simos juegos de Amstrad. La mayor&iacute;a, en un momento u otro, dejaron de funcionar. Recuerdo en especial uno que regalaron a mi hermano que se llamaba <B>CHARLY DIAMS</B>. A mi ese juego me gustaba mucho, fue una pena porque se borr&oacute; a los pocos d&iacute;as. Los disquetes de Amstrad eran muy susceptibles, si los dejabas cerca del ordenador se borraban. Tambi&eacute;n recuerdo con mucho cari&ntilde;o <B>LA ABAD&Iacute;A DEL CRIMEN</B>, un juego basado en El Nombre de la Rosa, una novela de Umberto Eco. Ese tambi&eacute;n se borr&oacute; y quise volver a recuperarlo por todos los medios. Hoy en d&iacute;a no me explico qu&eacute; le encontraba a un juego tan simple y horrendo (horrendo en el sentido que deja por los suelos la excepcional historia de Umberto Eco). Pero sin duda el que m&aacute;s he echado de menos ha sido el<B> DUSTIN</B>. Ese juego s&iacute; que era m&iacute;tico, llegamos hasta a pas&aacute;rnoslo. Me acuerdo perfectamente del final, ten&iacute;as que ir con una especie de estatua y d&aacute;rsela a un t&iacute;o que no te dejaba pasar en la playa, despu&eacute;s ya pod&iacute;as coger la barca y el juego se acababa. Pero, claro, tambi&eacute;n se borr&oacute;. Fue quiz&aacute;s el juego que m&aacute;s me gust&oacute; de Amstrad. Actualmente lo tengo, pero ya no me acuerdo c&oacute;mo se jugaba. </P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Siempre recordar&eacute; esos juegos, no por lo que son, sino por lo que significaron en mi vida, en mi infancia. Y por mucho que mejoren los juegos actuales, ninguno ser&aacute; como los de antes. No puede haber juegos como los de antes, no porque hayan cambiado los juegos, sino porque nosotros no somos los que &eacute;ramos antes. Por eso es bueno que existan los emuladores, colaboran a que la gente como yo podamos cumplir nuestros sue&ntilde;os. En mi caso, gracias a un emulador he podido volver a sentirme el ni&ntilde;o que fui hace muchos a&ntilde;os, y eso es algo que no tiene precio.</P>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsa.htm"><font FACE="ARIAL"><B>[Aquellos maravillosos bits]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER></HTML>
