<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>U</B></font><FONT color="#000000" size=2 face="arial"><B>n Paseo por Nuestra Historia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Topo, la profesionalidad del soft nacional.
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">

<P ALIGN=JUSTIFY>Topo fue, sin lugar a dudas, la que m&aacute;s de cerca se trat&oacute; con la todopoderosa
Dinamic. La principal caracter&iacute;stica de esta compa&ntilde;&iacute;a resid&iacute;a en la capacidad
de arriesgar en cada nuevo t&iacute;tulo a &quot;todo o nada&quot;, mediante fuertes inversiones de dinero, esfuerzo 
e ilusi&oacute;n, como significaron
tres de sus proyectos m&aacute;s ambiciosos, el Viaje al Centro de la Tierra, Lorna, y Gremlins 2 (que supuso
un aut&eacute;ntico notici&oacute;n, al ser &eacute;sta la primera vez que una &quot;humilde&quot; compa&ntilde;&iacute;a
espa&ntilde;ola se hac&iacute;a con los derechos para producir una pel&iacute;cula de alguien
como Spilberg). 
<br><br>
Como en todas las grandes compa&ntilde;&iacute;as, en Topo, tambi&eacute;n existi&oacute; una gran figura
que se dedic&oacute; a llevar a lo m&aacute;s alto el list&oacute;n de calidad que supon&iacute;a cada
nuevo t&iacute;tulo de la misma, me estoy refierendo a Gabriel Nieto, que figurar&aacute; como
uno de los directores de compa&ntilde;&iacute;as de juegos espa&ntilde;olas m&aacute;s carism&aacute;tico. La verdad
es que, despu&eacute;s de haberme leido todas y cada una de los art&iacute;culos, entrevistas
y debates en los que participi&oacute;, me doy m&aacute;s cuenta de que, en la actualidad, si
existiese alguien, como Gabriel Nieto, el &quot;motor del software en nuestro pa&iacute;s&quot;, ser&iacute;a
algo con mucha m&aacute;s fuerza de lo que es ahora, es decir, si Topo y Gabriel Nieto, hubiesen 
podido, al igual que Dinamic, &quot;superar la transici&oacute;n a los 16 bits&quot; y estar ahora con todos nosotros, el 
panorama actual del software de entretenimiento en nuestro pa&iacute;s no lo concer&iacute;a nadie...
<br>
<br>
Despu&eacute;s de haberos intentado dejar claro lo que signific&oacute; Topo, os comentar&eacute; algo 
de su trayectora como compa&ntilde;&iacute;a. 
<br>
<br>
Para empezar, Topo se uni&oacute; con algo de retraso a la
industria del software de entretenimiento nacional, sin embargo, ocurrio algo que
no era usual, y es que Topo comenz&oacute; a sacar muchos y variados t&iacute;tulos, pero
en lugar de ser creaciones mediocres (y digo lo de mediocres por el n&uacute;mero de t&iacute;tulos),
estos eran grandes creaciones, de la talla de Spirits, Survivor, Cray 5 o
Colt 36. Estos t&iacute;tulos permitieron a nuestra, legendaria, compa&ntilde;&iacute;a poder
vender y preparar la segunda &quot;tanda&quot; de t&iacute;tulos como fueron Stardust,
Desperado (una aut&eacute;ntica maravilla), Silient Shadow, Emilio Butrague&ntilde;o F&uacute;tbol o
Mad Mix Game, entre otros. De esta l&iacute;sta de juegos, hay que hacer menci&oacute;n especial al
Emilio Butrague&ntilde;o ya que consigui&oacute; record de ventas en nuestro
pa&iacute;s, alcanzando, si mal no recuerdo, m&aacute;s de 100.000 copias de casset, que
por aquella &eacute;poca era una at&eacute;ntica locura. <br><br>

<CENTER><TABLE>
<td><center><img src="jpg/gabriel.jpg" border=1></center></td>
<tr>
<td><FONT color="#000000" size=1>
<center>
<b>Gabriel Nieto, director de Topo, entregando<br> el Cassete de
platino a Emilio Butrageño.<br> ¡100000 copias de un videojuego, enhorabuena Topo!</b>
</center></td>
</table></center>

<br><br>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">

Por otro lado, esta el m&iacute;tico
Mad Mix Game, ¿Qui&eacute;n no ha jugado alguna vez a dicho juego?. Esta maravilla
binaria, encandil&oacute; a miles de usuarios durante el 80, tanto es as&iacute; que 
en el pa&iacute;s del sol naciente fue utilizado para la promoci&oacute;n de la Pepsi. Sin 
embargo, detalles como &eacute;ste no son &uacute;nicos en la trayectoria de la compa&ntilde;&iacute;a
espa&ntilde;ola, otro t&iacute;tulo, el Whopper Chase, fue utilizado por Burger King, mediante
el regalo del mismo por la compra de un par de hamburguesas.
<br>
<br>
Creo que el poder&iacute;o de Topo esta bien claro, pero como en todas las grandes,
la cuerda a&uacute;n no se hab&iacute;a acabado y Topo nos tendr&iacute;a m&aacute;s sorpresas aguard&aacute;ndonos como
era el caso de t&iacute;tulos con nombres como Balck Beard, Coliseum, Wells n` Fargo,
el impresionante RAM, Rock`n Roller, Tour 91, Zona 0 o la Espada Sagrada,
este &uacute;ltimo cont&oacute; con una inmejorable versi&oacute;n para los 16 bits. 
<br>
<br>
<img src="jpg/topopa.jpg" align="left" border=1>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">

Despu&eacute;s del lanzamiento para 16 bits de La Espada Sagrada, Topo inicia la
caida. Primero fue una bajada del n&uacute;mero de empleados de la compa&ntilde;&iacute;a a lo
que siguio la no creaci&oacute;n de m&aacute;s juegos, los cuales se vieron reemplazados por
t&iacute;tulos que intentaban &quot;asaltar&quot; al mundo de los 16 bits y ahora mismo
me estoy acordando del Quick it, que ofrec&iacute;a un entorno gr&aacute;fico para la
gesti&oacute;n del equipo al sufrido usuario del PC. Todos estos t&iacute;tulos no fueron
m&aacute;s que peque&ntilde;os gritos de agon&iacute;a ya que muy poco despu&eacute;s una de las grandes
de la historia de nuestro pa&iacute;s dejar&iacute;a de existir, eso s&iacute;, Topo nos dej&oacute;
un recuerdo imborrable. ¡Gracias Topo!.


</FONT>

<br><br><br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsb.htm"><font FACE="ARIAL"><B>[Un paseo por nuestra historia]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

