<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:topeko@hotmail.com">Antonio Monreal "Topeko".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Jedy Knight.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Lucas Arts.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Electronic Arts.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Arcade 3D.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 85%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<P ALIGN="JUSTIFY">

<P align="justify">Hace mucho
tiempo, en una galaxia muy, muy lejana... (<DFN><FONT FACE="Arial"><FONT COLOR="#000080">&iquest;Qui&eacute;n
no se acuerda de esta frase al comienzo de cierta pel&iacute;cula?</DFN>).</FONT><FONT COLOR="#000000">
En efecto, se trata de un juego basado en la saga de la Guerra de las Galaxias,
en concreto se trata de la segunda parte del &eacute;xito Dark Forces.
Para esta continuaci&oacute;n, el programa ha a&ntilde;adido varias mejoras
que elevar&aacute;n el n&uacute;mero de horas de diversion que proporciona
este juego en dos CD, superando con creces a la primera parte. Para empezar,
una cosa que los usuarios de la primera parte hab&iacute;an demandado era
la posibilidad de usar el sable laser, que por cierto es la &uacute;nica
arma que a veces le puede dar un toque algo "gore" al jueguecito (<DFN></FONT><FONT COLOR="#000080">A
diferencia de Duke3d y Quake no podeis hacer trizas a los enemigos ni esparcir
su sangre por las paredes y el suelo, &iexcl;Pandilla de sadicos! :D</DFN>)</FONT><FONT COLOR="#000000">
, el seccionar el brazo a un enemigo (<DFN></FONT><FONT COLOR="#000080">&iquest;Os
acord&aacute;is en que pel&iacute;cula ocurre?</DFN>)</FONT><FONT COLOR="#000000">.
Se ha a&ntilde;adido la posibilidad de juego multijugador (<DFN></FONT><FONT COLOR="#000080">Por
red local, Internet , modem y serie</DFN>)</FONT><FONT COLOR="#000000">.
Adem&aacute;s, para los que teng&aacute;is dos ordenadores en casa, los
chicos de Lucasarts han tenido todo un detalle: dos personas pueden jugar
a la vez en modo multijugador con una sola copia (<DFN></FONT><FONT COLOR="#000080">Cada
jugador con uno de los dos CDs.</DFN>)</FONT><FONT COLOR="#000000">. Tambi&eacute;n
es posible el uso de la "Fuerza"(<DFN></FONT><FONT COLOR="#000080">Cachodeo
aparte, con su uso vais a poder saltar m&aacute;s lejos, moveros m&aacute;s
r&aacute;pido, y otro sinf&iacute;n de cosas que os permitir&aacute;n llegar
a lugares que sin su uso serian imposibles de alcanzar&nbsp;</DFN>)</FONT><FONT COLOR="#000000">,
y finalmente la posibilidad de usar aceleraci&oacute;n 3D por hardware
(<DFN></FONT><FONT COLOR="#000080">Mediante Direct3D</DFN>)</FONT><FONT COLOR="#000000">.</FONT></FONT></FONT>
<font face=arial>

<h4>Con tanto juego de perspectiva en primera persona, &iquest;merece la pena comprar este?</H4>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1><FONT COLOR="#000000">Bueno, en una gama
de juegos que se esta quedando saturada (<DFN></FONT><FONT COLOR="#000080">Quake2,
Unreal, Sin...</DFN>),</FONT><FONT COLOR="#000000"> quiz&aacute;s se haya
quedado un "pel&iacute;n anticuado" (<DFN></FONT><FONT COLOR="#000080">No
tiene editor de niveles (o al menos todav&iacute;a no lo he encontrado),
no se le pueden hacer esas modificaciones que se puede hacer en el Quake</DFN>),</FONT><FONT COLOR="#000000">
pero tampoco te pide un equipo de &uacute;ltima generaci&oacute;n para
un juego &oacute;ptimo, y de momento (<DFN></FONT><FONT COLOR="#000080">A
falta de que saquen la version D3D de Unreal</DFN>)</FONT><FONT COLOR="#000000">
es el &uacute;nico programa de este tipo que conozco que usa Direct3D en
vez de OpenGL, con lo que deber&iacute;a funcionar con la mayor&iacute;a
de aceleradoras existentes (<DFN></FONT><FONT COLOR="#000080">Si los poseedores
de una Virge podr&aacute;n disfrutar de este juego con filtrado bilineal
a una velocidad aceptable</DFN>).</FONT><FONT COLOR="#000000"> Y la calidad
gr&aacute;fica esta bastante por encima de la de Quake/GLQuake, pudiendo
disfrutar de efectos como la transparencia del agua (<DFN></FONT><FONT COLOR="#000080">Nunca
entender&eacute; la obsesi&oacute;n que tiene la gente por este efecto.
La unica "ventaja" est&aacute; a la hora de echar partidas multijugador.</DFN>)</FONT><FONT COLOR="#000000">
sin necesidad de tarjeta aceleradora.</FONT></FONT></FONT>
<CENTER><TABLE ALIGN=LEFT >
<TR>
<TD><IMG SRC="jpg/jk1.jpg" ></TD>
</TR>

<TR>
<TD><B><FONT COLOR="#000000"><FONT SIZE=-2>&iquest;No quer&iacute;ais agua
transparente?</FONT></FONT></B>&nbsp;
<BR><B><FONT COLOR="#000000"><FONT SIZE=-2>&iexcl;Hala, que aproveche!.</FONT></FONT></B></TD>
</TR>
</TABLE></CENTER>
<FONT SIZE=-1><FONT COLOR="#000000"><FONT FACE="arial"><p align="justify">Otra cualidad de
este producto es el incre&iacute;ble tama&ntilde;o de sus mapas. Uno solo
de ellos puede ser tan largo o m&aacute;s como 5 mapas de Quake. Te puede
llevar mucho tiempo acabar uno solo de estos mapas, y eso si vas ignorando
enemigos, zonas ocultas, etc. El juego dispone de un total de 21 fases,
aparte de los mapas dedicados al modo multijugador, esta es una de las
dos cosas que no me gustan del programa, el no poder usar los niveles del
juego monousuario para jugar varios aunque solo fuera en modo cooperativo.
La otra cosa que no me gusta es que entre cada fase hay una escena de video
con actores reales mezclado con fondos generados por ordenador cuyo resultado
final no me gusta; o mejoran los fondos, o emplean tambien el ordenador
para generar los actores. En el modo multijugador se puede jugar de dos
formas distintas: </FONT><FONT FACE="Arial"><U>Entrenamiento Jedi</U>,
consiste en machacar a los demas jugadores (<DFN></FONT></FONT><FONT FACE="Arial"><FONT COLOR="#000080">En
otras palabras "deathmatch"</DFN>)</FONT><FONT COLOR="#000000">; <U>Capturar
la bandera</U>, dos equipos intentan coger las banderas del equipo enemigo,
llev&aacute;ndolas a donde tienen la propia e intentan evitar que hagan
lo mismo con la suya (<DFN></FONT><FONT COLOR="#000080">Os recomiendo &eacute;sta
cuando seais mas de 3-4 jugadores en una partida, porque aparte de dedicarte
a machacar a los dem&aacute;s jugadores, tendr&aacute;s que pensar y coordinarte
con al menos otro jugador.</DFN>)</FONT><FONT COLOR="#000000">; Casi se
me olvida, el juego tiene algunos detalles realmente originales, como la
posibilidad de jugar con una vista en tercera persona a lo "Tomb Raider",
eso s&iacute;, sin poder hacer las piruetas, ni las rotaciones de camara
que se hacen en este ultimo. Tambi&eacute;n podremos repeler los disparos
que nos hagan los enemigos con el sable (<DFN></FONT><FONT COLOR="#000080">Que
conste que mas que eso parece que estemos jugando un partido de "baseball"</DFN>)</FONT><FONT COLOR="#000000">,
o que te encuentres transeuntes que si en principio no tienen nada que
ver con el desarrollo del juego, el hecho de que los ataques o defiendas
influir&aacute;n en el final de la partida.</FONT></FONT></FONT>
<CENTER>&nbsp;</CENTER>

<CENTER><TABLE>
<TR>
<TD>
<CENTER><IMG SRC="jpg/jk2.jpg" BORDER=0 ><br><br><br><IMG SRC="jpg/jk3.jpg" BORDER=0 ></CENTER>
</TD>
</TR>

<TR>
<TD>
<CENTER><B><FONT COLOR="#000000"><FONT SIZE=-2>Si posees una tarjeta grafica
que pueda hacer filtrado bilineal notaras la diferencia.&nbsp;</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE></CENTER>

<font face=arial>

<H4>
Apartado T&eacute;cnico</H4>
<p align="justify">

<CENTER><TABLE ALIGN=RIGHT >
<TR>
<TD><IMG SRC="jpg/jk4.jpg" ><br><br><IMG SRC="jpg/jk5.jpg" ></TD>
</TR>
<TR>
<TD>
<DIV ALIGN=right><B><FONT COLOR="#000000"><FONT SIZE=-2>El programa dispone
de dos puntos de vista distintos para jugar, uno</FONT></FONT></B></DIV>

<DIV ALIGN=right><B><FONT COLOR="#000000"><FONT SIZE=-2>interior como Quake,
Duke3D, etc, y una exterior a lo Tomb raider</FONT></FONT></B></DIV>
</TD>
</TR>
</TABLE></CENTER>


<p align="justify">
<FONT SIZE=-1><FONT FACE="arial"><FONT COLOR="#000000">Este juego requiere
como minimo un P90, y no intentar&iacute;a subir la resoluci&oacute;n sin
aceleradora por debajo de un P133 (<DFN></FONT></FONT><FONT FACE="Arial"><FONT COLOR="#000080">Por
software siempre con color de 8 bit.</DFN>).</FONT><FONT COLOR="#000000">
Sin embargo, con aceleradora es otra historia; con un P120 y una Virge
se puede jugar perfectamente a 320x400 o a 512x384 con la pantalla ligeramente
reducida con filtrado bilineal, etc, pero s&oacute;lo para jugar un solo
jugador. Para multijugador ya ser&iacute;a necesario una tarjeta mas potente
como una Voodoo, Riva128 o PowerVR. Para los que tengan una tarjeta de
ultima generaci&oacute;n con suficiente memoria, se puede conseguir la
friolera de 1600x1200 puntos (<DFN></FONT><FONT COLOR="#000080">Siempre
con color de 16 bits</DFN>)</FONT><FONT COLOR="#000000">, aunque a no ser
que tengas un monitor de 17 o 19 pulgadas no notaras la diferencia a usarlo
con resoluciones m&aacute;s comunes, como 640x480 o 800x600. Aparte de
esto, la banda sonora se encuentra en el CD, en formato de pistas de audio
sacadas de las peliculas. Dentro de la configuraci&oacute;n del sonido,
aparte de poder controlar el volumen de los efectos sonoros y los de la
m&uacute;sica, podemos configurar el n&uacute;mero de canales de audio
a usar, hasta un total de 24. Para jugar en red por modem se necesita una
conexi&oacute;n de un minimo de 14.4Kbps, en el caso de una partida modem-modem
para 2 jugadores, y 28.8 kbps si se trata de una partida por internet,
pudiendo jugar hasta un maximo de 4 jugadores. Por red local se pueden
jugar un m&aacute;ximo de 8 jugadores.</FONT></FONT></FONT>

<H4>
Resumen</H4><p align="justify">
<FONT FACE="Arial"><FONT SIZE=-1><FONT COLOR="#000000">Para hacer el resumen
me gustar&iacute;a recordar que a finales de 1997, en muchas revistas inform&aacute;ticas
se hac&iacute;an consultas de que si tal o cual aceleradora 3D podr&iacute;a
usarse para jugar a GLQuake (<DFN></FONT><FONT COLOR="#000080">Sobre todo
usuarios de Virge.</DFN></FONT><FONT COLOR="#000000">), y casi siempre
recib&iacute;an la misma respuesta, no. Bueno, pues la mayor&iacute;a de
esos usuarios est&aacute;n de enhorabuena, porque con este t&iacute;tulo
van a poder disfrutar de todos esos efectos que no pudieron con Quake,
a m&aacute;s resolucion y m&aacute;s rapido. La &uacute;nica pega es que
a diferencia de Quake no podr&aacute;n hacer esas modificaciones, como
pueden ser los bots, los grappling hook, etc. Adem&aacute;s, recientemente
ha salido una ampliaci&oacute;n de este juego titulado "Mysteries of the
Sith", que a&ntilde;ade mas misiones, y la posibilidad de jugar con otro
personaje. Si bien gr&aacute;ficamente no esta al nivel de Quake 2, supera
a su antecesor, sin requerir un equipo muy potente. Este juego se lo recomendar&iacute;a
a gente que tiene un P100 o mejor, y que se compr&oacute; una tarjeta aceleradora
de primera generacion (<DFN></FONT><FONT COLOR="#000080">Mystique, Rendition,
Virge.</DFN></FONT><FONT COLOR="#000000">), y que le gustaria jugar a un
juego de este tipo, sin tener que gastarse m&aacute;s dinero en hardware.</FONT></FONT></FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadeb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

