<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:srd@ctv.es">Samuel Rísquez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Final Fantasy VII.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Square Soft.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> EIDOS.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Rol.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 85%.</b></font>
<HR>
<BR>
<BR>

<FONT color="#000000" face=arial size=2>
<table align="left">
<td><img src="jpg/a_rpg1a.jpg"></td>
<tr>
<td><font size=1><center><b>Las primeras imagenes <br>controlables del juego.</b></center></td>
</table><P ALIGN="JUSTIFY">
Antes de todo quer&iacute;a hacer un peque&ntilde;o resumen de la historia de la saga de cuyo s&eacute;ptimo capitulo ten&eacute;is la opini&oacute;n de un servidor enfrente vuestro:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La saga Final Fantasy naci&oacute; hace ya muchos a&ntilde;os en las oficinas de trabajo de Square. La idea era crear un juego de rol de batallas con personajes tipo cabezones para las maquinas de Nintendo; primero Game Boy y NES y luego Super Nes. Ahora no os voy a contar mucho sobre esos juegos, pero eran fant&aacute;sticos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despues de FF VI, salido en SNES, SquareSoft tenia unas ideas muy ambiciosas que no pod&iacute;an desarrollar en esta misma maquina, y esperaron a que Nintendo Enterprises, la &uacute;nica empresa para la que trabajaban no solo con esta saga sino con muchos mas juegos, sacara a la venta su nueva generaci&oacute;n de hardware. Pero cuando &eacute;sta anunci&oacute; que el formato de juego iba a ser en cartucho, Square le dijo "ah&iacute; te quedas", y Nintendo ah&iacute; se qued&oacute;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por aquella &eacute;poca, Sony estaba buscando, digamos, "nuevos talentos" para Playstation, utilizando contratos de esos que no permiten que seg&uacute;n que personajes o sagas salgan en mas maquinas que en la suya. Entonces llego un peque&ntilde;o paquetito a SquareSoft con una PSX dentro, la analizaron y, ¡eureka! ¡Ya tenemos consola!</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y as&iacute; hicieron maravillas con su nueva idea, de nombre Final Fantasy 7, mostrando cantidad de gr&aacute;ficos y animaciones que... ¡leed el articulo, corcho!</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Una maravilla gr&aacute;fica</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Eso es lo &uacute;nico que tiene sentido decir de este juegazo despu&eacute;s de ver la corta introducci&oacute;n, que en realidad solo es para situar donde est&aacute;n nuestros personajes. Esos acercamientos y alejamientos a toda velocidad de la gran ciudad de Midgar, uni&oacute;n de diez grandes ciudades cuyo nombre nadie recuerda, son dignos de ver. Despu&eacute;s se acerca una &uacute;ltima vez a la estaci&oacute;n de trenes del Sector 1. La ciudad tiene diez sectores, que suprimen al nombre de cada una de sus componentes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces llega un tren del que bajan cinco polizones. Los dos primeros dejan K.O. a los guardias, y el resto va bajando de uno en uno. El &uacute;ltimo en llegar es un tal ex-soldado, rubio y con pelos punky, a lo Dragon Ball Z (que japonesitos son estos japoneses). Entonces debes seguir a los dem&aacute;s corriendo (yo no he encontrado en las instrucciones como se hace, pero si tu tampoco ya te lo digo yo; [cancelar] + direcci&oacute;n) hasta llegar a una puerta que uno de ellos est&aacute; intentando abrir. Entonces os present&aacute;is y debes darte un nombre. M&aacute;s que nada, porque ex-soldado no es uno muy bonito. El juego te da por defecto y afecto Cloud, pero lo puedes cambiar si quieres.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y una vez que todos os conoc&eacute;is, Barret (que tambi&eacute;n puedes cambiar), el jefe del grupo terrorista que mont&aacute;is, Avalancha, os explica la misi&oacute;n; deb&eacute;is ir a la central de energ&iacute;a Mako de este sector y destruirlo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y as&iacute; empieza Final Fantasy VII. Durante los primeros minutos de juego se os va mostrando una envolvente historia que para los vagos que no pueden acercarse a la tienda y comprarlo os voy a explicar;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La ciudad de Midgar y el planeta en general est&aacute; controlada por el presidente de Shinra S.L., que tiene medio-comprado al alcalde y poseen la fuente de energia del planeta, las plantas de Mako, que ya descubrir&eacute;is de que est&aacute; hecho m&aacute;s adelante, pero en un principio simplemente se os dice que es "La energia de la Tierra", y que as&iacute; acabaremos con el planeta. De modo que Avalancha, va destruyendo reactores para que Shinra rectifique y los apague todos. Despues se ir&aacute;n sumando sub-historias, sobretodo en torno a los personajes que controlareis (9 contando los secretos), pero casi todas giraran alrededor de la energia Mako. ¡Si hasta tendremos un tri&aacute;ngulo amoroso y todo!</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">El juego una vez funcionando</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><table align="right">
<td><img src="jpg/a_rpg1b.jpg"></td>
<tr>
<td><font size=1><center><b>Las peleas tipicas del juego.</b></center></td>
</table>
Hay que destacar que las luchas y escenas cinematogr&aacute;ficas favorecen mucho al aspecto del juego y hacen que inocentes jugadores, sobretodo los de cierto sistema que no voy a decir aunque todos sabemos cual es, vayan detras del producto cual perrito detras de su amo. Y una gran parte queda muy satisfecho, pero una minor&iacute;a bastante alta ha quedado muy decepcionada con el juego. Sus dos puntos m&aacute;s fuertes le quitan una jugabilidad al juego que no os pod&eacute;is ni imaginar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando vas caminando de un lugar al otro, es incre&iacute;ble el n&uacute;mero de peleas que te encuentras por ah&iacute;, la mayor&iacute;a en absoluto justificadas. Son muy divertidas, sobretodo las de los jefes enormes que no se mueren nunca en las que debes descubrir sus puntos flojos, pero es inmensamente pesado hacer 6 luchas exactamente iguales para ir de un pueblo a otro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y luego est&aacute;n las escenas pre-grabadas, que hay en abundancia, y que cortan mucho el ritmo de la acci&oacute;n, sobretodo porque en la mayor&iacute;a has de estar d&aacute;ndole al dichoso intro cada vez que alguien dice una frase.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Eso hace que el juego est&eacute; sobretodo recomendado para jugadores de consolas, ya que el mando lo simplifica todo. Adem&aacute;s, el tener que esperar bastante rato entre cada vez que se ha de grabar la partida, dificulta el uso del resto de aplicaciones del PC, ya que no lo usamos solo para jugar. Mientras una consola te la puedes dejar encendida (ya que si dejas el juego no es por aburrimiento sino por tiempo), un ordenador no se usa solo para jugar, sino para conectar a internet, trabajar, maldecir a Bill Gates... Tambi&eacute;n se echa en falta la posibilidad de pausar el juego en medio de una lucha.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Por lo dem&aacute;s</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">FF7 es un juego muy entretenido, que incluye un aliciente especial; la posibilidad de jugar a 7 sub-juegos IMPRESCINDIBLES para acabar el juego, que no tienen nada que ver con RPG pero que levante la mano quien niegue que es de lo mejorcito a lo que ha jugado. Sobretodo un simulador de motociclismo que poco tiene que envidiar a los juegos exclusivos de este sistema de juego</P>
<center><table>
<td><img src="jpg/a_rpg1c.jpg"></td>
<tr>
<td><font size=1><center><b>El juego está traducido<br> al castellano, aunque<br> en elgunos momentos<br> metieron la pata....</b></center></td>
</table></center>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, estos 3 CDs sin contar el de instalaci&oacute;n forman parte de un juego que es muy atrayente y que no te permite aburrirte. Las peleas son muy divertidas, la calidad gr&aacute;fica y la velocidad con una tarjeta 3D es asombrosa, el gui&oacute;n es algo tan extremadamente fant&aacute;stico que no puedo describir, y es el mejor RPG de personajes no-cabezones que he probado, aunque para PC es el &uacute;nico al que he jugado, as&iacute; que no tom&eacute;is como base para comprar el juego esta afirmaci&oacute;n.</P></FONT></BODY>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

