<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> F1 Racing Simulation.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Ubi Soft.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Ubi Soft.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Simulador de coches.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 80%.</b></font>
<HR>

<BR>
 
<P align="justify"><img src="jpg/f1rs00.jpg" align="left">
El mundo de los simuladores automovil&iacute;sticos, sobre todo en lo que a las competiciones de monoplazas se refiere, est&aacute; copado principalmente por dos grandes especialistas en este campo: Microprose y Papyrus. Todos los aficionados a este tipo de juegos recordar&aacute;n, o incluso seguir&aacute;n jugando, la maravilla que fue, en su tiempo, el F1 Grand Prix creado por Geoff Crammond para Microprose o el posterior IndyCar Racing de Papyrus. Ambos juegos tuvieron una segunda parte que los superaba ampliamente en cuanto a calidad gr&aacute;fica, realismo, etc. El m&aacute;s esperado por los jugadores de todo el mundo fue, sin duda, el F1 Grand Prix 2 que marc&oacute; una barrera de calidad y realismo dif&iacute;cil de superar por la competencia.</P>
<P ALIGN="JUSTIFY">Con estos antecedentes, cualquier simulador de hoy en d&iacute;a tiene que cuidar hasta el m&aacute;s m&iacute;nimo detalle si quiere superar estos mitos. En Ubi Soft lo sab&iacute;an y se han esforzado al m&aacute;ximo para tratar de conseguir un juego sobresaliente en todas sus facetas. La pregunta es: ¿lo han conseguido? La respuesta es —y esta es una opini&oacute;n muy personal— s&iacute; pero con algunos matices. Lo cierto es que este juego destila calidad por donde quiera que se le mire. Nada m&aacute;s ejecutarlo podemos apreciar la calidad y el gusto con que ha sido realizado, sin embargo, hay algunos peque&ntilde;os detalles que se podr&iacute;an haber mejorado y que, sin llegar a empa&ntilde;ar el conjunto, si impiden que el juego sea uno de esos cl&aacute;sicos que uno nunca olvida.</P>
<P ALIGN="JUSTIFY">Pasando ya a describir el juego en s&iacute;, hay que destacar en primer lugar y por encima de todo que estamos ante un verdadero simulador, con todas las ventajas e inconvenientes que eso conlleva. Las ventajas son, principalmente, que el realismo y la sensaci&oacute;n de conducci&oacute;n priman por encima de todo lo dem&aacute;s. El inconveniente principal es que un juego de estas caracter&iacute;sticas es muy dif&iacute;cil de dominar y, como veremos m&aacute;s adelante, en este caso esto es incluso m&aacute;s cierto que en otros. No es por nada que llegar a ser piloto de f&oacute;rmula 1 no est&aacute; al alcance de cualquiera y a&uacute;n los pilotos con experiencia suelen cometer errores que, en las condiciones extremas a que se ven sometidos en estos monoplazas, suelen resultar fatales para el resultado de la carrera.</P>
<P ALIGN="JUSTIFY">

<table align="right">
<td><img src="jpg/f1rs01.jpg"></td>
<tr>
<td><center><font size=1><b>Un pequeño despiste y veremos la carrera<br> como espectadores</b></center></td>
</table>

Como en todo buen simulador, nosotros tenemos que desempe&ntilde;ar no s&oacute;lo el papel de pilotos sino tambi&eacute;n el de ingenieros. La cantidad de par&aacute;metros que son susceptibles de modificaci&oacute;n en uno de estos veh&iacute;culos es tan grande y est&aacute;n ligados de forma tan &iacute;ntima unos a otros que la tarea de ponerlo a punto para un circuito en particular y unas condiciones de carrera determinadas es, por s&iacute; misma, suficientemente compleja para desquiciar a cualquiera. Este juego reproduce esto de manera magistral, ofreci&eacute;ndonos una de las opciones de garaje de las m&aacute;s completas vistas hasta la fecha. Por poner algunos ejemplos (aparte de los m&aacute;s comunes como la elecci&oacute;n de neum&aacute;ticos, la estrategia de carrera, las relaciones de cambio, la fuerza aerodin&aacute;mica de los alerones o el reparto de frenada) es posible configurar el recorrido de los amortiguadores, los topes de goma de los mismos, los muelles de la suspensi&oacute;n, el &aacute;ngulo de ca&iacute;da de las ruedas, la altura de la carrocer&iacute;a, el tope de revoluciones del motor (que incide en su fiabilidad) y algunas otras cosas m&aacute;s. Por suerte el manual de usuario cuenta con una peque&ntilde;a gu&iacute;a de puesta a punto del coche que nos ayudar&aacute; en esta dif&iacute;cil tarea, aunque est&aacute; bastante mal traducida al espa&ntilde;ol, todo hay que decirlo.</P>
<P ALIGN="JUSTIFY">Las opciones de conducci&oacute;n son tambi&eacute;n muy completas permitiendo, adem&aacute;s de las t&iacute;picas de carrera individual, campeonato y entrenamiento, otras menos habituales como el aprendizaje con un coche maestro (que va delante de nosotros, ense&ntilde;&aacute;ndonos las trazadas, velocidad de paso por curva, etc.), el campeonato personalizado (que permite elegir las carreras a disputar) o el entrenamiento contra el reloj con coche fantasma (que marca el mejor tiempo hasta el momento). Tambi&eacute;n contempla, como no pod&iacute;a ser menos, el juego por red con opciones de pantalla partida, m&oacute;dem nulo y red IPX. Aqu&iacute; es donde encontramos la primera omisi&oacute;n importante de este juego y es que no ofrece la alternativa, hoy casi un est&aacute;ndar, de juego por Internet mediante protocolo TCP/IP.</P>
<P ALIGN="JUSTIFY">Una vez que nos subimos en el monoplaza, encontramos que el realismo es m&aacute;ximo en todos los aspectos. La sensaci&oacute;n de velocidad est&aacute; muy conseguida, adem&aacute;s de todos los peque&ntilde;os detalles que se nos puedan ocurrir, los cuales est&aacute;n perfectamente reflejados: las distintas banderas en carrera (amarilla, roja, negra), penalizaciones por saltarse la salida, el trazado o la limitaci&oacute;n de velocidad en boxes, la radio mediante la cual nuestro equipo nos informa desde boxes de los acontecimientos de la carrera, el ruido de los motores de los otros veh&iacute;culos…</P>
<P ALIGN="JUSTIFY">

<table align="left">
<td><img src="jpg/f1rs02.jpg"></td>
<tr>
<td><center><font size=1><b>Oiremos claramente el motor del <br>coche que nos adelanta</b></center></td>
</table>
<P align="justify">
Adem&aacute;s podremos tener una gran variedad de aver&iacute;as mec&aacute;nicas, que pueden ser graves (nos veremos obligados a abandonar) como p&eacute;rdida de agua o aceite, explosi&oacute;n del motor, etc. y leves (que nos permitir&aacute;n seguir mermados en alg&uacute;n aspecto) como fallo de la radio, sobrecalentamiento de frenos y otros muchos. El clima tambi&eacute;n es variable y si ya es dif&iacute;cil conducir en seco, os aseguro que con la pista mojada la dificultad es de aut&eacute;ntica locura. Y aqu&iacute; es donde lo que para algunos ser&aacute; una ventaja, para otros puede llegar a ser un inconveniente, ya que la dificultad del juego es, a mi juicio, excesiva. Incluso para los que se consideran unos expertos en el Grand Prix de Microprose, tanto de la primera parte como de la segunda (y entre los que yo me incluyo debido a las largas horas dedicadas a ambos) ser&aacute; dif&iacute;cil completar una vuelta completa sin percances (marcando un tiempo razonable) la primera vez que se uno se enfrenta al F1 Racing Simulation.</P>
<P ALIGN="JUSTIFY">Los circuitos tampoco se parecen todo lo que ser&iacute;a de esperar a los reproducidos en el juego de Microprose lo que hace que un circuito sobradamente conocido nos reserve algunas sorpresas en cuanto a velocidades de paso por curva, puntos de frenada, etc. Algunas de estas diferencias se deben a modificaciones sufridas por los trazados reales, aunque no estoy seguro de que todas sean achacables a esto &uacute;ltimo. En concreto, el circuito brasile&ntilde;o de Interlagos presenta diferencias notorias en zonas como las Subida de Arquibancadas, previa a la l&iacute;nea de meta o la curva al final de la Reta Oposta, llamada Descida do Lago (bajada del lago) y que ahora es totalmente llana. Otro ejemplo, que los aficionados recordar&aacute;n con tristeza, es la nueva chicane que sustituy&oacute; a la famosa curva de Tamburello en el Aut&oacute;dromo de Enzo &amp; Dino Ferrari de Imola en San Marino, a ra&iacute;z de la tr&aacute;gica muerte de Ayrton Senna.</P>
<P ALIGN="JUSTIFY">A pesar de contar con 3 niveles de dificultad y muchas ayudas a la conducci&oacute;n (ABS, dispositivo antiderrapaje, etc.) sigue siendo complicado mantenerse en la pista y evitar los continuos trompos. Algo que puede tener que ver con esto es el empleo del teclado como dispositivo de control. Usando un volante y unos pedales es posible que la cosa mejore un poco. Mi opini&oacute;n personal es que el simulador est&aacute; pensado para disfrutarlo mediante dispositivos de control anal&oacute;gicos y tanto es as&iacute; que pr&aacute;cticamente no merece la pena jugar con &eacute;l si s&oacute;lo disponemos del teclado. Indudablemente, se echan de menos las sensacionales ayudas que tiene el Grand Prix para los jugadores con teclado que hacen que acelerar, frenar y tomar las curvas no sea una odisea de peque&ntilde;os golpecitos de tecla.</P>

<center><table>
<td><img src="jpg/f1rs03.jpg"></td>
<tr>
<td><center><font size=1><b>Vista de cabina con el sol de cara <br>dificultando la conducción</b></center></td>
</table></center>


<P ALIGN="JUSTIFY">Los gr&aacute;ficos son, por otra parte, fant&aacute;sticos. Lo mejor que se ha visto hasta ahora en un simulador de este tipo. Todo ello, claro, teniendo una tarjeta aceleradora 3D (preferiblemente una 3Dfx), ya que de otro modo el juego ni siquiera funciona. El detalle gr&aacute;fico es de tal magnitud que tambi&eacute;n es posible salirse de la pista al quedarnos mirando el paisaje a nuestro alrededor. El sonido complementa a los gr&aacute;ficos a la perfecci&oacute;n, con unos sonidos digitalizados de gran calidad, tanto los motores, frenazos, accidentes, como los mensajes de radio (traducidos al castellano), etc.</P>
<P ALIGN="JUSTIFY">A&uacute;n quedan muchos otros detalles en el tintero. Existen tres vistas de c&aacute;mara para el piloto, aunque la vista de cabina es la &uacute;nica realmente &uacute;til, ya que las exteriores no permiten ver el tablero de instrumentos. Para el realizador el n&uacute;mero de c&aacute;maras es casi inacabable, desde vistas generales a otras m&aacute;s espectaculares colocadas en los monoplazas. Tambi&eacute;n contamos con la posibilidad de ver y salvar las repeticiones de las carreras, aunque aqu&iacute; la lentitud de los controles se acent&uacute;a hasta el punto de que el puntero del rat&oacute;n va a saltos en ocasiones. En el apartado t&eacute;cnico, resulta muy &uacute;til la opci&oacute;n de telemetr&iacute;a, que registra todos los par&aacute;metros de comportamiento del coche en la pista, informaci&oacute;n vital para conseguir unos ajustes id&oacute;neos y los mejores tiempos. Hay que mencionar tambi&eacute;n que el juego cuenta con la licencia de la FIA para la temporada de 1996, por lo que los equipos, los patrocinadores y los pilotos son los de dicha temporada, con excepci&oacute;n de Jacques Villeneuve que, por razones de su contrato de imagen en exclusiva no permite que su nombre se mencione, siendo sustituido por el &quot;Driver X&quot;. Esta licencia se deja sentir tambi&eacute;n en la presencia general del juego, por ejemplo en los r&oacute;tulos en carrera (diferencias entre pilotos, posiciones al paso por l&iacute;nea de meta, logotipo del cronometraje oficial, etc.) as&iacute; como al final de la misma (posiciones finales y tiempos de cada piloto, …), todo id&eacute;ntico a como podemos verlo en una retransmisi&oacute;n televisada.</P>

<center><table>
<td><img src="jpg/f1rs04.jpg"></td>
<tr>
<td><center><font size=1><b>Los menús tienen un diseño muy cuidado</b></center></td>
</table></center>
<P ALIGN="JUSTIFY">
Finalmente los men&uacute;s tienen un dise&ntilde;o muy cuidado, aunque la navegaci&oacute;n por los mismos resulta algo lenta incluso en un equipo potente y con la instalaci&oacute;n grande (casi 200 MB de espacio en disco). Esto unido a los otros detalles mencionados (la falta de juego por TCP/IP, la extrema dificultad y la falta de control sobre el coche con el teclado) hace que baje un poco la nota final, aunque no deja de ser un juego excelente para los amantes de este deporte.</P></FONT></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



