<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Wing Commander: Prophecy.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Origin.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Electronic Arts.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Simulador Espacial.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 85%.</b></font>
<HR>

<BR>
 
<P align="justify"><img src="jpg/wcp00.jpg" align="left">
<P ALIGN="JUSTIFY">¿Qu&eacute; os voy a decir de la serie Wing Commander que no haya dicho alguien ya? Una de las sagas de simulaci&oacute;n de combate espacial que m&aacute;s &eacute;xito han tenido entre los aficionados y un verdadero t&iacute;tulo de culto. Si quer&eacute;is recordar los viejos tiempos con un comentario sobre el t&iacute;tulo que dio vida a la serie pinchad <a href="colec5.htm">aqu&iacute;</a>.</P>
<B><P ALIGN="JUSTIFY">La Historia</P>
</B><P ALIGN="JUSTIFY">En &quot;Wing Commander: La Profec&iacute;a&quot; encarnaremos al Teniente Segundo Lance Casey, reci&eacute;n salido de la academia de pilotos de la Confederaci&oacute;n, que se incorpora a la dotaci&oacute;n del nuevo y gigantesco portanaves TCS Midway, junto con su compa&ntilde;ero Maxwell &quot;Maestro&quot; Garrett. Tras varios a&ntilde;os de paz con los Kilrathi parece que nuestra estancia ser&aacute; tranquila pero todo se complica de repente cuando una fuerza de origen desconocido aniquila por completo una flota Kilrathi. Las &quot;bolas de pelo&quot; empiezan a realizar conjeturas acerca del cumplimiento de una vieja profec&iacute;a…</P>
<I><P ALIGN="JUSTIFY">Durante el reinado de los Antiguos, Sivar mismo se apareci&oacute; en una visi&oacute;n a la Primera Profetisa de Kilrah. Sus palabras est&aacute;n recogidas en el Tomo de Sivar: «Llegar&aacute; un tiempo en que alguien con el coraz&oacute;n de un Kilrathi, pero no nacido Kirathi, arroje sobre nosotros el fuego purificador. Y Kn’Thrak, una era de profundas tinieblas, nos abrazar&aacute;. La Muerte misma se esparcir&aacute; oscureciendo las estrellas con un velo de negrura. Suya es la garra que arranca la carne del hueso. Suyo es el colmillo venenoso. Vendr&aacute;n en tal n&uacute;mero que volver&aacute;n est&eacute;ril el Universo y expulsar&aacute;n el aliento de nuestros clanes. Seremos ba&ntilde;ados en nuestra propia sangre y recibiremos carne podrida en nuestro pago. Con un trueno ensordecedor comenzar&aacute; la era oscura».</P>
</I><P ALIGN="JUSTIFY">En este estado de cosas, lo que presum&iacute;amos como unas &quot;vacaciones&quot; en el Midway se convierte en un estado de alerta total y deberemos afrontar nuestra primera misi&oacute;n con fuego real formando parte del escuadr&oacute;n de los &quot;Diamondbacks&quot;, comandado por la Teniente Primero Jean &quot;Stiletto&quot; Talvert, una chica algo dura de car&aacute;cter pero de buen coraz&oacute;n y una excelente piloto. Poco a poco iremos conociendo al resto de personal del Midway, incluyendo al Comandante Christopher Blair, viejo conocido de la serie y cuyo papel sigue representando el actor Mark Hamil, el l&iacute;der (o eso cree &eacute;l) de los pilotos Mayor Todd &quot;Man&iacute;aco&quot; Marshall o la rubia Jefe Rachel Coriolis que siempre nos saluda afectuosamente cuando regresamos con &eacute;xito de una misi&oacute;n y nos mira con unos ojillos que… bueno, es normal, somos guapos, nuestro padre fue un h&eacute;roe de guerra y el uniforme nos sienta bastante bien as&iacute; que las chicas no pueden evitar sentirse atra&iacute;das. Otra chica interesante que nos encontraremos entre la dotaci&oacute;n del Midway es la Teniente Coronel Aurora Finley, del departamento de Investigaci&oacute;n Cient&iacute;fica. ¿Quien ha dicho que una chica no puede ser a la vez guapa e inteligente? Esta lo es sin ning&uacute;n g&eacute;nero de dudas.</P>
<P ALIGN="JUSTIFY">A medida que transcurren las misiones, la trama de los acontecimientos se va desvelando. Todo parece indicar que los gatos est&aacute;n en lo cierto y que la profec&iacute;a que anuncia la destrucci&oacute;n del Universo est&aacute; a punto de cumplirse, siendo el brazo ejecutor una extra&ntilde;a raza alien&iacute;gena contra la que tendremos que luchar, incluso colaborando con nuestros antiguos enemigos, los Kilrathi. El argumento es realmente absorbente y personalmente sigo pegado a la pantalla de mi ordenador tratando de superar la siguiente fase para descubrir un peque&ntilde;o fragmento adicional del misterio. Ah&iacute; no acaba la cosa, ya que las emociones y sentimientos tambi&eacute;n juegan un papel importante en este juego y nos encontraremos con momentos en los que tendremos que decidir entre nuestro deber y lo que nuestro coraz&oacute;n nos dicta y la vida de nuestros compa&ntilde;eros estar&aacute; muchas veces en nuestras manos. En mi opini&oacute;n, en este episodio, las escenas &quot;cinematogr&aacute;ficas&quot; est&aacute;n muy bien integradas en la historia y nos hacen meternos en la piel de Lance Casey con gran rapidez, disfrutando de sus alegr&iacute;as y sufriendo sus mismas penas, como por ejemplo cuando se siente responsable por la captura de Comandante Blair por los alien&iacute;genas o cuando alg&uacute;n piloto amigo no regresa de una misi&oacute;n. Eso s&iacute;, las escenas de introducci&oacute;n y final de las misiones acaban haci&eacute;ndose un poco repetitivas, en ocasiones, pero siempre nos las podemos saltar con la tecla ESC e ir directamente a la pantalla de datos de la misi&oacute;n.</P>
<center><table>
<td><center><img src="jpg/wcp02.jpg"></center></td>
<tr>
<td><center><font size=1 face=arial><b>Las secuencias cinematogr&aacute;ficas protagonizadas con actores reales, incluido Mark Hamil, ayudan a seguir la trama de los acontecimientos</b></center></td>
</table></center>

<B><P ALIGN="JUSTIFY">El simulador</P>
</B><P ALIGN="JUSTIFY">Entrando ya de lleno en lo que se refiere al simulador de combate espacial dir&eacute; que la calidad es bastante sobresaliente. Los gr&aacute;ficos tienen un gran detalle y calidad, sobre todo si disponemos de una tarjeta aceleradora. Veremos las nebulosas y otras formaciones estelares con gran detalle y la acci&oacute;n es fluida casi en todo momento. Solo en muy contadas ocasiones se ralentiza a veces la acci&oacute;n cuando el n&uacute;mero de naves en las cercan&iacute;as es muy elevado. Hablando de las naves, la variedad de ellas que tenemos a nuestra disposici&oacute;n es suficiente y cubre desde los &aacute;giles interceptores &quot;Avispa&quot;, pasando por todo tipo de cazas de reconocimiento y ataque, como el &quot;Pira&ntilde;a&quot; o el &quot;Pantera&quot; hasta los m&aacute;s pesados bombarderos, como el &quot;Devastador&quot;. Las armas que manejaremos ser&aacute;n las t&iacute;picas variedades de ca&ntilde;ones y misiles. Desde el humilde ca&ntilde;&oacute;n l&aacute;ser hasta el de taquiones y desde los misiles &quot;dumbfire&quot; no guiados hasta los m&aacute;s sofisticados de reconocimiento de imagen, sin olvidar los torpedos, minas, etc.</P>
<center><table>
<td><center><img src="jpg/wcp01.jpg"></center></td>
<tr>
<td><center><font size=1 face=arial><b>El simulador espacial es tan bueno como siempre y, gracias a los gr&aacute;ficos acelerados, realmente espectacular</b></center></td>
</table></center>
<P ALIGN="JUSTIFY">El sonido tambi&eacute;n es de notable calidad en todos sus aspectos, siendo el punto m&aacute;s flojo la falta de doblaje al castellano de los di&aacute;logos, aunque se suple con unos subt&iacute;tulos bastante correctos en general. Esto, que en las escenas de v&iacute;deo no pasa de ser un peque&ntilde;o inconveniente, es un poco m&aacute;s problem&aacute;tico cuando estamos en pleno combate ya que, si no entendemos lo que nos dicen tendremos que leer las &oacute;rdenes en pantalla y, en fin, cuando uno est&aacute; persiguiendo a un enemigo o huyendo de un misil no es el mejor momento para ponerse a leer. M&aacute;s de una vez tendremos que hacer uso de la tecla de acceso al registro de mensajes de la misi&oacute;n para consultar con calma lo que nos hemos perdido en el ardor del combate.</P>
<P ALIGN="JUSTIFY">Los enemigos tienen todo tipo de naves, algunas de lo m&aacute;s original en su concepci&oacute;n, representando bastante bien su origen &quot;alien&quot;. Para defendernos de ellas contaremos con nuestros escudos de energ&iacute;a, los ya tradicionales postquemadores que nos dar&aacute;n la velocidad necesaria para perder a ese pesado que llevamos en cola y se&ntilde;uelos antimisil que nos salvar&aacute;n en m&aacute;s de una ocasi&oacute;n de una muerte segura. Contaremos con sistemas de balance de los escudos (adelante o atr&aacute;s) y de distribuci&oacute;n de la potencia (motores, escudos y ca&ntilde;ones). La cantidad de teclas a manejar, como suele suceder con este tipo de juegos, es alta pero enseguida nos haremos con los controles b&aacute;sicos y rara vez necesitaremos alguna otra. En resumen, el simulador sigue la l&iacute;nea de las anteriores entregas pero con la l&oacute;gica mejora a nivel gr&aacute;fico. Yo, personalmente, prefiero el sistema de adquisici&oacute;n de objetivos de los simuladores de Lucas y echo de menos la posibilidad de memorizar varios objetivos de acceso r&aacute;pido, sobre todo en las misiones de escolta y protecci&oacute;n en las que tener controlada en todo momento a la nave que protegemos es vital para lograr el &eacute;xito.</P>
<P ALIGN="JUSTIFY">He mencionado las misiones… En Wing Commander: La Profec&iacute;a os encontrar&eacute;is con toda la variedad de misiones que es de esperar. Reconocimiento, escolta, intercepci&oacute;n, ataque a cruceros y otras naves de gran tama&ntilde;o… la mayor&iacute;a de ellas bien integradas en la historia de fondo. Como siempre, resultar&aacute; primordial la coordinaci&oacute;n con nuestros hombres ala, para lo cual son muy importantes los comandos de comunicaci&oacute;n con aquellos, permitiendo ordenar ataques sobre objetivos seleccionados, pedir cobertura para nuestra nave, etc. Por supuesto, contaremos con el simulador de entrenamiento, donde practicar con las distintas naves y distintos tipos de misi&oacute;n antes de pasar al combate &quot;de verdad&quot;. La dificultad no es problema ya que disponemos de cinco niveles diferentes as&iacute; que hay para todos los gustos. En el nivel intermedio la cosa se complica enseguida as&iacute; que no quiero ni pensar lo que ser&iacute;a pilotar en el m&aacute;s dif&iacute;cil, pero en el m&aacute;s f&aacute;cil se pueden pasar las misiones sin demasiados problemas.</P>
<B><P ALIGN="JUSTIFY">Conclusi&oacute;n</P>
</B><P ALIGN="JUSTIFY">Mi opini&oacute;n personal es que este t&iacute;tulo tiene ese &quot;algo&quot; que le ha podido faltar a algunas de las entregas intermedias de la serie. Te engancha, te mantiene pegado a la silla y te obliga a jugar una misi&oacute;n detr&aacute;s de otra, te implica en las emociones de los protagonistas de forma mucho m&aacute;s intensa que lo har&iacute;a una pel&iacute;cula porque sabes que ah&iacute; fuera ser&aacute;s t&uacute; quien tenga que &quot;patear el culo&quot; a los alien&iacute;genas y no quieres fallarle a tu &quot;alter-ego&quot; Casey. Lo recomiendo a todos los fans de la serie, ya que son 3 CD’s repletos de entretenimiento. Me gustar&iacute;a hacer este comentario un poco m&aacute;s extenso y hablar de otros detalles que me dejo en el tintero pero hay dos razones por las que no lo voy a hacer: en primer lugar no quiero estropear la diversi&oacute;n a nadie contando m&aacute;s de lo debido y en segundo… estoy deseando cerrar el procesador de textos para echar otra partida.</P>
<P ALIGN="JUSTIFY">Antes de despedirme unos &uacute;ltimos consejos: actuad noblemente, defended a vuestros compa&ntilde;eros a&uacute;n a riesgo de la propia vida, luchad con honor (incluso aunque sea junto a las &quot;bolas de pelo&quot;) y no prejuzgu&eacute;is a nadie hasta conocerlo bien. Est&aacute;is en el TCS Midway porque sois lo mejor de lo mejor as&iacute; que no defraud&eacute;is la esperanza que se ha depositado en vosotros. ¡Y tened cuidado ah&iacute; afuera Tenientes!</P><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



