<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:albert@interbel.es">Albert Feliu</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">

<HR>

<font FACE ="ARIAL" size="3"><b>Título:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> MotorHead</b></font><br>

<HR>

<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Digital Illusions</b></font><br>

<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Gremlin Interactive.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Género:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Simulador deportivo.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés</b></font><br>

<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Nota:</b></font>

<font FACE ="ARIAL" size=3 color="#FF0000"><B> 83%.</b></font>

<HR>



<BR>

 

<table border="0" width="100%" cellspacing="0" cellpadding="0" align="center">

    <tr> 

      <td width="34%" valign="middle" align="left"> 

        <div align="center">

          </b> </div>

      </td>

      <td width="66%" valign="middle" align="right"><a href="http://www.motorhead.org"><img src="gif/mhanim.gif" alt="Banner de MotorHead"></a></td>

    </tr>

  </table>

  <p><a href="http://www.motorhead.org"> </a>

  <div align="justify"><font face="Arial, Helvetica, sans-serif" size="2"> Esta 

    pista ya la conoces, tiempo atr&aacute;s corriste tu primera carrera en ella 

    como piloto amateur. Hoy, con tu recién estrenado ASC II te dispones a triunfar 

    una vez m&aacute;s. Desde la segunda l&iacute;nea de salida las cosas se ven 

    bien. Delante tuyo s&oacute;lo dos coches vibran siguiendo el ritmo que imparten 

    sus motores de 500 CV. El sonido digital que emite el indicador de salida 

    castiga tus oidos. Aprietas el embrague a fondo, empiezas a dar gas, el coche 

    empieza a transmitir su fuerza. Luchas por mantener a la fiera quieta, tienes 

    que controlarla y evitar el chirrido de las ruedas de tracci&oacute;n, podr&iacute;as 

    perder segundos vitales. Faltan mil&eacute;simas de segundo... Sueltas el 

    embrague, los engranajes de tu motor encajan y la fuerza del trueno empuja 

    tu veh&iacute;culo hacia delante, salida perfecta. Aceleras y ves delante 

    de t&iacute; la primera curva, reduces, notas como toda la mec&aacute;nica 

    se estremece y estás llegando al l&iacute;mite. Aguantas el embrague mientras 

    entras en la curva, la direcci&oacute;n girada al m&aacute;ximo, en tus brazos 

    notas absolutamente todas las irregularidades del terreno. El coche se inclina, 

    apuras la frenada para superar a tus adversarios. Frenas tarde, aceleras pronto, 

    tu cuerpo se ve castigado por la brutalidad del movimiento. Sales de la curva 

    en primera posici&oacute;n, primer triunfo parcial, ya conoces esa sensaci&oacute;n. 

    Esta podr&iacute;a ser una carrera cualquiera de las muchas que vas a correr 

    si decides comprarte este juego.<br>

    <br>

    </font>

    

    <font face="Arial, Helvetica, sans-serif" size="2"> <br>

    </font></div>

<table border="0" width="100%" cellspacing="0" cellpadding="0" align="center">

    <tr> 

      <td width="41%" height="245"> 

        <div align="center"><img src="jpg/motor1.jpg" width="300" height="225"><br>

          <b><font face="Arial, Helvetica, sans-serif" size="1">Veh&iacute;culos 

          como este nos esperan en Motorhead</font></b></div>

      </td>

      <td width="1%" height="245"> 

        <div align="justify"></div>

      </td>

      <td width="58%" height="245">

	  <div align="justify"><font size="2" face="Arial, Helvetica, sans-serif">Todos 

        los que llevéis un m&iacute;nimo tiempo en esto del PC y os gusten m&aacute;s 

        o menos los juegos recordaréis la &eacute;poca en la que se pusieron de 

        moda los pinballs. Esta moda empez&oacute; cuando sali&oacute; un juego 

        llamado Pinball Dreams. Pues de los creadores de este juego, <b>Digital 

        Illusions</b>, nos llega esta maravilla. En el mundo de los juegos para 

        PC siempre ha existido la eterna discusi&oacute;n de si realmente los 

        desarrolladores saben sacar realmente todo el jugo a las diferentes m&aacute;quinas 

        o se limitan a esperar que el usuario compre los &uacute;ltimos avances 

        en hardware. Pues bueno, con <u>este</u> juego, la gente de <b>Digital 

        Illusions</b> se han salido. En un P133 pode&iacute;s correr por circuitos 

        cargados de pol&iacute;gonos y texturas y ver como el engine 3D os escupe 

        20 FPS. El juego cuenta con efectos reservados a poseedores de tarjetas 

        aceleradoras 3D pero de serie en el software. Podréis ver 

        &quot;lens flares&quot; calculados en tiempo real y con una calidad m&aacute;s 

        que sorprendente, podréis apreciar efectos de transpar&eacute;ncias, 

        de niebla, de reflexi&oacute;n sobre el cuerpo de los coches, todo. Adem&aacute;s 

        a una velocidad endiablada.</font></div></td>

    </tr>

  </table>

    

  <div align="justify"> 

    <p><font face="Arial, Helvetica, sans-serif" size="2">Si adem&aacute;s eres 

      el afortunado poseedor de una tarjeta 3DFX, entonces la experiencia 

      ya se convierte en una secuencia de im&aacute;genes que te har&aacute;n 

      dudar sobre la aut&eacute;ntica exist&eacute;ncia de los coches que ves 

      correr por la pantalla. Con una buena tarjeta aceleradora 3D el efecto es 

      demoledor. El juego es compatible con todas las tarjetas aceleradoras Direct3D, 

      aunque en tarjetas aceleradoras de primera generaci&oacute;n (Virge, Mystique, 

      ...) es mejor desactivar la aceleraci&oacute;n y utilizar el driver software 

      que incluye el juego, obtendrás mejor calidad visual general.<br>

      </font></p>

    

    <br>

    <font face="Arial, Helvetica, sans-serif" size="2"> </font><font face="Arial, Helvetica, sans-serif" size="2"> 

    El juego nos ofrece, originalmente, ocho circuitos y nueve coches. Una vez 

    consigamos ganar el campeonato que nos propone, podremos acceder a un d&eacute;cimo 

    coche de velocidad estratosf&eacute;rica. Es de agradecer la pol&iacute;tica 

    de mantener el producto actualizado por parte de Digital Illusions, en el 

    momento de redactar este art&iacute;culo ya conten&iacute;a en su web la versi&oacute;n 

    2.2 del juego (la versi&oacute;n 1.2 es la que se entrega con la caja original), 

    parches espec&iacute;ficos para versiones OEM entregadas con tarjetas de v&iacute;deo, 

    la versi&oacute;n 3.1 del servidor dedicado y dos coches m&aacute;s para a&ntilde;adir 

    a&uacute;n m&aacute;s jugabilidad al software.</font><font face="Arial, Helvetica, sans-serif" size="2"> 

    Adem&aacute;s est&aacute;n trabajando en una series de herramientas 

    para poder crear nuestros propios coches y circuitos. </font><font face="Arial, Helvetica, sans-serif" size="2">Sin 

    duda una actitud digna de admiraci&oacute;n.</font><br>

    <br>

    <table border="0" width="100%" cellspacing="0" cellpadding="0" align="center">

      <tr> 

        <td width="59%" height="245" valign="top"> 

          <div align="justify"><font face="Arial, Helvetica, sans-serif" size="2">El 

            juego cuenta con tres tipos b&aacute;sicos de juego, carrera &uacute;nica, 

            campeonato y contra-reloj. En la carrera &uacute;nica podremos seleccionar 

            entre las pista y coches disponibles en cada momento y correr contra 

            oponentes para practicar en una simulaci&oacute;n de carrera real. 

            En el campeonato, tendremos que correr en una liga y quedar en las 

            dos primeras posiciones, esto nos permitir&aacute; subir de categor&iacute;a. 

            El juego cuenta con tres categor&iacute;as o divisiones que tenemos 

            que superar. A medida que avanzamos por las diferentes ligas, vamos 

            ganando acceso a nuevos veh&iacute;culos y circuitos. Cuando ganemos 

            todas las carreras obtendremos un nuevo coche de caracter&iacute;sticas 

            superiores. En el modo contra-reloj, podemos jugar solos o en modo 

            &quot;ghost&quot;, en el cual apareceremos nosotros mismos grabados 

            previamente. Esto nos puede ayudar a motivarnos para conseguir mejores 

            tiempos.</font><br>

            <br>

            <div align="justify"> <font face="Arial, Helvetica, sans-serif" size="2">El 

              juego contempla la opci&oacute;n multijugador para poder disputar 

              carreras con los amiguetes sobre casi todos los protocolos existentes. 

              Podemos jugar sobre TCP/IP e IPX, conectando dos ordenadores con 

              un cable serie (null </font></div>

        </div></td>

        <td width="1%" height="245"> 

          <div align="justify"></div>

        </td>

        <td width="40%" height="245">

          <div align="center"> <font size="2" face="Arial, Helvetica, sans-serif"><img src="jpg/motor3.jpg" width="300" height="225"><br>

            <b><font face="Arial, Helvetica, sans-serif" size="1">Las l&iacute;neas 

            de algunos de los coches hacen intuir<br>

            la potencia que atesoran</font></b></font></div>

        </td>

      </tr>

    </table>

    <font face="Arial, Helvetica, sans-serif" size="2"> m&oacute;dem), con una 

    conexi&oacute;n punto a punto entre dos m&oacute;dems, y hasta existe un protocolo 

    propietario para trabajar sobre una LAN. Realmente excelente (como todo en 

    este juego).</font><br>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>

<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







