<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> TOCA Touring Car Championship.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Codemaster.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Simulador de coches.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 72%.</b></font>
<HR>

<BR>

 
<P align="justify"><img src="jpg/toca00.jpg" align="left">Los motores est&aacute;n en marcha. El sem&aacute;foro se pone en rojo y las revoluciones suben al m&aacute;ximo, al igual que el ritmo card&iacute;aco de los pilotos. Est&aacute; a punto de dar la salida… El sem&aacute;foro se pone verde y las gomas de los neum&aacute;ticos se queman en el asfalto. La lucha de los pilotos por las posiciones de privilegio al principio de la carrera es implacable ya que todos saben la importancia que tiene una buena salida…</P>
<P ALIGN="JUSTIFY">Estas sensaciones est&aacute;n reservadas a unos pocos privilegiados que pueden tener entre sus manos el volante de un coche de carreras, sea cual sea la disciplina: F&oacute;rmula 1, Indy, Nascar, Sport Prototipos, etc. Quiz&aacute;s ser&iacute;a mejor decir que estaban reservadas a ellos hasta hace unos pocos a&ntilde;os en que las simulaciones de ordenador nos empezaron a traer al resto de los mortales toda la emoci&oacute;n de la velocidad hasta la comodidad de nuestros hogares. El juego que voy a comentar a continuaci&oacute;n es uno m&aacute;s de la ya larga lista de estos simuladores que se adentran en el fascinante mundo del motor y, en concreto, de las cuatro ruedas. En este caso la competici&oacute;n de la que se ocupa es el Campeonato Brit&aacute;nico de S&uacute;per Turismos y la forma de abordarlo es m&aacute;s cercana al arcade que al simulador.</P>
<P ALIGN="JUSTIFY">Los s&uacute;per turismos son veh&iacute;culos de producci&oacute;n en serie y orientaci&oacute;n familiar, dotados de cuatro puertas y motores limitados a 2 litros de cilindrada. Son veh&iacute;culos por todos conocidos y que cualquiera de nosotros puede conducir en sus versiones de calle, como el Renault Laguna,  Audi A4, Volvo S40, Honda Accord, Peugeot 406, Nissan Primera, Ford Mondeo y Opel Vectra. Sin embargo las modificaciones t&eacute;cnicas que sufren para adaptarlos a la competici&oacute;n los convierte en verdaderos b&oacute;lidos muy dif&iacute;ciles de dominar. Sacarle todo el partido a uno de estos coches nos llevar&aacute; muchas horas de pr&aacute;ctica.</P>
<P ALIGN="JUSTIFY">En cuanto al juego, lo que m&aacute;s sobresale son los gr&aacute;ficos. Como viene siendo habitual en los &uacute;ltimos tiempos, el programa soporta aceleraci&oacute;n gr&aacute;fica mediante Direct3D y, gracias a la ayuda de una buena tarjeta (una 3Dfx, por ejemplo) los gr&aacute;ficos resultan muy vistosos, manteniendo una frecuencia de refresco de pantalla y una velocidad de juego m&aacute;s que satisfactorias. Si no disponemos de una de estas tarjetas los gr&aacute;ficos son mucho m&aacute;s pobres y la velocidad notablemente menor, con lo que el programa resulta jugable, sin m&aacute;s. De todas formas, ¿que jugador que se precie no tiene ya instalada en su equipo una de estas joyas? Si t&uacute; eres uno de ellos no s&eacute; a qu&eacute; est&aacute;s esperando, sal ahora mismo a la tienda m&aacute;s cercana, porque la diferencia en calidad de juego hace que merezca la pena el coste de la tarjeta. TOCA tiene, adem&aacute;s, otros detalles gr&aacute;ficos interesantes como las diferentes condiciones clim&aacute;ticas que est&aacute;n bastante bien representadas, con la lluvia, los truenos, la nieve y los efectos de reflejo de la luz del sol en nuestro parabrisas. Tambi&eacute;n se aprecia la luz de los faros de nuestros perseguidores y su reflejo en la pista mojada, el petardeo de los tubos de escape, el giro de las llantas, la goma quemada al acelerar en exceso sobre el asfalto, etc. Los coches est&aacute;n muy bien modelados y las texturas reproducen la publicidad aut&eacute;ntica de los equipos.</P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/toca01.jpg"></td>
<tr>
<td><center><font size=1><b>Un pequeño error y nos <br>encontramos fuera de la pista</b></center></td>
</table>
Disponemos de las t&iacute;picas vistas arcade desde la parte posterior del veh&iacute;culo y otras vistas interiores —desde la cabina y encima del cap&oacute;— m&aacute;s adecuadas para los fans de la simulaci&oacute;n. Sin embargo el interior de la cabina est&aacute; realmente mal realizado, sin distinguirse unos coches de otros y sin siquiera mostrar los indicadores del salpicadero. En definitiva es un juego orientado m&aacute;s a la faceta arcade que a otra cosa, y esto se nota tambi&eacute;n en el dise&ntilde;o de los men&uacute;s de opciones, los indicadores de velocidad, marcha, etc. y, sobre todo, en la total ausencia de un garaje donde poder ajustar los par&aacute;metros del veh&iacute;culo, como relaciones de cambio, reglajes de suspensi&oacute;n, tipo de neum&aacute;ticos, etc.</P>
<P ALIGN="JUSTIFY">Las opciones de juego son las suficientes para un programa de estas caracter&iacute;sticas, sin alardes. Destaca la opci&oacute;n de lucha contra el cron&oacute;metro, en la que podemos tomar como referencia la imagen fantasma del coche en nuestra mejor vuelta para ayudarnos en la dif&iacute;cil tarea de mejorar los tiempos. El n&uacute;mero de circuitos tambi&eacute;n es suficiente pero cuenta con el inconveniente de que no est&aacute;n accesibles todos desde el principio, sino que se van habilitando a medida que vamos avanzando pruebas en el modo de campeonato. Esto impide entrenar estos circuitos con libertad antes de la carrera (a no ser que nos sepamos los cheat codes, claro).</P>
<P ALIGN="JUSTIFY">Tampoco se han olvidado los programadores de Codemasters de las partidas multijugador, con suficientes opciones para contentar a cualquiera. Es posible jugar hasta cuatro personas en un mismo ordenador mediante la t&eacute;cnica de pantalla dividida, aunque el juego se vuelve demasiado lento; con s&oacute;lo dos sigue siendo perfectamente jugable. Tambi&eacute;n soporta las t&iacute;picas configuraciones de cable serie (m&oacute;dem nulo), juego por m&oacute;dem, red local IPX e Internet mediante TCP/IP. Y una sorpresa agradable: permite jugar a todos con un s&oacute;lo CD, gracias a la instalaci&oacute;n especial para juego en red de que dispone; una opci&oacute;n que no todas las compa&ntilde;&iacute;as se molestan en proporcionar, pensando que la comunidad de jugadores est&aacute; formada por gente a la que nos sobra el dinero. Un punto a favor de Codemasters por este tema y que aprendan los dem&aacute;s.</P>
<P ALIGN="JUSTIFY">En un juego con filosof&iacute;a arcade no parece muy oportuno hablar de realismo, sin embargo no es este el caso. Verdaderamente el juego no es un arcade puro y duro sino que cuida en la medida de lo posible la verosimilitud. El comportamiento de los coches est&aacute; bastante conseguido y no podremos, por ejemplo, tomar cualquier curva cerrada pisando a fondo porque nos saldremos con seguridad de la pista. Los coches derrapan con facilidad y no son en absoluto f&aacute;ciles de controlar a la primera (si queremos ir de prisa, por supuesto). A alta velocidad el m&aacute;s m&iacute;nimo descuido puede hacer que perdamos el control del veh&iacute;culo. As&iacute; que los fans de t&iacute;tulos del estilo de Daytona, etc. se pueden ir olvidando de todo lo aprendido a los mandos de tales juegos. En comparaci&oacute;n con &eacute;ste &uacute;ltimo, TOCA es un casi un simulador. En suelo mojado, la dificultad de control del coche aumenta mucho y ser&aacute; f&aacute;cil hacer un trompo por dar demasiado volante a la entrada de una curva r&aacute;pida o por frenar en medio de un giro muy cerrado. En estas condiciones, el tracci&oacute;n total de Audi deja sentir su superior estabilidad sobre el resto, pero a cambio penaliza en velocidad punta en los circuitos m&aacute;s r&aacute;pidos. La representaci&oacute;n de los circuitos tambi&eacute;n est&aacute; bastante lograda con los peraltes, subidas, bajadas y dem&aacute;s caracter&iacute;sticas de los mismos fielmente reproducidas. Adem&aacute;s son las pistas reales del campeonato brit&aacute;nico, como Donington Park, Silverstone, Brands Hatch, etc. ya que el juego cuenta con la licencia oficial del citado campeonato.</P>
<P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/toca02.jpg"></td>
<tr>
<td><center><font size=1><b>Los rivales tienen una conducción<br> bastante agresiva</b></center></td>
</table><P ALIGN="JUSTIFY">
Siguiendo con el tema del realismo, los accidentes tambi&eacute;n resultan muy espectaculares. Podemos chocar contra los oponentes para sacarlos de la pista y ver como vuelcan, se destrozan sus parabrisas, etc. Los desperfectos causados por estos accidentes ser&aacute;n claramente visibles en nuestro coche, en forma de chapa doblada, defensas arrancadas, faros rotos, etc. todo bastante bien realizado. Incluso es posible quedarnos sin el cap&oacute;, quedando el motor al descubierto. Adem&aacute;s afectar&aacute;n a la mec&aacute;nica del coche, pudi&eacute;ndose sentir sus efectos en cuanto a velocidad punta, aceleraci&oacute;n y estabilidad del veh&iacute;culo, por lo que ser&aacute; mejor no abusar de esta t&eacute;cnica de conducci&oacute;n. Por si esto fuera poco, los jueces de la carrera nos pueden amonestar por conducci&oacute;n antideportiva, priv&aacute;ndonos de parte de los puntos conseguidos, y si reincidimos hasta podr&aacute;n descalificarnos. Cuidado con los adversarios porque ellos tambi&eacute;n suelen usar su coche con aviesas intenciones y m&aacute;s de una vez nos tocar&aacute;n por detr&aacute;s en mitad de una curva, dando con nuestros &quot;huesos&quot; met&aacute;licos en la arena. La inteligencia artificial es aceptable, pudi&eacute;ndose distinguir el comportamiento de unos y otros pilotos, por lo que habr&aacute; que aprender a evitar a los m&aacute;s &quot;peligrosos&quot;. Un peque&ntilde;o defecto que tiene el juego en este aspecto es el hecho de que todos los contrarios nos aventajan descaradamente en la salida, parece hecho a prop&oacute;sito para pon&eacute;rnoslo un poco m&aacute;s dif&iacute;cil pero no resulta realista y si ten&iacute;as una buena posici&oacute;n en parrilla es fastidioso ver como te adelantan los dem&aacute;s con tanta facilidad.</P>
<P ALIGN="JUSTIFY">En el apartado de sonido el juego cumple sin brillar tampoco en exceso. Los efectos de sonido del motor, los frenazos, choques, etc. est&aacute;n bien realizados aunque son iguales para todos los coches, lo que resta algo de realismo. La m&uacute;sica est&aacute; bien pero, sinceramente, ¿qui&eacute;n escucha la m&uacute;sica en uno de estos juegos cuando va a 200 kil&oacute;metros por hora jug&aacute;ndose el tipo? Por suerte se puede desactivar la m&uacute;sica durante el juego, que es como mejor est&aacute;.</P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/toca03.jpg"></td>
<tr>
<td><center><font size=1><b>Con el tanque podremos hacer volar<br> por los aires a los adversarios</b></center></td>
</table><P align="justify">
Como casi todos los juegos, TOCA cuenta con unos cuantos cheats que nos permiten obtener circuitos extra, coches extra y algunas otras modificaciones, unas &uacute;tiles, otras simplemente curiosas. En particular, los dos coches adicionales son bastante sorprendentes: uno es una especie de tanque con el que podemos disparar a los adversarios y quit&aacute;rnoslos de en medio y el otro es un viejo Cadillac de color rosa y tracci&oacute;n trasera que, aunque tiene un radio de giro muy elevado, es muy r&aacute;pido, hasta el punto de que, en circuitos poco virados, podremos hacer con &eacute;l los mejores tiempos. Estos trucos los podemos ir obteniendo poco a poco cada tres carreras ganadas en modo campeonato. Si ganamos el campeonato tendremos la opci&oacute;n de jugar el desaf&iacute;o TOCA, en el que los circuitos se corren reflejados, es decir, lo que antes era una curva a izquierdas ahora es a derechas.</P>
<P ALIGN="JUSTIFY">En resumen es un juego entretenido. Se deja jugar sin demasiadas complicaciones pero para hacer buenos tiempos hay que practicar mucho. Los fan&aacute;ticos de la simulaci&oacute;n lo encontrar&aacute;n demasiado &quot;blando&quot; y pueden perfectamente prescindir de &eacute;l, pero para los que no se quieran complicar demasiado la vida con tipos de neum&aacute;tico, relaciones de cambio, etc. es de lo m&aacute;s parecido a conducir un coche de verdad que van a encontrar. Mi opini&oacute;n personal es que este t&iacute;tulo le pega una buena &quot;pasada&quot; al hom&oacute;logo de SEGA PC y, adem&aacute;s, sali&oacute; antes al mercado.</P>
<P ALIGN="JUSTIFY">Como consejos finales, decir que el Honda Accord es uno de los veh&iacute;culos m&aacute;s r&aacute;pidos pero tambi&eacute;n es de los m&aacute;s inestables y, por tanto, dif&iacute;ciles de controlar. Mi preferido es el Volvo S40 que est&aacute; bastante equilibrado. Los rivales a batir son los pilotos del equipo Renault, por lo que ser&aacute; bueno no perderles de vista en ning&uacute;n momento. Probar los diferentes ajustes de sensibilidad del controlador, ya sea joystick o teclado, hasta encontrar el que mejor se adapte a nuestra forma de conducir, ya que un volantazo a alta velocidad puede ser fatal para nuestras aspiraciones.</P></FONT></BODY>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>





