<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 1.<br>Introducci&oacute;n
</H3>
<p align=justify>
<B><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2.- La ventana de AMI PRO 3.1</P>
<P ALIGN="JUSTIFY"></P>
&#9;2.1.- Cuadro del men&uacute; de Control.<br>
&#9;2.2.- Barra de men&uacute;s.<br>
&#9;2.3.- SmartIcons.<br>
&#9;2.4.- Barra de estado.<br>
&#9;2.5.- Barra de t&iacute;tulos.<br>
&#9;2.6.-Bot&oacute;n Restaurar.<br>
&#9;2.7.- Bot&oacute;n Maximizar.<br>
&#9;2.8.- Bot&oacute;n Minimizar.<br>
&#9;2.9.- Barras de desplazamiento (horizontal y vertical).<br>
&#9;2.10.- Botones de desplazamiento (horizontal y vertical).<br>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCION.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro es un procesador de textos del tipo WYSIWYG (acr&oacute;nimo del t&eacute;rmino ingl&eacute;s What You See Is What You Get- lo que se ve es lo se obtiene). Cuenta con las mismas funciones que otras aplicaciones similares, como realce de texto, edici&oacute;n y revisi&oacute;n ortogr&aacute;fica. Sin embargo, Ami Pro tambi&eacute;n permite ver en pantalla la forma exacta en que va a aparecer un documento cuando se imprima, funci&oacute;n de la que no disponen otros procesadores de texto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro utiliza las convenciones de Microsoft Windows en cuando al uso de men&uacute;s, mandatos de men&uacute;s, recuadros de di&aacute;logo, botones de mandato, botones de selecci&oacute;n, recuadros de lista, casillas de verificaci&oacute;n, recuadros de texto, iconos y rat&oacute;n. Para cancelar cualquier men&uacute; o recuadro de di&aacute;logo sin necesidad de preocuparse sobre los cambios realizados en el documento basta con pulsar ESC.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- LA VENTANA DE AMI PRO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Con este apartado pretendo que se familiar&iacute;ce con las partes de la ventana de Ami Pro para poder trabajar de forma r&aacute;pida y eficaz. Es posible especificar las partes de la ventana de Ami Pro que desee visualizar, u ocultar todas las partes de la ventana.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><center><IMG SRC="gif/ami1.gif"></center>&nbsp;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">2.1.- Cuadro del men&uacute; de Control.</P>
</B><P ALIGN="JUSTIFY">&#9;</P>
<P ALIGN="JUSTIFY">Muestra un men&uacute; con mandatos  que permiten restaurar, mover, cambiar de tama&ntilde;o, maximizar, minimizar o cerrar la ventana activa, pasar de una ventana a otra o abrir la ventana del Panel de control.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.2.- Barra de men&uacute;s.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Contiene los men&uacute;s principales de Ami Pro.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.3.- SmartIcons.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muestra un grupo de iconos (peque&ntilde;os s&iacute;mbolos) que act&uacute;an como teclas r&aacute;pidas para efectuar funciones, mandatos y macros de  Ami Pro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para utilizar los SmartIcons es necesario tener un rat&oacute;n. Si sit&uacute;a el puntero sobre un SmartIcon y pulsa el bot&oacute;n del rat&oacute;n, Ami Pro ejecuta la funci&oacute;n, el mandato o la macro correspondiente. Si sit&uacute;a el puntero del rat&oacute;n sobre un icono y mantiene el bot&oacute;n derecho del rat&oacute;n pulsado, Ami Pro muestra el mandato de descripci&oacute;n del icono en la barra de t&iacute;tulo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.4.- Barra de estado.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muestra botones que ofrecen mandatos abreviados para las funciones y mandatos de Ami Pro as&iacute; como informaci&oacute;n sobre el documento actual o la funci&oacute;n que se est&aacute; llevando a cabo en ese momento.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.5.- Barra de t&iacute;tulos.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muestra el nombre de la aplicaci&oacute;n y el nombre del documento actual, o un mensaje de ayuda directa si se selecciona un men&uacute; o elemento de men&uacute;.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.6.-Bot&oacute;n Restaurar.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Restaura la aplicaci&oacute;n o el documento de Ami Pro al tama&ntilde;o y posici&oacute;n que ocupaba antes de maximizarlo o minimizarlo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.7.- Bot&oacute;n Maximizar.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ampl&iacute;a el tama&ntilde;o de  la ventana de Ami Pro a toda la pantalla.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.8.- Bot&oacute;n Minimizar.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Reduce la ventana de Ami Pro a un icono que se sit&uacute;a en la parte inferior de la pantalla.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2.9.- Barras de desplazamiento (horizontal y vertical).</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sirven para controlar la parte del documento que aparece en pantalla.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2.10.- Botones de desplazamiento (horizontal y vertical).</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Indican la situaci&oacute;n de la parte de documento que aparece en pantalla con respecto al ancho total del mismo y la situaci&oacute;n del punto de inserci&oacute;n con respecto al documento completo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- LA BARRA DE ESTADO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Es la &uacute;ltima linea de la ventana del AMI PRO.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;La barra de estado contiene botones que ofrecen mandatos abreviados para las funciones y mandatos de Ami Pro as&iacute; como informaci&oacute;n sobre el documento actual o la funci&oacute;n que se est&aacute; llevando a cabo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Para utilizar la barra de estado sit&uacute;e el puntero del rat&oacute;n sobre el icono o bot&oacute;n que desea utilizar y pulse el bot&oacute;n izquierdo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.1.- Indicador de estilo.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra el nombre del estilo de p&aacute;rrafo donde est&aacute; situado el punto de inserci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Si pulsa el indicador de estilo, Ami Pro muestra una lista con los estilos de p&aacute;rrafo disponibles. Elija uno y Ami Pro se lo asignar&aacute; al p&aacute;rrafo actual.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.2.- Familia.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra la familia de tipos de letra asignada al texto donde est&aacute; situado el punto de inserci&oacute;n. La familia puede hacer referencia a la especificada en el estilo de p&aacute;rrafo o a la asignada&nbsp; mediante el men&uacute; Formato o la barra de estado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Si pulsa el bot&oacute;n que indica la familia de tipos de letra, Ami Pro muestra una lista con las familias disponibles. Elija una de ellas y Ami Pro se la asignar&aacute; al texto que haya seleccionado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.3.- Tama&ntilde;o del tipo de letra.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra el tama&ntilde;o del tipo de letra asignado al texto donde est&aacute; situado el punto de inserci&oacute;n. El tama&ntilde;o del tipo de letra puede hacer referencia al especificado en el estilo de p&aacute;rrafo o al que se haya asignado utilizando el men&uacute; Formato o la barra de estado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Si se pulsa este bot&oacute;n, Ami Pro muestra una lista de los tama&ntilde;os disponibles. Elija un tama&ntilde;o y Ami Pro lo asignar&aacute; al texto seleccionado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.4.-V&iacute;a de acceso al documento.</P>
</B><P ALIGN="JUSTIFY">&#9;</P>
<P ALIGN="JUSTIFY">&#9;Muestra el nombre de la v&iacute;a de acceso al documento, la fecha y hora actuales, o la l&iacute;nea, columna y posici&oacute;n actuales. En Modo borrador s&oacute;lo aparece informaci&oacute;n sobre la columna.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Este bot&oacute;n act&uacute;a como conmutador, al pulsarlo aparecen el nombre de la v&iacute;a de acceso, la fecha y hora o la l&iacute;nea, columna y posici&oacute;n del punto de inserci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;La posici&oacute;n del punto de inserci&oacute;n se define seg&uacute;n la unidad de medida especificada en la regleta actual.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.5.- Bot&oacute;n de notificaci&oacute;n del correo.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra en pantalla el bot&oacute;n Correo si ha recibido correo nuevo. Ami Pro recibe correo de cc:Mail para Windows o de Lotus Notes si est&aacute; cargada la aplicaci&oacute;n de correo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.6.- Modo de texto</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra <B>Ins</B> cuando se utiliza el modo Inserci&oacute;n, <B>Sobr</B> cuando se utiliza el modo Sobrescritura y Rev si se utiliza el modo Revisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Este bot&oacute;n act&uacute;a como conmutador; al pulsarlo sucesivamente se alterna entre Inserci&oacute;n, Sobrescritura y Revisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.7.- Mays.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Indica si est&aacute; activada la tecla <B>Bloq May&uacute;s</B>. Cuando dicha tecla no est&aacute; activada, el bot&oacute;n aparece vac&iacute;o.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.8.- Flechas de cambio de p&aacute;gina.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra una flecha hacia arriba y otra hacia abajo, sin tener en cuenta d&oacute;nde est&aacute; situado el punto de inserci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Si se pulsa sobre una flecha de cambio de p&aacute;gina en Modo calidad, el punto de inserci&oacute;n se sit&uacute;a en la p&aacute;gina anterior o en la siguiente. Si se hace en Modo borrador, el punto se sit&uacute;a en la pantalla anterior o en la siguiente.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">3.9.- N&uacute;mero de p&aacute;gina.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Muestra el n&uacute;mero de p&aacute;gina actual. Este n&uacute;mero s&oacute;lo se muestra en Modo calidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Rat&oacute;n: Al pulsar este icono aparece el recuadro de di&aacute;logo Ir a.</P>
<P ALIGN="JUSTIFY"></P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
