<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 10.<br>La Fusión en Ami Pro 3.1
</H3>
<p align=justify>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>INDICE:</B></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- Conceptos b&aacute;sicos de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY">3.- Creaci&oacute;n de archivos de datos variables.</P>
<P ALIGN="JUSTIFY">4.- Modificaci&oacute;n de campos.</P>
<P ALIGN="JUSTIFY">5.- Edici&oacute;n de archivos de datos variables de Ami Pro.</P>
<P ALIGN="JUSTIFY">6.- Creaci&oacute;n de documentos de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY">7.- Fusi&oacute;n de datos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por fusi&oacute;n se entiende la combianaci&oacute;n de texto de dos o m&aacute;s archivos diferentes para crear listas de direcciones con distintas finalidades, cartas personalizadas, etc...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo m&aacute;s conocido son los mailings&nbsp;; es decir, fusionar una carta con una base de direcciones para enviar por correo a sus respectivos destinatarios. Otras aplicaciones, pueden ser reporting.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- CONCEPTOS B&Aacute;SICOS DE FUSI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se puede utilizar Fusi&oacute;n para combinar datos, como nombres y direcciones, con informaci&oacute;n de un documento de Ami Pro, como una carta o un informe. Por ejemplo, podr&iacute;a utilizar Fusi&oacute;n para enviar una carta a varias personas, pero personalizando cada carta con el nombre y domicilio del individuo. Fusi&oacute;n tambi&eacute;n permite crear listas de direcciones y etiquetas postales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para realizar una fusi&oacute;n, deber&aacute; seguir los pasos que se indican a continuaci&oacute;n:</P>
<P ALIGN="JUSTIFY"></P>
<OL>

<P ALIGN="JUSTIFY"><LI>Cree o seleccione un archivo de datos variables con la informaci&oacute;n variable (los nombres y direcciones).</LI></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><LI>Cree o edite un documento de fusi&oacute;n con el texto est&aacute;ndar (la carta o el informe) con el que  se va a combinar la informaci&oacute;n variable.</LI></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><LI>Fusione e imprima la informaci&oacute;n con el documento. </LI></P></OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para realizar una fusi&oacute;n se pueden utilizar distintos tipos de archivos de datos. Los datos pueden estar almacenados en un archivo de datos variables de Ami Pro, una tabla de Ami Pro, un archivo de base de datos o un archivo de hoja de c&aacute;lculo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible utilizar archivos de datos (registros) creados en otras aplicaciones import&aacute;ndolos, si tienen uno de los siguientes formatos:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">· ASCII con campos de longitud fija (FIXED)</P>
<P ALIGN="JUSTIFY">· ASCII con campos delimitados por comas (COMMA)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si desea utilizar un archivo de datos ASCII con campos delimitados no por comas (por ejemplo, por comillas), deber&aacute; importar el archivo externo a un documento de Ami Pro&nbsp;: </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">· DIF</P>
<P ALIGN="JUSTIFY">· Lotus 1-2-3, versiones 1, 1a y 2.x (.WKS y .WK1)</P>
<P ALIGN="JUSTIFY">· Lotus 1-2-3, versiones 3 y 3.1, y 1-2-3 para Windows (.WK3)</P>
<P ALIGN="JUSTIFY">· dBase, versiones III, III+ y IV</P>
<P ALIGN="JUSTIFY">· Excel, versi&oacute;n 4.0 y anteriores (.XLS)</P>
<P ALIGN="JUSTIFY">· Paradox, versiones hasta 3.5 (.DB)</P>
<P ALIGN="JUSTIFY">· SuperCalc, versiones 3 y 4</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- CREACI&Oacute;N DE ARCHIVOS DE DATOS VARIABLES.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un archivo de datos variables consta de registros, que se organizan en campos. Si el archivo de datos contiene nombres y direcciones, cada grupo de nombre y direcci&oacute;n constituye un registro. Dentro del registro, el nombre, la direcci&oacute;n, el c&oacute;digo postal, la ciudad y la provincia son campos. Es posible crear el archivo de datos como un documento de Ami Pro, usar datos de una tabla de Ami Pro o utilizar datos creados en una aplicaci&oacute;n de base de datos u hoja de c&aacute;lculo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Puede crear un archivo de datos variables de Ami Pro incluso si la pantalla muestra otro documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Elija Archivo/Fusi&oacute;n.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Bienvenido a fusi&oacute;n, especificando los tres pasos del proceso de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Elija la opci&oacute;n 1 para crear un archivo de datos nuevo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija Aceptar.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Archivo de datos de fusi&oacute;n y una lista de los documentos del directorio actual. Puesto que todav&iacute;a no ha creado un archivo de datos variables, no puede utilizar ninguno de los documentos existentes.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Elija Nuevo.</P>


<P ALIGN="JUSTIFY">Ami Pro abre un documento sin t&iacute;tulo y muestra el recuadro de di&aacute;logo Crear archivo de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Para cada campo que desee crear, teclee el texto que desee utilizar como Nombres de campo y luego pulse INTRO, o bien, elija A&ntilde;adir.</P>
<P ALIGN="JUSTIFY">Los nombres de campo pueden contener letras o n&uacute;meros, pero no deben empezar con un n&uacute;mero ni constar de n&uacute;meros solamente. Ami Pro sit&uacute;a los nombres de campo en el recuadro de lista Campos del archivo de datos, siguiendo el orden en que hayan sido a&ntilde;adidos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Si necesita alterar el nombre de los campos, seleccione el campo adecuado en el recuadro de lista Campos del archivo de datos y luego elija el bot&oacute;n de desplazamiento adecuado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">7. Si necesita suprimir un campo, selecci&oacute;nelo en el recuadro de lista Campos del archivo de datos y luego elija Suprimir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8. Si necesita cambiar un nombre de campo, suprima uno existente y a&ntilde;ada uno nuevo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9. Si desea especificar delimitadores de campo y de registro especiales, elija Opciones. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El delimitador de campo marca el final de un campo (la ciudad, por ejemplo) y el delimitador de registro marca el final de un registro (un grupo de nombre y direcci&oacute;n, por ejemplo). Estos caracteres especiales no pueden aparecer en ning&uacute;n lugar de la informaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">10. Elija los delimitadores de campo y de registro deseados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">11. Elija el bot&oacute;n Aceptar para regresar al recuadro de di&aacute;logo Crear archivo de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">12. Elija Aceptar.</P>


<P ALIGN="JUSTIFY">Ami Pro sit&uacute;a los delimitadores de campo y de registro en la primera l&iacute;nea del archivo de datos variables. Sit&uacute;a los nombres de campo, separados por delimitadores de campo y con un delimitador de registro al final, en la segunda l&iacute;nea del archivo de datos variables.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Archivo de datos, que se parece a una tarjeta indexada. Los nombres de campo especificados aparecen a la izquierda de los recuadros de texto.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">13. En cada recuadro de texto, teclee la informaci&oacute;n deseada y luego pulse INTRO.</P>


<P ALIGN="JUSTIFY">Si el archivo de datos variables contiene m&aacute;s de diez campos, Ami Pro muestra una flecha hacia abajo en la parte inferior de la tarjeta indexada. Puede seleccionar la flecha para mostrar los nombres de campo restantes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">14. Si comete un error al escribir la informaci&oacute;n, corr&iacute;jalo situando el punto de inserci&oacute;n en el recuadro de texto deseado y edite la informaci&oacute;n que contenga.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">15. Cuando acabe de especificar la informaci&oacute;n para todos los campos, elija A&ntilde;adir.</P>


<P ALIGN="JUSTIFY">Ami Pro sit&uacute;a la informaci&oacute;n en la tercera l&iacute;nea del archivo de datos variables y en las siguientes y muestra un nuevo registro en blanco. Los primeros diez caracteres de la informaci&oacute;n especificada para el primer campo del registro anterior aparecen en un separador de tabulaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">16. Repita este procedimiento para cada registro que desee crear.</P>


<P ALIGN="JUSTIFY">Ami Pro sit&uacute;a los registros en el archivo de datos variables siguiendo el orden en que los haya creado.</P>


<P ALIGN="JUSTIFY">Puede modificar el orden de los registros llevando a cabo una clasificaci&oacute;n alfab&eacute;tica. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">17. Cuando ya haya creado todos los registros, elija Cerrar.</P>
<P ALIGN="JUSTIFY">&#9;Ami Pro le muestra un mensaje solicitando que guarde el archivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">18. Especifique el nombre de archivo deseado y elija Aceptar.</P>


<P ALIGN="JUSTIFY">Puede visualizar registros especiales y editarlos, o bien, crear registros nuevos que desee a&ntilde;adir al archivo de datos variables.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">4.- MODIFICACI&Oacute;N DE CAMPOS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible utilizar Administraci&oacute;n de campos para insertar o renombrar ciertos campos en un archivo de datos variables que ya existe.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para modificar un campo&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Elija Archivo/Fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Elija la opci&oacute;n 1 para editar el archivo de datos variables.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">Si el archivo de datos variables no aparece en pantalla, Ami Pro solicita el nombre del archivo. Especif&iacute;quelo y elija Edici&oacute;n.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el primer registro en el recuadro de di&aacute;logo Archivo de datos.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Elija Adm de campos.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Administraci&oacute;n de campos, que contiene una lista de los nombres de campo del archivo de datos variables. A continuaci&oacute;n, puede insertar un campo o renombrarlo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Para insertar un campo en un archivo de datos variables&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al insertar un campo, debe especificar la posici&oacute;n deseada para ese campo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. En el recuadro de texto Nombre de campo, teclee el nombre de campo que desee insertar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. En el recuadro de lista Campos del archivo de datos, elija el campo que ocupa la posici&oacute;n donde desea insertar el nuevo campo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Elija Insertar.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Elija Antes del texto seleccionado o Despu&eacute;s del texto seleccionado como posici&oacute;n para el nuevo campo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Elija Aceptar para insertar el campo y regresar al recuadro de di&aacute;logo Administraci&oacute;n de campos.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el nuevo nombre de campo en el recuadro de lista Campos del archivo de datos, en la posici&oacute;n previamente determinada.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">6. Elija Aceptar para regresar al recuadro de di&aacute;logo Archivo de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para asignar un nombre nuevo para un campo del archivo de datos variables</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. En el recuadro de lista Campos del archivo de datos, elija el campo que desee renombrar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. En el recuadro de texto Nombres de campo, teclee el nuevo nombre para el campo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Elija Renombrar.</P>
<P ALIGN="JUSTIFY">&#9;Ami Pro renombra el campo seleccionado.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Elija Aceptar para regresar al recuadro de di&aacute;logo Archivo de datos.</P>


<P ALIGN="JUSTIFY">&#9;Ami Pro muestra el registro en pantalla con el nombre de campo modificado.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">5.- EDICI&Oacute;N DE ARCHIVOS DE DATOS VARIABLES DE AMI PRO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible editar un archivo de datos variables modificando la informaci&oacute;n de uno o m&aacute;s campos, a&ntilde;adiendo nuevos registros o borrando registros que ya existen.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Deber&aacute; visualizar los registros antes de poder editarlos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La edici&oacute;n de un archivo de datos variables de Ami Pro se debe realizar&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Elija Archivo/Fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Elija la opci&oacute;n 1 para editar el archivo de datos variables.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija Aceptar.</P>


<P ALIGN="JUSTIFY">Si el archivo de datos variables no aparece actualmente en pantalla, Ami Pro solicita el nombre del archivo. Especif&iacute;quelo y elija Editar.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el primer registro en el recuadro de di&aacute;logo Archivo de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Visualice el registro que desee editar.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">5. Pulse TAB o MAYUS+TAB para desplazar el punto de inserci&oacute;n hacia el campo que desee editar y especifique la informaci&oacute;n deseada.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">6. Elija el mandato que desee.</P>


<P ALIGN="JUSTIFY">* A&ntilde;adir&nbsp;: Guarda la informaci&oacute;n actual que se muestra en pantalla como un nuevo registro y muestra un registro en blanco.</P>
<P ALIGN="JUSTIFY">* Suprimir&nbsp;: Borra el registro actual del archivo de datos variables y muestra el registro siguiente.</P>
<P ALIGN="JUSTIFY">* Actualizar&nbsp;: Guarda toda informaci&oacute;n nueva en el registro actual y lo sigue mostrando en pantalla.</P>
<P ALIGN="JUSTIFY">* Registro nuevo&nbsp;: Elimina la informaci&oacute;n en pantalla sin guardarla y muestra un registro en blanco.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">7. Despu&eacute;s de editar los registros del archivo de datos variables, elija Cerrar.</P>


<P ALIGN="JUSTIFY">Ami Pro actualiza el registro actual y cierra el recuadro de di&aacute;logo Archivo de datos. Si hab&iacute;a editado el archivo, Ami Pro le indica que guarde los cambios.</P>
<P ALIGN="JUSTIFY"></P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">6.- CREACI&Oacute;N DE DOCUMENTOS DE FUSI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Despu&eacute;s de crear el archivo de datos variables, puede crear el documento de fusi&oacute;n. El documento de fusi&oacute;n contiene el texto para la carta o el informe. Se puede crear un nuevo documento de Ami Pro o bien utilizar uno ya existente.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Para crear un documento de fusi&oacute;n&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. El documento que contiene el texto est&aacute;ndar (la carta o el informe) debe ocupar la ventana activa y encontrarse en Modo calidad o visualizar un documento sin t&iacute;tulo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Sit&uacute;e el punto de inserci&oacute;n en la posici&oacute;n donde desee que Ami Pro inserte la informaci&oacute;n que contiene el archivo de datos variables.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Elija Archivo/Fusi&oacute;n.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Bienvenido a fusi&oacute;n, especificando los tres pasos del proceso de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Seleccione la opci&oacute;n 2 para crear un documento de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Elija Aceptar.</P>


<P ALIGN="JUSTIFY">Puesto que a&uacute;n no ha asignado el archivo de datos variables al documento, Ami Pro muestra un mensaje. Elija S&iacute; para utilizar el documento actual como documento de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY">Si acaba de crear o editar un archivo de datos variables, Ami Pro lo asigna autom&aacute;ticamente al documento de fusi&oacute;n y muestra el recuadro de di&aacute;logo Insertar campo de fusi&oacute;n. Elija el nombre de campo que desee insertar en el documento de fusi&oacute;n y dir&iacute;jase al paso 8.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro utiliza de forma automatica el archivo de datos variables especificado cada vez que se realiza una fusi&oacute;n con este documento de fusi&oacute;n. Si Ami Pro no puede especificar el archivo de datos variables, muestra el recuadro de di&aacute;logo Archivo de datos de fusi&oacute;n, de manera que se podr&aacute; asignar el archivo deseado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Especifique el nombre del archivo de datos variables que desee asignar al documento de fusi&oacute;n y elija Aceptar.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el recuadro de di&aacute;logo Insertar campo de fusi&oacute;n, que contiene una lista de los nombres de campo del archivo de datos variables que haya asignado al documento de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">7. Elija el Nombre de campo que desee insertar en el documento de fusi&oacute;n.</P>


<P ALIGN="JUSTIFY">Cuando se realiza la fusi&oacute;n, Ami Pro sustituye cada nombre de campo por la informaci&oacute;n que &eacute;ste contiene.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">8. Elija Insertar para situar el nombre de campo en el documento de fusi&oacute;n.</P>


<P ALIGN="JUSTIFY">Ami Pro muestra el nombre de campo entre par&eacute;ntesis angulares, &lt;&gt;, en el documento. El recuadro de di&aacute;logo Insertar campo de fusi&oacute;n permanece en pantalla.</P>
<P ALIGN="JUSTIFY">Ami Pro no reconoce los nombres de campo y par&eacute;ntesis tecleados en el documento de fusi&oacute;n. Deber&aacute; insertar los nombres de campo mediante el recuadro de di&aacute;logo Insertar campos de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9. Si fuese necesario, sit&uacute;e el punto de inserci&oacute;n donde desee insertar otro nombre de campo.</P>


<P ALIGN="JUSTIFY">&#9;Teclado: Pulse ALT+F6 para desplazar el punto de inserci&oacute;n en el documento.</P>


<P ALIGN="JUSTIFY">Es posible insertar un nombre de campo o m&aacute;s en una sola l&iacute;nea. Si algunos registros no contienen la informaci&oacute;n referente a un campo en particular, Ami Pro no deja espacios en esa l&iacute;nea durante la fusi&oacute;n. Si el nombre de campo es el &uacute;nico texto de la l&iacute;nea, Ami Pro define el interlineado de esa l&iacute;nea como cero durante la fusi&oacute;n. Siempre que el espaciado de p&aacute;rrafo anterior y posterior se haya definido como cero, no aparecer&aacute;n espacios de sobra en el documento impreso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">10. Repita el procedimiento hasta que haya insertado todos los nombres de campo que desee.</P>


<P ALIGN="JUSTIFY">&#9;Teclado: Pulse ALT+F6 para regresar al recuadro de di&aacute;logo Insertar campo de fusi&oacute;n. </P>


<P ALIGN="JUSTIFY">Una vez insertados los campos de fusi&oacute;n en el documento de fusi&oacute;n, se pueden cortar, copiar o mover en otras posiciones del documento. Seleccione todo el nombre de campo incluyendo los par&eacute;ntesis angulares y pulse SUPR, o seleccione cortar, copiar y pegar, o Arrastrar y soltar para copiar o mover el nombre de campo a la posici&oacute;n deseada. Adem&aacute;s, se pueden asignar atributos de texto y mejoras de texto a los nombres de campo utilizando estilos de p&aacute;rrafo, SmartIcons, la barra de estado o el men&uacute; Formato. Cuando Ami Pro inserta los datos en el documento de fusi&oacute;n, el texto se presenta en pantalla y se imprime con los atributos que se hayan aplicado a los nombres de campo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">11. Elija el bot&oacute;n de acci&oacute;n que desee.</P>


<P ALIGN="JUSTIFY">* Continuar fusi&oacute;n&nbsp;: Muestra el recuadro de di&aacute;logo Bienvenido a fusi&oacute;n, con la opci&oacute;n 3 seleccionada. Ahora ser&aacute; posible fusionar la informaci&oacute;n.</P>
<P ALIGN="JUSTIFY">* Cerrar&nbsp;: Cierra el recuadro de di&aacute;logo y vuelve al documento de fusi&oacute;n, para que pueda seguir edit&aacute;ndolo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible guardar el documento de fusi&oacute;n y los nombres de los campos como una nueva hoja de estilos. As&iacute; se puede usar esa hoja de estilos nueva para crear otros documentos de fusi&oacute;n. Ami Pro utiliza de forma autom&aacute;tica el archivo de datos variables que se ha asignado al documento de fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">7.- FUSI&Oacute;N DE DATOS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Despu&eacute;s de crear el archivo de datos variables y el documento de fusi&oacute;n, de especificar el archivo de datos apropiado y de insertar los nombres de campo en el documento de fusi&oacute;n, se puede efectuar la fusi&oacute;n. Podr&aacute; visualizar en pantalla, imprimir o guardar documentos fusionados.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">El proceso de fusi&oacute;n&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. El documento de fusi&oacute;n debe ocupar la ventana activa y encontrarse en Modo calidad. </P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Elija Archivo/Fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija la opci&oacute;n 3 para fusionar e imprimir el documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Elija Aceptar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Elija el tipo de fusi&oacute;n que desee efectuar.</P>


<P ALIGN="JUSTIFY">* Fusionar e imprimir&nbsp;: Env&iacute;a el documento de fusi&oacute;n con la informaci&oacute;n que contienen los registros directamente a la impresora.</P>
<P ALIGN="JUSTIFY">* Fusionar, ver e imprimir&nbsp;: Muestra el documento de fusi&oacute;n con la informaci&oacute;n de un registro de manera que se puede ver y modificar antes de enviarlo a la impresora. Las modificaciones que realice afectar&aacute;n a futuros documentos fusionados.</P>
<P ALIGN="JUSTIFY">* Fusionar y guardar como&nbsp;: Guarda el documento de fusi&oacute;n con la informaci&oacute;n de un registro en el archivo de Ami Pro que se especifique, para poderlo editar o imprimir m&aacute;s tarde.</P>
<P ALIGN="JUSTIFY">En el documento de fusi&oacute;n, los nombres de campo deben encontrarse en el texto principal para poder utilizar Fusionar y guardar como. Dichos nombres no pueden encontrarse dentro de marcos, tablas, notas a pie de p&aacute;gina, cabeceras ni pies de p&aacute;ginas. Adem&aacute;s, el documento de fusi&oacute;n no debe contener im&aacute;genes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Para especificar el n&uacute;mero de copias, el grupo de p&aacute;ginas y otras opciones de impresi&oacute;n, elija Opcs de impresi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">7. Especifique las opciones apropiadas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8. Elija Aceptar para regresar al recuadro de di&aacute;logo Fusi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9. Elija Aceptar para iniciar la fusi&oacute;n.</P>


<P ALIGN="JUSTIFY">Ami Pro crea los documentos con la informaci&oacute;n que contienen los registros y los muestra en pantalla, los imprime o los guarda en un archivo.</P>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
