<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 3.<br>Operaciones más habituales en Ami Pro 3.1
</H3>
<p align=justify>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P>2.- Selecci&oacute;n de un texto.</P>
<P ALIGN="JUSTIFY">&#9;2.1.- Selecci&oacute;n de texto mediante el rat&oacute;n.</P>
<P ALIGN="JUSTIFY">2.2.- M&eacute;todos r&aacute;pidos para seleccionar texto mediante el rat&oacute;n.</P>
<P>2.3.- Selecci&oacute;n de texto mediante el teclado.</P>
<P ALIGN="JUSTIFY">3.- Copiar o repetir un texto.</P>
<P ALIGN="JUSTIFY">4.- Desplazamiento de texto.</P>
<P ALIGN="JUSTIFY">4.1.- M&eacute;todos r&aacute;pidos para desplazar texto</P>
<P>5.- Cambios de tipo de letra.</P>
<P ALIGN="JUSTIFY">6.- Aplicaci&oacute;n de atributos a texto.</P>
<P ALIGN="JUSTIFY">7.- Pr&aacute;ctica.</P>
</FONT><B><FONT FACE="Arial"><P>1.- INTRODUCCION.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">&#9;En esta Unidad vamos a tratar de las operaciones mas habituales en AMI PRO, como pueden ser&aacute;: poner negrita, subrayar, cambiar tipo de letra del documento, operaciones con bloques de texto.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- SELECCI&Oacute;N DE UN TEXTO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Se indica a Ami Pro que haga algo con un determinado bloque, p&aacute;rrafo o palabra seleccionando el texto y realizando una acci&oacute;n. Se puede usar tanto el teclado como el rat&oacute;n para seleccionar texto.</P>
<P ALIGN="JUSTIFY">Cuando el texto est&aacute; seleccionado, puede sobreescribirlo, borrarlo, moverlo, copiarlo y modificar su aspecto cambiando su tipo de letra, alineaci&oacute;n, sangrado, espaciado o atributos.</P>
<U><P ALIGN="JUSTIFY">2.1.- Selecci&oacute;n de texto mediante el rat&oacute;n.</P><DIR>
<DIR>

</U><P ALIGN="JUSTIFY">1. Mueva el rat&oacute;n hasta que el puntero vertical se encuentre al principio del texto que desea seleccionar.</P>
<P ALIGN="JUSTIFY">2. Arrastre el rat&oacute;n hasta llegar al final del texto que desea seleccionar y suelte el bot&oacute;n.</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Ami Pro borrar&aacute; el texto seleccionado si se introduce texto nuevo o se pulsan las teclas de RETROCESO, SUPR o INTRO mientras el texto est&eacute; resaltado. Si realiza una de estas acciones sin querer, es posible que consiga recuperar el texto mediante la funci&oacute;n Deshacer. </P>
<U><P ALIGN="JUSTIFY">2.2.- M&eacute;todos r&aacute;pidos para seleccionar texto mediante el rat&oacute;n.</P>
</U><P ALIGN="JUSTIFY">Ami Pro proporciona m&eacute;todos r&aacute;pidos para la selecci&oacute;n de texto mediante el rat&oacute;n.</P>
<P ALIGN="JUSTIFY">Para seleccionar:&#9;Acci&oacute;n:</P>
<P ALIGN="JUSTIFY">una palabra&#9;&#9;Pulse el rat&oacute;n dos veces sobre la palabra</P>
<P ALIGN="JUSTIFY">varias palabras&#9;&#9;Pulse el rat&oacute;n dos veces y arr&aacute;strelo</P>
<P ALIGN="JUSTIFY">una frase&#9;&#9;Pulse CTRL + el rat&oacute;n una vez</P>
<P ALIGN="JUSTIFY">varias frases&#9;&#9;Mantenga pulsado CTRL + pulse el rat&oacute;n y arr&aacute;strelo</P>
<P ALIGN="JUSTIFY">un p&aacute;rrafo&#9;&#9;Pulse CTRL + el rat&oacute;n dos veces</P>
<P ALIGN="JUSTIFY">varios p&aacute;rrafos&#9;&#9;Mantenga pulsado CTRL + pulse el rat&oacute;n dos veces y arr&aacute;strelo</P>
<U><P ALIGN="JUSTIFY">2.3.- Selecci&oacute;n de texto mediante el teclado.</P><DIR>
<DIR>

</U><P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n en la posici&oacute;n apropiada al principio o final del texto que desee seleccionar. </P></DIR>
</DIR>

<P ALIGN="JUSTIFY">2. Mantenga pulsada la tecla MAYUS y pulse las teclas de movimiento del cursor.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n es posible usar una combinaci&oacute;n de las teclas r&aacute;pidas descritas en la p&aacute;gina anterior y MAYUS para seleccionar texto. Por ejemplo, MAYUS + FIN selecciona todo el texto desde la posici&oacute;n del punto de inserci&oacute;n hasta el final de la l&iacute;nea.</P>
<P ALIGN="JUSTIFY">Ami Pro borrar&aacute; el texto seleccionado si se introduce nuevo texto o se pulsan las teclas RETROCESO, SUPR o INTRO mientras se encuentra resaltado. Si realiza una de estas acciones sin querer, puede que recupere el texto con la funci&oacute;n Deshacer.</P>
<P ALIGN="JUSTIFY">El usuario tendr&aacute; la &uacute;ltima palabra a la hora de utilizar alguno de estos m&eacute;todos.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- COPIAR O REPETIR UN TEXTO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Es posible copiar texto mediante los SmartIcons, los men&uacute;s o el teclado.</P>
<P ALIGN="JUSTIFY">El texto copiado permanece en el Portapapeles hasta que se copie m&aacute;s texto, informaci&oacute;n distinta o una imagen. </P>
<P ALIGN="JUSTIFY">Para copiar o repetir un texto en otro punto, se realizar&aacute; los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY">1. Seleccione el texto que desee copiar.</P>
<P ALIGN="JUSTIFY">2. Elija Edici&oacute;n/Copiar o el Smarticons Copiar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Teclado: Pulse CTRL+INS o CTRL+C.</P>
<P ALIGN="JUSTIFY">Ami Pro coloca una copia del texto en el Portapapeles. El texto original permanece en el documento.</P></DIR>
</DIR>

<OL>
<OL>

<P ALIGN="JUSTIFY"><LI>Sit&uacute;e el punto de inserci&oacute;n donde desee colocar el texto.</LI></P></OL>
</OL>

<P ALIGN="JUSTIFY">4. Elija Edici&oacute;n/Pegar o el Smarticons Pegar.</P>
<P ALIGN="JUSTIFY">Teclado: Pulse MAYUS+INS o CTRL+V.</P>
<P ALIGN="JUSTIFY">El contenido del Portapapeles aparece en la posici&oacute;n elegida.</P>
<P ALIGN="JUSTIFY">El usuario tendr&aacute; la &uacute;ltima palabra a la hora de utilizar alguno de estos m&eacute;todos.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">4.- DESPLAZAMIENTO DE TEXTO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Es posible desplazar texto mediante los SmartIcons, los men&uacute;s o el teclado.</P>
<P ALIGN="JUSTIFY">El texto desplazado permanece en el Portapapeles hasta que se copie o corte m&aacute;s texto, informaci&oacute;n distinta o una imagen.</P>
<P ALIGN="JUSTIFY">Para desplazar un texto de sitio, se realizar&aacute; con los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY">1. Seleccione el texto que desee trasladar.</P>
<P ALIGN="JUSTIFY">2. Elija Edici&oacute;n/Cortar o el Smarticons Cortar.</P>
<P ALIGN="JUSTIFY">Teclado: Pulse MAYUS+SUPR o CTRL+X.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Ami Pro coloca el texto en el Portapepeles. Cuando se corta un texto, el texto original se borra del documento.</P></DIR>
</DIR>

<OL>
<OL>

<P ALIGN="JUSTIFY"><LI>Sit&uacute;e el punto de inserci&oacute;n donde desee colocar el texto.</LI></P>
<P ALIGN="JUSTIFY">4. Elija Edici&oacute;n/Pegar o el Smarticons Pegar.</P>
<P ALIGN="JUSTIFY">Teclado: Pulse MAYUS+INS o CTRL+V.</P>
<P ALIGN="JUSTIFY">El contenido del Portapapeles aparece en la posici&oacute;n elegida.</P>
<U><P ALIGN="JUSTIFY">4.1.- M&eacute;todos r&aacute;pidos para desplazar texto</P>
</U><P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n en el texto que desea desplazar</P>
<P ALIGN="JUSTIFY">2. Si desea cambiar la posici&oacute;n del p&aacute;rrafo donde se encuentra el punto de inserci&oacute;n a la del p&aacute;rrafo anterior, pulse ALT+­.</P>
<P ALIGN="JUSTIFY">3. Si desea cambiar la posici&oacute;n del p&aacute;rrafo donde se encuentra el punto de inserci&oacute;n a la del p&aacute;rrafo siguiente, pulse ALT+¯.</P>
<P ALIGN="JUSTIFY">Ami Pro desplaza el texto a la posici&oacute;n deseada. Como Ami Pro no sit&uacute;a el texto desplazado o copiado mediante las teclas r&aacute;pidas en el Portapapeles, no se puede pegar dicho texto.</P>
<P ALIGN="JUSTIFY">El usuario tendr&aacute; la &uacute;ltima palabra a la hora de utilizar alguno de estos m&eacute;todos.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">5.- CAMBIOS DE TIPO DE LETRA.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Es posible modificar la familia de tipos de letra, su tama&ntilde;o y el color aplicados a un texto seleccionado.</P>
<P ALIGN="JUSTIFY">Los tipos de letra de que dispone Ami Pro dependen de los tipos de letra de la impresora que se utilice. Si el nombre del bot&oacute;n familia situado en la barra de estado aparece en rojo (en color gris si se trata de un monitor monocromo) cuando el punto de inserci&oacute;n se encuentra en determinados p&aacute;rrafos y el bot&oacute;n tama&ntilde;o del tipo de letra no reacciona al pulsar el rat&oacute;n sobre &eacute;l, el estilo de p&aacute;rrafo asignado a dicho texto corresponde a un tipo de letra que no se encuentra disponible en la impresora que se utiliza.</P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n, vamos a ver como se desarrolla la aplicaci&oacute;n de un tipo de letra a una parte del documento:</P>
<P ALIGN="JUSTIFY">1. Seleccione el texto que desea modificar.</P>
<P ALIGN="JUSTIFY">2. Elija Formato/Tipo de letra.</P>
<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse el rat&oacute;n sobre el bot&oacute;n familia situado en la barra de estado y elija una familia de tipos de letra. Pulse el rat&oacute;n sobre el bot&oacute;n tama&ntilde;o del tipo de letra y elija el tama&ntilde;o que desea.</P>
<P ALIGN="JUSTIFY">3. Especifique la familia, el tama&ntilde;o y el color del tipo de letra que desee aplicar al texto seleccionado.</P>
<P ALIGN="JUSTIFY">Es posible introducir un tama&ntilde;o de tipo de letra especial en el recuadro de texto situado junto al recuadro de lista Tama&ntilde;o, cuando la opci&oacute;n no est&aacute; atenuada</P>
<P ALIGN="JUSTIFY">4. Elija Aceptar</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el texto seleccionado con la familia, el tama&ntilde;o y el color especificado.</P>
<P ALIGN="JUSTIFY"><LI>Si desea que el texto seleccionado vuelva a tener los par&aacute;metros de tipo de letra del estilo de p&aacute;rrafo, elija la opci&oacute;n Restaurar estilo.</LI></P></OL>
</OL>

</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">6.- APLICACI&Oacute;N DE ATRIBUTOS A TEXTO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Si lo desea, puede aplicar al texto seleccionado atributos como negrita, cursiva, subrayado o may&uacute;sculas. Los atributos disponibles dependen de los tipos de letra de que disponga la impresora.</P>
<P ALIGN="JUSTIFY">Para aplicar un atributo, hay que realizar las siguientes operaciones&nbsp;:</P>
<P ALIGN="JUSTIFY">1. Seleccione el texto que va a modificar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Teclado: Mantenga pulsada la tecla CTRL y pulse la letra correspondiente que desea aplicar al texto: O,N,S, U, o K para aplicar ese atributo.</P></DIR>
</DIR>

<OL>
<OL>

<P ALIGN="JUSTIFY"><LI>Elija el men&uacute; Formato.</LI></P></OL>
</OL>

<P ALIGN="JUSTIFY">3. Seleccione el atributo que desee aplicar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">4. Para eliminar un solo atributo del texto, seleccione el texto, elija el men&uacute; Formato y seleccione el atributo que aparezca junto a una marca de verificaci&oacute;n. Para eliminar todos los realces y atributos del texto, elija Formato/Normal.</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">&#9;A continuaci&oacute;n vamos a explicar los diferentes atributos que se le puede dar al texto:</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">* Normal&nbsp;: Elimina todos los realces y atributos aplicados al texto mediante el men&uacute; Formato. El texto seleccionado vuelve a tener los par&aacute;metros del estilo de p&aacute;rrafo.</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">* Negrita&nbsp;: Destaca el texto seleccionado. </P>
<P ALIGN="JUSTIFY">* Cursiva&nbsp;: El texto seleccionado aparece en cursiva.</P>
<P ALIGN="JUSTIFY">* Subrayado&nbsp;: Subraya el texto seleccionado, incluidos los espacios entre las palabras.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">* Subrayado palabras&nbsp;: Subraya las palabras que componen el texto seleccionado y deja sin subrayar los espacios entre ellas. </P>
<P ALIGN="JUSTIFY">* Letras&nbsp;: Asigna a las letras del texto seleccionado el tipo (may&uacute;sculas, min&uacute;sculas, iniciales o versalitas) especificado. Cuando se anula este realce, el texto vuelve a tener las letras del estilo de p&aacute;rrafo.</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">* May&uacute;sculas&nbsp;: Convierte en may&uacute;sculas todas las letras seleccionadas.</P>
<P ALIGN="JUSTIFY">* Min&uacute;sculas&nbsp;: Convierte en min&uacute;sculas todas las letras seleccionadas .</P>
<P ALIGN="JUSTIFY">* Iniciales&nbsp;: Convierte en may&uacute;scula la primera letra de las palabras seleccionadas.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">* Versalitas&nbsp;: Convierte en versalitas todas las letras seleccionadas. Ami&nbsp; Pro transforma las may&uacute;sculas originales del texto (primer car&aacute;cter de cada una de las palabras seleccionadas) en el tama&ntilde;o de letra may&uacute;scula est&aacute;ndar correspondiente al tipo de letra especificado y convierte todas las letras min&uacute;sculas en un tipo de letra correspondiente a 7/10 el tama&ntilde;o del tipo de letra original.</P>
<P ALIGN="JUSTIFY">Si su impresora no puede imprimir versalitas con el tama&ntilde;o exacto, Ami Pro utilizar&aacute; un tama&ntilde;o lo m&aacute;s parecido posible.</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Ami Pro muestra el texto seleccionado con el atributo adecuado.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">7.-PRACTICA.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a desarrolla un pr&aacute;ctica referente a lo que hemos explicado en el tema. Primeramente hay que escribir lo siguiente&nbsp;:</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P>1.- Lotus Ami Pro y la soluci&oacute;n completa de aplicaciones Lotus para Windows</P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P>&nbsp;</P>
<P>1.1.- Interfaz com&uacute;n de usuario</P>
</FONT><FONT FACE="Arial" SIZE=2><P>Todos los productos de la soluci&oacute;n completa de aplicaciones Lotus para Windows comparten similares patrones de presentaci&oacute;n y funcionamiento, lo cual facilita enormemente su aprendizaje y utilizaci&oacute;n, tanto individual como en conjunto. Tal es el caso, por ejemplo, de los SmartIcons compartidos por todas las aplicaciones: en cuanto aprenda a utilizarlos en Lotus Ami Pro, podr&aacute; servirse de ellos en cualquiera de las dem&aacute;s aplicaciones Lotus para Windows.</P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P>1.2.- Herramientas para trabajo en grupo</P>
</FONT><FONT FACE="Arial" SIZE=2><P>Lotus Ami Pro ofrece una completa colecci&oacute;n de herramientas especialmente dise&ntilde;adas para la resoluci&oacute;n efectiva de tareas en el entorno Windows, tanto a t&iacute;tulo individual como colectivo. Entre ellas, cabe citar el Gestor de aplicaciones Lotus, la funci&oacute;n de selecci&oacute;n m&uacute;ltiple y copia o las herramientas de Lotus Freelance Graphics para la elaboraci&oacute;n de presentaciones.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Tareas a realizar&nbsp;:</P>
<P ALIGN="JUSTIFY">&#9;1.- Poner en negrita y subrayado el punto 1.</P>
<P ALIGN="JUSTIFY">&#9;2.- Poner en subrayado los puntos 1.1 y 1.2</P>
<P ALIGN="JUSTIFY">&#9;3.- Poner en cursiva la palabra Smarticons.</P>
<P ALIGN="JUSTIFY">&#9;4.- Poner en negrita las palabras que se refieren a programas informaticos.</P>
<P ALIGN="JUSTIFY">&#9;5.- Practicar las operaciones de Copiar, Cortar y Pegar.</P>
<P ALIGN="JUSTIFY">&#9;6.- Cambiar los tipos de letras a los titulos.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
