<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 4.<br>Operaciones con parrafos. Cabeceras y pies. Margenes y tabuladores. Numeracion de paginas
</H3>
<p align=justify>
<B><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- El P&aacute;rrafo.</P>
<OL>

<P ALIGN="JUSTIFY"><LI>La alineaci&oacute;n.</LI></P>
<P ALIGN="JUSTIFY"><LI> El sangrado.</LI></P>
<P ALIGN="JUSTIFY"><LI> El interlineado.</LI></P></OL>

<P ALIGN="JUSTIFY">3.- Cabeceras y Pies.</P>
<OL>

<P ALIGN="JUSTIFY"><LI>Creaci&oacute;n de cabeceras y pies fijos</LI></P>
<P ALIGN="JUSTIFY"><LI>Creaci&oacute;n de cabeceras y pies alternos.</LI></P>
<P ALIGN="JUSTIFY"><LI> Supresi&oacute;n de cabeceras y pies.</LI></P></OL>

<P ALIGN="JUSTIFY">4.- M&aacute;rgenes y Tabuladores.</P>
<OL>

<P ALIGN="JUSTIFY"><LI>M&aacute;rgenes</LI></P>
<P ALIGN="JUSTIFY"><LI>Tabuladores</LI></P></OL>

<P ALIGN="JUSTIFY">5.- Numerar p&aacute;ginas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">En esta unidad vamos a tratar el aspecto y la est&eacute;tica de  los p&aacute;rrafos. Tambi&eacute;n atenderemos a las opciones de alineaci&oacute;n, sangrado, interlineado y por &uacute;ltimo como se imprime un documento en AMI PRO.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- EL PARRAFO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;Un p&aacute;rrafo es un conjunto de palabras u oraciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<U><P ALIGN="JUSTIFY">2.1 La alineaci&oacute;n.</P>
</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde AMI PRO, podemos alinear el texto a la izquierda, derecha, centrado o justificado a los m&aacute;rgenes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro alinea solamente p&aacute;rrafos enteros. Incluso en el caso de que s&oacute;lo se seleccione una parte del p&aacute;rrafo, las opciones de alineaci&oacute;n seleccionadas afectar&aacute;n al p&aacute;rrafo completo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n explicaremos como se aplica la alineaci&oacute;n a los p&aacute;rrafos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 1. Seleccione el texto que desee modificar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Teclado: Mantenga pulsada la tecla CTRL y pulse la letra correspondiente a la opci&oacute;n de Alineaci&oacute;n elegida: I, T, D, o J.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY"> 2. Elija Formato/Alineaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 3. Seleccione la alineaci&oacute;n que desee&nbsp;:</P>
<P ALIGN="JUSTIFY">&#9;&#9;* Izquierda&nbsp;: Alinea el texto seleccionado s&oacute;lo respecto al margen izquierdo.</P><DIR>
<DIR>
<DIR>
<DIR>

<P ALIGN="JUSTIFY">* Centrado&nbsp;: Centra el texto seleccionado respecto a los m&aacute;rgenes izquierdo y derecho.</P></DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="JUSTIFY">&#9;&#9;* Derecha&nbsp;: Alinea el texto seleccionado s&oacute;lo respecto al margen derecho.</P><DIR>
<DIR>
<DIR>
<DIR>

<P ALIGN="JUSTIFY">* Justificado&nbsp;: Justifica el texto seleccionado respecto a ambos m&aacute;rgenes, derecho e izquierdo.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="JUSTIFY"> 4. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra el texto seleccionado con la alineaci&oacute;n especificada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Para volver a la alineaci&oacute;n especificada en el estilo de p&aacute;rrafo, seleccione el texto, elija Formato/Alineaci&oacute;n y, a continuaci&oacute;n, seleccione la alineaci&oacute;n que aparezca junto a una marca de verificaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;A continuaci&oacute;n vemos como se alinea el texto&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="RIGHT">Esta l&iacute;nea esta alineada a la derecha.</P>
<P ALIGN="JUSTIFY"></P>
<P>Esta l&iacute;nea esta alineada a la izquierda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="CENTER">Esta l&iacute;nea esta alineada al  centro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta l&iacute;nea esta justificada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&#9;</P>
<U><P ALIGN="JUSTIFY">2.2 El sangrado.</P>
</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Puede utilizar los SmartIcons o el men&uacute; Formato para sangrar todas las l&iacute;neas, la primera l&iacute;nea o las l&iacute;neas restantes de un p&aacute;rrafo seleccionado o una combinaci&oacute;n de todos los sangrados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro sangra solamente p&aacute;rrafos enteros. Incluso en el caso de que seleccione s&oacute;lo una parte del p&aacute;rrafo, el sangrado que se especifique afectar&aacute; a todo el p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Cuando utiliza SmartIcons para sangrar texto, Ami Pro sangra autom&aacute;ticamente en incrementos de 0,5 pulgadas o 1 de cent&iacute;metro, dependiendo de la unidad de medida especificada en el formato de p&aacute;gina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n explicaremos como se realiza un sangrado usando SmartIcons</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Pulse el bot&oacute;n de icono para aplicar un sangrado en todas las l&iacute;neas de un p&aacute;rrafo en el margen izquierdo de 0,5 pulgadas o de 1 cent&iacute;metro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pulse el bot&oacute;n del icono para aplicar un sangrado solamente en la primera l&iacute;nea del p&aacute;rrafo de 0,5 pulgadas o de 1 cent&iacute;metro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pulse el bot&oacute;n del rat&oacute;n para aplicar un sangrado en todas las l&iacute;neas de un p&aacute;rrafo excepto en la primera l&iacute;nea de 0,5 pulgadas o de 1 cent&iacute;metro.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Si desea sangrar un p&aacute;rrafo otras 0,5 pulgadas o 1 cent&iacute;metro, pulse otra vez el bot&oacute;n del icono adecuado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora explicaremos como se aplica  un sangrado utilizando el men&uacute; Formato</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 1. Seleccione el texto que desea modificar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 2. Elija Formato/Sangrado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 3. Seleccione pulgadas, cent&iacute;metros, picas o puntos como unidad de medida.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una pica equivale a 1/6 de pulgada; un punto equivale a 1/72 de pulgada.</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">4. Especifique el Sangrado que desea aplicar a las l&iacute;neas del p&aacute;rrafo, Ami Pro sangra respecto al margen izquierdo o derecho&nbsp;:</P></DIR>
</DIR>


<UL>

<UL>
<P ALIGN="JUSTIFY"><LI>Todas&nbsp;: Sangra todas las l&iacute;neas del p&aacute;rrafo a partir del margen izquerdo la cantidad especificada. </LI></P>
<P ALIGN="JUSTIFY"><LI>Desde dcha&nbsp;: Sangra todas las l&iacute;neas del p&aacute;rrafo a partir del margen derecho la cantidad especificada. </LI></P>
<P ALIGN="JUSTIFY"><LI>Primera&nbsp;: Sangra s&oacute;lo la primera l&iacute;nea del p&aacute;rrafo la cantidad especificada.  Para sangrar la primera l&iacute;nea de texto del p&aacute;rrafo, Ami Pro a&ntilde;ade la cantidad especificada en la opci&oacute;n Primera a la cantidad especificada en la opci&oacute;n Todas.</LI></P>
<P ALIGN="JUSTIFY"><LI>Resto&nbsp;: Sangra todas las l&iacute;neas del p&aacute;rrafo, excepto la primera, la cantidad especificada. Para sangrar las restantes l&iacute;neas de texto del p&aacute;rrafo, Ami&nbsp; Pro a&ntilde;ade la cantidad especificada en la opci&oacute;n Resto a la cantidad especificada en la opci&oacute;n Todas. </LI></P></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> 5. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">&#9;Ami Pro muestra el texto seleccionado con el sangrado especificado.</P>
<P ALIGN="JUSTIFY"></P>
<OL START=6>

<OL>

<P ALIGN="JUSTIFY"><LI>Para volver a los par&aacute;metros de sangrado especificados en el estilo de p&aacute;rrafo, seleccione el texto, elija Formato/Sangrado y seleccione Restaurar estilo.</LI></P></OL>
</OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Como ves en este apartado de esta Unidad hemos aplicado la Sangr&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero existe otro tipo de sangrado, el sangrado franc&eacute;s, que consiste en sangrar todas las l&iacute;neas de un p&aacute;rrafo, incluido cualquier texto que se haya introducido en la primera l&iacute;nea a continuaci&oacute;n del tabulador, seg&uacute;n la cantidad especificada en la opci&oacute;n Resto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es imprescindible especificar una cantidad en el recuadro de texto Resto para poder establecer un sangrado franc&eacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para crear un sangrado franc&eacute;s, en primer lugar deber&aacute; introducir el texto que desea que aparezca al principio de la primera l&iacute;nea, pulsar TABULADOR y, a continuaci&oacute;n, introducir el texto restante. Si el sangrado franc&eacute;s no se alinea en la posici&oacute;n elegida, aumente o disminuya la cantidad especificada en la opci&oacute;n Resto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un sangrado franc&eacute;s permite crear un formato parecido a las entradas de glosario, donde el t&eacute;rmino aparece en el extremo izquierdo de la l&iacute;nea y la descripci&oacute;n o definici&oacute;n aparece a la derecha.</P>
<P ALIGN="JUSTIFY"></P>
<U><P ALIGN="JUSTIFY">2.3 El interlineado.</P>
</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El interlineado, consiste en la separaci&oacute;n entre l&iacute;neas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro solamente aplica la opci&oacute;n de interlineado a p&aacute;rrafos enteros. Incluso en el caso de que se seleccione s&oacute;lo una parte del p&aacute;rrafo, el interlineado que se defina afectar&aacute; a todo el p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para aplicar la opci&oacute;n de  interlineado hay que seguir los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Seleccione el texto que desea modificar.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">2. Elija Formato/Interlineado.</P>
<P ALIGN="JUSTIFY"> </P><DIR>
<DIR>

<P ALIGN="JUSTIFY">3. Seleccione pulgadas, cent&iacute;metros, picas, o puntos como unidad de medida.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">4. Especifique el Interlineado que desea aplicar&nbsp;:</P>
<P ALIGN="JUSTIFY">&#9;&#9;* Simple&nbsp;: Muestra el texto seleccionado con interlineado simple.</P>
<P ALIGN="JUSTIFY">&#9;&#9;* 1 ½&nbsp;: Muestra el texto seleccionado con interlineado uno y medio.</P>
<P ALIGN="JUSTIFY">&#9;&#9;* Doble&nbsp;: Muestra el texto seleccionado con interlineado doble.</P><DIR>
<DIR>
<DIR>
<DIR>

<P ALIGN="JUSTIFY">* Especial&nbsp;: Muestra el texto seleccionado con el interlineado que especifique el usuario.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="JUSTIFY">5. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">&#9;Ami Pro muestra el texto seleccionado con el interlineado espec&iacute;fico.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Si desea restaurar el interlineado especificado en el estilo de p&aacute;rrafo, seleccione la opci&oacute;n Restaurar estilo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a ver un ejemplo de todos los tipos de interlineado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P>Esto es una prueba de interlineado simple. Esto es una prueba de interlineado simple.</P>
<P>Esto es una prueba de interlineado simple. Esto es una prueba de interlineado simple.</P>
<P>Esto es una prueba de interlineado simple. Esto es una prueba de interlineado simple</P>

<P>Esto es una prueba de interlineado 1 1/2.Esto es una prueba de interlineado 1 1/2.</P>
<P>Esto es una prueba de interlineado 1 1/2. Esto es una prueba de interlineado 1 1/2.</P>
<P>Esto es una prueba de interlineado 1 1/2.Esto es una prueba de interlineado 1 1/2.</P>

<P>Esto es una prueba de interlineado doble. Esto es una prueba de interlineado doble.</P>
<P>Esto es una prueba de interlineado doble. Esto es una prueba de interlineado doble.</P>
<P>Esto es una prueba de interlineado doble. Esto es una prueba de interlineado doble.</P>

<P>Esto es una prueba de interlineado especial. Esto es una prueba de interlineado especial.</P>
<P>Esto es una prueba de interlineado especial. Esto es una prueba de interlineado especial.</P>
<P>Esto es una prueba de interlineado especial. Esto es una prueba de interlineado especial.</P>

<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- CABECERAS Y PIES.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<U><P ALIGN="JUSTIFY">3.1 Creaci&oacute;n de cabeceras y pies fijos</P>
<P ALIGN="JUSTIFY"></P>
</U><P ALIGN="JUSTIFY">Si desea que la cabecera o pie aparezca en todas las p&aacute;ginas, todas las p&aacute;ginas menos la primera, todas las p&aacute;ginas derechas o todas las izquierdas del documento, puede crear una cabecera o un pie fijos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estos son los pasos para crear cabeceras o pies fijos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">1. En Modo calidad, sit&uacute;e el punto de inserci&oacute;n en la posici&oacute;n de la p&aacute;gina donde desee crear la cabecera o pie.</P>
<P ALIGN="JUSTIFY">Mandato abreviado: Pulse el bot&oacute;n del rat&oacute;n en el margen superior o inferior de la p&aacute;gina correspondiente y dir&iacute;jase al paso 4. Es posible determinar d&oacute;nde se encuentran los m&aacute;rgenes superior e inferior seleccionando Vista/Preferencias y M&aacute;rgenes en color.</P>
<P ALIGN="JUSTIFY">Si ha seleccionado A partir de la segunda p&aacute;gina para la cabecera o pie en el formato, Ami Pro no le permite insertar el punto de inserci&oacute;n en el margen superior ni inferior de la primera p&aacute;gina del documento. Sit&uacute;e el punto de inserci&oacute;n en otra p&aacute;gina para crear o modificar la cabecera o el pie.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P></DIR>
</DIR>

<P ALIGN="JUSTIFY">2. Elija P&aacute;gina/Cabecera/pie.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija Cabecera o Pie.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">4. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">Ami Pro sit&uacute;a el punto de inserci&oacute;n en el margen superior o en el inferior.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Introduzca el texto o cree el marco para una imagen. </P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Es posible colocar una imagen en una cabecera o un pie fijos. Si desea que la imagen aparezca en m&aacute;s de una p&aacute;gina, deber&aacute; especificar Igual en todas las p&aacute;ginas como Posici&oacute;n en el recuadro de di&aacute;logo Modificar formato del marco. De esta manera el marco se convierte en parte del formato de p&aacute;gina y aparece en todas las p&aacute;ginas del documento.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">6. Pulse ESC para volver al texto principal del documento.</P>
<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse sobre cualquier punto del texto principal.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Ami Pro muestra la cabecera o el pie en todas las p&aacute;ginas, sin tener en cuenta en qu&eacute; p&aacute;gina se introdujo.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<U><P ALIGN="JUSTIFY">3.1 Creaci&oacute;n de cabeceras y pies alternos.</P>
</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible crear cabeceras y pies fijos alternos, que muestran informaci&oacute;n distinta en las p&aacute;ginas derecha e izquierda del documento. Las p&aacute;ginas impares est&aacute;n a la derecha y las pares a la izquierda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para crear cabecera o un pie fijos alternos, hay que seguir los siguientes procedimientos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. En Modo calidad, elija P&aacute;gina/Modificar formato p&aacute;gina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Seleccione Derechas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija Aceptar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Sit&uacute;e el punto de inserci&oacute;n en cualquier p&aacute;gina impar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse en los m&aacute;rgenes superior o inferior de la p&aacute;gina correspondiente y vaya al paso 6.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">5. Elija P&aacute;gina/Cabecera/pie.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">6. Seleccione Cabecera o Pie.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">7. Elija Aceptar.</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">8. Introduzca el texto correspondiente o cree un marco de imagen para las p&aacute;ginas impares.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Es posible introducir una imagen en cabeceras o pies fijos alternos. Si desea que la imagen aparezca en p&aacute;ginas alternativas, deber&aacute; especificar Igual en p&aacute;ginas alternativas como Posici&oacute;n en el recuadro de di&aacute;logo Modificar formato del marco. La imagen se convierte en parte del formato de p&aacute;gina y se repite a lo largo del documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9. Pulse ESC para volver al texto principal del documento.</P>
<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse sobre cualquier parte del texto principal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">10. Sit&uacute;e el punto de inserci&oacute;n en cualquier p&aacute;gina par.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse sobre los m&aacute;rgenes superior o inferior de cualquier p&aacute;gina par y repita los pasos 8 y 9.</P>
<P ALIGN="JUSTIFY">Ami Pro muestra la cabecera o el pie de la p&aacute;gina izquierda en todas las p&aacute;ginas pares y la cabecera o el pie de la derecha en todas las p&aacute;ginas impares del  documento.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<U><P ALIGN="JUSTIFY">3.3 Supresi&oacute;n de cabeceras y pies.</P>
</U><P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Es posible eliminar una cabecera o un pie fijos cuando ya no necesita que la informaci&oacute;n aparezca en los m&aacute;rgenes superior o inferior del documento.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Para suprimir cabeceras o pies  hay que proceder de la siguiente manera&nbsp;:</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">1. En Modo calidad, sit&uacute;e el punto de inserci&oacute;n en cualquier p&aacute;gina que contenga una cabecera o un pie.</P>
<P ALIGN="JUSTIFY">Mandato abreviado: Pulse el bot&oacute;n del rat&oacute;n en el margen superior o inferior de la p&aacute;gina correspondiente y dir&iacute;jase al paso 5.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">2. Elija P&aacute;gina/Cabecera/pie.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">3. Elija Cabecera o Pie.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Elija Aceptar.</P>
<P ALIGN="JUSTIFY">Ami Pro sit&uacute;a el punto de inserci&oacute;n en el margen superior o en el inferior.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5.  Suprima el texto o la imagen del margen superior o del inferior.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6.  Pulse ESC para volver al texto principal del documento.</P>
<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse sobre cualquier parte del documento principal.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Si necesita suprimir una cabecera o un pie alterno, repita los pasos 2 a 6 en la cabecera o pie que aparezca en las p&aacute;ginas alternas.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">4.- MARGENES Y TABULADORES.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<OL>

<U><P ALIGN="JUSTIFY"><LI>M&aacute;rgenes.</LI></P></OL>

</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible especificar los m&aacute;rgenes derecho, izquierdo, superior e inferior, el n&uacute;mero de columnas y el espacio entre columnas para todo el documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Modificar de m&aacute;rgenes y columnas se realiza de la siguiente forma&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Elija P&aacute;gina/Modificar formato de p&aacute;gina.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse el bot&oacute;n derecho del rat&oacute;n cuando el puntero del rat&oacute;n se encuentre en cualquier &aacute;rea del margen.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">2. Seleccione M&aacute;rgenes y columnas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Seleccione los m&aacute;rgenes y las columnas correspondientes.</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">4. Para cambiar el margen izquierdo, coloque el puntero del rat&oacute;n en la flecha negra s&oacute;lida situada en la parte inferior izquierda de la regleta y arr&aacute;strela hasta la posici&oacute;n adecuada; tambi&eacute;n es posible especificar el margen en el recuadro de texto Izquierdo.</P>
<P ALIGN="JUSTIFY">Teclado: Pulse TAB para situar el punto de inserci&oacute;n en la regleta; a continuaci&oacute;n, utilice las teclas de movimiento del cursor para desplazar la l&iacute;nea negra vertical hasta la posici&oacute;n apropiada. Por &uacute;ltimo, pulse [ para definir el margen izquierdo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Para cambiar el margen derecho, coloque el puntero del rat&oacute;n en la flecha negra vertical situada en la parte inferior derecha de la regleta y arr&aacute;strela hasta la posici&oacute;n adecuada, o bien especifique el margen derecho correspondiente directamente en el recuadro de texto Derecho.</P>
<P ALIGN="JUSTIFY">Teclado: Pulse TAB para situar el punto de inserci&oacute;n en la regleta; a continuaci&oacute;n utilice las teclas de movimiento del cursor para desplazar la l&iacute;nea negra vertical hasta la posici&oacute;n apropiada. Por &uacute;ltimo, pulse ] para definir el margen derecho.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Para modificar la anchura de dos columnas adyacentes, sit&uacute;e el puntero en la mitad inferior de la regleta, entre el indicador del margen derecho de un a columna y el del margen izquierdo de la siguiente; a continuaci&oacute;n arrastre el rat&oacute;n en la direcci&oacute;n conveniente. Cuando las columnas tengan la anchura adecuada, suelte el bot&oacute;n. </P></DIR>
</DIR>

<P ALIGN="JUSTIFY"> </P><DIR>
<DIR>

<P ALIGN="JUSTIFY">7. Para modificar el espacio comprendido entre las columnas, especifique la Distancia entre columnas pertinente.</P>
<P ALIGN="JUSTIFY">Si desea que la distancia entre las distintas columnas sea diferente, desplace los indicadores de margen correspondientes en la regleta hasta establecer las distancias adecuadas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8. Para modificar la distancia entre las distintas columnas adyacentes sin alterar la anchura de las columnas, sit&uacute;e el puntero en la mitad inferior de la regleta entre los indicadores de margen izquierdo y derecho de la misma columna; a continuaci&oacute;n, arrastre el rat&oacute;n en la direcci&oacute;n apropiada. Una vez establecida la distancia adecuada entre las columnas, suelte el bot&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9. Si desea que la longitud de las columnas sea semejante, selecciones Columnas uniformes.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">En p&aacute;ginas de texto completas, Ami Pro intenta situar siempre la misma cantidad de texto en todas las columnas, sin tener en cuenta si se ha seleccionado Columnas uniformes o no. Por tanto esta opci&oacute;n resulta de utilidad para alinear horizontalmente el texto de la &uacute;ltima p&aacute;gina de un documento o de un formato de p&aacute;gina cuando no ocupa la p&aacute;gina completa.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">5.- NUMERAR P&Aacute;GINAS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro permite numerar de forma autom&aacute;tica las p&aacute;ginas de un documento y especificar el tipo de numeraci&oacute;n, la p&aacute;gina y el n&uacute;mero a partir de los cuales va a comenzar la numeraci&oacute;n y cualquier texto que desee situar delante de los n&uacute;meros de p&aacute;gina. La opci&oacute;n Numeraci&oacute;n de p&aacute;ginas puede seleccionarse desde cualquier p&aacute;gina del documento. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para que los n&uacute;meros de p&aacute;gina aparezcan en todo el documento puede situarlos en el margen superior o inferior como parte de una cabecera o un pie. Si ha especificado Derechas e Izquierdas en el formato de p&aacute;gina, o ha insertado cabeceras y pies flotantes en el documento, es probable que necesite situar los n&uacute;meros en m&aacute;s de una p&aacute;gina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando queramos que la numeraci&oacute;n sea autom&aacute;tica  hay que realizar los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">1. En Modo calidad, sit&uacute;e el punto de inserci&oacute;n en el margen superior o inferior de cualquier p&aacute;gina del documento.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">2. Elija P&aacute;gina/Numeraci&oacute;n de p&aacute;ginas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Elija el tipo de numeraci&oacute;n. Puede especificar 1, I, i, A, o a.</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">4. Para comenzar la numeraci&oacute;n en una p&aacute;gina que no sea la primera, elija Comenzar en p&aacute;gina y especifique el n&uacute;mero adecuado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Para comenzar la numeraci&oacute;n a partir de un n&uacute;mero que no sea el uno, elija Comenzar por n&uacute;mero y especifique el n&uacute;mero adecuado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Para introducir texto delante del n&uacute;mero de p&aacute;gina, teclee el texto y los espacios en el recuadro Texto precedente. Es posible introducir hasta 30 caracteres.</P>
<P ALIGN="JUSTIFY">Ami Pro incluye de forma autom&aacute;tica el texto en el Indice y el Indice alfab&eacute;tico cuando utiliza estas funciones. Se puede utilizar Texto precedente para crear n&uacute;meros de p&aacute;gina tales como P&aacute;gina 1, P&aacute;gina 2, etc.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">7. Elija Aceptar.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Para introducir texto o espacios despu&eacute;s del n&uacute;mero de p&aacute;gina, tecl&eacute;elos como parte de la cabecera o el pie despu&eacute;s de que Ami Pro introduzca el n&uacute;mero. Tambi&eacute;n puede asignar realces con el men&uacute; Formato o un estilo de p&aacute;rrafo, tanto al texto como al n&uacute;mero de p&aacute;gina.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">Es posible modificar la numeraci&oacute;n de las p&aacute;ginas en un documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para cambiar los n&uacute;meros de p&aacute;gina, hay que seguir los pasos siguientes&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Borre el n&uacute;mero de la p&aacute;gina que desea cambiar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Elija P&aacute;gina/Numeraci&oacute;n de p&aacute;ginas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Especifique las opciones adecuadas.</P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
