<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 6.<br>Impresión
</H3>
<p align=justify>
<P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- Impresi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con esta Unidad trato de explicar la forma de imprimir los documentos y paginas de estos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.-IMPRESION.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde Ami Pro se puede imprimir el documento que aparece en la ventana activa. Aunque la impresi&oacute;n se realiza normalmente en primer plano (no se puede realizar otra acci&oacute;n hasta que la informaci&oacute;n necesaria se haya enviado a Windows), Ami Pro ofrece la posibilidad de imprimir en segundo plano.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Puede especificar las p&aacute;ginas que desea imprimir y c&oacute;mo deben aparecer cuando use la funci&oacute;n Imprimir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La impresi&oacute;n del documento puede realizarse de la siguiente forma&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Active la ventana que contiene el documento que desea imprimir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Elija Archivo/Imprimir.</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Ami Pro muestra el nombre de la impresora y el puerto al que est&aacute; conectada en el &aacute;ngulo inferior izquierdo del recuadro de di&aacute;logo Imprimir. Es posible cambiar la impresora para el documento actual utilizando Especificar impresora.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">3. Especifique el n&uacute;mero de copias que desea realizar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Especifique Todas o P&aacute;gina actual como Grupo de p&aacute;ginas. </P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">5. Si desea imprimir solamente ciertas p&aacute;ginas, especifique los n&uacute;meros de p&aacute;gina inicial y final en los recuadros de texto De y A.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Seleccione las p&aacute;ginas que desea imprimir dentro del grupo. Puede elegir P&aacute;ginas pares, P&aacute;ginas impares o Ambas.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">7. Para especificar opciones de impresi&oacute;n y bandejas, elija Opciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8. Seleccione las Opciones de impresi&oacute;n adecuadas&nbsp;:</P><DIR>
<DIR>

<P ALIGN="JUSTIFY">* Invertir orden&nbsp;: Empieza a imprimir a partir de la &uacute;ltima p&aacute;gina, sigue con la pen&uacute;ltima y as&iacute; sucesivamente.</P>
<P ALIGN="JUSTIFY">*  Clasificar&nbsp;: Imprime una copia completa del documento antes de imprimir la copia siguiente. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si especifica varias copias y no elige Clasificar, Ami Pro imprime todas las copias de la p&aacute;gina 1, a continuaci&oacute;n todas las copias de la p&aacute;gina 2 y as&iacute; sucesivamente.</P>
<P ALIGN="JUSTIFY">* Marcas de corte&nbsp;: Imprime l&iacute;neas finas que indican las esquinas de la p&aacute;gina. Imprime marcas de corte a media pulgada de la esquina superior izquierda de la p&aacute;gina f&iacute;sica.  Utilice las marcas de corte cuando el tama&ntilde;o especificado en el formato de p&aacute;gina sea menor que el tama&ntilde;o f&iacute;sico del papel. Si el tama&ntilde;o especificado en el formato de p&aacute;gina coincide con el tama&ntilde;o f&iacute;sico del papel, solamente se imprimir&aacute; la marca de corte de la esquina superior izquierda.</P>
<P ALIGN="JUSTIFY">* Sin im&aacute;genes&nbsp;: S&oacute;lo imprime el texto del documento. Los marcos que contienen im&aacute;genes se imprimen como marcos vac&iacute;os. Si el documento contiene im&aacute;genes, al seleccionar Sin im&aacute;genes disminuir&aacute; considerablemente el tiempo de impresi&oacute;n.</P>
<P ALIGN="JUSTIFY">* Con notas&nbsp;: Imprime las iniciales del usuario en la posici&oacute;n que ocupan las notas en el texto y el contenido de todas las notas al final del documento. Para que las iniciales se impriman, es preciso haberlas especificado en el recuadro de di&aacute;logo Configuraci&oacute;n. </P>
<P ALIGN="JUSTIFY">* Con descripci&oacute;n doc.&nbsp;: Imprime la informaci&oacute;n sobre el documento como p&aacute;gina de cubierta.</P>
<P ALIGN="JUSTIFY">* En papel preimpreso&nbsp;: Cuando se selecciona esta opci&oacute;n, Ami Pro no imprime el texto protegido ni las l&iacute;neas y sombras de marcos y tablas.</P>
<P ALIGN="JUSTIFY">* Actualizar campos&nbsp;: Actualiza los resultados de todos los campos de acci&oacute;n del documento y los imprime en la posici&oacute;n en que se hallan los campos.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">9. Seleccione las opciones de bandeja adecuadas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">10. Elija Aceptar para volver al recuadro de di&aacute;logo Imprimir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">11. Para seleccionar opciones de configuraci&oacute;n de la impresora, elija Especificar. </P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<P ALIGN="JUSTIFY">Las opciones que especifique afectar&aacute;n a todos los documentos que imprima desde Windows. Si modifica la configuraci&oacute;n de la impresora para el documento actual pero prefiere utilizar la configuraci&oacute;n original para otro documento, elija Archivo/Especificar impresora y modifique los par&aacute;metros despu&eacute;s de haber imprimido el documento actual.</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">12. Elija Aceptar para volver al recuadro de di&aacute;logo Imprimir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">13. Elija Aceptar para imprimir el documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro muestra un mensaje para indicar que est&aacute; imprimiendo el documento. Elija Cancelar si desea anular el proceso de impresi&oacute;n. AmiPrint permite disminuir el periodo de tiempo que permanece el mensaje en pantalla.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
