<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 7.<br>Estilos en Ami Pro 3.1
</H3>
<p align=justify>
<B><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- Las hojas de estilos.</P>
<P ALIGN="JUSTIFY">3.- Conceptos b&aacute;sicos.</P>
<P ALIGN="JUSTIFY">4.- Asignaci&oacute;n de estilos de p&aacute;rrafo mediante Formato r&aacute;pido.</P>
<P ALIGN="JUSTIFY">5.- Asignaci&oacute;n de estilos de p&aacute;rrafo mediante el indicador de estilo.</P>
<P ALIGN="JUSTIFY">6.- Asignaci&oacute;n de estilos de p&aacute;rrafo mediante la ventana de estilos.</P>
<P ALIGN="JUSTIFY">7.- Almacenamiento como hoja de estilo.</P>
<P ALIGN="JUSTIFY">8.- Gesti&oacute;n de estilos de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY">9.- Modificaci&oacute;n de estilos de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nos hemos familiarizado con el procesador, por lo tanto vamos a entrar en temas m&aacute;s avanzados.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- LAS HOJAS DE ESTILOS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro viene con una serie de estilos o plantillas ya creados, lo que facilita mucho el trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando empezamos un documento, tenemos la oportunidad de decidir qu&eacute; estilo queremos usar. La hoja de estilo es como una plantilla que tiene un formato predefinido, que se puede dar tanto para la p&aacute;gina como para los p&aacute;rrafos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El formato de p&aacute;gina incluye toda la informaci&oacute;n de formato de una p&aacute;gina y determina el aspecto de &eacute;sta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando acudimos a la opci&oacute;n <I>Nuevo</I> desde el menu<I> Archivo</I>, nos encontramos con el cuadro de dialogo de los estilos posibles.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><center><IMG SRC="gif/ami4.gif" ></center></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los posibles estilos que figuran ya predefinidos son los siguientes&nbsp;:</P>

<UL>

<UL>
<P ALIGN="JUSTIFY"><LI>Agendas</LI></P>
<P ALIGN="JUSTIFY"><LI>Formularios Comerciales</LI></P>
<P ALIGN="JUSTIFY"><LI>Hojas de Fax</LI></P>
<P ALIGN="JUSTIFY"><LI>Portadas</LI></P>
<P ALIGN="JUSTIFY"><LI>Transparencias</LI></P>
<P ALIGN="JUSTIFY"><LI>Notas de prensas</LI></P>
<P ALIGN="JUSTIFY"><LI>Esquemas</LI></P>
<P ALIGN="JUSTIFY"><LI>Boletines</LI></P>
<P ALIGN="JUSTIFY"><LI>Memoradums</LI></P>
<P ALIGN="JUSTIFY"><LI>Cartas</LI></P>
<P ALIGN="JUSTIFY"><LI>Informes.</LI></P></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estos son los tipos de estilos que ya hay predefinidos, pero se puede definir el usuario.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- CONCEPTOS BASICOS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los estilos de p&aacute;rrafo de Ami Pro incluyen informaci&oacute;n completa de formato de texto y determinan el modo en que se presentan los documentos inicialmente. Los estilos de p&aacute;rrafo se incluyen en la hoja de estilos que se selecciona al crear un documento y contienen informaci&oacute;n de formato predefinida para p&aacute;rrafos de texto. Ami Pro define un p&aacute;rrafo como todo texto, caracteres y espacios incluidos entre dos retornos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A medida que se escribe y edita un documento, se pueden asignar distintos estilos de p&aacute;rrafo al texto. Ami Pro asigna un formato al texto utilizando la informaci&oacute;n que contiene el estilo de p&aacute;rrafo asignado a dicho texto. Ami Pro mostrar&aacute; el nombre del estilo de p&aacute;rrafo actual en el bot&oacute;n indicador de estilos de la barra de estado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los par&aacute;metros de estilo de p&aacute;rrafo comprenden las siguientes opciones:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>Familia de tipos de letra, tama&ntilde;o, color y atributos como negrita y cursiva.</LI></P>
<P ALIGN="JUSTIFY"><LI>Tabuladores izquierdo, derecho, num&eacute;rico, centro y car&aacute;cter de relleno, sangrado y sangrado franc&eacute;s.</LI></P>
<P ALIGN="JUSTIFY"><LI>Alineaci&oacute;n izquierda, derecha, centrado o alineaci&oacute;n justificada. </LI></P>
<P ALIGN="JUSTIFY"><LI>Interlineado, espaciado de p&aacute;rrafos y densidad de texto.</LI></P>
<P ALIGN="JUSTIFY"><LI>Cambio de p&aacute;gina antes, despu&eacute;s o dentro de estilo de p&aacute;rrafo, as&iacute; como mantenimiento de un p&aacute;rrafo unido al p&aacute;rrafo anterior o al siguiente.</LI></P>
<P ALIGN="JUSTIFY"><LI>Colocaci&oacute;n delante de un p&aacute;rrafo de un topo, n&uacute;mero o texto.</LI></P>
<P ALIGN="JUSTIFY"><LI>Colocaci&oacute;n de una l&iacute;nea sobre o debajo de un p&aacute;rrafo, as&iacute; como la posici&oacute;n y tipo de la l&iacute;nea.</LI></P></UL>


<UL>
<P ALIGN="JUSTIFY"><LI>Formato de los datos num&eacute;ricos en una tabla de Ami Pro.</LI></P>
<P ALIGN="JUSTIFY"><LI>Divisi&oacute;n de palabras cuando son demasiado largas para caber en una l&iacute;nea.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si el nombre de un estilo de p&aacute;rrafo aparece en el bot&oacute;n indicador de estilo en rojo (en gris si se trata de un monitor monocromo), el estilo de p&aacute;rrafo asignado a dicho texto no se encuentra disponible en la hoja de estilos o documento actuales. Es posible que haya importado o pegado texto de un documento a otro o que haya utilizado otra hoja de estilos en un documento, o que haya eliminado un estilo de p&aacute;rrafo. Cuando esto ocurre, puede optarse por asignar a todos los p&aacute;rrafos un estilo de los que se encuentren disponibles o crear un estilo de p&aacute;rrafo de igual nombre y caracter&iacute;sticas que el asignado al texto del documento original.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P>4.- ASIGNACI&Oacute;N DE ESTILOS DE P&Aacute;RRAFO MEDIANTE FORMATO R&Aacute;PIDO.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible utilizar Formato r&aacute;pido para extraer un formato de estilo de p&aacute;rrafo de un texto y r&aacute;pidamente aplicar dicho formato a otro texto en un documento principal, tabla o marco.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Asimismo, es posible utilizar Formato r&aacute;pido para extraer formato de texto y aplicarlo a otro texto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La asignaci&oacute;n de estilo a un p&aacute;rrafo mediante Formato r&aacute;pido se debe hacer de la siguiente forma&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n en el p&aacute;rrafo que cuenta con el formato seleccionado</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Seleccione Formato/Formato r&aacute;pido</P>
<P ALIGN="JUSTIFY">&#9;Teclado: Pulse CTRL + F.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Seleccione S&oacute;lo estilo de p&aacute;rrafo.</P>


<P ALIGN="JUSTIFY">* S&oacute;lo tipo de letra y atributos de texto.&nbsp;: Utiliza todo el formato de texto de la palabra donde se encuentra el punto de inserci&oacute;n. </P>
<P ALIGN="JUSTIFY">El formato de texto es la familia de tipo de letra, tama&ntilde;o de letra, color, atributos (negrita, cursiva, subrayado, subrayado palabras), may&uacute;sculas o efectos especiales que se aplica al texto seleccionado utilizando SmartIcons, la barra de estado o el men&uacute; Formato.</P>
<P ALIGN="JUSTIFY">* S&oacute;lo estilo de p&aacute;rrafo&nbsp;: Utiliza todo el formato de estilo de p&aacute;rrafo del p&aacute;rrafo donde se encuentra el punto de inserci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Elija  Aceptar.</P>
<P ALIGN="JUSTIFY">&#9;El puntero del rat&oacute;n adquiere la forma de un pincel.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">5. Seleccione los p&aacute;rrafos a los que desea aplicar el formato de p&aacute;rrafo y suelte el bot&oacute;n del rat&oacute;n.</P>
<P ALIGN="JUSTIFY">Ami Pro asigna el estilo de p&aacute;rrafo al texto seleccionado. De esta forma, el texto aparecer&aacute; con el formato de estilo de p&aacute;rrafo que usted ha seleccionado.</P>
<P ALIGN="JUSTIFY">Ami Pro cambia el estilo de p&aacute;rrafo pero no reemplaza ning&uacute;n formato de texto o cambios efectuados en el texto aplicados con anterioridad. Por ejemplo, si ha aplicado un formato de estilo de p&aacute;rrafo de Helvetica a un texto que se hab&iacute;a cambiado a Palatino con anterioridad, el texto aparecer&aacute; en Palatino. Puede seleccionar el texto y, a continuaci&oacute;n, Formato/Normal para utilizar el formato de estilo de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Si desea aplicar el formato de estilo de p&aacute;rrafo seleccionado a otros p&aacute;rrafos, repita el punto 5.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">7. Cuando ya no desee aplicar el formato de estilo de p&aacute;rrafo, elija Formato/Formato r&aacute;pido.</P>


<P ALIGN="JUSTIFY">&#9;Teclado: Pulse ESC.</P>
<P ALIGN="JUSTIFY">&#9;El puntero del rat&oacute;n adquiere la forma de un cursor vertical.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P>5.- ASIGNACI&Oacute;N DE ESTILOS DE P&Aacute;RRAFO MEDIANTE EL INDICADOR DE ESTILO</B>.</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible asignar estilos de p&aacute;rrafo mediante el indicador de estilo de la barra de estado.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1.  Sit&uacute;e el punto de inserci&oacute;n dentro del p&aacute;rrafo al que desea asignar un estilo o seleccione los p&aacute;rrafos correspondientes.</P>
<P ALIGN="JUSTIFY"></P>


<OL START=2>

<P ALIGN="JUSTIFY"><LI>Pulse sobre el estilo de p&aacute;rrafo apropiado en el indicador de estilo de la barra de estado.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P>6.- ASIGNACI&Oacute;N DE ESTILOS DE P&Aacute;RRAFO MEDIANTE LA VENTANA DE ESTILOS.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es posible asignar estilos de p&aacute;rrafo mediante la ventana de estilos.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n dentro del p&aacute;rrafo al que desea asignar un estilo o seleccione los p&aacute;rrafos correspondientes.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Pulse CTRL+Y para pasar a la ventana de estilos.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Utilice las teclas de movimiento del cursor para desplazarse por los estilos de p&aacute;rrafo hasta que el que desea emplear se encuentre resaltado.</P>
<P ALIGN="JUSTIFY">Teclas r&aacute;pidas: Pulse la tecla de funci&oacute;n que precede al estilo de p&aacute;rrafo apropiado para asignar el estilo de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Pulse la BARRA ESPACIADORA o INTRO para asignar un estilo de p&aacute;rrafo al texto del documento.</P>
<P ALIGN="JUSTIFY">Pulse ESC para salir de la ventana de estilos sin asignar m&aacute;s estilos de p&aacute;rrafo. Si la ventana de estilos permanece en pantalla, podr&aacute; ocultarla eligiendo Vista/Ocultar ventana de estilos.</P>
<P ALIGN="JUSTIFY"></P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">7.- ALMACENAMIENTO COMO HOJA DE ESTILO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Para crear una hoja de estilos, deber&aacute; modificar un documento que utilice una existente y, a continuaci&oacute;n, almacenar los cambios en la nueva hoja.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando se crean o se modifican estilos de p&aacute;rrafo o se cambia el formato de p&aacute;gina, Ami Pro almacena en el documento toda la informaci&oacute;n de formato; por tanto, todos los cambios quedan recogidos en el mencionado documento. En el caso de que desee tener acceso a los estilos y formato de p&aacute;gina modificados para aplicarlos a otros documentos, deber&aacute; almacenarlos bien en la hoja actual o bien en una nueva hoja de estilos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si s&oacute;lo ha modificado los estilos de p&aacute;rrafo y desea utilizarlos en otros documentos puede hacerlo, asimismo, con Gesti&oacute;n de estilos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al utilizar Guardar como hoja de estilos, Ami Pro desplaza la informaci&oacute;n de formato almacenada en el documento a la hoja de estilos que se especifique y elimina los topos situados delante de cualquier nombre de estilo de p&aacute;rrafo; esto indica que la informaci&oacute;n de formato se encuentra ahora almacenada en la hoja de estilos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De la misma manera, Ami Pro almacena las descripciones especificadas en el recuadro de di&aacute;logo Informaci&oacute;n sobre el documento. Para poder ver la descripci&oacute;n de la hoja de estilos, deber&aacute; elegir Archivo/Nuevo y, a continuaci&oacute;n, Mostrar descripci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los cambios introducidos podr&aacute;n almacenarse en la hoja de estilos actual (la asociada al documento actual) o en una nueva creada por el usuario.</P>
<P ALIGN="JUSTIFY"></P>


<OL>

<P ALIGN="JUSTIFY"><LI>Seleccione Estilo/Guardar como hoja de estilos.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Escriba un nombre de archivo para la hoja de estilos. El nombre puede tener hasta 8 caracteres, un punto y la extensi&oacute;n STY, que sirve para indicar que el archivo es una hoja de estilos.</P>
<P ALIGN="JUSTIFY">Para crear una hoja de estilos con un nuevo nombre, introduzca un nombre de archivo para la nueva hoja. La hoja de estilos actual no se modificar&aacute;. Si desea mantener los cambios realizados en la hoja de estilos actual, no modifique su nombre: los documentos que obtengan informaci&oacute;n de formato de dicha hoja de estilos utilizar&aacute;n los par&aacute;metros nuevos. </P>
<P ALIGN="JUSTIFY">Si almacena los cambios en una hoja de estilos incluida en el paquete de Ami Pro, se reemplazar&aacute; la hoja de estilos original. Para recuperarla, deber&aacute; volver a instalar Ami Pro.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Escriba la descripci&oacute;n de la hoja de estilos.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Si desea incluir en la nueva hoja el texto, los marcos, las tablas y los gr&aacute;ficos del documento, seleccione la opci&oacute;n Incluir contenido.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Si desea que Ami Pro ejecute una macro cada vez que se elija Archivo/Nuevo y se seleccione esta hoja, deber&aacute; seleccionar la opci&oacute;n Ejecutar macro.</P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n pulse sobre la flecha o pulse la tecla de cursor abajo con el punto de inserci&oacute;n en el recuadro de texto, con lo que ver&aacute; una lista de las macros existentes en el directorio especificado en Ami Pro.</P>
<P ALIGN="JUSTIFY">Utilice esta opci&oacute;n para insertar en un documento retornos, puntos de referencia, fechas, n&uacute;meros de p&aacute;gina, etc. autom&aacute;ticamente.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">6. Seleccione Aceptar.</P>


<P ALIGN="JUSTIFY">Ami Pro incorpora la informaci&oacute;n almacenada en el documento a la hoja de estilos especificada y suprime los topos situados delante de los nombres de estilo, lo que indica que la informaci&oacute;n de formato se encuentra almacenada en la hoja de estilos. Cualquier documento que utilice informaci&oacute;n de formato o de p&aacute;gina procedente de la hoja de estilos, utilizar&aacute; los par&aacute;metros modificados.</P>
<P ALIGN="JUSTIFY"></P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">8.- GESTI&Oacute;N DE ESTILOS DE P&Aacute;RRAFO.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Para gestionar los estilos de p&aacute;rrafo, deber&aacute; utilizar la opci&oacute;n Gesti&oacute;n de estilos tanto si almacena la informaci&oacute;n de formato para los estilos de p&aacute;rrafo en el documento actual como si lo hace en la hoja de estilos. Esta opci&oacute;n permite desplazar estilos entre el documento y la hoja, restaurar estilos para que vuelvan a tener los par&aacute;metros de la hoja, eliminar estilos y asignar teclas de funci&oacute;n a estilos de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Elija Estilos/Gesti&oacute;n de estilos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Seleccione un estilo de p&aacute;rrafo de los que aparecen en los recuadros de lista.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">* Estilos del documento&nbsp;: Los estilos de p&aacute;rrafo almacenados en el documento aparecen en el recuadro de lista Estilos del documento. Estos estilos ya se han modificado y s&oacute;lo pueden usarse en el documento actual. Cada vez que modifique un estilo de p&aacute;rrafo o cree uno nuevo, aparecer&aacute; su nombre con un topo. </P>
<P ALIGN="JUSTIFY">Por ejemplo, si se cambia el tipo de letra del estilo Est&aacute;ndar y, en consecuencia, se modifica, Ami Pro traslada Est&aacute;ndar de la opci&oacute;n Estilos de la hoja al recuadro de lista Estilos del documento.</P>
<P ALIGN="JUSTIFY">* Estilos de la hoja&nbsp;: Los estilos almacenados en la hoja de estilos asociada al documento actual aparecen en el recuadro de lista Estilos de la hoja. Estos estilos no han sido modificados en el documento, por tanto, Ami Pro almacena la informaci&oacute;n de formato sobre dichos estilos en la hoja relacionada con el documento. </P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">3. Elija los botones de selecci&oacute;n o de mandato correspondientes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4.Elija Aceptar para volver al documento.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">9.- MODIFICACI&Oacute;N DE ESTILOS DE P&Aacute;RRAFO.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">La opci&oacute;n Modificar del men&uacute; Estilos vuelve a asignar formato al texto de un documento utilizando un estilo de p&aacute;rrafo determinado. Es posible especificar el tipo de letra, alineaci&oacute;n, tabuladores, sangrado, espaciado, cambios de p&aacute;gina, topos, n&uacute;meros, texto precedente, l&iacute;neas, formato de tabla y divisi&oacute;n de palabras que se desee. Ami Pro ofrece ejemplos que permiten comprobar el aspecto que tendr&aacute; el documento a medida que se introducen los cambios.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Elija Estilo/Modificar.</P>


<P ALIGN="JUSTIFY">Rat&oacute;n: Pulse el bot&oacute;n derecho del rat&oacute;n una vez que el punto de inserci&oacute;n se encuentre en el texto principal del documento. Teclado: Pulse CTRL+E.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Seleccione el estilo de p&aacute;rrafo objeto de la modificaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Seleccione la opci&oacute;n de Modificar que desee aplicar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4. Elija el bot&oacute;n de mandato correspondiente.</P>


<P ALIGN="JUSTIFY">* Aceptar&nbsp;: Almacena los par&aacute;metros de estilo de p&aacute;rrafo y cierra el recuadro de di&aacute;logo Modificar estilo.</P>


<P ALIGN="JUSTIFY">&#9;* Cancelar&nbsp;: Cierra el recuadro de di&aacute;logo Modificar estilo sin almacenar los cambios.</P>


<P ALIGN="JUSTIFY">* Guardar&nbsp;: Almacena los par&aacute;metros de estilo de p&aacute;rrafo sin cerrar el recuadro de di&aacute;logo Modificar estilo. Este m&eacute;todo permite modificar varios estilos de p&aacute;rrafo.</P>
<P ALIGN="JUSTIFY">* Guardar como&nbsp;: Almacena los par&aacute;metros de estilo de p&aacute;rrafo en un estilo de p&aacute;rrafo nuevo.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Ami Pro vuelve a asignar un formato al texto del documento que utilice dicho estilo de p&aacute;rrafo. El nombre de estilo de p&aacute;rrafo aparece en la barra de estado y en la ventana de estilos junto con un topo (punto). Esto indica que la informaci&oacute;n de formato correspondiente al estilo de p&aacute;rrafo se encuentra almacenada en el documento y no en la hoja de estilos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si ha modificado previamente texto seleccionado en un p&aacute;rrafo cualquiera con dicho estilo de p&aacute;rrafo, los atributos y realces aplicados invalidan los par&aacute;metros del estilo de p&aacute;rrafo. Puede seleccionar el p&aacute;rrafo y elegir Formato/Normal para utilizar los par&aacute;metros del estilo de p&aacute;rrafo. El estilo de p&aacute;rrafo modificado se encontrar&aacute; disponible para otros documentos si lo almacena en la hoja de estilos.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
