<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 8.<br>Introducci&oacute;n
</H3>
<p align=justify>
<B><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- Sin&oacute;nimos.</P>
<P ALIGN="JUSTIFY">3.- Ortograf&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro incluye varias herramientas de consulta&nbsp;: el diccionario de sin&oacute;nimos, muy &uacute;til para buscar definiciones, variaciones sem&aacute;nticas y sin&oacute;nimos de palabras por los que sustituir los t&eacute;rminos de un documento&nbsp;; y la ortograf&iacute;a, que permite revisar las palabras que nos confundimos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- SINONIMOS.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro posee un diccionario de sin&oacute;nimos de miles de palabras donde buscar definiciones, variaciones sem&aacute;nticas y sin&oacute;nimos con los que sustituir texto de un documento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para buscar sin&oacute;nimos se hace de la siguiente manera&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Seleccione la palabra que desea buscar o sit&uacute;e el punto de inserci&oacute;n sobre ella. Si selecciona m&aacute;s de una palabra, Ami Pro s&oacute;lo buscar&aacute; la primera.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Elija Herramientas/Sin&oacute;nimos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Ami Pro muestra la siguiente informaci&oacute;n:</P>
<P ALIGN="JUSTIFY">&#9;&#9;* Palabra consultada&nbsp;: Palabra seleccionada en el documento.</P>
<P ALIGN="JUSTIFY">&#9;&#9;* Variaciones de significado&nbsp;: Posibles acepciones de la palabra seleccionada.</P>




<P ALIGN="JUSTIFY">* Significado&nbsp;: Definici&oacute;n del t&eacute;rmino resaltado en el recuadro Variaciones de significado.</P>
<P ALIGN="JUSTIFY">* Sin&oacute;nimos&nbsp;: Palabras alternativas al t&eacute;rmino resaltado en el recuadro Variaciones de significado.</P>




<P ALIGN="JUSTIFY">&#9;&#9;* Sustituir por&nbsp;: Palabra resaltada en el recuadro Sin&oacute;nimos.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Si desea obtener informaci&oacute;n sobre una acepci&oacute;n, seleccione otro t&eacute;rmino en el recuadro de lista Variaciones de significado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5. Cuando quiera cambiar la palabra del recuadro de texto Sustituir por, seleccione otra en Sin&oacute;nimos o introd&uacute;zcala manualmente en dicho recuadro de texto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6. Para acceder a la informaci&oacute;n sobre un sin&oacute;nimo, seleccione una palabra en el recuadro Sin&oacute;nimos y elija Consultar, o bien introduzca manualmente la palabra en el recuadro de texto Sustituir por y elija Consultar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">7. Elija Anterior en caso de necesitar consultar otra vez la palabra anterior, sus acepciones, sus sin&oacute;nimos y su definici&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8. Si desea sustituir la palabra seleccionada en el documento por la del recuadro Sustituir por, elija Sustituir.</P>
<P ALIGN="JUSTIFY"></P>


<OL START=9>

<P ALIGN="JUSTIFY"><LI>Elija Cancelar para volver al documento.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- ORTOGRAFIA.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Mediante Ortograf&iacute;a puede revisar las palabras con errores ortogr&aacute;ficos y sustituirlas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n donde desee que comience la revisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2. Elija Herramientas/Ortograf&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Seleccione las opciones correspondientes.</P>




<P ALIGN="JUSTIFY">* Verificar desde principio de documento&nbsp;: Ami Pro revisa todo el texto desde el principio del documento, sin tener en cuenta d&oacute;nde estaba el punto de inserci&oacute;n cuando eligi&oacute; Herramientas/Ortograf&iacute;a. Si anula la selecci&oacute;n de esta opci&oacute;n, la revisi&oacute;n comenzar&aacute; donde se encuentre el punto de inserci&oacute;n. Si el punto de inserci&oacute;n no se encuentra en la unidad de texto principal del documento, Ami Pro anula la selecci&oacute;n de esta opci&oacute;n y la aten&uacute;a autom&aacute;ticamente.</P>
<P ALIGN="JUSTIFY">* Incluir otras unidades de texto&nbsp;: Ami Pro revisa el texto de la unidad en la que se encuentra el punto de inserci&oacute;n y el de todas las unidades de categor&iacute;a inferior. Si anula la selecci&oacute;n de esta opci&oacute;n, la revisi&oacute;n comenzar&aacute; donde se encuentra el punto de inserci&oacute;n. Si el punto de inserci&oacute;n no se encuentra en la unidad de texto principal del documento, Ami Pro anula la selecci&oacute;n de esta opci&oacute;n y la aten&uacute;a autom&aacute;ticamente.</P>
<P ALIGN="JUSTIFY"></P>




<OL START=4>

<P ALIGN="JUSTIFY"><LI>Elija Aceptar para comenzar la revisi&oacute;n ortogr&aacute;fica. </LI></P></OL>



<P ALIGN="JUSTIFY">Ami Pro inicia la revisi&oacute;n ortogr&aacute;fica.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">La correcci&oacute;n de errores ortogr&aacute;ficos se realiza con los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY">Correcci&oacute;n de errores ortogr&aacute;ficos</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">1. Seleccione una palabra en Alternativas o edite la palabra en el recuadro de texto Sustituir por.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">2. Elija la opci&oacute;n adecuada.</P>


<P ALIGN="JUSTIFY">* Sustituir todas&nbsp;: Sustituye esa palabra en todo el texto por la que especifique en el recuadro de texto Sustituir por.</P>
<P ALIGN="JUSTIFY">* Sustituir&nbsp;: Sustituye la palabra por la que especifique en el recuadro de texto Sustituir por s&oacute;lo esta vez.</P>


<P ALIGN="JUSTIFY">&#9;* Omitir todas&nbsp;: No tiene en cuenta la palabra en todo el texto.</P>
<P ALIGN="JUSTIFY">&#9;* Omitir&nbsp;: No tiene en cuenta la palabra s&oacute;lo esta vez.</P>


<P ALIGN="JUSTIFY">&#9;* Incluir en diccionario&nbsp;: Incluye la palabra en el diccionario de usuario. A partir de ese momento, Ami Pro reconoce esa palabra en todos los documentos en los que se realice la revisi&oacute;n ortogr&aacute;fica.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Repita los pasos 1-2 cada vez que Ami Pro encuentre una palabra que no reconozca.</P>
<P ALIGN="JUSTIFY">Al final de la revisi&oacute;n ortogr&aacute;fica, el punto de inserci&oacute;n se encontrar&aacute; en la &uacute;ltima palabra que contenga errores ortogr&aacute;ficos o que est&eacute; repetida, a&uacute;n en el caso de que se haya corregido u omitido.</P>
<P ALIGN="JUSTIFY">Si cuando se inici&oacute; la revisi&oacute;n ortogr&aacute;fica se encontraba en Modo borrador, la pantalla permanecer&aacute; en este modo cuando finalice el proceso. Si la &uacute;ltima palabra que encontr&oacute; Ami Pro se encuentra en marcos fijos, notas la pie, cabeceras o pies, el punto de inserci&oacute;n permanecer&aacute; en una de estas unidades y solamente aparecer&aacute; en la pantalla el texto de esa unidad. Puede seleccionar Modo calidad para averiguar exactamente d&oacute;nde se encuentra el punto de inserci&oacute;n y, a continuaci&oacute;n, situarlo en la porci&oacute;n de texto principal adecuada.</P>
<P ALIGN="JUSTIFY"></P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
