<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de manejo del Ami Pro 3.1</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@arrakis.es">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 9.<br>Otras herramientas.
</H3>
<p align=justify>
<B><P ALIGN="JUSTIFY">INDICE:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1.- Introducci&oacute;n.</P>
<P ALIGN="JUSTIFY">2.- Cambio de p&aacute;gina.</P>
<P ALIGN="JUSTIFY">3.- Importaci&oacute;n - Exportaci&oacute;n.</P>
<P ALIGN="JUSTIFY">4.- Ejemplos de importaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">1.- INTRODUCCI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">AMI PRO ofrece otra serie de herramientas que puede ofrecer al usuario gran utilidad, como puede ser&nbsp;: insertar un cambio de p&aacute;gina  y la importaci&oacute;n - exportaci&oacute;n de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con la importaci&oacute;n de datos se puede utilizar para los informes de ventas, memorias, etc... En esta Unidad veremos la importaci&oacute;n de datos y gr&aacute;ficos en Excel y Lotus 1-2-3, que son los mas utilizados, aunque hay otros.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">2.- CAMBIO DE PAGINA.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Puede insertarse un cambio de p&aacute;gina o de columna en cualquier lugar del texto principal. De esta forma, el usuario puede determinar d&oacute;nde quiere finalizar una p&aacute;gina o columna y d&oacute;nde desea iniciar p&aacute;ginas o columnas nuevas. Los cambios insertados por el usuario reciben el nombre de saltos de p&aacute;gina o cambios de p&aacute;gina o columna manuales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para insertar cambios de p&aacute;gina o columna manuales, debe realizarse los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Sit&uacute;e el punto de inserci&oacute;n en el texto en que desea comenzar una nueva p&aacute;gina o columna.</P>
<P ALIGN="JUSTIFY"></P>

<OL START=2>

<P ALIGN="JUSTIFY"><LI>Elija P&aacute;gina/Cambios p&aacute;gina/columna.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3. Seleccione Insertar cambio de p&aacute;gina o Insertar cambio de columna.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">4. Si inserta un cambio de p&aacute;gina y desea que el texto que precede al punto de inserci&oacute;n quede centrado entre los m&aacute;rgenes superior e inferior, seleccione la opci&oacute;n Centrar verticalmente texto anterior al cambio.</P>
<P ALIGN="JUSTIFY">Si una vez especificado el centrado vertical, desea eliminarlo, deber&aacute; suprimir el cambio de p&aacute;gina.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">5. Elija Aceptar.</P>


<P ALIGN="JUSTIFY">Cuando inserta un cambio de p&aacute;gina, Ami Pro introduce una marca de cambio de p&aacute;gina en la posici&oacute;n del punto de inserci&oacute;n, por lo que el texto situado a partir de dicha posici&oacute;n se desplazar&aacute; a la p&aacute;gina siguiente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando se inserta un cambio de columna, Ami Pro introduce una marca de cambio de columna al final del p&aacute;rrafo en que se encuentra el punto de inserci&oacute;n; el texto situado a partir del fin de p&aacute;rrafo se desplazar&aacute; a la columna siguiente. Si no hay texto a partir del cambio de columna, deber&aacute; pulsar INTRO para mover el punto de inserci&oacute;n a la columna siguiente. Para poder ver las marcas de cambio de p&aacute;gina y columna, elija Vista/Preferencias y seleccione C&oacute;digos.</P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">3.- IMPORTACION-EXPORTACI&Oacute;N.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Puede utilizar los filtros de texto y de importaci&oacute;n de archivos de datos de Ami Pro para convertir documentos creados en otras aplicaciones a documentos de Ami Pro y convertir documentos de Ami Pro a otro formato de archivos de texto. Ami Pro admite los siguientes formatos: </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<U><P ALIGN="JUSTIFY">Filtros de importaci&oacute;n de archivos&#9;&#9;Filtros de exportaci&oacute;n de archivos</P>
</U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Advance Write&#9;&#9;&#9;&#9;Advance Write</P>
<P ALIGN="JUSTIFY">Ami Pro&#9;&#9;&#9;&#9;&#9;Ami Pro</P>
<P ALIGN="JUSTIFY">ASCII&#9;&#9;&#9;&#9;&#9;&#9;ASCII</P>
<P ALIGN="JUSTIFY">dBase III&reg;, dBase III+&reg;, y dBase IV&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">DCA/FFT (Final Form Text)&#9;&#9;&#9;DCA/FFT (Final Form Text)</P>
<P ALIGN="JUSTIFY">DCA/RFT (Revisable Form Text)&#9;&#9;DCA/RFT (Revisable Form Text)</P>
<P ALIGN="JUSTIFY">DIF&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">DisplayWrite&reg; 4 y 5&#9;&#9;&#9;&#9;DisplayWrite 4 y 5</P>
<P ALIGN="JUSTIFY">E-Mail&#9;&#9;&#9;&#9;&#9;&#9;E-Mail</P>
<P ALIGN="JUSTIFY">Executive MemoMaker&#9;&#9;&#9;Executive MemoMaker</P>
<P ALIGN="JUSTIFY">Lotus Manuscript&reg; 2.0 y 2.1&#9;&#9;</P>
<P ALIGN="JUSTIFY">Navy DIF&#9;&#9;&#9;&#9;&#9;Navy DIF</P>
<P ALIGN="JUSTIFY">Office Writer 6.2&#9;&#9;&#9;&#9;Office Writer 6.2</P>
<P ALIGN="JUSTIFY">Professional Write&#9;&#9;&#9;&#9;Professional Write</P>
<P ALIGN="JUSTIFY">Organizer 1.x&#9;&#9;</P>
<P ALIGN="JUSTIFY">Rich Text Format&#9;&#9;&#9;&#9;Rich Text Format</P>
<P ALIGN="JUSTIFY">Samna&reg; Word&#9;&#9;&#9;&#9;Samna Word</P>
<P ALIGN="JUSTIFY">Versi&oacute;n 1.0 de WordStar 2000&#9;&#9;Versi&oacute;n 1.0 de WordStar 2000</P>
<P ALIGN="JUSTIFY">Versi&oacute;n 3.0 de WordStar 2000&#9;&#9;Versi&oacute;n 3.0 de WordStar 2000</P>
<P ALIGN="JUSTIFY">Versi&oacute;n 3.02 de Wang (IWP)&#9;&#9;&#9;Versi&oacute;n 3.02 de Wang (IWP)</P>
<P ALIGN="JUSTIFY">Versi&oacute;n 1 de SmartWare&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones 5.0, 5.1 y 5.2 de WordPerfect&#9;Versiones 5.0, 5.1 y 5.2 de WordPerfect</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Versiones 3.3 y 4.0 de MultiMate&reg; </P>
<P ALIGN="JUSTIFY">y MultiMate Advantage II&#9;&#9;Versiones 3.3 y 4.0 de MultiMate y MultiMate Advantage II</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Versiones 3 y 4 de SuperCalc&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones 1.0, 1.01 y 1.1 (.WKR y .WK1) de Symphony&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones 1, 1A, 2.0 y 2.01 (.WKS and .WK1) de 1.2.3&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones 3.3, 3.4, 4.1 y 5.0 de WordStar&reg; &#9;Veriones 3.3, 3.4, 4.1 y 5.0 de WordStar</P>
<P ALIGN="JUSTIFY">Versiones 4.1 y 4.2 de WordPerfect&#9;&#9;Versiones 4.1 y 4.2 de WordPerfect</P>
<P ALIGN="JUSTIFY">Versiones 1.5 a 2.5 de Enable&#9;&#9;Versiones 1.5 a 2.5 de Enable</P>
<P ALIGN="JUSTIFY">Versiones 2.11 y anterior de Peach TextTM Versiones 2.11 y anteriores de Peach Text</P>
<P ALIGN="JUSTIFY">Versiones 4.0, 5.0, y 5.5 de MIcrosoft Word&#9; Versiones 4.0, 5.0 y 5.5 de Microsoft Word</P>
<P ALIGN="JUSTIFY">Versiones 3.0, 3.1 y 1-2-3 para Windows (.WK3 y .WK4))&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones  3.5 (.DB) y anteriores de Paradox&reg;&#9;&#9;</P>
<P ALIGN="JUSTIFY">Versiones 4.0 y versiones anteriores de Microsoft Excel&#9;&#9;</P>
<P ALIGN="JUSTIFY">Wang (IWP) versi&oacute;n 3.02&#9;&#9;&#9;Wang (IWP) versi&oacute;n 3.02</P>
<P ALIGN="JUSTIFY">Windows Write&#9;&#9;&#9;&#9;Windows Write</P>
<P ALIGN="JUSTIFY">Word para Windows&#9;&#9;&#9;&#9;Word para Windows</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las aplicaciones admiten diferentes niveles de funcionalidad, por ello, es posible que Ami Pro no pueda importar determinados informaci&oacute;n de formato cuando importe archivos de texto o de datos o exporte un archivo de texto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En general, los datos de formato que Ami Pro puede importar y exportar  son los siguiente:</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Alineaci&oacute;n--Texto centrado, texto justificado, alineaci&oacute;n a la derecha y alineaci&oacute;n a la izquierda.</P>
<P ALIGN="JUSTIFY">Mientras est&aacute; importando, Ami Pro convierte estas opciones en elementos de formato y realce.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Letras--Iniciales may&uacute;sculas y texto en min&uacute;sculas, versalitas y may&uacute;sculas.</P>


<P ALIGN="JUSTIFY">Mientras est&aacute; importando, Ami Pro convierte estas opciones en elementos de formato y realce.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Fechas--Mientras Ami Pro est&aacute; importado y exportando, si el formato de archivos no permite utilizar  funciones de fecha, Ami Pro importa las fechas en formato de texto.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Tipos de letra--Familia de tipos de letra, tama&ntilde;o y color.</P>


<P ALIGN="JUSTIFY">Mientras est&aacute; importando, Ami Pro convierte estas opciones en formato de texto y realces de texto.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Cabeceras y pies</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Caracteres internacionales</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Interlineado</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Formato de p&aacute;gina--m&aacute;rgenes, cambios de p&aacute;gina, regletas y tabuladores</P>


<P ALIGN="JUSTIFY">Durante la importaci&oacute;n, si el filtro seleccionado no permite utilizar datos de formato de p&aacute;gina, Ami Pro inserta una regleta con la definici&oacute;n de tabuladores correcta al principio de cada p&aacute;rrafo del texto. Cuando s&iacute; permite utilizarlos, la primera regleta se incorpora al formato de p&aacute;gina est&aacute;ndar o al formato insertado, dependiendo de si el punto de inserci&oacute;n se encontraba o no al principio del documento al importar el archivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando el archivo importado no contiene regleta por omisi&oacute;n, excepto si se trata de filtros ASCII o E-Mail, la regleta insertada introduce un tabulador cada media pulgada. Para archivos ASCII o E-Mail Ami Pro usa la reglata insertada en la posici&oacute;n en que se encontraba el punto de inserci&oacute;n al importar el archivo.</P>
<P ALIGN="JUSTIFY">Cuando el filtro no admite tabuladores de centrado, num&eacute;ricos o derechos, Ami Pro los cambia por tabuladores izquierdos y la regleta por omisi&oacute;n introduce un tabulador cada media pulgada. Si el filtro admite tabuladores de centrado, num&eacute;rico y derecho, Ami Pro los utilizar&aacute;.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Numeraci&oacute;n de p&aacute;ginas</P>


<P ALIGN="JUSTIFY">Durante la importaci&oacute;n y esportaci&oacute;n y si el formato al que van a importarse los datos no permite utilizar esta funci&oacute;n, Ami Pro exporta los n&uacute;meros de p&aacute;gina en formato de texto.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Estilos de p&aacute;rrafo</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Opciones de formato especiales--guiones, espacios fijos</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Atributos de texto--negrita, doble subrayado, cursiva, caracteres superpuestos, tachado, super&iacute;ndice, sub&iacute;ndice, subrayado y subrayado de palabras</P>
<P ALIGN="JUSTIFY">Mientras est&aacute; importando, Ami Pro convierte estas opciones en formato de texto y de realces de texto.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Marcos de texto</P>


<P ALIGN="JUSTIFY">Mientras est&aacute; exportando, el texto en marcos anclados aparece en el archivo en la misma posici&oacute;n que el marco anclado. El texto que no est&aacute; en marcos anclados, aparece al final del formato de p&aacute;gina o al final del documento.</P>
<P ALIGN="JUSTIFY"></P>


</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">4.- EJEMPLOS DE IMPORTACION.</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a ver los ejemplos m&aacute;s clarificadores a la hora de atender este tema. Cuando se hace un informe que incluya los datos de las ventas y sus graficos hecho en Lotus 1-2-3 o Excel.</P>
<center><IMG SRC="gif/ami5.gif"></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Las opciones de datos de formato en Lotus 1-2-3&nbsp;:</P>
<P ALIGN="JUSTIFY">* Todo el archivo&nbsp;: Ami Pro importa la hoja de c&aacute;lculo completa.</P>
<P ALIGN="JUSTIFY">* Rango&nbsp;: Ami Pro importa solamente la parte de la hoja de c&aacute;lculo que le especifique. Puede especificar un nombre o rango con formato A3 . . C25.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro modifica los siguientes caracteres de acentuaci&oacute;n y s&iacute;mbolos al importarlos de Lotus 1-2-3 :</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lotus 1-2-3 &#9;&#9;&#9;&#9;Ami Pro </P>
<P ALIGN="JUSTIFY">grave de may&uacute;scula&#9;&#9;&#9;grave gen&eacute;rico</P>
<P ALIGN="JUSTIFY">agudo de may&uacute;scula&#9;&#9;&#9;agudo gen&eacute;rico</P>
<P ALIGN="JUSTIFY">circunflejo de may&uacute;scula &#9;&#9;circunflejo gen&eacute;rico </P>
<P ALIGN="JUSTIFY">di&eacute;resis de may&uacute;scula &#9;&#9;&#9;di&eacute;resis gen&eacute;rica</P>
<P ALIGN="JUSTIFY">tilde de may&uacute;scula &#9;&#9;&#9;tilde gen&eacute;rica</P>
<P ALIGN="JUSTIFY">grave de min&uacute;scula&#9;&#9;&#9;grave gen&eacute;rico</P>
<P ALIGN="JUSTIFY">agudo de min&uacute;scula&#9;&#9;&#9;agudo gen&eacute;rico</P>
<P ALIGN="JUSTIFY">circunflejo de min&uacute;scula&#9;&#9;circunflejo gen&eacute;rico</P>
<P ALIGN="JUSTIFY">di&eacute;resis de min&uacute;scula&#9;&#9;&#9;di&eacute;resis gen&eacute;rica </P>
<P ALIGN="JUSTIFY">tilde de min&uacute;scula&#9;&#9;&#9;tilde gen&eacute;rica</P>
<P ALIGN="JUSTIFY">flor&iacute;n holand&eacute;s&#9;&#9;&#9;&#9;f </P>
<P ALIGN="JUSTIFY">Pesetas&#9;&#9;&#9;&#9;Pts </P>
<P ALIGN="JUSTIFY">&lt; &#9;&#9;&#9;&#9;&#9;&lt;= </P>
<P ALIGN="JUSTIFY">÷ &#9;&#9;&#9;&#9;&#9;/ </P>
<P ALIGN="JUSTIFY">TM &#9;&#9;&#9;&#9;&#9;tm </P>
<P ALIGN="JUSTIFY">Œ&#9;&#9;&#9;&#9;&#9;OE </P>
<P ALIGN="JUSTIFY">Ÿ&#9;&#9;&#9;&#9;&#9;Y </P>
<P ALIGN="JUSTIFY">œ&#9;&#9;&#9;&#9;&#9;oe </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro utiliza los par&aacute;metros por omisi&oacute;n de la ventana 1.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro omite las fechas anteriores a 1-1-1980 y las celdas que las contienen.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro no permite utilizar el formato que muestra f&oacute;rmulas en lugar de valores. Estos se importan con el formato por omisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Las opciones de datos de formato en Excel&nbsp;:</P>
<P ALIGN="JUSTIFY">* Todo el archivo&nbsp;: Ami Pro importa la hoja de c&aacute;lculo completa.</P>


<P ALIGN="JUSTIFY">* Rango&nbsp;: Ami Pro importa solamente la parte de la hoja de c&aacute;lculo que le especifique. Puede especificar un nombre o una direcci&oacute;n de rango con el formato: A3:C7 o $A$3:$C$7, pero nunca R1C3:R5C7.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Cuando se utiliza un archivo de Excel 3.0, Ami Pro muestra otras opciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si el punto de inserci&oacute;n se encuentra en una tabla cuando importa un archivo de Excel, Ami Pro proporciona cuatro opciones de estilos. Si el punto de inserci&oacute;n se encuentra en el texto principal del documento cuando importa un archivo de Excel, Ami Pro s&oacute;lo proporciona las opciones Aplicar y Omitir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las opciones de datos de formato en Excel&nbsp;:</P>


<P ALIGN="JUSTIFY">* Convertir estilos de p&aacute;rrafo&nbsp;: Ami Pro crea estilos de p&aacute;rrafo que se ajusten a los nombres de estilo y los datos de formato utilizados en el archivo original. Ami Pro importa todos los atributos de texto como formato y realce de texto.Cuidado Si ya existen estilos de p&aacute;rrafo con los mismos nombres, Ami Pro los modifica para que  puedan utilizar los datos de formato del archivo original.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">* Aplicar estilos de p&aacute;rrafo&nbsp;:&#9;Ami Pro convierte todos los datos de formato, incluidos los datos de formato de estilos de p&aacute;rrafo como formato y realce de texto. Todos los p&aacute;rrafos utilizar&aacute;n el estilo de la l&iacute;nea donde se encontraba el punto de inserci&oacute;n al importar el archivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">* Conservar nombres de estilos de p&aacute;rrafo&nbsp;: &#9;Ami Pro importa todos los nombres de estilos de p&aacute;rrafo. Si hay nombres de estilo disponibles en el documento de Ami Pro iguales a los nombres de estilo del documento original, Ami Pro asigna los estilos de p&aacute;rrafo correspondientes. En caso contrario Ami Pro asignar&aacute; los par&aacute;metros del estilo de p&aacute;rrafo Est&aacute;ndar, y mostrar&aacute; el nombre de estilo en color rojo en la barra de estado. El usuario puede asignar uno distinto, o crear un estilo de p&aacute;rrafo con el nombre de estilo original. Ami Pro no reconocer&aacute; Cabecera 1 ni cabecera 1 como nombres de estilos coincidentes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">* Omitir estilos de p&aacute;rrafo&nbsp;:&#9;Ami Pro importa los datos de formato de texto como formato y realce de texto. Ami Pro no importar&aacute; datos de formato de estilos de p&aacute;rrafo. Todos los p&aacute;rrafos utilizar&aacute;n el estilo de la l&iacute;nea donde se encontraba el punto de inserci&oacute;n al importar el archivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro importa los veinti&uacute;n formatos num&eacute;ricos originales de Excel. Los formato definidos por el usuario se importan en formato GENERAL.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro importa las fechas y las horas en formato Excel con los par&aacute;metros especificados en el Panel de control de Windows.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro conserva texto centrado y alineaci&oacute;n derecha e izquierda cuando importa en tablas. Fill alignment (alineaci&oacute;n de relleno) se importa como GENERAL, que en Excel significa alineaci&oacute;n a la izquierda para texto y a la derecha para n&uacute;meros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ami Pro no puede importar los tipos de letra de Excel, aunque ciertos atributos de tipo de letra como negrita, cursiva, subrayado y caracteres superpuestos s&iacute; se importan en texto y tablas. Estos atributos se conservan al pegar datos de Excel en el texto principal de un documento de Ami Pro.</P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aular.htm"><font FACE="ARIAL"><B>[Curso de Ami Pro 3.1]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
