<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:topeko@hotmail.com">Antonio Monreal "Topeko".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Ultima On-Line.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Origin.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Título de importanción.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Rol.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 95%.</b></font>
<HR>
<BR>
<BR>

<FONT color="#000000" size=2 face=arial><p align="justify">

Bueno lo primero que he de decir (o he de dejar claro), es que si est&aacute;s interesado en adquirir este juego y por alguna raz&oacute;n no sabes nada de ingles, no posees una tarjeta de cr&eacute;dito (</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><DFN>Visa, Mastercard, American Express o Discovery</DFN>)</FONT><FONT FACE="Arial" SIZE=2>,y aun as&iacute; no estas dispuesto a pagar una cuota mensual de 9,95$ (unas </FONT><B><U><FONT FACE="Arial" SIZE=2 COLOR="#ff0000">1500 pelas</B></U></FONT><FONT FACE="Arial" SIZE=2> al cambio actual) os pod&eacute;is olvidar de el.</P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000">
</FONT><FONT FACE="Arial" SIZE=2><H4 ALIGN="JUSTIFY">¡Hey sigo aqui!¿De que va esto?</H4>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY">"<I>Knock</I>""<I>Knock</I></FONT><FONT FACE="Arial" SIZE=2> ¿Segu&iacute;s ah&iacute;? Entonces ten&eacute;is delante de vosotros el mejor juego de rol on line que existe (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Bueno la verdad es que de momento no hay mucho donde elegir aparte de los mud... ¡El diablo por más que os empe&ntilde;&eacute;is es un arcade!</I>)</FONT><FONT FACE="Arial" SIZE=2>Cualquiera que lo haya jugado, ya sea un usuario asiduo o simplemente un curioso lo aseverar&aacute; sin dudar.</P>
<P ALIGN="JUSTIFY"><table align="left">
<td><img src="jpg/entrena.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><p align="left">
Entre las acciones que se realizan en este juego,<br> entrenarse es la que,en un principio, más tiempo<br> nos
                                    llevará
</p>
</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Este juego llega a tal grado de complejidad que tienes la sensaci&oacute;n de que te has sumergido en un mundo real, en el que has de sobrevivir como mejor puedas (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">ten en cuenta que no eres un Inmortal y cosas tan comunes en Britannia como ataques, inanici&oacute;n, envenenamiento pueden afectar "levemente" al estado de salud de tus personajes</I>)</FONT><FONT FACE="Arial" SIZE=2> 
y hacerte poco a poco mas fuerte desarrollando las m&uacute;ltiples habilidades disponibles que te permitir&aacute;n hacer una infinidad de acciones. Por ejemplo: Podr&aacute;s <U>cocinar</U> (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Personalmente yo intento hacer un nuevo plato a base de los sesos de los cad&aacute;veres poco descompuestos que me voy encontrando, "¡&Ntilde;am,&ntilde;am!"</I></FONT><FONT FACE="Arial" SIZE=2>); <U>Pelear</U> (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">No tiene que ser solamente con otros jugadores aunque es lo mas frecuente, hay cerca de una decena de habilidades para el combate</I></FONT><FONT FACE="Arial" SIZE=2>); <U>Manufacturar</U> productos, que pueden ser a su vez materiales intermedios para la elaboraci&oacute;n de productos aun m&aacute;s complejos (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">P.ej:Tejer lana para hacer trozos o rollos de tela que posteriormente pueden ser utilizados para hacer prendas para vestir</I></FONT><FONT FACE="Arial" SIZE=2>); <U>Domesticar</U> animales y extra&ntilde;as bestias (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">¿A quien no le apetece arrasar una mazmorra o el castillo de alguien al que se la tienes jurada con tu drag&oacute;n amaestrado?</I></FONT><FONT FACE="Arial" SIZE=2>), y otras muchas m&aacute;s que no enumero por no aburrir al incauto que se adentra en mis palabras. La verdad es que hasta que no se prueba no se toma conciencia del significado de la palabra "complejidad" cuando se aplica a un juego.</P>
<P ALIGN=justify>

</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><H4 ALIGN="JUSTIFY">&nbsp;</H4>
</FONT><FONT FACE="Arial" SIZE=2><H4 ALIGN="JUSTIFY">¿Que diferencia hay de las anteriores sagas ultima? </H4>
<P ALIGN="JUSTIFY">El juego, al ser pensado para ser jugado en internet, evita o corrige los defectos que se les achacaba a anteriores entregas de la serie, uno de ellos por ejemplo era lo cortas que resultaban las historias, una vez que las terminabas el juego ya no tenia ning&uacute;n inter&eacute;s el volver a jugarlo (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Bueno creo que para el Ultima VII:The black gate hab&iacute;a una ampliaci&oacute;n en la aventura para la versi&oacute;n en ingl&eacute;s</I></FONT><FONT FACE="Arial" SIZE=2>). Ahora al no tener una historia fija (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">las aventuras que correremos ser&aacute;n consecuencia de unos eventos que ir&aacute;n apareciendo en el juego, como una horda de criaturas que merodea la ciudad y para subir de nivel se nos insta en las ciudades a enfrentarse a ellas, o una visita a una mazmorra, es algo imprevisible lo que te va a ocurrir a continuaci&oacute;n</I></FONT><FONT FACE="Arial" SIZE=2>)te encontraras con que no hay fin, otro "defecto"(</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">si es que lo quer&eacute;is considerar as&iacute;</I></FONT><FONT FACE="Arial" SIZE=2>) es que el grupo que formabais parec&iacute;a carecer de inteligencia, los di&aacute;logos eran casi fijos con solo unas pocas variantes, y te tenias que ocupar de todo tu grupo (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Alimentarlos, vestirlos, organizar el ataque....¡Ni que estuvi&eacute;ramos en una guarder&iacute;a!</I></FONT><FONT FACE="Arial" SIZE=2>) pero ahora si se asocia gente contigo esta es real tendr&eacute;is que discutir y razonar antes de que te hagan caso (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">si es que lo consigues :D</I></FONT><FONT FACE="Arial" SIZE=2>), los &uacute;nicos que te seguir&aacute;n ciegamente ser&aacute;n los animales que hayas domesticado/comprado. A juegos anteriores tambi&eacute;n se les pod&iacute;a achacar que era relativamente f&aacute;cil conseguir dinero, pero aqu&iacute; 
</FONT><U><FONT FACE="Arial" SIZE=2 COLOR="#ff0000">¡No!</U></FONT><FONT FACE="Arial" SIZE=2> Para eso hay que trabajar en uno de las distintos oficios a los que nos podemos dedicar (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Antes de empezar a jugar a nuestro personaje le podremos asignar variados atributos que nos ser&aacute;n &uacute;tiles para desempe&ntilde;ar un empleo determinado de entre una larga lista </I></FONT><FONT FACE="Arial" SIZE=2>) As&iacute; que nos vamos a tener que ganarnos el pan con el sudor de nuestra frente...(</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">...estoooooo, m&aacute;s bien carg&aacute;ndonos el bot&oacute;n izquierdo de unos cuantos ratones ;-)</I></FONT><FONT FACE="Arial" SIZE=2>) a no ser que os guste el dinero f&aacute;cil, por que entonces podr&eacute;is ser ladrones o P.K (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#ff0000">P</FONT><FONT FACE="Arial" SIZE=2 COLOR="#000080">layer</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000">K</FONT><FONT FACE="Arial" SIZE=2 COLOR="#000080">illers, jugadores que se dedican a matar a otros jugadores en serie para despojarlos despu&eacute;s de sus posesiones</I></FONT><FONT FACE="Arial" SIZE=2>) es un oficio que te mantendr&aacute; alejado de las ciudades ya que los guardianes de estas te machacarán una y otra vez que intentes cometer un delito en la ciudad y los comerciantes te rehuir&aacute;n.</P>
<P ALIGN="JUSTIFY">Es curioso como el comportamiento de la sociedad de este mundo virtual se asemeja al real, la existencia de "fuertes" que se intentan aprovechar de su superioridad para destruir a los menos "dotados" para quedarse con sus recursos, y la asociaci&oacute;n de estos &uacute;ltimos en </FONT><A HREF="http://www.arrakis.es/~isaura/"><FONT FACE="Arial" SIZE=2>guilds</FONT></A><FONT FACE="Arial" SIZE=2> (</FONT><FONT FACE="Arial" SIZE=2 COLOR="#000080"><DFN>Clanes o cofradias, el hiperenlace os manda hacia la pagina del guild al que yo pertenezco aunque hay otros de habla espa&ntilde;ola</FONT></DFN><FONT FACE="Arial" SIZE=2>) para defenderse de ellos, y hacer causa com&uacute;n para sus prop&oacute;sitos, los cuales no son siempre ben&eacute;volos.</P>
<P ALIGN="JUSTIFY">Este mundo virtual intenta mantener un equilibrio ecol&oacute;gico (P.ej: </FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Los precios de las tiendas se rigen por la ley de la oferta y la demanda, el precio de venta/compra de un objeto varia en funci&oacute;n de las existencias</I></FONT><FONT FACE="Arial" SIZE=2>) que no siempre se mantiene ya que algunos recursos (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">sobre todo aquellos obtenidos de animales salvajes</I></FONT><FONT FACE="Arial" SIZE=2>)resultan ser claramente mas rentables y f&aacute;ciles de conseguir, por lo tanto ser&aacute;n los primeros en desaparecer masacrados y son renovados constantemente por el servidor cada media hora. </P>
<br>
<br>
<center><table>
<td><center><img src="jpg/comercio.jpg" border=1></center></td>
<tr>
<td>
<center>
<FONT color="#000000" size=1 >
<b>
Como dice la canción "...el dinero es lo que hace girar al mundo..." nosotros seremos peones que nos veremos obligados a hacer que se cumpla.

</b>
</center>
</td>
</table></center>
<br>
<br>
<P ALIGN=justify>


<P ALIGN="JUSTIFY">&nbsp;</P>
<H4 ALIGN="JUSTIFY">Aptdo T&eacute;cnico</H4>
<table align="right">
<td><img src="jpg/persona.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><p align="right">Se mantiene el sistema para
<br> representar el estado del personaje<br> que ya tenían anteriores entregas.<br> En 
este caso gestionando<br> un personaje mio en la ciudad de Vesper.</p>
</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

<P ALIGN="JUSTIFY">T&eacute;cnicamente el juego no pide mucho comparado con lo que se pide ahora en otros productos (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">no hace falta la casi ya omnipresente tarjeta aceleradora 3d</I></FONT><FONT FACE="Arial" SIZE=2>), de hecho a pesar de que piden un p133 como m&iacute;nimo para usarlo, he conseguido usarlo en un p120 perfectamente, y &uacute;nicamente se va a notar las diferencias al usarlo de un ordenador a otro en funcion de la calidad de la conexi&oacute;n (cuanto m&aacute;s mejor) y de la tarjeta de sonido dada la cantidad de ficheros en formato midi que usa el juego.(</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">Y pensar que cuando me entere por primera vez de su existencia cuando buscaba un walkthrough para el ultima VII: Serpent isle se ped&iacute;a un 486DX75 y recomendaban un p133 para las betas del programa</I> 8-0</FONT><FONT FACE="Arial" SIZE=2>)</P>
<P ALIGN=justify>

<P ALIGN="JUSTIFY">&nbsp;</P>
<H4 ALIGN="JUSTIFY">Resumen</H4>
<P ALIGN="JUSTIFY">La verdad es que es una maravilla que queda &uacute;nicamente empa&ntilde;ada por esas cl&aacute;usulas que te hacen aceptar para poder usarlo: Solo poder usarlo en servidores de Origin; Nada de usar emuladores de servidor para echarte una partida offline (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">que es una de las cosas que se echa de menos, el poder jugar solo en casa o con unos amigos en red sin hacer engordar en ceros la factura telef&oacute;nica</I></FONT><FONT FACE="Arial" SIZE=2>). Y el hecho de tener que pagar para poder usarlo (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">en diablo era gratis y jamas hubo una merma en la calidad del servicio</I></FONT><FONT FACE="Arial" SIZE=2>), quiz&aacute;s a este lado del charco nos tengamos que acostumbrar a pagar por unos servicios por los que antes no se pagaba nada (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">¡Hala! ¡A rascarse el bolsillo!</I></FONT><FONT FACE="Arial" SIZE=2>). Adem&aacute;s como el juego oficialmente solo se comercializa en USA (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">De ah&iacute; que tengas que comprarlo de importaci&oacute;n</I></FONT><FONT FACE="Arial" SIZE=2>) el adquirirlo se puede llegar a convertir en misi&oacute;n imposible. A ver cuando se molestan en lanzarlo en Europa (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">¡Que al otro lado del charco no estamos en la edad de piedra!</I></FONT><FONT FACE="Arial" SIZE=2>) donde ya hay mas de 35000 usuarios, que demandamos un servidor europeo. De momento esta es la mejor entrega de la serie ultima, que nos quita el mal sabor que nos dejo el Pagan (</FONT><I><FONT FACE="Arial" SIZE=2 COLOR="#000080">tambi&eacute;n conocido como Ultima VIII y del que o&iacute; tan malas criticas que prefer&iacute; no comprarlo</I></FONT><FONT FACE="Arial" SIZE=2>), esperemos hasta que llegue la novena parte que necesitara </FONT><A HREF="http://www.dimension3d.com/"><FONT FACE="Arial" SIZE=2>aceleradora 3d</FONT></A></P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

