<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>

<HR>		  







<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>

</b></FONT>

<br><br>

<FONT size=2 color="#000000" face="Arial"><br><br><br>

<H3>

¿Qué juego hacer?

</H3>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque a priori parecer&aacute; una tonter&iacute;a, en la etapa del aprendizaje suele ser bastante complicado decantarse por un g&eacute;nero determinado a la hora de realizar el primer juego. Este art&iacute;culo pretende orientar un poco a todos aquellos que est&eacute;n a punto de lanzarse a crear su primer juego, ofreciendo un peque&ntilde;o an&aacute;lisis de cada uno de los g&eacute;neros que son, m&aacute;s o menos, est&aacute;ndar en el mundo del videojuego. Como ver&eacute;is, el objetivo ser&aacute; el de poner en pr&aacute;ctica todos nuestros conocimientos te&oacute;ricos para ir adquiriendo experiencia.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial">Antes de que nos emocionemos...
</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Resulta com&uacute;n entre los noveles, a la hora de plantear su primer juego, llenar la cabeza de ideas que se escapan totalmente de sus capacidades como programadores, grafistas o dise&ntilde;adores. Antes de comenzar a perfilar "el mejor juego del mundo", hace falta que nos serenemos y pensemos fr&iacute;amente en nuestras posibilidades como creadores. El primer t&iacute;tulo que desarrollemos es imperativo que vea la luz, esto es, que se logre acabar. Por lo tanto, hay que tomar una idea sencilla pero que cubra todos los aspectos te&oacute;ricos que creamos que tenemos dominados. En la etapa de aprendizaje, lo que tenemos que hacer es aprender y, por lo tanto, no preocuparnos de si nuestro juego podr&aacute; competir "por algo". Hay que lograr ir poniendo en pr&aacute;ctica todas y cada una de las cosas que creemos que hemos aprendido de tutoriales por Internet, en libros o por propia investigaci&oacute;n personal. Recordad, que por mucho que leamos, por mucha base te&oacute;rica que tengamos, lo importante es practicar de alg&uacute;n modo. La diferencia entre un programador que, adem&aacute;s de documentarse, programa y otro que s&oacute;lo se documenta, es abismal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por otro lado, deberemos de tener en cuenta que los juegos no son "pr&aacute;cticas" para ver qu&eacute; hace o qu&eacute; no hace esta o aquella rutina. Eso en el mundo de la "DemoScene" s&iacute; funciona pero en el del desarrollo de juegos no, porque un juego es algo mucho m&aacute;s complicado. En un juego debemos de dar coherencia a todo nuestro c&oacute;digo. Un juego es un programa interactivo (una demo no lo es) y, por lo tanto, el director del mismo es el propio usuario no el programador. Debemos de saber cerrar nuestros primeros proyectos, que ser&aacute;n sencillos, para que, m&aacute;s adelante, y al haber cogido experiencia suficiente, los proyectos m&aacute;s complejos no se nos resistan.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; pues, lo m&aacute;s importante en la etapa del aprendizaje es ir entendiendo los distintos mecanismos que hacen funcionar un juego. Esto lo lograremos llevando a la pr&aacute;ctica todos nuestros conocimientos te&oacute;ricos. No hace falta meterse a desarrollar juegos "grandes" (y el concepto de "grande", aunque var&iacute;a entre diferentes personas, siempre es proporcional), sino realizar juegos peque&ntilde;os acab&aacute;ndolos siempre.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n, voy a proceder a analizar, muy por encima, los diferentes estilos o g&eacute;neros de los que puede beber nuestro primer y b&aacute;sico desarrollo. Antes, sin embargo, har&eacute; una menci&oacute;n al tema de las 2D y las 3D.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial">¿Lo hacemos en 2D o 3D?
</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Resulta un hecho innegable que si quieres vivir en el futuro del desarrollo de juegos, has de saber moverte en las tres dimensiones. Sin embargo, eso no es &oacute;bice para que pases por alto la representaci&oacute;n en 2D, es decir, has de conocer con profundidad la programaci&oacute;n en 2D. Los juegos han de justificar el uso de la tecnolog&iacute;a por encima de toda regla y esto es algo que has de asumir como programador, grafista o dise&ntilde;ador. Por lo tanto, resulta imprescindible tener buenos conocimientos de ambos tipos de representaci&oacute;n gr&aacute;fica. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La programaci&oacute;n en 3D es m&aacute;s complicada que la programaci&oacute;n en 2D (a priori). Sin embargo, y tal como dec&iacute;a m&aacute;s atr&aacute;s, de poco sirve ponerte a estudiar programaci&oacute;n 3D como un loco si nunca has hecho nada en 2D. Es imprescindible conocer bien las 2D antes de lanzarse a trabajar en 3D. Realizar el primero de tus juegos en 3 dimensiones tan s&oacute;lo traer&aacute; problemas y de lo que se trata es de que acabemos nuestro primer juego por sencillo que &eacute;ste sea (insisto, queremos hacer juegos no rutinas gr&aacute;ficas). Desecha cualquier intento de realizar algo en 3D como primer desarrollo. Desecha tambi&eacute;n cualquier intento de crear una herramienta o engine en 3D si antes no has hecho alguna utilidad para el manejo de, por ejemplo, sprites o tiles en 2D. S&eacute; inteligente y, sobre todo, paciente. No gastes tus energ&iacute;as y tiempo dando golpes al aire. Cuando hayas hecho suficientes juegos en 2D peque&ntilde;os y est&eacute;s seguro de que has adquirido esa experiencia tan necesaria, salta a las 3D (y cuando hayas dado el salto, nunca olvides justificar el uso de la tecnolog&iacute;a). </P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial">Escogiendo un g&eacute;nero
</h4></FONT><FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Esta primera decisi&oacute;n creo que es vital. Todos solemos tener alg&uacute;n tipo de g&eacute;nero por el que nos inclinamos y, cuando pensamos en hacer un juego que se nutra de &eacute;l, lo solemos hacer pensando en algo realmente grande, estupendo, inmejorable. Que no haya nada que se le parezca en el mercado. L&oacute;gicamente, esa primera etapa de "furor" la tiene todo el mundo. Lo importante es saber contenerla y ponerla en pr&aacute;ctica s&oacute;lo cuando seamos capaces de acometerla. Decantarse por nuestro g&eacute;nero preferido a la hora de hacer el primer proyecto puede ser muy peligroso. Si a nosotros nos gustan mucho los juegos de rol o de aventura, por ejemplo, seguro que pensamos de inmediato en un complejo gui&oacute;n, en personajes controlados por el ordenador realmente inteligentes, en escenarios que van cambiando din&aacute;micamente, o en sistemas de atributos o combates de &uacute;ltima generaci&oacute;n con multitud de a&ntilde;adidos o extras. Todo esto es muy peligroso pues lleva consigo un m&aacute;s que probable abandono del proyecto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la etapa del aprendizaje, lo mejor que podemos hacer es elegir juegos de corte cl&aacute;sico que no tengan mucha complicaci&oacute;n. Les a&ntilde;adimos algunas mejoras de cosecha propia y los hacemos. Cualquier juego, por sencillo que parezca, siempre tendr&aacute; alg&uacute;n tipo de complejidad que nos d&eacute; m&aacute;s trabajo del esperado y sobre el que merezca la pena indagar. Nunca pens&eacute;is que porque vuestro juego no va a tener la categor&iacute;a de ser vendido va a ser una p&eacute;rdida de tiempo el hacerlo. Siempre, y esto es muy importante, se aprende algo nuevo con cualquier desarrollo. Por sencillo que sea el juego, siempre aprender&eacute;is alguna t&eacute;cnica nueva o refinar&eacute;is todo aquello que ya cre&eacute;is tener dominado (u os dar&eacute;is cuenta de un error que no repetir&eacute;is en el futuro). Adem&aacute;s, para qu&eacute; nos vamos a enga&ntilde;ar, la experiencia lo es todo y para coger experiencia haciendo juegos, no hay m&aacute;s remedio que hacerlos. Es de caj&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo ideal, pues, es realizar proyectos cortos (unos dos o tres meses de tiempo de desarrollo; preferiblemente 2 meses). Si os pas&aacute;is un a&ntilde;o o a&ntilde;o y medio haciendo cosas de esta manera, que vayan aumentando en complejidad, aprender&eacute;is muy r&aacute;pido y estar&eacute;is, antes de lo que os imagin&aacute;is, preparados para abarcar proyectos muy grandes. De nuevo, deb&eacute;is de someteros a la m&aacute;xima del desarrollo de juegos "<I>Nunca intentes hacer el mejor juego del mundo a la primera</I>" pero, ¡ojo!, haced todo dando siempre lo mejor de vosotros mismos (ah&iacute; es donde se encuentra la vocaci&oacute;n y el talento que tanto hace falta en el desarrollo de juegos).</P>

</FONT><B><FONT FACE="Arial"><P>Tipos de g&eacute;neros</P>
</B></FONT><FONT FACE="Arial" SIZE=2>
<B><P>Juegos de inteligencia / habilidad</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El g&eacute;nero de los juegos de inteligencia o habilidad, es uno de los m&aacute;s antiguos que hay. El "paradigma" de &eacute;ste tipo de juegos es la obra de culto "Tetris". La complejidad principal de este tipo de productos, se encuentra en el algoritmo que contiene el mecanismo o, mejor dicho, las reglas del juego. Sin embargo, estos algoritmos no suelen ser, en principio, excesivamente complicados. Basta con que nos fijemos en alg&uacute;n juego de habilidad que nos guste un poco para anotar en papel las reglas por las que se rige. Despu&eacute;s, tan s&oacute;lo deberemos de implementar esas reglas en un algoritmo (al que le podremos dedicar m&aacute;s o menos tiempo para optimizarlo o incluso para modificar sus reglas principales) y tendremos el juego. As&iacute;, por ejemplo, el juego del &quot;Tetris&quot; (que su funcionamiento ser&aacute; explicado en el n&uacute;mero 10 de Macedonia), tiene un regla principal muy sencilla; ir colocando piezas en una tabla delimitada por filas y columnas (que no es m&aacute;s que una matriz de mxn casillas) de tal forma que logremos hacer filas que tengan todas sus columnas con elementos de alguna pieza. A partir de esta premisa, deberemos de desarrollar toda la l&oacute;gica que rodea al programa (c&oacute;mo representar internamente la tabla en donde se colocan las piezas, c&oacute;mo representar las piezas o las colisiones entre la pieza que vamos moviendo y las que se encuentran ya alojadas en la matriz, la velocidad con la que van bajando las piezas, etc). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como veis, en este tipo de desarrollos, hay un buen mont&oacute;n de aspectos que se desprenden de la premisa o regla principal de juego. Ofreciendo, siempre, buenos ejercicios para demostrar que somos capaces de trabajar con las estructuras de datos m&aacute;s apropiadas y eficientes.</P>
<P ALIGN="JUSTIFY">La complejidad de la programaci&oacute;n gr&aacute;fica en estos juegos, es muy sencilla (lo que no quita que cada uno lo complique hasta donde quiera despu&eacute;s) pero muy &uacute;til para afianzar conocimientos y adquirir seguridad en el desarrollo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P>Juegos arcade</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este tipo de juegos requieren, sobre todo, una elevada calidad t&eacute;cnica. El hecho de manejar a alg&uacute;n tipo de "objeto" de forma r&aacute;pida y din&aacute;mica, necesita de t&eacute;cnicas que aprovechen bien el hardware de la m&aacute;quina. Todo esto reviste en un conocimiento moderadamente importante de temas espec&iacute;ficos (como pueden ser el ensamblador) y en algoritmos o m&eacute;todos de representaci&oacute;n tambi&eacute;n muy eficientes. De todas formas, no es una idea descabellada hacer un arcade como primer juego. Basta con que nos propongamos hacer algo sencillo y abarcable y tendremos la seguridad de que habremos puesto en pr&aacute;ctica un buen mont&oacute;n de conocimientos t&eacute;cnicos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un buen juego por el que empezar, podr&iacute;a ser un sencillo juego de naves tipo "Asteroids" o "Space Invaders" o un "shoot'em up" tipo "R-Type". Eso sin menospreciar otros proyectos como alg&uacute;n juego estilo al cl&aacute;sico "Green Beret". Todo este tipo de juegos arcade, pueden afianzar conocimientos que te servir&aacute;n de base para poder hacer luego arcades de mayores proporciones. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En los juegos arcade, lo m&aacute;s importante es la parte destinada a la programaci&oacute;n gr&aacute;fica. Saber usar bien la m&aacute;quina que posees para realizar algoritmos de dibujado har&aacute; que tu juego resulte interesante. Independientemente de esto, deber&aacute;s de saber realizar un juego coherente, es decir, con fases equilibradas y divertidas. De nuevo, hay que volver al hecho de que los juegos no son s&oacute;lo m&oacute;dulos de efectos especiales de programaci&oacute;n. Los juegos han de ser algo que te haga pasar un rato divertido o emocionante por eso, se ha de utilizar siempre dise&ntilde;os interesantes de cara al jugador.</P>
<P ALIGN="JUSTIFY"></P>
<B><P>Juegos de aventura / rol</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Los juegos de este tipo suelen reunir varias disciplinas de otros g&eacute;neros. Una aventura gr&aacute;fica o conversacional, no siempre tendr&aacute; el mismo tipo de realizaci&oacute;n "est&aacute;ndar". En un juego de rol ocurrir&aacute; lo mismo. Los a&ntilde;adidos que podamos darles a nuestras creaciones, deber&aacute;n siempre estar supeditadas a la experiencia que tengamos como desarrolladores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quiz&aacute;s, si lo que m&aacute;s te interesa son las aventuras, lo mejor que puedas hacer es comenzar a realizar aventuras conversacionales. El por qu&eacute; est&aacute; bien claro. Las aventuras gr&aacute;ficas basan todo su potencial creativo y de desarrollo en pantallas bellamente ilustradas y personajes animados con lo que para un grupo de desarrollo novel, esto es algo que se escapa totalmente de sus posibilidades. La calidad de una aventura se mide, a fin de cuentas, por el argumento y el gui&oacute;n con el que cuente. Una conversacional es el medio m&aacute;s potente que existe para poner en pr&aacute;ctica tus dotes como dise&ntilde;ador de aventuras pues te obliga a tener que crear un libro virtual sobre el que el lector pueda seguir la aventura. Todo el inter&eacute;s del juego se cierne en la calidad argumental del juego en s&iacute;, no en los gr&aacute;ficos del mismo. Por otro lado, una conversacional puede ser algo realmente complejo. A t&uacute; disposici&oacute;n tienes problemas tan interesantes como la creaci&oacute;n de parsers, evoluci&oacute;n din&aacute;mica del universo en el que juegas, personajes controlados por el ordenador que campan a sus anchas, etc. Obviamente, todos estos extras tambi&eacute;n pueden ser incorporados a las aventuras gr&aacute;ficas sin embargo, estamos en las mismas de antes. Mientras que las conversacionales no necesitan de gr&aacute;ficos para poder construirse, las gr&aacute;ficas se basan en &eacute;stos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra de las ramas de la aventura es la de los juegos de rol. Este tipo de g&eacute;nero es bastante confuso. Realmente beben de las aventuras ofreciendo al jugador, adem&aacute;s de una historia y gui&oacute;n digno, situaciones de mayor libertad para que el jugador pueda realizar su cometido. As&iacute;, en un juego de rol, se puede mezclar el g&eacute;nero arcade (combates), el estrat&eacute;gico (disposici&oacute;n de personajes, modo de acometer un combate, gestionar el inventario, etc.) y el aventurero (resoluci&oacute;n de problemas l&oacute;gicos, conversaciones, una historia que conocer, etc.). Los juegos de rol encierran, a priori, m&aacute;s complejidad de desarrollo que una aventura "convencional". En l&iacute;neas generales, cualquier juego que lleve la coletilla de "aventura" siempre requerir&aacute; bastante m&aacute;s esfuerzo del que parece. Crear juegos en los que haya una historia, puzzles y guiones que te muevan a continuar jugando, requieren un esfuerzo de dise&ntilde;o extra y, por tanto, una madurez importante como creador de juegos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No intentes embarcarte en una creaci&oacute;n de este tipo de g&eacute;nero a la primera, a no ser que tengas ya experiencia como programador de juegos o cuentes con alg&uacute;n tipo de herramienta que te haga la mayor parte del trabajo de programaci&oacute;n (en <a href="sumario.htm">Spanish Quest</a> puedes obtener informaci&oacute;n sobre este tipo de herramientas y en esta misma sección de Macedonia, un completo <a href="bpja1.htm">curso</a> sobre diseño y creación).</P>
<B><P ALIGN="JUSTIFY"></P>
<P>Estrategia</P>
</B>
<P ALIGN="JUSTIFY">Los juegos de estrategia se presentan como candidatos ideales para acometer un primer o segundo proyecto ya que esconden una gran cantidad de desaf&iacute;os, de dise&ntilde;o, para el desarrollador. Para empezar, obligan al programador a investigar estructuras de datos que est&eacute;n siempre supeditadas al juego en s&iacute;. Aqu&iacute; hay que trabajar siempre de acuerdo a la forma en la que podamos representar las reglas de juego del modo m&aacute;s eficiente. A decir verdad, los juegos de estrategia someten la tecnolog&iacute;a al juego siempre. Adem&aacute;s las reglas que puedan regir un juego de estrategia pueden ser perfectamente abordables por el grupo de programaci&oacute;n. Obviamente, y al igual que pasa en cualquiera de los g&eacute;neros anteriormente citados, deberemos de controlar nuestras emociones y proponer juegos que no se conviertan en un c&uacute;mulo de reglas que acaben por volver locos a nuestras, a&uacute;n, poco ejercitadas cabezas de dise&ntilde;adores. Podr&iacute;amos, por ejemplo, pensar en un juego que utilice representaci&oacute;n similar a la del original "Civilization" y cuyo cometido sea infinitamente m&aacute;s sencillo. Tan s&oacute;lo poner en pr&aacute;ctica algunos conceptos como la b&uacute;squeda del camino m&aacute;s corto, la creaci&oacute;n de estructuras de datos que economicen en memoria para los mapas o unidades(en los juegos de estrategia hay que guardar amplias cantidades de informaci&oacute;n que, adem&aacute;s, han de ser accesibles r&aacute;pidamente) son motivos para plantearse acometer un proyecto de este tipo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los juegos de estrategia son, por tanto, candidatos ideales a abordar. No tienen por qu&eacute; ofrecer gr&aacute;ficos vanguardista y en ellos se suelen poner en pr&aacute;ctica multitud de disciplinas de la programaci&oacute;n de juegos. Desde dise&ntilde;os robustos a estructuras de datos y algoritmos que luego nos valgan para otro tipo de desarrollos.</P>

<B><P>Simulaci&oacute;n</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los juegos de simulaci&oacute;n son un g&eacute;nero prohibitivo para cualquier novel. Los conocimientos t&eacute;cnicos necesarios para llevar proyectos de este tipo est&aacute;n fuera del alcance de cualquier principiante. El hecho de necesitar amplios conocimientos matem&aacute;ticos resulta una criba que tan s&oacute;lo se puede superar mediante la experiencia previa en la realizaci&oacute;n de juegos con un nivel de matem&aacute;tica m&aacute;s sencilla y con el posterior aprendizaje de representaci&oacute;n tridimensional. Olv&iacute;date, al menos por el momento, de hacer un simulador.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P>En conclusi&oacute;n</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de haber comentado, muy por encima, todos los g&eacute;neros base existentes (est&aacute; claro que hay muchas otras ramificaciones que no se han tenido en cuenta, m&aacute;s las ideas personales de cada creador) uno ha de decantarse por aquel que le permita poner en pr&aacute;ctica todos los conocimientos te&oacute;ricos que cree que posee o ha adquirido ya. Aunque el juego en cuesti&oacute;n no sea nuestro preferido. Vuelvo a reiterar que hasta que podamos hacer ese juego que tanto nos gusta, deberemos de aprender a programar juegos. Como en todo, aprender a programar juegos s&oacute;lo se consigue programando juegos. Concentr&eacute;monos en la realizaci&oacute;n de peque&ntilde;os desarrollos, a&ntilde;ad&aacute;mosles alg&uacute;n que otro toque de original de cosecha propia (que nos anime durante la etapa de desarrollo), y, lo m&aacute;s importante, acab&eacute;moslos. S&oacute;lo de esta forma lograremos ir madurando como desarrolladores. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aprender a trabajar en equipo y a preguntar las dudas que nos puedan surgir a otra persona con mayor experiencia que nosotros, es algo que tambi&eacute;n se torna esencial en el aprendizaje. No debemos de encerrarnos en nosotros mismos, sino ir evolucionando en un ambientes en donde la colaboraci&oacute;n sea parte importante. Recordad que, en el futuro, deberemos de trabajar con otras personas. No se trata de &quot;saber m&aacute;s&quot; se trata de ayudarnos y aprender los unos de los otros.</P></FONT><BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>



<br>

<HR>
<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="apj.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>







<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



