<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>





<br><HR>		  <TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2><TD><TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2><TR><TD><DIV align="left"><FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a></DIV></TD></TR></TABLE></TD></TABLE><br><br><img src="g_misc/69.gif" align=right><P align=right><FONT color="#cc0000" size=2 face="arial"><b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br><A HREF="mailto:afeliu@retemail.es">Albert Feliu.</A></b></FONT><br><br><FONT size=2 color="#000000" face="Arial"><br><br><br><H3>¿Así que quieres hacer un juego para consolas?</H3><font size=2 face=arial><P ALIGN="JUSTIFY">No est&aacute;s solo. Cuando comparas los 900 millones de d&oacute;lares generados por el mercado l&uacute;dico del PC con los 25 billones generados por el mercado de consolas no es muy dif&iacute;cil enteder porque estas tomando esta decisi&oacute;n. Altos volumenes de venta, una aus&eacute;ncia total de problemas de compatibilidad con el hardware y una industria rentable est&aacute; haciendo que m&aacute;s y m&aacute;s desarrolladores esten sacando versiones para consolas de su software l&uacute;dico.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Vamos a arrancar motores y ha examinar
 algunos de los aspectos que implican programar para alguna de las dos consolas que est&aacute;n impuestas en estos momentos, la Sony Playstation y la Nintendo N64. Con la ayuda de dos equipos de desarrolladores, Crave Entertainment y Snowblind Studios, miraremos el problema desde el punto de vista de &quot;¿Como lo deben hacer?&quot; e intentaremos aclarar algunas dudas que nos asaltan de c&oacute;mo y con que m&eacute;todos se consiguen resultados determinados.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Para empezar, en este n&uacute;mero analizamos el proceso a seguir para desarrollar para la consola de Sony y dejamos para posteriores ediciones el estudio del caso de la consola Nintendo 64.</P><P ALIGN="JUSTIFY"></P><B><P ALIGN="JUSTIFY">Sony Playstation</P></B><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Para empezar, estudiaremos la veterana, pero todav&iacute;a popular, Sony Playstation. Con m&aacute;s de 30 millones de unidades vendidas en todo el mercado mundial (Febrero 1998), la base instalada de Playstation es m&aacute;s que suficiente. Y con juegos como FINAL FANTASY VII, GRAN TURISMO, y la franquicia de RESIDENT EVIL, la plataforma no parece que emita signos de empezar a apagarse. Para estudiar la perspectiva de la Playstation, hemos entrevistado el grupo de SHADOW MADNESS, en Crave Entertainment.</P><B><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">El juego.</B> </P><P ALIGN="JUSTIFY">SHADOW MADNESS (pr&oacute;xima salida a la venta en primavera de 1999) es el intento de Crave de entrar en el mercado de franquicias de juegos RPG. El entorno de juego sigue el formato perfeccionado por el FINAL FANTASY VII de Squaresoft con caracteres 3D calculados en tiempo real (RT3D) explorando escenarios est&aacute;ticos, los v&iacute;deos a pantalla completa explicativos de hist&oacute;rias y campos de batalla totalmente realizados en RT3D.</P><P ALIGN="JUSTIFY">La producci&oacute;n del juego empez&oacute; sobre la mitad de 1997, cuando, despu&eacute;s de una fase inicial de dise&ntilde;o, se form&oacute; un equipo de 
artistas y empezaron en los videos a pantalla completa (FMV) y las m&aacute;s de 800 localidades interactivas que forman el juego. El equipo de ingenieria se form&oacute; unos meses despu&eacute;s, cuando los principales contenidos gr&aacute;ficos ya estaban desarrollados.</P><B><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">El proceso de aprovaci&oacute;n de SONY.</B> </P><P ALIGN="JUSTIFY">Todos los juegos publicados para la consola Sony Playstation llevan el sello de garant&iacute;a que garantiza la calidad de estos. Para que un juego pueda salir al mercado, primero debe pasar unas durisimas pruebas de Sony para asegurar tanto la calidad global del producto como el correcto contenido de este. Estos controles de calidad son realmente estrictos, dandose casos en los que enmitad de un proyecto, Sony a retirado la licencia para comercializarlo al escaparse este de los estandares impuestos por la compa&ntilde;&iacute;a. Este es un punto delicado ya que para peque&ntilde;as empresas puede significar el fracaso m&aacute;s absoluto, on as&iacute; para grandes productoras como Eidos que ya cuentan con un amplio margen debido a su rendimiento anterior en la producci&oacute;n de titulos exitosos sobre la plataforma Sony.</P><P ALIGN="JUSTIFY"></P><B><P ALIGN="JUSTIFY">Estrateg&iacute;a de desarrollo.</B> </P><P ALIGN="JUSTIFY">Desde el principio, los desarrolladores de Crave escogieron la plataforma Sony. Una de las razones que ayudo a tomar esta decisi&oacute;n fue la posibilidad que ofrece la PSX de utilizar FMV (Videos a pantalla completa) a pantalla completa. Este es un punto de vital importancia para ellos, ya que necesitan de esta herramienta para mostrar las secuencias explicativas tan necesarias en juegos aventureros. Esta decisi&oacute;n tambi&eacute;n trajo consigo algunos problemas que tuvieron que ser resueltos antes de empezar la producci&oacute;n real del juego.</P><P ALIGN="JUSTIFY">Uno de los problemas principales de la consola PSX es la limita capacidad de mem&oacute;ria (2MB de RAM) disponible para los artis
tas – mapas de texturas, paletas, animaciones, geometria y fondos est&aacute;ticos, todo tiene que converger en un espacio de mem&oacute;ria tan limitado. Para crear una experiencia de juego realmente inmersiva, la gente de Crave opto por desarrollar dos modalidades de juego.</P><P ALIGN="JUSTIFY">Cuando el jugador se mueve por el mundo de juego, utilizamos el llamado modo Weeble. Este modo esta caracterizado por modelos de personajes a baja resolucion moviendose sobre fondos est&aacute;ticos o con scroll. La mayor&iacute;a de la mem&oacute;ria se utiliza para almacenar los fondos de alta resoluci&oacute;n y las diferentes capas.</P><P ALIGN="JUSTIFY">La tarea realmente dificil de implementar en el modo Weeble era conseguir una aire cinem&aacute;tico y un correcto control de la camara, ya que es en este modo en el que se cuenta la mayor&iacute;a de la histor&iacute;a a parte de en las secuencias de animaci&oacute;n. El intensivo uso de capas permiti&oacute; al equipo desarrollar mundos tridimensionales simulados con la simple utilizaci&oacute;n de fondos est&aacute;ticos. Para implementar este sistema, el equipo utilizo tecnicas directamente heredadas de la industria del cine como el control de camara y la manipulaci&oacute;n del punto de vista. Esto exiji&oacute; una mayor responsabilidad para los artistas.</P><P ALIGN="JUSTIFY">En el modo Weeble, los caracteres ocupan una parte relativamente peque&ntilde;a de la pantalla. En consecuencia, estos estan modelados a baja resoluci&oacute;n (entre 100 y 140 poligonos) y utilizan menos texturas, permitiendo tener m&aacute;s caracteres a la vez en pantalla. Adicionalmente, sus animaciones pueden ser menos complejas. El ahorro de memoria que supone el uso de texturas de baja resoluci&oacute;n, utilizar pocos poligonos y animaciones de baja calidad</P><P ALIGN="JUSTIFY"></P><B><P ALIGN="JUSTIFY">Interpolaci&oacute;n de frames (formato HMD)</P></B><P ALIGN="JUSTIFY">Cuando se tuvo que determinar un formato en el que guardar la geometr&iacute;a 3D y los datos de la animaci
&oacute;n, los desarrolladores ten&iacute;an tres opciones: MIME, .TOD/.TMD o el nuevo formato .HMD. Cada uno tiene sus ventajas y desventajas, pero el formato .HMD era el &uacute;nico formato no aprovado todav&iacute;a, y con relativamente poca informaci&oacute;n sobre su utilizaci&oacute;n. La verdadera libertad que ofrec&iacute;a el formato .HMD era la facilidad para los programadores de aceder a las secuencias de animaci&oacute;n que este contiene. Este les permit&iacute;a generar algoritmos para interpolar en tiempo real, de manera que animaciones que deber&iacute;an tener 30 frames, solo necesitar&iacute;an 7. La posibilidad de disponer de un engine con capacidad para generar frames interpolados en tiempo real quiere decir que cada secu&eacute;ncia de animaci&oacute;n puede ser obtenida sin muchos puntos de informaci&oacute;n intermedios, con el engine generando movimientos y poses suaves. La consecuencia directa de esto es la menor utilizaci&oacute;n de la preciada memoria, tan escasa en esta plataforma hardware, y un numero superior de animaciones por personaje. Seg&uacute;n la gente de Crave, nunca podr&iacute;an haber llevado adelante este proyecto sin el nuevo formato .HMD, que todav&iacute;a no ha sido utilizado por ning&uacute;n producto comercial todav&iacute;a.</P><P ALIGN="JUSTIFY"></P><B><P ALIGN="JUSTIFY">Herramientas</P></B><P ALIGN="JUSTIFY">Para la elecci&oacute;n de las herramientas necesarias para desarrollar el proyecto, exist&iacute;an b&aacute;sicamente dos puntos clave: Generaci&oacute;n r&aacute;pida de contenido gr&aacute;fico pre-renderizado en alta calidad, y modelos RT3D totalmente texturados. Para esto se elijieron dos herramientas cl&aacute;sicas, PowerAnimator 8.5 y 3D Studio MAX 2.0. La probada calidad de renderizado de PowerAnimation se vio respaldada por la tecnolog&iacute;a de Renderman. </P><P ALIGN="JUSTIFY">La mayoria de la modelacion RT3D se desarrollo en 3D Studio MAX, y las secuencias cinematicas y fondos pre-renderizados se realizaron en PowerAnimator utilizando tecno
log&iacute;a NURBS. Lo ingenieros desarrollaron un plugin para exportar la geometr&iacute;a, informaci&oacute;n de textura y animaci&oacute;n desde 3D Studio MAX hacia formato .HMD, en consecuencia, toda la informaci&oacute;n RT3D paso primero por 3D Studio MAX.</P><P ALIGN="JUSTIFY">Adem&aacute;s del software comercial, existen algunas utilidades desarrolladas por los propios ingenieros, como una utilidad que les permite posicionar fisicamente las texturas dentro de la memoria de la m&aacute;quina, permitiendo un uso m&aacute;s eficiente de esta. Las multiples combinaciones a la hora de colocar esta informaci&oacute;n en mem&oacute;ria hacen muy dificil automatizarla.</P><P ALIGN="JUSTIFY"></P><B><P ALIGN="JUSTIFY">¿Qu&eacute; nos dejamos?</P></B><P ALIGN="JUSTIFY">Pues de momento, espero que este art&iacute;culo sobre la tecnolog&iacute;a utilizada para desarrollar sobre consolas SONY os haya sido de utilidad. Su aire introductorio es evidente, ya estaba indicado as&iacute; en la introducci&oacute;n. Dejamos para m&aacute;s adelante el informe sobre el mundo de la programaci&oacute;n para la consola Nintendo 64. Si teneis alguna pregunta o duda, o quereis decirme lo malo que es este art&iacute;culo podeis hacerlo tranquilamente a </FONT><A HREF="mailto:albert@interbel.es"><FONT FACE="Arial" SIZE=2>albert@interbel.es</FONT></A><FONT FACE="Arial" SIZE=2>.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Eterno agradecimiento a Mel Guymon por su colaboraci&oacute;n desinteresada en la realizaci&oacute;n de este art&iacute;culo. </P><P ALIGN="JUSTIFY"></P></FONT><center><img src="gif/prgcon1.gif"></center><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></FONT><BR><BR><P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><br>











<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="apj.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>







<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



