<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<!-- INICIO DE SECCION PARA LA INSERCION DE LAS CARACTERISTICAS DEL JUEGO -->
<BR><BR><BR><BR><BR><BR>
<HR>
<FONT FACE ="ARIAL" SIZE="3"><B>Título: </B></FONT>
<FONT FACE ="ARIAL" SIZE=3 COLOR="#008800"><B>Silver.</B></FONT><BR>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Compañía: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Infogrames U.K.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Distribuidora: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Infogrames Ibérica.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Género: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Videoaventura.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Idioma: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Castellano.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Plataforma: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Windows 9x.</B></FONT><BR>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Puntuación </B></FONT><br>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Técnica: [</B><font size=2 face=arial color="#cc0000"><B>8</B></font><B>] | Jugabilidad: [</B><font size=2 face=arial color="#cc0000"><B>6</B></font><B>] | Originalidad: [</B><font size=2 face=arial color="#cc0000"><B>6</B></font><B>]</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Total: [</B><font size=2 face=arial color="#cc0000"><B>62%</B></font><B>]</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Comentarios / Observaciones: </B></FONT><br>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>No es, como se esperaba, un juego de rol.</li></FONT>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>Excesivamente lineal, poco flexible... decepcionante.</li></FONT>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>Buena atmósfera, música notable y excelentes fondos.</li></FONT>
<HR>
<BR>
<!-- FIN DE SECCION PARA LA INSERCION DE LAS CARACTERISTICAS DEL JUEGO -->

 
<P align="justify">
<table width="200" align="left"> 
<td><img src="jpg/silver0.jpg"></TD>
</table>


<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nos encontramos ante la que se presum&iacute;a respuesta Europea al Rol Japon&eacute;s (Final Fantasy VII, para ser m&aacute;s exactos). Desgraciadamente, Silver no es un juego de rol, por lo que ni es una respuesta al Final Fantasy VII ni es todo lo que de &eacute;l se ha venido hablando. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><H4><FONT FACE="Arial"><P ALIGN="JUSTIFY">Comienzo del juego y primeras impresiones</H4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tal y como sucedi&oacute; cuando se lanz&oacute; el juego Diablo, Silver ha generado una alt&iacute;sima expectaci&oacute;n entre los jugadores roleros del mundo del PC. Y tal como sucedi&oacute; con el Diablo, Silver ha defraudado a todos aquellos que esper&aacute;bamos un juego de rol o, al menos, algo que mantuviera las principales caracter&iacute;sticas del g&eacute;nero, sin caer en una simpleza exasperante. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La primera impresi&oacute;n que tienes cuando arrancas Silver y comienzas a verlo funcionar es, ciertamente, prometedora. Ante ti se descubre una fenomenal "pseudopresentaci&oacute;n" que funciona sobre el mismo engine del juego (sin contar la intro "oficial" que sirve para narrar el origen de Silver) y en la que t&uacute; puedes y debes de participar. Lo primero que m&aacute;s llama la atenci&oacute;n son los fondos sobre los que se mueven los personajes as&iacute; como el elevado n&uacute;mero de &eacute;stos (personajes) que el engine es capaz de mostrar poligonalmente y sin necesidad de recurrir a una tarjeta aceleradora 3D (se basa en la tecnolog&iacute;a MMX - lo cual dice mucho de cu&aacute;nto tiempo lleva haci&eacute;ndose Silver - utilizando baja poligonizaci&oacute;n). Esto, unido a la gran atm&oacute;sfera conseguida, hacen que el jugador s&oacute;lo se pueda esperar lo mejor. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los primeros pasos en el juego transcurren, como ya he citado, a medida que se va desarrollando la presentaci&oacute;n del mismo. Los problemas comienzan cuando el archimago Silver, a trav&eacute;s de su hijo Fuge, ordena raptar a todas las mujeres en edad de procrear. El protagonista de la aventura, David, se encuentra en esos momentos entrenando con su abuelo fuera de la casa en la que residen tanto &eacute;l como su esposa Jennifer. Este momento es el elegido por los dise&ntilde;adores para introducir al jugador en un tutorial inteligentemente maquillado por la presentaci&oacute;n; el usuario aprende los movimientos b&aacute;sicos de la lucha y comienza a manipular objetos. Una vez transcurridos unos cuantos di&aacute;logos (sin ninguna posibilidad de ser dirigidos), las tropas de Fuge hacen acto de presencia raptando a Jennifer. Como te imaginar&aacute;s, David y su abuelo se ponen al instante al rescate desencadenando una persecuci&oacute;n muy intensa entre los dos protagonistas y las tropas de Fuge. Durante la persecuci&oacute;n, el jugador tiene que luchar contra los guardias que le van cerrando el paso hasta que, finalmente, llega al puerto y ve c&oacute;mo el barco que lleva tanto a Jennifer como al resto de mujeres de la ciudad, desaparece a lo lejos. A partir de ese momento, comenzar&aacute; la aventura.</P>
<br><br>

<center><table width="400"> 
<td><img src="jpg/silver1.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Fuge y sus soldados, dispuestos a raptar a todas las mujeres del reino</center></font></td> 
</table></center>
<p align="justify">
<br>


<P ALIGN="JUSTIFY">Obviar que desde el primer instante en el que comienzas a manejar al h&eacute;roe notas que hay algo que le falta al juego, ser&iacute;a mentir. El programa, desde el primer momento, te asombra por la puesta en escena que luce, sin embargo, hay algo que falla en todo el magn&iacute;fico decorado y ese algo no es otro que la sospechosa baja complejidad del mismo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">¡Viva la linealidad!</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<table width="250" align="right"> 
<td><img src="jpg/silver3.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>El interfaz nos ofrece pocas opciones pero es moderadamente cómodo</center></font></td> 
</table>
<P ALIGN="JUSTIFY">Una vez que el usuario ha superado la presentaci&oacute;n del juego y puede comenzar a pulular por los escenarios que le brinda Silver, lo primero que har&aacute; ser&aacute; investigar en las posibilidades del interfaz. Ante nosotros tenemos opciones para armar a nuestro h&eacute;roe, tanto ofensiva (espada, hacha o arco) como defensivamente (escudo), de utilizar hechizos o pociones m&aacute;gicas y de comer para... ¡recuperar energ&iacute;a!. Y es que, una de las cosas que me puso alerta fue ver c&oacute;mo el protagonista recuperaba una buena porci&oacute;n de energ&iacute;a al tomarse una manzana (el cabreo fue mayor al ver c&oacute;mo sal&iacute;a flotando la cantidad de puntos que hab&iacute;a recuperado). Hombre esto en un arcade pues no te llamar&iacute;a la atenci&oacute;n pero en un supuesto juego de rol, que el tomar un trozo de queso, una manzana o cualquier alimento te suba la porci&oacute;n de energ&iacute;a pues... Detalles como &eacute;ste son los que restan categor&iacute;a al producto desde el primer momento en el que se comienza a probar. No porque sea algo correcto o sea algo incorrecto, sino porque el "aura" serio y desafiante que el producto luce tanto en caja como en argumento y desarrollo, comienza desmoronarse ante la mirada at&oacute;nita de un jugador de rol de ordenador.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los primeros quince minutos de juego se caracterizan por hacer que el usuario se encuentre pasando pantalla tras pantalla luchando contra todos y cada uno de los soldados de Silver que hay por la ciudad. De vez en cuando, y para hacer evolucionar la aventura, se nos premia con alg&uacute;n di&aacute;logo autom&aacute;tico entre David y su abuelo que contribuyen a seguir creando atm&oacute;sfera y dramatismo. Pasado los primeros 30 minutos ya habr&aacute;s descubierto todos los secretos que te brinda el interfaz y ya habr&aacute;s asimilado toda la mec&aacute;nica del juego. Silver se reduce a luchar, usar objetos muy de vez en cuando (sobre todo las t&iacute;picas "llavecitas") y pasar pantallas, eso s&iacute;, inteligentemente decoradas por "cut scenes" plagadas de di&aacute;logos logrados y acciones autom&aacute;ticas por parte del protagonista, para que se vaya desarrollando el argumento. Es aqu&iacute; cuando nos damos cuenta de la incre&iacute;ble linealidad del producto; no s&oacute;lo no es posible dirigir los di&aacute;logos o realizar las acciones que a ti te apetezcan, sino que, para colmo, ver&aacute;s que s&oacute;lo puedes guardar la partida en determinados momentos; cuando te aparezca un "cronista" como prueba de que has superado alg&uacute;n obst&aacute;culo especialmente complicado. Como supondr&eacute;is, la robustez del juego se viene abajo y es cuando comienzas a dudar sobre si est&aacute;s jugando a un juego de ordenador o si te encuentras delante de una consola con nulas posibilidades para guardar la partida.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que Silver tenga una historia lineal no es malo. Lo malo es la escasa capacidad de acci&oacute;n que se le ha ofertado al jugador. Llega a ser agobiante y excesivamente aburrido el estar luchando en todas y cada una de las pantallas (sin ninguna posibilidad de huida) y ver que s&oacute;lo obtienes por recompensa una conversaci&oacute;n que sirve para desarrollar m&aacute;s y m&aacute;s el argumento del juego, pero en la que no tienes ninguna posibilidad de intervenir. No hay una gran variedad de objetos y nuestros personajes s&oacute;lo suben de nivel cuando destruyen a alg&uacute;n enemigo final de escenario. S&iacute;, hab&eacute;is le&iacute;do bien, hay enemigos finales de escenario.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">Profundizando en el desarrollo</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es f&aacute;cil criticar un juego si no lo has jugado hasta el final. Este no es el caso. Un servidor ha jugado hasta el final del Silver porque, pese a todo, es adictivo. Su principal baza es no ser un juego excesivamente dif&iacute;cil; cualquier jugador puede hacerse con el entorno del mismo y con todos y cada uno de los "secretos" del interfaz.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La historia en la que se sustenta se desarrolla, como ya se ha comentado m&aacute;s arriba, de forma totalmente autom&aacute;tica. Los di&aacute;logos saltan cuando tienen que saltar y las acciones se producen siempre que tienes los objetos necesarios. No existen tramas paralelas a la troncal y lo &uacute;nico que puede considerarse alejado de la estricta puesta en escena son ciertos cofres visibles e invisibles (que tienen muchas posibilidades de pasar desapercibidos y olvidarse por completo) y que contienen p&oacute;cimas, flechas, comida... lo t&iacute;pico.</P>
<P ALIGN="JUSTIFY"></P>
<center><table width="400"> 
<td><img src="jpg/silver5.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Los decorados son preciosos y el comportamiento de los enemigos, pese a ser muy predecible, añade emoción al juego.</center></font></td> 
</table></center><br>
<P ALIGN="JUSTIFY">La adicci&oacute;n del Silver aumenta progresivamente, seg&uacute;n vayas involucr&aacute;ndote en el argumento y, sobre todo, a medida que vas viendo la cantidad de buenas ideas que se han desaprovechado, mientras te mientes pensando "vamos a avanzar que seguro que cambia ahora". El sistema de combate en tiempo real es excelente. Es probable que haya jugadores que se cansen de tanto movimiento de rat&oacute;n pero, a decir verdad, el cansancio viene de la cantidad tan elevada de combates que hay que librar, no de la calidad del sistema en s&iacute; (deja por los suelos al sistema de combate, tambi&eacute;n en tiempo real, del Diablo). Los escenarios, como ya se ha repetido hasta la saciedad, son maravillosos y en muchas ocasiones hacen que medites sobre la pena de que no se hubiera aumentado la complejidad del producto d&aacute;ndoles m&aacute;s "vida" (universo m&aacute;s din&aacute;mico, existencia de muchos m&aacute;s NPC's, historias paralelas a la troncal, coherencia en el desarrollo y uso de objetos, m&aacute;s madurez en determinados aspectos, etc). Hablo de aumentar la complejidad y se deber&iacute;a de exigir, por toda la seriedad y robustez que "emana" esta producci&oacute;n a un simple vistazo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Uno de los problemas m&aacute;s graves de la fuerte linealidad en el desarrollo se deben a las graves incoherencias que incorpora el juego. &Eacute;stas se ven reflejadas tanto en la forma de viajar de un punto a otro del mapa o escenario (muy poco real), como en la nula existencia de un universo din&aacute;mico; ya puedes ir y venir mil veces a un sitio que, como sea de d&iacute;a, siempre ser&aacute; de d&iacute;a y esto mismo se puede aplicar a escenarios nocturnos. Otros problemas relacionados con la incoherencia son las llaves. El manejo de objetos en el juego se fundamenta, b&aacute;sicamente, en llaves que encontrar para abrir ciertas puertas o cofres y as&iacute; poder avanzar en el desarrollo de la aventura. Pues bien, muchas veces te encuentras o consigues llaves que luego abren las puertas m&aacute;s impensables o los cofres m&aacute;s extraviados. Esto no tiene, en absoluto, sentido y resulta ciertamente rid&iacute;culo de cara al dise&ntilde;o. Esto sin contar con que podemos manejar armas o escudos para los que no tenemos a&uacute;n nivel suficiente. Si eres de nivel 6 y te encuentras o, mejor dicho, consigues la &uacute;nica (y recalco &uacute;nica, porque la variedad de armas es preocupantemente escasa) arma de nivel 9, ¡adelante!. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No me puedo explicar c&oacute;mo errores de este tipo se pueden dar en un dise&ntilde;o tan lineal y, por lo tanto, prefijado y sin posibilidad, a priori, de incoherencias.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El sistema de magia del juego es tambi&eacute;n puramente arcade. Basta con tener alguno de los orbes que debemos de buscar para darse cuenta de que todo se reduce a elegirlo y atacar con &eacute;l. Cuando lo usemos, veremos que, dependiendo de la potencia escogida, as&iacute; nos disminuir&aacute; el man&aacute;. Al menos, el juego incorpora hechizos que no s&oacute;lo se fundamentan en el ataque. Tambi&eacute;n podemos lanzar curaciones o invocar criaturas que nos ayuden a luchar (c&oacute;mo no) contra nuestros enemigos. Sin embargo, resultan de muy escasa variedad.</P>
<center><table width="300"> 
<td><img src="jpg/silver4.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Una de las particularidades del combate, es que iremos aprendiendo golpes especiales.</center></font></td> 
</table></center><br>
<P ALIGN="JUSTIFY">Durante el desarrollo del juego, podremos manejar a un total de 3 personajes, esto es, a David y otros dos. En total, hay 4 personajes, si no recuerdo mal, entre los que escoger para tu grupo. Esto resulta interesante pero no efectivo ya que el hacer excesivas combinaciones acaba por desembocar en personajes de mediana experiencia, en lugar de dos espec&iacute;ficos bien preparados. Los personajes que nos acompa&ntilde;ar&aacute;n s&iacute; que tendr&aacute;n cierta personalidad pues, de vez en cuando, dar&aacute;n su opini&oacute;n o intervendr&aacute;n en los di&aacute;logos algo, esto &uacute;ltimo, de agradecer. As&iacute; mismo, el combate con ellos ser&aacute; controlado por la IA del juego y, en l&iacute;neas generales, &eacute;sta no resulta muy convincente. De todas formas, abre interesantes posibilidades para los juegos de rol en los que controlar a varios personajes.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">Conclusiones finales</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La documentaci&oacute;n del juego es muy mala ya que se reduce a unas pocas hojas de instrucciones, dando una pobre presentaci&oacute;n del producto. El juego, pese a venir decorado con dibujos de un indudable estilo manga, no los incorpora en su desarrollo. Por lo tanto, el uso de &eacute;stos se puede entender como una h&aacute;bil apuesta comercial para enga&ntilde;ar a jugadores del Final Fantasy VII. En otras palabras, no esper&eacute;is ver personajes poligonales de estilo manga, ni caras, ni nada similar. Lo &uacute;nico manga (a parte del "corte de manga" a los jugadores de rol ;) ) que aparece en el juego son los dibujos que se incluyen tanto en el manual como en la pantalla de cr&eacute;ditos, una vez que te acabas el producto. Para finalizar en el comentario de los detalles del juego, decir que la m&uacute;sica es muy buena y se acopla perfectamente al desarrollo del mismo. La carga del CD puede hacerse insufrible si no tienes un lector r&aacute;pido pues se leen datos del mismo siempre que pasamos de una pantalla a otra.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Silver es un juego que te arrastra hasta que te lo acabas, de eso no hay duda. Est&aacute; muy bien maquillado y servir&aacute; para encandilar a todos los que disfrutaron con el famoso Diablo. Incluso, es muy probable que produzca alguna que otra deserci&oacute;n de entre los incondicionales del cl&aacute;sico de Blizzard. Sin embargo, y al igual que en este &uacute;ltimo, la incre&iacute;ble simpleza y los pocos alicientes que tiene el jugador (ver fenomenales decorados y escuchar di&aacute;logos pertenecientes a una historia muy lineal) pueden acabar con la paciencia de &eacute;ste. El jugador tiene un peso muy secundario a lo largo de toda la aventura y eso no es bueno. Son muchas las ocasiones en las que te quedas mirando un escenario, luchando con tu personaje o vi&eacute;ndole dialogar y te preguntas qu&eacute; hubiera pasado si se hubiera hecho un desarrollo m&aacute;s complejo y con mas posibilidades. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En mi modesta opini&oacute;n, creo que este juego puede interesar a todos los que disfrutaron del Diablo y se quedaron deseando algo m&aacute;s de historia. B&aacute;sicamente, el juego viene a ser lo mismo (aunque con menos componente de rol y mucha m&aacute;s historia) y, por lo tanto, Silver no puede considerarse, ni por asomo, un juego de rol; es una videoaventura. A&uacute;n as&iacute;, el comentario lo ponemos en "Dimensi&oacute;n CRPG" porque suponemos que es donde t&uacute; te lo esperar&iacute;as encontrar.</P></FONT>


<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



