<HTML>
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:stratos@macom.es"> Antonio Arteaga.</A><br>
<FONT color="#009933" size=2 face="arial">Director de Stratos</font>
</b></FONT>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
A medio camino...
</FONT>
</H3>


<FONT color="#000000" size=2 face="arial" >        
<P align="justify">
<P ALIGN=JUSTIFY>
Te asalta la primera idea. Le vas dando forma. Te gusta y decides ponerte con ella. Por supuesto, tu juego ser&aacute; el mejor de los que se han visto hasta ahora, o por lo menos igual. En tu mente tienes claras las im&aacute;genes, los men&uacute;s, las animaciones... Decididamente, va a ser un gran juego.
<br>
Empiezas con las primeras rutinas. No vas a emplear a&uacute;n gr&aacute;ficos buenos, porque primero hay que probar. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tras horas y horas, la nave empieza a moverse como t&uacute; quer&iacute;as. ¡Esto funciona!. Te buscas un amiguete que dibuja bien y empiezan a cambiar los gr&aacute;ficos. Cada vez m&aacute;s, y mejores. Las rutinas siguen creciendo y ya aparecen los enemigos en pantalla.</P>
<P ALIGN="JUSTIFY">Bueno, no est&aacute; quedando exactamente como pensabas en un principio, pero tus amigos te dicen que les gusta mucho y que lo podr&aacute;s vender seguro.<br>
Entonces te asalta la primera duda. ¿Lo llevo a alguna distribuidora ya? ¿O me espero a tener algo m&aacute;s completo?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tomemos aqu&iacute; la cuesti&oacute;n y separemos los caminos. Si el lector opina que la demo debe entregarse ya, que pase al siguiente punto ( Elecci&oacute;n nº 1), y si opina que hay que desarrollarlo m&aacute;s, que pase al punto Elecci&oacute;n nº 2.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">Elecci&oacute;n nº 1: </P>
</I><P ALIGN="JUSTIFY">Buscas en las revistas la direcci&oacute;n de varias empresas de desarrollo. Eliges las que te parecen m&aacute;s importantes, preparas paquetes con manual impreso, descripci&oacute;n detallada y un juego de diskettes con la beta. Avisas que est&aacute; en fase de desarrollo y que vas a incluir esto, esto tambi&eacute;n y esto otro si es posible. Todos los datos de contacto y a esperar respuesta.
<br>Pasan los d&iacute;as, pasan los meses... Nada.</P>
<P ALIGN="JUSTIFY">(pasa al punto <I>Conclusi&oacute;n</I>)</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">Elecci&oacute;n nº 2:</P>
</I><P ALIGN="JUSTIFY">Tu amigo y t&uacute; os met&eacute;is de lleno con los gr&aacute;ficos. Sab&eacute;is que la primera impresi&oacute;n es la que cuenta. Van desech&aacute;ndose animaciones, pantallas... hasta que el resultado se ajusta a lo que pens&aacute;is puede ser un &eacute;xito seguro. Sigues el proceso del punto <I>Elecci&oacute;n nº 1</I>, eligiendo los destinatarios y enviando las demos. Despu&eacute;s de esperar, y esperar, y esperar... ¡por fin llega la llamada!. Han visto tu juego y le ven ciertas posibilidades, pero habr&aacute; que realizar unos peque&ntilde;os cambios. Conciertas la entrevista y cuando llega el d&iacute;a te presentas ante tu ¿posible? distribuidor.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">"Hay que mejorar mucho los gr&aacute;ficos. Estos no est&aacute;n mal, pero no llegan a la calidad que queremos
<br>Hay ciertas cosillas que no nos gustan. A ver si pod&eacute;is mejorar las rutinas para hacerlo m&aacute;s jugable.
<br>Esto est&aacute; bien, pero ¿no podr&iacute;ais incluir una fase de bonus en 3D? Eso se lleva mucho. Venga, &aacute;nimo, que vais bien..."</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Te queda un regusto amargo, pero est&aacute;s contento. Vuelta al trabajo y a ver si esto es lo que quer&iacute;an. Nuevo env&iacute;o de demos. M&aacute;s mejoras. M&aacute;s horas y nuevos env&iacute;os.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">"El juego ganar&iacute;a mucho si fuese totalmente en 3D. Si lo hac&eacute;is en 3D - y no dud&eacute;is que os ayudaremos en todo lo que podamos para hacerlo - dad por seguro que lo publicaremos."</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una cierta desesperaci&oacute;n se apodera de t&iacute;. Lo intentar&aacute;s, porque a estas alturas no vas a abandonar.</P>
<P ALIGN="JUSTIFY">¡Est&aacute;s a punto de sacar un juego al mercado! ¿No es eso lo que quer&iacute;as? Vamos all&aacute;...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pasan los d&iacute;as. Has tenido que reescribir todo el c&oacute;digo. Los gr&aacute;ficos ya no te sirven y el grafista est&aacute; mosqueado. Se resiste ese condenado bug. Llamas a la empresa y pides ayuda. </P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">"Hombre, te podemos echar una mano, pero no pienses que te vamos a hacer el c&oacute;digo. Para eso, lo hacemos nosotros enterito, ¿no?".</P>
<P ALIGN="JUSTIFY"></P>
</I><P ALIGN="JUSTIFY">Discutes con el grafista, hasta ahora tu mejor amigo. Discutes con la empresa. Y tomas la determinaci&oacute;n. Voy a pensar un nuevo juego y ya veremos con qui&eacute;n lo saco.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">Conclusi&oacute;n.</P>
</I><P ALIGN="JUSTIFY">Tantas y tantas horas de trabajo desperdiciadas. Tantas ilusiones y al final... nada. Esto es frecuente (m&aacute;s de lo que quisiera) en el mundo del desarrollo de juegos en Espa&ntilde;a. Es lo que se conoce por "<I>quedarse a medio camino</I>" en los c&iacute;rculos de la publicaci&oacute;n de software. Un juego que est&aacute; por encima de los habituales pero que no llega a calidad comercial.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De cada 100 juegos que siguen este proceso, tal vez 1 &oacute; 2 consiguen ser publicados a trav&eacute;s de empresas distribuidoras. Otros, si hay suerte, se consiguen publicar en revistas que regalan juegos a sus lectores. Los beneficios son la d&eacute;cima parte como mucho de lo que se esperaba.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Hubiera sido mejor plantearse desde el principio un juego m&aacute;s modesto y con menos trabajo, ya que al final iba a ir a una revista y se iba a cobrar esto? ¿Merece la pena arriesgarse buscando el &eacute;xito final?, ¿Si el juego no hubiera sido tan bueno, lo hubiese publicado la editorial?. Son preguntas que obtienen respuesta distinta para cada proyecto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero s&iacute; hay algo que no puede negarse: en nuestro pa&iacute;s se dedica una <I>m&iacute;nima</I> atenci&oacute;n al desarrollo de grupos no consagrados. De acuerdo, es un negocio y nadie se va a pillar con un producto que no sabe si va a tener salida. Pero hay otras formas de hacer las cosas: se pueden dar consejos, se pueden sacar ediciones de bajo coste, se pueden dar otros contactos por si acaso... y por supuesto siempre es mejor decir <I>"Mira, este juego no va a tener salida"</I> y evitar mayores males que dar cuerda a costa de las ilusiones de los desarrolladores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tal vez alg&uacute;n d&iacute;a en Espa&ntilde;a se consideren los productos nacionales como en otros pa&iacute;ses. En Sudam&eacute;rica, por ejemplo, si un grupo del pa&iacute;s termina un juego pod&eacute;is dar por sentado que todas las publicaciones hablar&aacute;n de &eacute;l como una joya. Tal vez no sea el mejor, tal vez no sea ni siquiera bueno, pero es suyo. Y, al fin y al cabo, ¿no tienen todos los juegos un valor desde el momento en que se hacen con ilusi&oacute;n y tratando de gustar a los futuros usuarios?, ¿No son una obra de arte en cierto modo?</P>
<P ALIGN="JUSTIFY">Que cada cual saque sus conclusiones personales. Que cada cual decida lo que quiere hacer.</P>
<P ALIGN="JUSTIFY">Pero que cada cual sepa muy bien por qu&eacute; lo hace, porque muchas veces es m&aacute;s importante el <I>POR QU&Eacute;</I> que el <I>C&Oacute;MO</I>. De esto se trata.</P>
<P ALIGN="JUSTIFY"></P></FONT>

</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
