<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>N</B></font><FONT color="#000000" size=2 face="arial"><B>intendo 64</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:srd@retemail.es">Samuel Rísquez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Legend of Zelda: The Ocarina of Time.</b></font>
<HR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Compa&ntilde;&iacute;a:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Nintendo.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Distribuidora:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Nintendo.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>G&eacute;nero:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Plataformas.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Idioma:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Castellano.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Plataforma:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Nintendo
64.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Nota:</FONT></FONT></B><FONT COLOR="#008800" SIZE=1><b> [Juego Sin Puntuar]</b></font>
<HR>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Un ni&ntilde;o duerme de
noche. El fr&iacute;o le invade. Un hada ha sido elegida para guiarle por
su camino hacia la salvaci&oacute;n de su reino.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Tras rechistar, el ni&ntilde;o
sale de su caba&ntilde;a en el bosque. Una ni&ntilde;a se le aproxima.
Respira profundamente y baja la escalera de mano. Vaya, ha tropezado.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&iquest;D&oacute;nde acaba
la ficci&oacute;n y d&oacute;nde empieza la realidad? Con los juegos de
Miyamoto nunca se sabe. Hasta que no pruebas Zelda: The Ocarina Of Time,
no te crees que de verdad es como si t&uacute; fueses ese ni&ntilde;o
que con una botella pide leche a una vaca, ese ni&ntilde;o que tiene
sus diferencias con el jefe de su clan, &eacute;se ni&ntilde;o sin hada
que vive atormentado por sus compa&ntilde;eros, ese ni&ntilde;o
elegido para salvar Hyrule. Y m&aacute;s adelante, ese joven que
mata dragones, ese joven que lucha con su sombra, ese joven
que galopando va de Kakariko al lago.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>El argumento</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Estamos en una &eacute;poca
medieval. Tres diosas crearon este reino, consumiendo todos sus
poderes en el llamado Triforce, que protege Hyrule. Pero, &iquest;qu&eacute;
pasar&iacute;a si un villano del desierto, con control sobre el tiempo,
la magia y la fuerza, quisiera desequilibrarlo?</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Pasar&iacute;a que ser&iacute;a
una excusa para que Miyamoto consumiese su mayor obra de arte.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Es incre&iacute;ble lo logrado
que est&aacute; el desarrollo. Cuando siendo peque&ntilde;o viajas a un
rancho y te encuentras con un potro que corre tras de ti si tocas una canci&oacute;n,
y luego cuando ese potro ya es un caballo que te ayuda en tu camino.
Cuando todos los ni&ntilde;os del bosque pasan de ti porque eres algo diferente,
y luego te admiran por tu pinta de guerrero. Es en esos momentos cuando
puedes decir “es fabuloso”. Es cierto: Zelda apenas tiene argumento. &iquest;Un
fallo? Quiz&aacute;s para otro juego s&iacute;; pero para &eacute;ste no.
El gui&oacute;n es muy simple, pero a cambio se ha cuidado mucho la evoluci&oacute;n
de los personajes, incluyendo al propio protagonista, o a Zelda, tal vez
la que m&aacute;s cambia durante los siete a&ntilde;os de diferencia temporal,
o tu amistad con Saria. Si, si, TU amistad con Saria, porque no es aqu&eacute;l
humanoide vestido de verde el que est&aacute; marginado, el que se enfrenta
a medusas, el que se enamora de los entra&ntilde;ables personajes: el que
hace todo eso eres t&uacute;. Y eso es algo de admirar.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<H4>Ambientación</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Al igual que pas&oacute;
con Super Mario, ya pod&eacute;is esperar los cl&oacute;nicos de este juego.
Tal vez con &eacute;ste ya no se atrevan porque ser&iacute;a muy evidente,
pero Zelda deja muchos caminos abiertos, despierta la imaginaci&oacute;n
de los dise&ntilde;adores.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>El colorido es incre&iacute;ble.
La ambientaci&oacute;n es fabulosa. Aqu&iacute;, de verdad notas cu&aacute;ndo
est&aacute;s en una cueva helada o cu&aacute;ndo est&aacute;s en el mism&iacute;simo
infierno. Incluso puedes sentir el fr&iacute;o o el calor, porque est&aacute;
todo tan bien recreado, que de la mism&iacute;sima pena que te da no poder
acabar de sentirlo todo que lo haces sin pensarlo.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Tal vez donde falle Zelda
es en que no ha sabido dar una buena excusa argumental como para justificar
el tener que pasar por chiquicientos paisajes diferentes. Vamos, la historia
de que hay no-se-cu&aacute;ntos elementos y que hay que juntarlos para
estabilizarlo est&aacute; muy visto. Ya que se han molestado tanto en hacer
realista las reacciones de los personajes, pod&iacute;an haber dado una
excusa mejor.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Pero mientras est&aacute;s
jugando, la ambientaci&oacute;n no te deja pensar en ello. Porque, mientras
est&aacute;s dentro de un &aacute;rbol matando ara&ntilde;as, &iquest;a
qui&eacute;n le importa que sea simplemente por hacer un nivel que ocurra
en un &aacute;rbol? Cuando est&aacute;s abri&eacute;ndote camino por el
hielo evitando que una estalagmita te parta la cabeza, &iquest;te importar&aacute;
mucho haber ido all&iacute; porque a alguien se le ocurri&oacute; meter
cierto objeto all&iacute; dentro? No. Mientras en otros juegos habr&iacute;a
que restar m&eacute;rito porque est&aacute;s continuamente pensando en
que el argumento no encaja, en Zelda no ocurre, porque el propio juego
no te deja pensar en nada m&aacute;s.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Ya s&oacute;lo resta declarar
que este juego es de los mejores en jugabilidad. Porque de acuerdo,
mientras juegas no piensas, pero sinceramente un argumento hay que mir&aacute;rselo
mejor. Hay que subir mucho m&eacute;rito por ocult&aacute;rtelo, pero una
vez te das cuenta, hay que restarlo.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Adem&aacute;s, hay que considerar
que Jap&oacute;n no nos ha tenido en cuenta. El juego no est&aacute; traducido
al castellano mientras que si lo est&aacute; al franc&eacute;s y alem&aacute;n,
cuando llevaban a&ntilde;os prometi&eacute;ndolo. Hubiera sido una oportunidad
inmejorable para que demostr&aacute;semos que en Espa&ntilde;a se compran
los juegos bien hechos, pero Nintendo tuvo que volverse atr&aacute;s porque
“en Espa&ntilde;a se vende tan poco que no vale la pena traducirlo porque
hay que sacarlo cu&aacute;nto antes para que lo compre mucha gente”. Parece
exagerado, pero yo no le veo una explicaci&oacute;n l&oacute;gica a este
asunto. Nintendo no pens&oacute; en nosotros cuando tom&oacute; la decisi&oacute;n
de no traducir el juego.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&iquest;Debe eso pagarse
con no comprarlo? Yo creo que no. Este Zelda es de lo mejor que puedes
encontrar actualmente, aunque la gu&iacute;a de textos que Nintendo Espa&ntilde;a
ha creado te lo pone dif&iacute;cil para entender algo. Yo no tuve demasiados
problemas, pero a los que el ingl&eacute;s no es su fuerte les decepcionar&aacute;
bastante este sistema. Y no cre&aacute;is que dejar de comprarlo ser&aacute;
una forma de hacer reaccionar a Nintendo: simplemente no nos traer&aacute;n
un pr&oacute;ximo Zelda, en el que Miyamoto ha confirmado que est&aacute;
trabajando. Tal vez para entonces reaccionen...</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Pero no nos vayamos con rodeos:
Zelda es fant&aacute;stico, Zelda m&aacute;s que un juego es tu segunda
vida, y Zelda debe estar en tu colecci&oacute;n particular. Si no, &iquest;qu&eacute;
seria de Hyrule?...</FONT></FONT>


<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="atfnin.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







