<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>N</B></font><FONT color="#000000" size=2 face="arial"><B>intendo 64</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:srd@retemail.es">Samuel Rísquez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<P align="justify">

<HR>





<font FACE ="ARIAL" size="3"><b>Título:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Super Mario 64.</b></font><br>

<HR>

<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Nintendo.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Nintendo.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Género:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Plataformas.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Nintendo 64.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Nota:</b></font>

<font FACE ="ARIAL" size=3 color="#FF0000"><B></b></font>

<HR>

<FONT FACE="Arial" SIZE=1><P ALIGN="JUSTIFY">NOTA: Actualmente, hacer un art&iacute;culo sobre Super Mario 64 no es lo mismo que haberlo hecho en su momento. Cuando &eacute;sta obra de arte lleg&oacute;, muchas cosas cambiaron tal como las conocemos. Al igual que ha pasado con casi todos los grandes juegos, muchos cl&oacute;nicos se han sucedido desde su aparici&oacute;n. Por ello, y por todo lo que este cartucho contiene, en casi todas las revistas se llevo un porcentaje de la nota muy por debajo del 100. Y una nota similar es la que podr&iacute;a llevarse ahora en &eacute;ste art&iacute;culo. Pero al ser un juego de &eacute;ste tipo, saldr&iacute;a muy mal parado en &eacute;stos momentos porque en su momento super&oacute; al resto. Por ello, he decidido no ponerle nota al juego. Porque, le pusiera la que le pusiera, no se la merecer&iacute;a. Al fin y al cabo, la puntuaci&oacute;n no es lo m&aacute;s importante, peor ser&iacute;a ponerla sin texto alguno...</P>

<P ALIGN="JUSTIFY">Y, ahora s&iacute;, d&eacute;jate llevar por la magia de Miyamoto y olvida lo dem&aacute;s...</P></font>

<hr>

<BR>



<font size=2 face=arial>

<FONT FACE="Arial">



<P ALIGN="JUSTIFY">Como ya he dicho antes, opinar sobre &eacute;ste juego en &eacute;stos momentos no es f&aacute;cil. En efecto, para otros juegos de antig&uuml;edad como Super Mario Kart –de &eacute;ste mismo personaje– s&iacute; que resulta sencillo, porque no han revolucionado nada, lo que no quiere decir que sean cuatro l&iacute;neas de programaci&oacute;n mal puestas.</P>



<P ALIGN="JUSTIFY">Despu&eacute;s de &eacute;sta pieza de coleccionista, muchos cl&oacute;nicos –no digais que no- se han sucedido, no s&oacute;lo en esta plataforma sino, sobretodo, en otras consolas. No voy a decir nombres, porque si bien es cierto que much&iacute;simos conceptos se han tomado de &eacute;ste cartucho, cada nuevo juego ha a&ntilde;adido algo nuevo al g&eacute;nero o simplemente ha hecho algo que haga que el tomar &eacute;ste juego como ejemplo sea algo m&aacute;s que se haya dicho en alguna que otra parte, porque de lo contrario, ya se han llevado su merecido en cifras de ventas o en puntuaciones medias...</P>



<P ALIGN="JUSTIFY">Y ahora, despu&eacute;s de &eacute;sta peque&ntilde;a clase &eacute;tica, para los –pocos- que no conoc&eacute;is las excelencias de las nuevas aventuras de Mario, ¿quereis que las repasemos? Vamos all&aacute;.</P>



<H4>Y... ¿qué revolución?</H4>

<P ALIGN="JUSTIFY">Much&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;&iacute;simas cosas, tanto dentro como fuera del mundo de las plataformas. Para empezar, fue el buque insignia de la revoluci&oacute;n de Nintendo, lo que demostr&oacute; de lo que era capaz la maquinita... De hecho, el engine de Zelda es una evoluci&oacute;n del de Mario 64. Pero tamb&iacute;en revolucion&oacute; el concepto de plataformas, de hecho, nunca en toda la historia de los videojuegos se ha visto tanto cl&oacute;nico suelto... Incluso en la propia m&aacute;quina. Porque Mario ten&iacute;a los mejores gr&aacute;ficos, el mejor engine, la mejor tecnolog&iacute;a... Pero eso tambi&eacute;n lo tuvo Banjo-Kazooie. A Mario nunca le ha faltado y, por lo menos hasta que viva Miyamoto, le faltar&aacute;, imaginaci&oacute;n, diversi&oacute;n, variedad y mucha, mucha creatividad. Nintendo, os hab&eacute;is superado a vosotros mismos (que ya es dif&iacute;cil).</P>



<H4>Primer de todo, ¿de qué va el juego?</H4>



<P ALIGN="JUSTIFY">Los juegos de Mario, todo hay que decirlo, nunca han tenido un argumento que sobresaliera, nunca sus programadores se han roto los cuernos para que la historia te absorbiera... Ni lo han necesitado.</P>



<P ALIGN="JUSTIFY">En &eacute;sta ocasi&oacute;n, la historia ha sido m&aacute;s simple que nunca: la princesita ha creado algo nuevo, maravilloso, que har&aacute; que Mario se tire a sus pies... un pastel, para ser mas exactos. As&iacute; que Mario va a su castillo –no nos explica si para ver a su amada o para zamparse su raci&oacute;n de nata- y, cu&aacute;l es su sorpresa que el reino ha sido asaltado por, nunca lo dir&iacute;ais... ¡Bowser! ¡Originalidad al poder!</P>



<P ALIGN="JUSTIFY">El caso es que Bowser ha robado las 120 estrellas que daban poder al castillo y que... bueno... hay que recuperarlas. Ademas, ha secuestrado a la princesita (y supongo que Mario no tiene acceso al pastel...).</P>



<H4>La diversión cuenta más que lo demás</H4>



<P ALIGN="JUSTIFY">Eso es lo que debi&oacute; pensar Miyamoto, porque es incre&iacute;blemente imposible aburrirse. ¿Por qu&eacute;? Porque los dise&ntilde;adores del juego no se limitaron a un solo estilo. En Super Mario 64 no s&oacute;lo hay plataformas: hay carreras, deslices por la nieve, punteria de disparo... Y la mayor&iacute;a de las estrellas tienen una forma diferente de conseguirlas, as&iacute; que hay juego para rato...</P>



<P ALIGN="JUSTIFY">Voy a daros una peque&ntilde;a muestra de lo que hay por hacer:</P>



<P ALIGN="JUSTIFY">Volar: ya en Super Mario World (Super Nintendo) se nos mostraron indicios que que Mario tend&iacute;a a volar. De hecho, en dicha genial&iacute;sima obra de hace m&aacute;s de cinco a&ntilde;os, m&aacute;s que volar daba un buen salto y &quot;aterrizaba bien&quot; (como el astronauta de Toy Story ;-)), pero en esta ocasi&oacute;n todo es diferente. En cada pantalla, deberemos localizar a una bomba rosa que, sin mando a distancia (¿tendr&aacute; telepat&iacute;a?) nos abre una escotilla que da acceso a la boca de un ca&ntilde;on. Y as&iacute; conseguimos... ¡Mario-Confeti! (es broma). Si se mete tan tranquilo, lo &uacute;nico que conseguiremos es que se de de morros con lo primero que encuentre, y en algunos casos puede doler, pero si lleva una gorra con alas... ¡vuela! ¡Si, literalmente, V-U-E-L-A! Y durante un buen rato, hasta que la gorra se agota... Y es que hasta Mario tiene defectos (¿alguien lo dudaba ;-)?).</P>



<P ALIGN="JUSTIFY">Nadar: Bueno, esta es ya muy t&iacute;pico de la saga Mario... Ya en la NES hizo sus primeros pinitos como excelente nadador (y buceador). As&iacute; que elevadlo a la tercera dimensi&oacute;n, y ver&eacute;is lo que puede llegar a ser... ¡Ah! Y dadle recuerdos al pecezote de las gafas de sol, me dio un buen susto el otro d&iacute;a...</P>



<P ALIGN="JUSTIFY">Competir: En unas cuantas ocasiones, nos encontraremos con personajes que nos retar&aacute;n a una peque&ntilde;a carrera. Estos son un graaan ping&uuml;ino, que nos pedir&aacute; que nos deslicemos con &eacute;l por una de las rampas, que en esta ocasi&oacute;n es, c&oacute;mo no de hielo. ¡Ah! Y para los tramposos, el ping&uuml;inito detecta cu&aacute;ndo hemos utilizado malas artes para ganar... Tambi&eacute;n nos encontraremos con una graaaaan tortuga, de nombre Koopa the Quick, y &eacute;ste repite... En el primer encuentro, nos har&aacute; subir monta&ntilde;a arriba... M&aacute;s adelante, deberemos ir a contraviento. En ambos casos, ser&aacute; incre&iacute;blemente entretenido, pero no esper&eacute;is ganad en el segundo a la primera... ni a la segunda... ni a...</P>



<P ALIGN="JUSTIFY">Montar sobre caparazones: Aunque pueda parecer lo mas rid&iacute;culo del planeta, es imprescindible en algunos momentos, para salir adelante, montarse sobre un caparaz&oacute;n e ir a toda velocidad por los escenarios –alrededor del 50%- que la contienen, aunque no siempre es necesaria, pero si te aburres es uno de los mejores remedios...</P>



<P ALIGN="JUSTIFY">Hay much&iacute;simas cosas m&aacute;s, pero no me gustar&iacute;a que alg&uacute;n alto ejecutivo de Nintendo leyese el art&iacute;culo (nunca se sabe) y contrataran al fontanero m&aacute;s carism&aacute;tico del mundo para que me diera una buena patada... No os quiero estropear la sorpresa. Bueno, SEGURO que a estas alturas ya todos hab&eacute;is jugado, pero para los que no... ¡que haceis frente el ordenador!</P>



<H4>Conclusión</H4>



<P ALIGN="JUSTIFY">Mario os apasionar&aacute; u os decepcionar&aacute;, os enganchar&aacute; u os repeler&aacute;, pero si os atrae la magia que envuelve al Mundo Nintendo, y a&uacute;n no la conoc&eacute;is... &Eacute;sta es la mejor toma de contacto.</P>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="atfnin.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







