<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>

<HR>

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>layStation</B></FONT></a>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:kyle_jx2@yahoo.com">Javier M.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<P align="justify">



<HR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>T&iacute;tulo:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Rollcage</FONT></FONT></FONT></B>
<BR>
<HR><B><FONT FACE="ARIAL"><FONT SIZE=+0><FONT COLOR="#000000">Compa&ntilde;&iacute;a:
</FONT><FONT COLOR="#008800">Attention to detail.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Distribuidora:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>Psygnosis.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Plataforma:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#008800"><FONT SIZE=+0>PlayStation.</FONT></FONT></FONT></B>
<BR><FONT COLOR="#000000"><B><FONT FACE="ARIAL"><FONT SIZE=+0>Nota:</FONT></FONT></B><FONT FACE="arial"><FONT SIZE=-1>
</FONT></FONT></FONT><B><FONT FACE="ARIAL"><FONT COLOR="#FF0000"><FONT SIZE=+0>90%.</FONT></FONT></FONT></B><FONT FACE="arial"><FONT COLOR="#000000"><FONT SIZE=-1>&nbsp;</FONT></FONT></FONT>&nbsp;
<HR>

<P align="justify"><img src="jpg/rolcov.jpg" align="left">
<FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Cuando muchos nos est&aacute;bamos
preguntando si Psygnosis desarrollar&iacute;a una tercera parte de Wipeout
(cuyo lanzamiento ha sido confirmado recientemente), la compa&ntilde;&iacute;a
de Liverpool decide sorprendernos con Rollcage. Descrito por algunos como
“Wipeout con&nbsp;ruedas”
(aunque con las suficientes diferencias como para que destaque por sus
propios m&eacute;ritos), lo cierto es que nos encontramos ante uno de los
mejores juegos de 1999, sin duda.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;Son evidentes las similitudes
de Rollcage con Wipeout, uno de los primeros juegos que salieron para Playstation.
Ambos juegos comparten la ambientaci&oacute;n futurista, la utilizaci&oacute;n
de armas y la banda sonora repleta de artistas techno. A pesar de ello,
Rollcage tiene suficientes elementos diferenciadores que le permiten brillar
con luz propia.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;En este juego podr&aacute;s
conducir varios veh&iacute;culos, cada uno con sus caracter&iacute;sticas
peculiares, pero que tienen una cosa en com&uacute;n: las enormes ruedas
con las que cuentan. Esta peculiaridad les permite a los veh&iacute;culos
cosas como subirse por las paredes o dar vueltas de campana sobre s&iacute;
mismos y quedarse al rev&eacute;s, algo a lo que cuesta un poco acostumbrarse.
Y es que, como en&nbsp; Wipeout,
el comportamiento de los veh&iacute;culos dista bastante de lo que uno
se espera (sobre todo si uno viene de la escuela de Gran Turismo o Toca
Touring Car): las primeras partidas te las pasar&aacute;s intentando controlar
al veh&iacute;culo, viendo como se sube por las paredes y da vueltas de
180&ordm; sobre s&iacute; mismo si te descuidas, derrapando constantemente
cuando chocas con otros veh&iacute;culos, rebotando contra otros obst&aacute;culos...
Hasta que coges el tranquillo y empiezas a apreciar la sutileza del control,
aprendiendo a utilizar las peculiaridades de tu veh&iacute;culo en tu propio
beneficio. Eso s&iacute;: el control de este juego es m&aacute;s asequible
que el de Wipeout (recuerdo que me pas&eacute; un d&iacute;a entero aprendiendo
a controlar aquellos veh&iacute;culos anti-gravedad), as&iacute; que, tras
unas pocas partidas, resulta relativamente f&aacute;cil manejar el veh&iacute;culo.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>
<br><br>
<center><IMG SRC="jpg/roll1.jpg" HEIGHT=188 WIDTH=250></center>
<br><br>
<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;Una vez que has aprendido
el manejo del veh&iacute;culo, vienen las armas. Estas aparecen aleatoriamente
en el circuito, y puedes llevar un m&aacute;ximo de dos armas a la vez.
Eso s&iacute;, debes tener cuidado ya que los dem&aacute;s veh&iacute;culos
tambi&eacute;n pueden recogerlas y utilizarlas contra ti. Existen tanto
armas ofensivas (la mayor&iacute;a) como defensivas (el escudo te concede
invulnerabilidad a cualquier ataque de los dem&aacute;s veh&iacute;culos),
y, para tener &eacute;xito en el juego, es imprescindible conocerlas todas
a fondo y utilizarlas en el momento adecuado.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P align="justify"><img src="jpg/roll2.jpg" align="right"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;Rollcage tiene dos
modos de juego principales: la modalidad contra el cron&oacute;metro, en
el que conduces t&uacute; solo en el circuito de tu elecci&oacute;n, intentando
batir tu propio r&eacute;cord; y las ligas, tres en concreto (G&eacute;minis,
Escorpio y Tauro). Al principio s&oacute;lo puedes escoger el nivel f&aacute;cil
(tres vueltas a cada circuito); una vez que has completado las tres ligas,
puedes elegir el nivel dif&iacute;cil, en el que&nbsp;te
aparecen los mismos circuitos, pero esta vez los enemigos son m&aacute;s
inteligentes. Si eres habilidoso y consigues ganar las ligas con el m&aacute;ximo
de puntos, puedes acceder a varias modalidades de juego, como el modo espejo
(que dobla el n&uacute;mero de circuitos) y otras modalidades para dos
jugadores. Eso s&iacute;: una vez has superado la primera liga, m&aacute;s
bien facilita, el nivel de dificultad aumenta progresivamente, siendo necesario
un buen conocimiento de los circuitos para alcanzar el &eacute;xito en
cada liga.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;Siendo un producto
de Psygnosis, es de esperar que la calidad audiovisual est&eacute; a la
m&aacute;xima altura. Los gr&aacute;ficos son, sin duda, espectaculares.
Destacar&iacute;a los efectos de luces y las explosiones, a lo que hay
que unir la variedad en el dise&ntilde;o de los circuitos y la rapidez
en el desarrollo del juego (es destacable la pr&aacute;ctica inexistencia
de ralentizaciones cuando hay muchos veh&iacute;culos en pantalla, algo
de lo que adolecen otros juegos). En lo referente al sonido, dejando de
lado los efectos sonoros (de gran calidad), destaca la banda sonora repleta
de artistas techno m&aacute;s bien desconocidos, si exceptuamos a Fat Boy
Slim. En este apartado he de decir que no me ha parecido tan atractiva
como la de Wipeout. Cuesti&oacute;n de gustos, supongo...</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>
<br><br>
<center><IMG SRC="jpg/roll3.jpg" HEIGHT=240 WIDTH=320></center>
<br><br>
<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>&nbsp;En resumen, Rollcage
es un juego excelente. Eso s&iacute;, es un juego arcade, en el que la
acci&oacute;n prima sobre el realismo (en la l&iacute;nea del ya mencionado
Wipeout y de Ridge Racer). Probablemente, a los fans de Gran Turismo o
Colin McRae Rally les decepcionar&aacute; la falta de realismo del juego,
pero los dem&aacute;s tendremos la oportunidad de jugar a uno de los mejores
juegos de 1999.</FONT></FONT><br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="atfsony.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







