<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a><HR>

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>layStation</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:kyle_jx2@yahoo.com">Javier M.</a>

</b></FONT>

<FONT color="#000000" size=2 face="arial">
<br><br><br><br><br><br>

<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> R-Type.</b></font><br>

<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Irem.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Sony Interactive Studios.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Shoot'em up.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> PlayStation.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 87%.</b></font>
<HR>
<BR>

 

<P ALIGN="JUSTIFY">En 1987, la empresa japonesa Irem lanz&oacute; una m&aacute;quina arcade que, con el tiempo, se convertir&iacute;a en legendaria. Considerado por algunos como el mejor <I>shoot'em up</I> de todos los tiempos, <B>R-Type </B>sorprendi&oacute; a los adictos a los salones recreativos y se convirti&oacute; en un &eacute;xito inmediato. L&oacute;gicamente, el siguiente paso fue la conversi&oacute;n a varios sistemas dom&eacute;sticos, tanto ordenadores como consolas, de entre los cuales destac&oacute; la conversi&oacute;n de NEC para su consola PC-Engine/Turbografx16: tal fue la perfecci&oacute;n de la conversi&oacute;n (el juego sali&oacute; a la venta en dos tarjetas<I> Hu-Card</I>, cada una conteniendo 4 niveles de la recreativa, algo inaudito en la &eacute;poca) que las consolas desaparec&iacute;an de las estanter&iacute;as a toda velocidad. La inevitable secuela aparecer&iacute;a en 1989<B> (R-Type II)</B>, e incluso habr&iacute;a una tercera parte, <B>R-Type Leo</B>, la cual no disfrut&oacute; del &eacute;xito de las anteriores.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">La aparici&oacute;n de <B>R-Types </B>(recopilaci&oacute;n que incluye las dos primeras partes de la saga), aparte de servir de aperitivo antes de la aparici&oacute;n de <B>R-Type Delta</B>, una versi&oacute;n totalmente renovada y adaptada a los gustos poligonales del presente, es una excelente oportunidad para disfrutar de un aut&eacute;ntico cl&aacute;sico que a&uacute;n puede ense&ntilde;ar muchas cosas a los desarrolladores del presente.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">¿Qu&eacute; es lo que hace tan especial a <B>R-Type</B>? En primer lugar, fue una de las primeras m&aacute;quinas en contar con tecnolog&iacute;a de 16 bits, lo cual podemos observar en la calidad de sus gr&aacute;ficos, que a&uacute;n hoy nos parecen atractivos. En segundo lugar, introdujo varias novedades en un g&eacute;nero (el de los <I>shoot’em up</I> o &quot;matamarcianos&quot;) que ya empezaba a estar saturado. La principal novedad era el sistema de disparo de la nave: no s&oacute;lo dispon&iacute;as del disparo normal, sino que, si manten&iacute;as pulsada la tecla de disparo, pod&iacute;as lanzar un rayo que devastaba todo lo que se interpon&iacute;a en su camino. Pero eso no era todo: no podemos olvidarnos del sat&eacute;lite que nos serv&iacute;a tanto de escudo como de potente arma extra, el cual pod&iacute;amos acoplar delante o detr&aacute;s de nuestra nave y, en cualquier momento, enviarlo contra los enemigos. Era imprescindible dominar ese peque&ntilde;o sat&eacute;lite para poder acceder a los niveles superiores.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">La conversi&oacute;n para Playstation es id&eacute;ntica a la m&aacute;quina original, aunque se han incluido algunos detalles como la compatibilidad con la funci&oacute;n vibratoria del mando Dual-Shock o la posibilidad de grabar autom&aacute;ticamente la partida a medida que vamos avanzando (lo cual, vista la extrema dificultad del juego, es un detalle muy de agradecer). ¿Que si recomendar&iacute;a su compra? Lo cierto es que no es un juego para todo el mundo: si est&aacute;s acostumbrado a gr&aacute;ficos poligonales de &uacute;ltima generaci&oacute;n, quiz&aacute;s deber&iacute;as esperar a que aparezca <B>R-Type Delta</B>. Si eres un nost&aacute;lgico que desea volver a vivir las sensaciones del pasado, este es, sin duda alguna, el mejor <I>pack retro</I> que ha aparecido para Playstation, aunque, a mi juicio, el precio (7.490 ptas.) es un poco alto: si lo sacaran a precio de serie <I>platinum</I>, ser&iacute;a una excelente compra.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Cuando pones en tu Playstation un juego que sali&oacute; hace m&aacute;s de 10 a&ntilde;os y te engancha de tal forma que no puedes parar, a pesar de que no trae ning&uacute;n pol&iacute;gono texturado, y por el que no parece haber pasado el tiempo, es una se&ntilde;al de que estamos ante un verdadero cl&aacute;sico. Quiz&aacute;s no te decidas a compr&aacute;rtelo, pero, por lo menos, se merece un alquiler... </P>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="atfsony.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







