<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>layStation</B></FONT></a>

</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Gran Turismo.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Sony Interactive Studios.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Sony Interactive Studios.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Simulación / Arcade automovilístico.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> PlayStation.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 87%.</b></font>
<HR>

<BR>
 
<P align="justify"><img src="jpg/gt00.jpg" align="left">
<P ALIGN="JUSTIFY">Todos los que alguna vez hemos tenido una de estas consolas a nuestra disposici&oacute;n sabemos las bondades y las deficiencias de la PlayStation. Los l&iacute;mites de esta ya veterana consola, que tanto &eacute;xito ha cosechado en todo el mundo, son bien conocidos y poco espacio hay para la sorpresa o la innovaci&oacute;n. ¡Mentira! Esto era lo que hasta hace bien poco pod&iacute;amos pensar, pero en el verano del 98 lleg&oacute; un nuevo t&iacute;tulo, de nombre <I>Gran Turismo</I>, que iba a cambiar la apreciaci&oacute;n de muchos de nosotros sobre cuales eran los l&iacute;mites reales de la consola.</P>
<P ALIGN="JUSTIFY">Y es que, despu&eacute;s de contemplar por primera vez la repetici&oacute;n de una carrera en <I>Gran Turismo</I>, uno no puede dejar de asombrarse ante la calidad gr&aacute;fica que este peque&ntilde;o aparatito gris es capaz de desplegar. ¡Hey! ¿Ese coche de reluciente carrocer&iacute;a que evoluciona por el circuito es el m&iacute;o? ¡Si parece la secuencia de introducci&oacute;n!</P>
<I><P ALIGN="JUSTIFY">Gran Turismo</I> es, en esencia, un arcade. Aunque se pueden apreciar en &eacute;l variados elementos m&aacute;s propios de un simulador no llega a merecer el subt&iacute;tulo que ostenta: &quot;The Real Driving Simulator&quot;, pero esto es una cuesti&oacute;n meramente formal. Lo importante en un juego es que nos proporcione muchas horas de entretenimiento y en esta faceta <I>Gran Turismo</I> cumple con nota muy alta. A pesar de contar con tan s&oacute;lo dos modalidades de juego, lo cierto es que con una sola le hubiese bastado, ya que las carreras arcade no son m&aacute;s que un peque&ntilde;o aperitivo para ir tom&aacute;ndole la medida al juego antes de entrar en su verdadera salsa: el modo Gran Turismo. </P>
<table align="right">
<td><center><img src="jpg/gt01.jpg"></center></td>
<tr>
<td width="*"><center><font size=1 face=arial><b>La calidad gr&aacute;fica, sobre todo en las repeticiones, es excepcional</b></center></td>
</table>
<P ALIGN="JUSTIFY">En este modo de juego empezaremos con una m&iacute;sera cantidad de dinero, la cual invertiremos en comprar un coche de segunda mano, totalmente de serie y que no ser&aacute; precisamente una &quot;bomba&quot;. Con este cacharro tendremos que contentarnos con participar en carreras de bajo nivel y, poco a poco, ir ganando el dinero necesario para mejorar sus prestaciones. Llegado el momento estaremos en condiciones de comprarnos un coche m&aacute;s competitivo, con el que acceder a carreras de m&aacute;s entidad y labrarnos un futuro en el duro deporte de las cuatro ruedas. No estamos limitados a un &uacute;nico veh&iacute;culo sino que tenemos un amplio garaje a nuestra disposici&oacute;n. Cuando el dinero ya no sea un obst&aacute;culo no habr&aacute; forma de resistirse a tener varios modelos y &quot;prepararlos&quot; con las mejores piezas disponibles para participar en los eventos especiales, donde se limita el tipo de veh&iacute;culo. Y es que, convenientemente puesto a punto, hasta el coche m&aacute;s &quot;civilizado&quot; se puede convertir en un pura sangre sediento de circuito.</P>
<P ALIGN="JUSTIFY">Uno de los grandes aciertos de este juego es, precisamente, que la diversi&oacute;n no se centra &uacute;nica y exclusivamente en correr por la pista con el gas a fondo y ganar carrera tras carrera. El hecho de ir mejorando nuestro coche y comprobando como afectan las modificaciones realizadas a su comportamiento resulta tambi&eacute;n tremendamente divertido y, en mi opini&oacute;n, es el verdadero acierto de <I>Gran Turismo</I>, que le hace destacarse del resto de la competencia. Entre las m&uacute;ltiples mejoras que podemos efectuar en nuestro veh&iacute;culo se encuentran distintos niveles de turbo, disminuir su peso, suspensiones, frenos, escape, cambio, neum&aacute;ticos, equilibrado del motor, y un mont&oacute;n m&aacute;s, todas convenientemente explicadas en cuanto a su influencia en el comportamiento del coche y la respuesta del motor. Con las modificaciones adecuadas se nos abre la posibilidad de configurar el coche para cada tipo de circuito: un par motor m&aacute;s alto en baja y un cambio corto para circuitos &quot;ratoneros&quot;, llenos de curvas lentas, o un turbo soplando a toda potencia en alta y un cambio algo m&aacute;s largo para conseguir altas velocidades en circuitos r&aacute;pidos.</P>
<center>
<table>
<td><center><img src="jpg/gt03.jpg"></center></td>
<tr>
<td width="*"><center><font size=1 face=arial><b>Las posibilidades de configuraci&oacute;n del veh&iacute;culo son casi ilimitadas</b></center></td>
</table></center>

<P ALIGN="JUSTIFY">Otro detalle original es que, para poder correr en determinadas carreras necesitaremos una licencia de conducci&oacute;n deportiva que, por cierto, no es nada sencilla de obtener. Hay tres tipos de licencia y el examen consta de diversas pruebas que ser&aacute;n cada vez m&aacute;s dif&iacute;ciles. En cuanto a los coches que ofrece el juego, los amantes de los deportivos japoneses estar&aacute;n encantados, con tanto Mazda, Honda, Nissan, Toyota, etc. mientras que los que nos decantamos por la tradicional artesan&iacute;a europea del autom&oacute;vil echamos de menos marcas tan prestigiosas como Ferrari, Porsche, Mercedes, Lotus, etc. En cualquier caso, disponemos de un buen mont&oacute;n de coches para no aburrirnos en mucho tiempo.</P>
<table align="left">
<td><center><img src="jpg/gt02.jpg"></center></td>
<tr>
<td width="*"><center><font size=1 face=arial><b>Esta es la consecuencia m&aacute;s probable de un veh&iacute;culo mal equilibrado</b></center></td>
</table>
<P ALIGN="JUSTIFY">Todos estos coches se comportan, adem&aacute;s, de forma bastante realista teniendo en cuenta que hablamos de un juego eminentemente arcade. Los trompos est&aacute;n asegurados en las primeras vueltas, hasta que empecemos a cogerle la medida al coche. La variedad de comportamientos es realmente notoria y var&iacute;a desde la gran docilidad de los modelos de serie hasta la brutal entrega de potencia de los deportivos m&aacute;s salvajes; desde la tendencia a subvirar de los tracci&oacute;n delantera hasta la divertida y nerviosa zaga de los tracci&oacute;n trasera. En cualquier caso, sea cual sea el coche que pilotemos, es toda una gozada y conozco gente poco aficionada a los coches que empez&oacute; &quot;echando una partidita&quot; con la consola del hermano peque&ntilde;o y ha acabado totalmente &quot;colgada&quot; con <I>Gran Turismo</I>. Y no estoy hablando de m&iacute;… Bueno, al menos no s&oacute;lo de m&iacute;.</P>
<P ALIGN="JUSTIFY">En resumen, si te gustan los juegos de carreras no deber&iacute;as perderte este t&iacute;tulo por nada del mundo. Probablemente, el &uacute;nico que se le pueda comparar en calidad es el Need for Speed III pero para m&iacute;, Gran Turismo le gana en diversi&oacute;n y cuenta con una mayor riqueza de juego. Si no eres especialmente aficionado a este g&eacute;nero deber&iacute;as echarle un vistazo de todas formas porque es, sin duda, un se&ntilde;or juego.</P>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>
<A HREF="atfsony.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



