<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>

<HR>

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>layStation</B></FONT></a>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:kyle_jx2@yahoo.com">Javier M.</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<P align="justify">

<HR>











<font FACE ="ARIAL" size="3"><b>Título:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Apocalypse.</b></font><br>

<HR>

<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Neversoft.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Activision.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Género:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Arcade.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>

<font FACE ="ARIAL" size=3 color="#008800"><B> PlayStation.</b></font><br>

<font FACE ="ARIAL" size="3"><b>Nota:</b></font>

<font FACE ="ARIAL" size=3 color="#FF0000"><B> 89%.</b></font>

<HR>



<BR>

 

<P ALIGN="JUSTIFY">Hace ya bastante tiempo que llegaron las primeras noticias de este juego, anunciado como uno de los grandes bombazos de la temporada: Activision hab&iacute;a conseguido fichar a Bruce Willis para que protagonizara uno de sus juegos. La idea original consist&iacute;a en que el jugador controlar&iacute;a a un personaje que tendr&iacute;a a Bruce como ayudante a lo largo de los diferentes niveles del juego. M&aacute;s adelante se descart&oacute; esta idea, suponemos que por una raz&oacute;n: si tienes a Bruce Willis (en este caso, una versi&oacute;n virtual del protagonista de <I>La jungla de cristal)</I> como reclamo publicitario, parece l&oacute;gico que lo pongas como protagonista principal del juego. La gente <I>quiere</I> ser Bruce. De ah&iacute; que, en <I>Apocalyse</I>, controles a un Bruce Willis digitalizado, en el papel del cient&iacute;fico convertido en justiciero Trey Kincaid.</P>

<P ALIGN="JUSTIFY"></P>

<table align="right">

<td><img src="jpg/apo1.jpg"></td>

</table>

<P ALIGN="JUSTIFY">Si tuvi&eacute;ramos que definir a <I>Apocalypse</I> con una palabra, esa palabra ser&iacute;a <B>espect&aacute;culo</B>. Imag&iacute;nate que James Cameron dirigiera <I>Terminator 3</I> y contara con Arnold Schwarzeneger, Bruce Willis y Wesley Snipes para hacer la pel&iacute;cula. Ser&iacute;a incre&iacute;ble, ¿no? Pues<I> Apocalyse</I> ser&iacute;a (salvando las distancias) algo similar: acci&oacute;n fren&eacute;tica y sin descanso, explosiones y efectos especiales por doquier, atronadores efectos de sonido... El juego es una mezcla de <I>Loaded</I> (uno de los primeros juegos que salieron para Playstation) y <I>Pandemonium</I>:  es un juego de acci&oacute;n en el que tienes que disparar a todo lo que se mueva (como <I>Loaded</I>), con notas de gore incluidas, a trav&eacute;s de unos escenarios cuya espectacularidad se ve aumentada por los constantes movimientos de c&aacute;mara (como en <I>Pandemonium</I>).</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Gr&aacute;ficamente, el juego no est&aacute; nada mal. Si bien la Playstation no puede competir con los &uacute;ltimos t&iacute;tulos para PC con tarjeta aceleradora 3D, lo cierto es que las compa&ntilde;&iacute;as desarrolladoras est&aacute;n rebasando los l&iacute;mites de la Playstation, y se nota en este t&iacute;tulo. Algunos niveles est&aacute;n mejor conseguidos que otros, eso s&iacute;, pero, en general, los gr&aacute;ficos son notables. Menci&oacute;n especial merecen los paneles gigantes de v&iacute;deo que aparecen en algunos niveles, en los que se pueden ver algunas de las bandas que han contribuido a la banda sonora: simplemente, espectaculares.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Por su parte, el sonido es correcto. A los t&iacute;picos sonidos de explosiones y armas de fuego hay que unir una banda sonora orientada al rock. A m&iacute; me gustan m&aacute;s las bandas sonoras estilo <I>Wipeout</I>, pero siempre viene bien un cambio...</P>

<P ALIGN="JUSTIFY"></P>

<center>

<table>

<td><img src="jpg/apo2.jpg"></td>

</table></center>



<P ALIGN="JUSTIFY">En cuanto a la jugabilidad, s&oacute;lo mencionar que es uno de los juegos m&aacute;s fren&eacute;ticos que existen. La acci&oacute;n se sucede sin descanso, s&oacute;lo interrumpida por las escenas de v&iacute;deo entre niveles, cuya calidad es alta, y en las que puedes contemplar a un Bruce Willis perfectamente digitalizado para la ocasi&oacute;n. Te recomiendo que utilices un mando Dual-Shock para este juego: aunque funciona perfectamente con un mando normal, el mando anal&oacute;gico es ideal para llegar a los &uacute;ltimos niveles. El sistema de control utilizado es similar al de juegos como <I>Robotron</I> o <I>Smash TV</I>: el mando anal&oacute;gico izquierdo mueve al personaje, mientras que el derecho te sirve para disparar en todas las direcciones. Al principio es un poco lioso, pero, cuando te acostumbras, es perfecto.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">A pesar de todo, el juego tiene sus defectos. El principal es que, en ocasiones, el punto de vista utilizado no te permite observar claramente d&oacute;nde se encuentra tu personaje, lo cual suele traducirse en saltos mal calculados que te hacen perder vidas, algo especialmente irritante en los &uacute;ltimos niveles. Por otro lado, el juego puede hacerse algo corto: exceptuando los dos &uacute;ltimos niveles, que son bastante dif&iacute;ciles, el resto del juego no tiene un nivel de dificultad demasiado elevado, y es posible que te acabes el juego en pocos d&iacute;as, si eres un jugador m&aacute;s o menos experimentado.</P>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="atfsony.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







