<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>layStation</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<P align="justify">
<HR>


<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Oddworld: Abe's Oddysee.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Oddworld Inhabitants.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> GT Interactive.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Plataformas.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Español.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> PlayStation.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 80%.</b></font>
<HR>

<BR>
 
<P align="justify"><img src="jpg/abe00.jpg" align="left">
<P ALIGN="JUSTIFY">El mundo del videojuego est&aacute; lleno de novedades que, cuando uno las mira m&aacute;s de cerca, resultan ser nuevos planteamientos de algo ya ensayado con anterioridad. Tomar una f&oacute;rmula que ya ha demostrado tener &eacute;xito y darle una nueva imagen, aportando en el proceso algunas nuevas ideas, suele dar buenos resultados si se hace bien. Otro caso muy distinto es cuando la compa&ntilde;&iacute;a desarrolladora se limita a copiar las buenas ideas pensando que con eso ya est&aacute; todo hecho, es lo que yo suelo llamar &quot;el mismo perro con distinto collar&quot;. Tranquilos, si os est&aacute;is preguntando a cu&aacute;l de las dos categor&iacute;as pertenece el juego que estoy a punto de comentar, la respuesta es sencilla y rotunda: sin duda de ning&uacute;n g&eacute;nero, a la primera.</P>
<P ALIGN="JUSTIFY">Paso a continuaci&oacute;n a explicarme un poco mejor. Muchos de vosotros os acordar&eacute;is de un juego que sali&oacute; al mercado all&aacute; por el a&ntilde;o 1995, llamado &quot;Fade To Black&quot; desarrollado por Delphine. Este no era ni m&aacute;s ni menos que una segunda parte en 3D de todo un cl&aacute;sico del videojuego, tambi&eacute;n creado por Delphine, y que algunos nost&aacute;lgicos entre los que me cuento recordamos de vez en cuando como uno de los m&aacute;s entretenidos que hemos tenido la suerte de jugar. Por supuesto, me estoy refiriendo a &quot;Flashback&quot;. Mezclando de forma magistral los g&eacute;neros de arcade y aventura y dotando al conjunto de unos gr&aacute;ficos de calidad soberbia para el momento mediante una nueva t&eacute;cnica de animaci&oacute;n llamada &quot;rotoscope&quot; produjo un resultado dif&iacute;cil de olvidar.</P>
<P ALIGN="JUSTIFY">Como suele suceder en estos casos, &quot;Flashback&quot; cre&oacute; escuela y le sucedieron varios &quot;clones&quot;, muchos de los cuales pertenecer&iacute;an claramente a la segunda categor&iacute;a de las mencionadas al principio. Uno de los &uacute;ltimos que recuerdo —y quiz&aacute;s de los mejor realizados— fue el &quot;Blackthorne&quot; o &quot;Blackhawk&quot; (que por ambos nombres se le conoci&oacute;) creado por Blizzard e Interplay en el 94.</P>
<table align="left">
<td><center><img src="jpg/abe01.jpg"></center></td>
<tr>
<td width="*"><center><font size=1 face=arial><b>Abe es un extraterrestre bastante feo pero muy simp&aacute;tico</b></center></td>
</table>

<P ALIGN="JUSTIFY">A estas alturas os estar&eacute;is preguntando a qu&eacute; viene tanto rollo. Aunque tambi&eacute;n es muy probable que hay&aacute;is deducido que, sencillamente, al ver por vez primera el juego <I>Oddworld: Abe’s Oddysee</I> uno no puede dejar de apreciar ciertas similitudes de planteamiento con &quot;Flashback&quot;. En este t&iacute;tulo encarnamos a un habitante de Oddworld (que es un mundo bastante extra&ntilde;o, como su propio nombre indica) perteneciente a la raza de los Mudokons, la cual lleva mucho tiempo esclavizada por otra raza, los Glukkons, que los emplea como mano de obra para sus f&aacute;bricas de procesamiento de carne. Este simp&aacute;tico personaje de nombre Abe descubre un buen d&iacute;a que su raza no es empleada por los Glukkons solamente como esclavos sino que tambi&eacute;n planean convertirlos en un nuevo y delicioso manjar. Visto el panorama tan poco prometedor decide escapar y ayudar a sus cong&eacute;neres a hacer lo propio. Para conseguirlo debemos guiar a Abe a lo largo de varios niveles dise&ntilde;ados con gran originalidad, tanto en lo que se refiere al dise&ntilde;o gr&aacute;fico como a la concepci&oacute;n de los puzles que componen la aventura.</P>
<P ALIGN="JUSTIFY">En cuanto al apartado gr&aacute;fico, la calidad de los fondos es sobresaliente, dando una perfecta ambientaci&oacute;n &quot;extraterrestre&quot; al juego. Los movimientos de Abe y el resto de los personajes son muy fluidos tambi&eacute;n y todo ello sin emplear t&eacute;cnicas novedosas, ni tres dimensiones, ni &quot;motion capture&quot;, … Todo realizado mediante pura y simple animaci&oacute;n tradicional y con mucho talento. Los chicos de Oddworld Inhabitants nos demuestran con su trabajo que son las buenas ideas y la buena realizaci&oacute;n las que producen un buen juego y no las tecnolog&iacute;as revolucionarias (al menos no por s&iacute; solas). En lo sonoro tampoco defrauda en absoluto, con unos efectos de ambientaci&oacute;n de lo m&aacute;s conseguidos, como por ejemplo el trinar de los p&aacute;jaros en los bosques. Lo m&aacute;s original es la capacidad de hablar de Abe —con una vocecilla muy simp&aacute;tica y en castellano— y el papel que esto desempe&ntilde;a en el desarrollo del juego ya que, mediante la conversaci&oacute;n, silbidos y… otros sonidos, podemos indicar a otros personajes que ejecuten una serie de acciones que ser&aacute;n imprescindibles para continuar avanzando. Abe tambi&eacute;n sabe cantar y esto vuelve especialmente locos a los est&uacute;pidos Sligs, hecho del que nos beneficiaremos en m&aacute;s de una ocasi&oacute;n ya que podemos poseerlos y controlar sus movimientos e incluso &quot;suicidarlos&quot;. Esta posibilidad de poseer a otros personajes es uno de los m&aacute;s claros ejemplos de imaginaci&oacute;n de los muchos que destila el juego.</P>
<P ALIGN="JUSTIFY">En cuanto a los puzles, son de lo m&aacute;s variado y para solventarlos tendremos que usar todo el abanico de acciones que es capaz de realizar Abe. Adem&aacute;s del ya mencionado talento vocal, Abe es especialista en agacharse, rodar, escabullirse de puntillas sin hacer ruido, saltar, esconderse entre las sombras, etc. adem&aacute;s de manejar toda una serie de objetos como palancas, bombas, piedras y otros muchos. Algunos de estos puzles son un poco complicados pero con perseverancia los podremos superar. Por cierto, vienen genial para hacerse con el manejo de nuestro simp&aacute;tico Abe las primeras pantallas en las que se nos muestran, a modo de tutorial, todas las posibilidades a nuestro alcance.</P>
<table align="right">
<td><center><img src="jpg/abe02.jpg"></center></td>
<tr>
<td width="*"><center><font size=1 face=arial><b>Los gr&aacute;ficos son sensacionales y los puzles muy variados</b></center></td>
</table>

<P ALIGN="JUSTIFY">En ciertos niveles podremos cabalgar a nuestro fiel compa&ntilde;ero —y bicho feo donde los haya— de nombre Elum. Su participaci&oacute;n se limitar&aacute; a permitirnos saltar distancias m&aacute;s largas y a hacernos pasar un rato divertido observando sus movimientos, pero merece la pena. Hay otros muchos detalles en el juego que no os voy a contar porque os estropear&iacute;a la diversi&oacute;n, as&iacute; que comprobadlo por vosotros mismos.</P>
<P ALIGN="JUSTIFY">En pocas palabras y para finalizar. Si sois nost&aacute;lgicos del videojuego o simplemente os gusta este tipo de juegos que mezclan plataformas y aventura compraos <I>Oddword: Abe’s Oddysee</I> sin dudarlo ni un instante. Os proporcionar&aacute; muchas horas de entretenimiento con ese sabor a juego &quot;de los de antes&quot; y adem&aacute;s ahora lo ten&eacute;is en edici&oacute;n Platinum a un precio interesante. Solamente si conocisteis el &quot;Flashback&quot; y fuisteis de los pocos a los que no les gust&oacute; os recomendar&iacute;a prescindir de Abe. Y, a&uacute;n as&iacute;, yo le dar&iacute;a una oportunidad. ¡Ah! Se me olvidaba. Si despu&eacute;s de terminarlo alguien se queda con ganas de m&aacute;s ya est&aacute; disponible la segunda parte &quot;Oddworld: Abe’s Exoddus&quot;.</P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>
<A HREF="atfsony.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



