<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>L</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>a Biblioteca</B></FONT><BR>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=3 face="arial"><B>ula Macedo<font color="#cc0000">n</font>ia</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>S</B></font><FONT color="#000000" size=2 face="arial"><B>ección Programación Gráfica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:oscarg@salleurl.edu">Oscar García "Kokopus".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>


<h3>
Interactive Computer Graphics, a top-down approach with OpenGL </h3>
<b>
Edward Angel.
<br>
Addison Wesley
<br>
ISBN: 0-201-85571-2</b>
<BR>
<br>
<p align=justify>

Ya era hora de que apareciera un libro con el que se pudiera empezar a programar casi directamente a la vez que se lee sin necesidad de tener que pasar a trav&eacute;s de cientos de paginas plagadas de complicadas f&oacute;rmulas matem&aacute;ticas. </P>
<P ALIGN="JUSTIFY">Edward Angel, el autor del libro, tiene un sensacional curriculum gr&aacute;fico fruto de sus experiencias como profesor e investigador en diversas universidades norteamericanas. Actualmente se encuentra en la universidad de Nuevo M&eacute;jico, USA. Como el mismo sugiere en el prologo del libro, OpenGL supone una estupenda herramienta docente de cara a programar gr&aacute;ficos de bajo nivel sin tener que perder mucho tiempo en elucubraciones matem&aacute;ticas complejas. </P>
<P ALIGN="JUSTIFY">El libro es ameno e inteligible para el principiante y resolutivo en las consultas del mas experimentado.&nbsp; Cada capitulo intenta cubrir una determinada tem&aacute;tica gr&aacute;fica de forma completa de manera que una consulta especifica puede realizarse r&aacute;pidamente con un solo vistazo al &iacute;ndice. </P>
<P ALIGN="JUSTIFY">Esta orientado b&aacute;sicamente a personas con conocimientos de lenguaje C, algo de &aacute;lgebra lineal y trigonometr&iacute;a y estructuras b&aacute;sicas ( arrays, listas, arboles ... ). </P>
<P ALIGN="JUSTIFY">A trav&eacute;s de 10 cap&iacute;tulos se repasan adem&aacute;s de los t&iacute;picos temas gr&aacute;ficos ( arquitecturas gr&aacute;ficas, color, visitando, proyecciones, &aacute;lgebra, transformaciones, sombras, texturas... ) algunas aplicaciones concretas muy actuales como interacci&oacute;n con el usuario, fractales, simulaci&oacute;n f&iacute;sica con part&iacute;culas y curvas complejas. </P>
<P ALIGN="JUSTIFY">Muy notable el numero de diagramas y figuras a lo largo del libro que definitivamente facilitan much&iacute;simo su comprensi&oacute;n, en especial en los temas referidos a proyecciones y transformaciones. Adem&aacute;s al final de cada capitulo se proponen diversos ejercicios relacionados con este para tal de ampliar nuestro conocimiento "pensando" un poco. </P>
<P ALIGN="JUSTIFY">Por otra parte y como viene siendo habitual en esta clase de libros, el autor recomienda algunas lecturas interesantes de otros libros. As&iacute; menciona al final de cada capitulo que puede leerse como suplemento para profundizar en el tema. </P>
<P ALIGN="JUSTIFY">Por otra parte contamos con tres completos ap&eacute;ndices que contienen todos los listados completos, en C, de los programas de ejemplo y algunas claves sobre &aacute;lgebra lineal ( espacios y matrices ), temas de obligada lectura si se pretende operar con geometr&iacute;a 3D. Eso si, no incluye CD-ROM, aunque esto no es un gran problema si ten&eacute;is en cuenta que el autor proporciona una direcci&oacute;n FTP para que teng&aacute;is acceso a todos los programas del libro de forma gratuita. Al final de este articulo ten&eacute;is un enlace a esta direcci&oacute;n. </P>
<P ALIGN="JUSTIFY">Se acompa&ntilde;a el libro de unas estupendas ilustraciones centrales a todo color referenciadas por el autor en determinados puntos del texto. Son ejemplos muy claros y actuales de lo que puede hacerse y te ayudan considerablemente a entender conceptos tales como "antialiasing", sombreado, proyecciones, fractales, efectos de niebla o uso de part&iacute;culas en una animaci&oacute;n. </P>
<P ALIGN="JUSTIFY">Como redactor del curso de gr&aacute;ficos con OpenGL y por tanto usuario de esta librer&iacute;a, creo que es un muy buen libro para empezar a darse un "garbeo" por el mundillo gr&aacute;fico 3D. No tiene la profundidad que otros, como los manuales de referencia OpenGL o "Introducci&oacute;n a la graficacion por ordenador" de Foley, pero es gracias a eso y a su car&aacute;cter practico que te permite obtener resultados casi desde el primer dia. </P>
<P ALIGN="JUSTIFY">Pensad que importantes universidades americanas como USC (University of Southern California) o UNM ( University of New Mexico ), lo utilizan como texto principal en sus clases de gr&aacute;ficos. Concretamente yo lo uso continuamente como referencia en el curso de OpenGL que imparto en esta revista. </P>
<P ALIGN="JUSTIFY">Yo utilizo la versi&oacute;n inglesa del libro y por el momento no tengo noticias de que este traducido a nuestra lengua. De todas maneras esta escrito de manera practica e informal, evitando as&iacute; que el primer problema para entender la matem&aacute;tica subyacente sea el idioma. </P>
<P ALIGN="JUSTIFY">Como conclusi&oacute;n dir&eacute; que si estas empezando a interesarte por los gr&aacute;ficos y te decides a usar OpenGL, te lo recomiendo, es sin duda TU libro. Si por contra eres experto/a en &aacute;lgebra lineal, entiendes de proyecciones, sabes lo que son coordenadas homog&eacute;neas y te pasas el dia "texturizando", hombre quiz&aacute;s ya sabes demasiado y se te puede quedar corto. De todas formas creo que incluso como referencia para el experto es muy interesante como manual de continua consulta. </P>
<P ALIGN="JUSTIFY">Para mas informaci&oacute;n: </P>

<ul>
<P ALIGN="JUSTIFY"><LI>Consulta el libro en la editorial <A HREF="http://cseng.aw.com/bookdetail.qry?ISBN=0-201-85571-2&amp;ptype=0" target="_new"><FONT FACE="Arial" SIZE=2>aqu&iacute;</FONT></A><FONT FACE="Arial" SIZE=2>. </LI></P>
<P ALIGN="JUSTIFY"><LI>Consulta la pagina del autor <A HREF="http://www.cs.unm.edu/~angel/" target="_new"><FONT FACE="Arial" SIZE=2>aqu&iacute;</FONT></A><FONT FACE="Arial" SIZE=2>. </LI></P>
<P ALIGN="JUSTIFY"><LI>Consulta v&iacute;a FTP los ejemplos del libro <A HREF="ftp://ftp.aw.com/cseng/authors/angel/intcg/Prog_Files/"><FONT FACE="Arial" SIZE=2>aqu&iacute;</FONT></A><FONT FACE="Arial" SIZE=2>. </LI></P></ul>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index05.htm"><font FACE="ARIAL"><B>[La Biblioteca]</B></font></a> <hR>
<A HREF="biblioc.htm"><font FACE="ARIAL"><B>[Sección Programación Gráfica]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">LA BIBLIOTECA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

