<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

</p> <br><br><br><br>
<H3>Solución al Ultima VII; The Black Gate</H3>
<table align="left">
<td><img src="gif/u7boxlk.gif" ></td>
</table>

<FONT color="#000000" size=2 face=arial><p align="justify">
En
esta ocasión os voy a ofrecer la solución de uno de los mejores juegos de
Rol (por no decir el mejor) que existe pese a tener ya unos cuantos añitos. Sin
embargo, siendo lo que es, un juego de la importantísima saga Ultima del señor
Garriot, creo que era indispensable realizar una solución como esta y, además,
detallada y narrada.<br>
Ni que decir tiene que si tienes algún tipo de duda puedes ponerte en contacto
conmigo, ya sabes, Miguel Angel o Beren si te gustan más los nicks. Mi e-mail
es: <A HREF="mailto:isaura@arrakis.es">isaura@arrakis.es</a>.
<br><br>
Bueno, ya no me enrollo más, ahí va la solución de esta obra de arte.

<br><br>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Comenzando el juego</B>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face=arial>
Caminas fuera de la puerta lunar roja en Trinsic. Iolo te ve y te saluda con alegr&iacute;a, tambi&eacute;n te habla sobre recientes asesinatos en esta ciudad. El alcalde viene y te pregunta si quieres investigar los asesinatos, ¿a que esperas? di que si y hemos comenzado esta impresionante aventura.<BR>
<BR>
<B>Trinsic</P>
</B><P ALIGN="JUSTIFY">
Empieza por los establos (al norte). Toma la llave junto al cuerpo, recuerda siempre hablar con todos en el juego, no solo es necesario sino que enriquece el juego. Sal de los establos y ve hacia la casa de Spark, el hijo de la v&iacute;ctima. Habla con el y si te interesa recl&uacute;talo, tiene gran destreza (30), pero no es muy fuerte. Usa la llave para abrir el cofre en la planta superior.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nota: No es &eacute;tico, pero muchas veces es necesario robar para solventar gastos, comprar comida, etc., as&iacute; que si lo consideras necesario, roba, pero aseg&uacute;rate de que nadie te vea. Prosigue la investigaci&oacute;n con Klog (hermandad), Gilberto el guardia y luego Gargan (en ese orden). A estas alturas ya habr&aacute;s escuchado hablar de Abraham y Elizabeth, y de Garfio. Ve a la Alcald&iacute;a y dale tu informe al Alcalde, responde unas preguntas y ya te puedes ir, cruza la puerta norte, atraviesa el pantano y llegamos a Paws.</P>

<B>Paws</B><BR>
<BR>
En esta pobre villa pronto oir&aacute;s sobre un ladr&oacute;n. Puedes investigar los enigmas que se te plantearan atrav&eacute;s del juego, aunque no es necesario (yo recomiendo hacerlo, un avatar no teme a nada, y no se cansa de ayudar a la gente ;-). Habla con Feridwyn (hermandad) y con Morphin (carnicer&iacute;a, lugar barato para comprar comida). ¿Estas listo? Vamos a Britain.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Britain</B><BR>
<BR>
Primero ve al Castillo de Lord British (norte). El te dar&aacute; el Orbe de las lunas y te ofrecer&aacute; armas y tu libro de hechizos. Toma la llave del estudio del rey, y luego ve a su habitaci&oacute;n. En una sala al oeste veras una palanca, tira de ella, y entra en los pasadizos del palacio. Moviendo palancas llegaras a la escalera. Sube, y ve al noroeste, al almac&eacute;n, abre con la llave y toma todo lo que necesites. Al sur de ese lugar encontraras a Wilson (otro enigma menor). H&aacute;blale a el y luego a Lord British para liberarle. Al oeste del almac&eacute;n habr&aacute;s visto una sala con armas, armaduras y un mosquete. Para abrir este lugar ve a la cocina del castillo, en una sala al este, detr&aacute;s de un barril encontraras una palanca, tira de de ella y VOILA! ya tienes mosquete.<BR>
</P>
<I><P ALIGN="JUSTIFY">Nota : Para conseguir municiones haz doble click en los grandes huesos de animales (por ejemplo los del pantano entre Trinsic y Paws).</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Miranda te dar&aacute; un documento que deber&aacute;s darle al gobernador de Cove. Ahora es un buen momento para explorar Britain. Encontr&aacute;s a Shamino y a Sentri, buenos compa&ntilde;eros de equipo (Shamino deber&iacute;a ser obligatorio, es uno de los compa&ntilde;eros oficiales). Habla con Batlin, y dile que quieres formar parte de la hermandad. El tambi&eacute;n te dir&aacute; que Liz y Abraham han salido hacia Minoc, lugar al que tienes que ir a llevar el paquete. Habla con todos, como dije antes, y antes de irte ve al museo en la noche y toma "prestadas" las rocas lunares. Con ellas podr&aacute;s usar los hechizos de marcar y retornar, que recomiendo que consigas lo mas r&aacute;pido posible. Ahora vamos al oeste, por el camino de piedra y luego de tierra, atravesando la granja del OVNI, el sucio lago Lock al sur y llegamos a Cove.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cove</B><BR>
<BR>
Dale el documento a Lord Heater, el alcalde, y mas tarde devu&eacute;lveselo a Miranda. Habla con Rudyom el mago. Lee su diario, y toma 4 rocas negras y la vara violeta (transmutador/vara de Rudyom). Habla con la gente, y luego con Natassia (esta generalmente en el altar, saliendo de Cove al sur). Parece que tenemos mucho atractivo, ¿no?. Vuelve a Britain, entrega el documento, y toma el camino de Cove nuevamente, pero esta vez toma el camino a trav&eacute;s del pantano al norte, y vayamos a Minoc. Nota : El camino a trav&eacute;s del pantano es peligroso, tambi&eacute;n se puede llegar a Minoc en barco si dispones del dinero suficiente. Esto es mas seguro, pero tambi&eacute;n problem&aacute;tico, teniendo en cuenta que el juego espera que entres por el sur y no por el norte, de manera que encontraras el pueblo vac&iacute;o a menos que vayas al sur del pueblo, salgas y vuelvas a entrar.<BR>
<BR>
<B>Minoc</B><BR>
<BR>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/ulcol1.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial>
<p align="justify">
Encontraras una banda de gitanos en el camino. Habla con ellos, y haz que la adivina Margarita te adivine la suerte (si has hablado con Chuckles en Britain y has resuelto su juego de palabras ya sabr&aacute;s que hay que hacer esto). Continua hasta Minoc y luego al aserradero, donde el ultimo asesinato tuvo lugar. Toma la daga serpentinia del lugar, y habla con la gente. Dale el paquete a Elynor, y sabr&aacute;s que Liz y Abraham han ido a Paws (ya empezamos con esta carrerita). Explora la ciudad, conoce a sus habitantes, y luego vuelve a Paws.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">Nota : El paquete no debe ser abierto, sin embargo da igual si lo haces, la informaci&oacute;n no es muy importante, y Batlin te obligara a realizar una segunda prueba, lo abras o no.</P>
</I><P ALIGN="JUSTIFY"><BR>
<B>Paws (2ª parte)</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Feridwyn te dir&aacute; que Liz y Abraham han ido a Jhelom (que raro... jeje). Ve al negocio de Beverlea y compra un reloj de arena. Ahora puedes elegir entre ir a Jhelom o a Yew, yo prefiero ir a Jhelom a recobrar a mi ultimo compa&ntilde;ero, Dupre, pero tu haz lo que quieras.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Jhelom</B><BR>
<BR>
Encontraras a Dupre en la taberna, conviene reclutarlo, es un gran guerrero y uno de los cuatro compa&ntilde;eros oficiales (Iolo, Shamino y Dupre). El tema de la bandera de honor es uno de los enigmas solitarios, resu&eacute;lvelo si quieres. Habla con todos, y te dir&aacute;n que Liz y Abraham salieron rumbo a Britain (puff...). Preg&uacute;ntale a DeSnel por la daga que encontraste en Minoc. Luego vuelve a Britain.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Britain (2ª parte)</P>
</B><P ALIGN="JUSTIFY"><BR>
Habla con Batlin, el te dir&aacute; que la segunda prueba es en el Calabozo Destard, as&iacute; que ve all&iacute; (suroeste de Trinsic). La cueva es la segunda, en la primera encontraras un unicornio. Dentro de la cueva encontraras gran cantidad de tesoros (Y DE DRAGONES!!!). Parece que Batlin ya lo tenia planeado, pero somos mucho mas fuertes que el, SOMOS AVATARES!!!. Toma lo que quieras, en lo posible toma las espadas de cristal, ser&aacute;n muy &uacute;tiles mas adelante. </P>
<P ALIGN="JUSTIFY"><BR>
<I>Nota : Puede que por un error del juego, entrando en la primera cueva (la del drag&oacute;n), recorri&eacute;ndola hasta el final encontraras un cofre, toma lo de dentro y vuelve a Britain, Baltin creer&aacute; que has ido a Destard.</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Luego de todo esto vuelve victorioso a Britain, y habla con Batlin. Te dir&aacute; que vuelvas a la filial de la hermandad a las 9 pm. Haz lo que quieras hasta entonces (recomiendo dormir). A las 9 ve y hazte miembro, no le prestes atenci&oacute;n a tus amigos y responde bien. Aseg&uacute;rate a partir de ahora que llevas siempre el medall&oacute;n puesto, cambiara la manera de ver de la gente con la que hables (generalmente para mal). Parece que Liz y Abraham han ido a Vesper, pero primero vamos a Yew (asegurate de entrenar antes, viaje muy dificil y de conseguir el hechizo de eliminar bloqueo magico).<BR>
<BR>
<B>Bosque de Yew</P>
</B><P ALIGN="JUSTIFY"><BR>
Toma desde Britain el camino al oeste y al norte, cruzando todo el bosque, hasta llegar a la abad&iacute;a de Empath. Habla con los monjes, Taylor the hablara de los emps y de los fuegos fatuos. para hablar con los emps necesitaras miel, de la cueva de las abejas (sur de la abad&iacute;a). Otro monje (a la entrada), te pedir&aacute; que le consigas una poci&oacute;n negra (invisibilidad) de Nicodemus. Antes de hacerlo mira la lista de criminales peligrosos en la prisi&oacute;n al oeste de la abad&iacute;a, adem&aacute;s habr&aacute;s notado que ning&uacute;n otro monje conoce a este ultimo, Kreg. Antes de ir a la cueva explora la ciudad (o lo que sea). Sobre el linde este del camino, intern&aacute;ndose un poco en el bosque la encontraras. Ahora vamos a la cueva (lugar peligroso) al sur de la abad&iacute;a. Las abejas no se enojaran contigo a menos que toques su miel, en ese momento prep&aacute;rate para la batalla. Puedes huir (COBARDE!!!), o pelear y matar a las abejas. Ahora estamos listos para el pueblo emp.<BR>
<BR>
<B>Pueblo Emp</P>
</B><P ALIGN="JUSTIFY"><BR>
Salva antes, puede ser peligroso. Ahora int&eacute;rnate en el bosque muy hacia el este, hasta ver unos arboles de hojas azules. Aqui es. Busca al llamado Trellek, el te hablara del padre de Natassia, y que para acompa&ntilde;arte deber&aacute;s pedirle permiso a su esposa (Saralek). Ella te dir&aacute; que hables con el lider (Solomon), el cual te dar&aacute; un contrato que le debes hacer firmar al le&ntilde;ador. Este vive en una de las casas de la supuesta ciudad de Yew. Cuando lo firme devu&eacute;lveselo a Solomon. Saralek te dir&aacute; que minti&oacute;, pero Trellek te podr&aacute; dar un silbato, no desesperes.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Fuegos Fatuos</P>
</B><P ALIGN="JUSTIFY"><BR>
Los Fuegos Fatuos son esas peque&ntilde;as bolitas azules que vuelan, seguramente has visto alguno en el bosque. La gran mayor&iacute;a se encuentra en un castillo en ruinas entre la ciudad y el pueblo de los emps, lo podr&aacute;s ver en el mapa, como un rect&aacute;ngulo marr&oacute;n cerca de las monta&ntilde;as. NI SE TE OCURRA ATACAR UNO!!!! (en todo caso salva la partida antes de hacerlo, insensato, mmhhh). Cuando veas alguno cerca usa el silbato y Xorinia (el F. F.) te hablara, agota todas las opciones de dialogo, y te dir&aacute; que para hablar con el se&ntilde;or del tiempo necesitaras darles el cuaderno de notas de Alagner. El vive en Nueva Magincia, as&iacute; que mas tarde lo veremos.<BR>
<BR>
<B>Vesper</B><BR>
<BR>
Vesper es una ciudad en el desierto, al este de Cove. Puedes llegar caminando o por barco (Vesper no tiene puerto, pero lo puedes dejar por ahi). Habla con todos, como siempre, y sabr&aacute;s por medio de Cador que Liz y Abraham (nuevamente) se han ido, ahora hacia Moonglow. Pasa por la mina, explora el lado de la ciudad de las gargolas, cuidado con lo que dices en la taberna, jeje. Ahora vamos a Moonglow.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Moonglow</B><BR>
<BR>
Isla de Moonglow, conviene ir en barco. Habla con la gente y explora la ciudad. Visita el Liceo. En la hermandad te diran que Liz y Abraham fueron a Terfin (sorpresa, sorpresa!). Ahora ve al observatorio y consigue el cristal que hace falta (lo tiene Addom, un viajero en la ciudad). Ahora al norte encontraras la casa de Penumbra, la bruja que se puso a dormir, as&iacute; que DESPIERTALA!!!!!. Tendr&aacute;s que poner ciertos objetos cerca de la placa de metal de la puerta, que si la lees te dar&aacute; unas pistas de que hacer. Los objetos son : un martillo, un anillo de oro (supongo que cualquiera sirve, pero no lo se), una ganz&uacute;a, un ovillo de hilo y algo mas, lee la placa e aver&iacute;gualo!!. Una vez dentro despi&eacute;rtala con una poci&oacute;n o con tu hechizo de despertar. Ella te dir&aacute; que pongas roca negra en los pilares que la rodean. Como ya los tienes, ponlos, y te dir&aacute; que consigas el anillo et&eacute;reo, y cree que la g&aacute;rgola Draxinosum lo tiene. El vive en Terfin, y como los compa&ntilde;eros de la hermandad tambi&eacute;n est&aacute;n all&aacute; (por lo menos, eso te han dicho), vamos all&aacute;.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Terfin</B><BR>
<BR>
Esta isla esta al sur, y es el lugar donde viven las g&aacute;rgolas despu&eacute;s del cataclismo de su mundo (ver anteriores ultimas). Habla con todos, y hazles saber a todos, especialmente al sacerdote de los altares de la muerte de Inamo (la g&aacute;rgola de Trinsic, ¿recuerdas?). El entrenador de Terfin es especialmente bueno, aprovecha que estas aqui y entrena. Draxinosum te dir&aacute; que el anillo le fue vendido al Sultan de Spektran. Quan, de la hermandad te dir&aacute; que Liz y Abraham han ido al retiro de la hermandad. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Isla de Spektran</P>
</B><P ALIGN="JUSTIFY"><BR>
Esta peque&ntilde;a isla esta al norte de Terfin. La puerta del palacio se abre sola, y dentro esta el sult&aacute;n (totalmente loco). El anillo esta en el fondo de la casa, en un cuarto custodiado por una arp&iacute;a de piedra. Si gustas de leer los libros que hay en el juego, sabr&aacute;s que dicen que la arp&iacute;a de piedra es un arma peligrosa, Y TIENEN RAZON!!!, t&oacute;mala desprevenida y no habr&aacute; problemas, dale un poco de tiempo, y tus amigos sufriran las consecuencias. Toma la llave del cuerpo de la arp&iacute;a, y toma el anillo et&eacute;reo. Ll&eacute;vaselo a Penumbra en Moonglow, y lo hechizara para ti. Ahora estas preparado para lo dif&iacute;cil, aseg&uacute;rate de que llevas una espada de cristal y vamos al calabozo Deceit.<BR>
<BR>
<B>Calabozo Deceit</P>
</B><P ALIGN="JUSTIFY"><BR>
Este nefasto lugar esta en la isla Dagger, al norte de Moonglow. El camino es un poco intrincado, pero no lo suficiente para despistar al Avatar, as&iacute; que vamos alla, recorre las galer&iacute;as, busca paredes falsas cuando no sepas por donde salir, y lucha!. Si encuentras a los c&iacute;clopes , h&aacute;blales. Cuando llegues a la habitaci&oacute;n con un generador , deja a todos tus amigos en la entrada, ponte el anillo, empu&ntilde;a la espada de cristal y entra al generador. Este tipo rojo es la raz&oacute;n de la espada de cristal, DESTRUYELO!!!!, toma el tetraedro (MUY IMPORTANTE!!!) y recupera a tus amigos. Ahora es momento de ir a hablar de una vez con Alagner.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Nueva Magincia</P>
</B><P ALIGN="JUSTIFY"><BR>
No es un lugar muy importante. La casa de Alagner esta en el punto mas al norte de la isla. El te prestara el cuaderno solo si puedes contestar la pregunta de la vida y la muerte. El &uacute;nico capaz de darte la respuesta es "El Torturado", que vive en Skara Brae. Necesitaras el hechizo de "Sesi&oacute;n de Espiritismo" antes de ir all&iacute;.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Skara Brae</P>
</B><P ALIGN="JUSTIFY"><BR>
Toma el camino al oeste de Britain, pero esta vez hacia el oeste y al sur. Encontraras un embarcadero. Usa el cuerno para llamar al barquero, y luego usa el hechizo de espiritismo para hablarle. El te llevara a la isla. Habla con los fantasmas, especialmente con Mordra y Trent el herrero. Toma la caja de musica del herrero. Ahora ve a la torre oscura, al noroeste, y all&iacute; usa la caja para llamar la atenci&oacute;n de la esposa de Trent, ella te dar&aacute; un anillo. Trent ahora finalizara la jaula de almas para ti (te pedir&aacute; una barra de hierro, hay muchas en el cementerio). Ahora busca las siguientes pociones : </P>
<P ALIGN="JUSTIFY"></P>
<OL TYPE="I">

<P ALIGN="JUSTIFY"><LI>Esencia de Mandragora (naranja hirviente) </LI></P>
<P ALIGN="JUSTIFY"><LI>Poci&oacute;n curativa (amarilla) </LI></P>
<P ALIGN="JUSTIFY"><LI>Poci&oacute;n de invisibilidad (negra) </LI></P>
<P ALIGN="JUSTIFY"><LI>Un frasco de poci&oacute;n vac&iacute;o </LI></P></OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora ll&eacute;valas a la casa del Alquimista, donde encontraras un aparato con varios tubos. En los tres tubos de la izquierda usa las pociones y en el de la derecha el frasco vac&iacute;o, haz doble click y listo. Ahora ll&eacute;vate la jaula y la poci&oacute;n a la torre oscura a medianoche. Usa la jaula en el pozo de las almas, al cual tendr&aacute;s que entrar mediante una pared falsa junto a las escaleras, al norte del castillo. Cuando el vampiro este en su cama de piedra, en el centro del castillo usa la jaula en el , y luego la poci&oacute;n. Esto matara al vampiro y revivir&aacute; al verdadero Horance. H&aacute;blale, y sabr&aacute;s que hace falta un sacrificio. Habla con el gobernador (Forsythe), y luego preg&uacute;ntale a todos. Al final vuelve a hablar con Forsythe, y el lo har&aacute;. Ll&eacute;valo al pozo de almas, y lo destruir&aacute;s. Ahora ve a hablar con el Torturado, y te dir&aacute; que NO hay respuesta a la pregunta.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Nueva Magincia (2ª parte)</P>
</B><P ALIGN="JUSTIFY"><BR>

Vuelve a hablar con Alagner, que te dar&aacute; la llave de su almac&eacute;n, el gran edificio junto a su casa. Este lugar es un laberinto, aunque no muy complicado, y podr&aacute;s encontrar cosas interesantes en el camino. Cuando llegues a un sal&oacute;n grande, con una mesa, usa todo lo que tengas a tu alcance (preferiblemente cajas y la mesa de ayuda), y forma una escalera hasta el cuarto en la parte superior. Toma lo que quieras, y no te olvides del cuaderno, l&eacute;elo si quieres, tiene cosas muy interesantes. Ll&eacute;vaselo a los Fuegos Fatuos (Xorinia). Ellos te dir&aacute;n que para hablar con el se&ntilde;or del tiempo debes usar el orbe de las lunas en cualquier lugar al noroeste, y te dar&aacute;n informaci&oacute;n sobre el guardi&aacute;n. Ahora es el turno del Se&ntilde;or del Tiempo.</P>
<P ALIGN="JUSTIFY"><BR>
<B>El Se&ntilde;or del Tiempo</P>
</B><P ALIGN="JUSTIFY"><BR>
Usa el orbe como te dije, y llegaras a el. El te hablara del Calabozo Despise, el generador esf&eacute;rico, y el reloj encantado que necesitaras. Nicodemus, el mago de Yew lo podr&aacute; hechizar. Ll&eacute;vale el reloj que le compraste a Beverlea. Una vez que has hecho esto, equ&iacute;pate bien, gana algo de experiencia, entrena, y vamos Nueva Magincia. Cuando lleguemos (Oh Dios MIO!!) veremos con horror que Alagner ha sido descuartizado. Prep&aacute;rate para lo mejor. Mira en su bola de cristal y AHI ESTAN!!! Son Elizabeth y Abraham!!!!! junto con Garfio!. Ahora que ya esta, vamos al calabozo Despise.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Calabozo Despise</P>
</B><P ALIGN="JUSTIFY"><BR>
A la entrada del calabozo, o por ah&iacute; cerca, encontrar&aacute;s la alfombra m&aacute;gica de la que Rudyom hablaba. Si la usas, debes saber que NO DEBES VOLAR SOBRE LA ISLA DEL AVATAR!!!, esto puede causar que una puerta muy importante se cierre para siempre, y por lo tanto, deber&iacute;as volver a empezar. El calabozo esta en las monta&ntilde;as al norte de Britain, solo sigue las monta&ntilde;as al noroeste hasta encontrar la entrada. Dentro te encontraras en un laberinto de teletransportadores. Cuando encuentres un cartel sigue al este y sales del laberinto. Sigue los t&uacute;neles sur y oeste generalmente hasta llegar al generador. Nuevamente antes de acercarte deja a tus amigos, y entra (aseg&uacute;rate de llevar contigo el reloj). Encontraras un laberinto de puertas lunares, &uacute;salas en este orden :</P>
<P ALIGN="JUSTIFY"></P>
<OL TYPE="I">

<P ALIGN="JUSTIFY"><LI>Rojo </LI></P>
<P ALIGN="JUSTIFY"><LI>Azul </LI></P>
<P ALIGN="JUSTIFY"><LI>Azul </LI></P>
<P ALIGN="JUSTIFY"><LI>Rojo </LI></P></OL>

<P ALIGN="JUSTIFY"><BR>
Destruye el generador, toma la esfera (MUY IMPORTANTE TAMBIEN!!) y vete. Ahora volvamos a la b&uacute;squeda de Liz y Abraham. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Retiro de la Hermandad</P>
</B><P ALIGN="JUSTIFY"><BR>
Esta peque&ntilde;a isla esta al oeste de Terfin. Aseg&uacute;rate de que tienes puesto el medall&oacute;n y h&aacute;blale al hombre de la puerta, te dar&aacute; una llave. Te dice que no entres en la cueva del norte, pero quien es el para decirle al avatar lo que tiene que hacer??, adelante, entra. Habla con la gente de dentro, y mata a la guardiana. Cuidado con este generador, no te le acerques demasiado o morir&aacute;s. una vez que veas lo que hace, vete a hablar con el Se&ntilde;or del Tiempo (puedes usar el reloj), que te dir&aacute; que necesitas un yelmo de cadelita. Ahora puedes elegir la soluci&oacute;n r&aacute;pida, o la normal. Para la soluci&oacute;n r&aacute;pida, saltearse el pr&oacute;ximo paso.</P>
<P ALIGN="JUSTIFY"><BR><br>
<P ALIGN="JUSTIFY"><center>
<table>
<td><img src="jpg/solguar.jpg" ></td>
</table></center><br>
<FONT color="#000000" size=2 face=arial>
<p align="justify"><br>
<B>Moonglow (2ª parte)</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Vuelve a la ciudad, habla con los del observatorio y los del liceo, y te enteraras que la cadelita venia incrustada en un meteorito, que se supone que cayo en una extra&ntilde;a isla, as&iacute; que vamos a buscarla.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Isla de Ambrosia</P>
</B><P ALIGN="JUSTIFY"><BR>
Para llegar aqui solo tienes que ir al lugar ocupado por la rosa de los vientos en tu mapa (este de Minoc, muy al norte de Moonglow, noreste de Vesper). Veras una entrada a una cueva en la parte norte, junto a un hada que esta loqu&iacute;sima. Entra, ve al oeste, y luego al sur (cuidado con el vampiro). La cadelita la guarda una hydra de tres cabezas, DESTRUYELA!!, y toma una pieza de cadelita. Vete a Minoc y habla con Zorn, el herrero, el te hara el yelmo. Vuelve al retiro de la hermandad, deja a tus amigos y entra al generador (con el casco puesto). Aqu&iacute; no puedo ayudarte, este rompecabezas es siempre distinto (creo). Cuidado con las bolas de fuego y otras trampas. A medida que te pares en ciertos puntos, iran apareciendo puentes. Cubrir&aacute;s alrededor del 100% de los puentes antes llegar al medio (recomiendo salvar mucho). Destruye el generador, toma el cubo (no necesito decir que es MUY IMPORTANTE) y sal de aqu&iacute;. Vamos a la isla de los bucaneros (al norte, cerca de Britain). </P>
<P ALIGN="JUSTIFY"><BR>
<B>Isla de los Bucaneros</P>
</B><P ALIGN="JUSTIFY"><BR>
Si has pasado por aqu&iacute; antes, ent&eacute;rate de que el cubo hace que la gente diga la verdad, puede que muchos di&aacute;logos cambien. Danag, de la hermandad te dar&aacute; jugosa informaci&oacute;n, as&iacute; como en la taberna. Habla con los del casino (sala de juegos). Sintag te dar&aacute; una llave que lleva a la guarida secreta de Garfio. Busca y recorre todo el lugar, veras una lista de los asesinatos, y veras que tu y Lord British est&aacute;n anotados. Toma la llave que tiene en uno de sus cofres. Los t&uacute;neles conectan Las Aguas, La Hermandad y las sala de juegos. Encontraras al falso avatar. Ahora es momento de ir a por los malditos lideres de la hermandad, as&iacute; que A LA ISLA DEL AVATAR!!!<BR>
</P>
<I><P ALIGN="JUSTIFY">Nota : Algo muy divertido ahora que tienes el cubo de la verdad, es ir recorriendo de nuevo las ciudades de Britannia, y descubrir quien te ha mentido (Klog de Trinsic esta muy bien).</P>
<P ALIGN="JUSTIFY"></P>
</I><P ALIGN="JUSTIFY">Nota 2 : No vayas a la isla del avatar a menos de que est&eacute;s bien entrenado, y tengas buenas armas, ser&aacute; un viaje dif&iacute;cil.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nota 3 : Hay una manera de entrar a la guarida de Garfio sin la llave, encu&eacute;ntrala si puedes, jejej</P>
<P ALIGN="JUSTIFY"><BR>
<B>Isla del Avatar</P>
</B><P ALIGN="JUSTIFY"><BR>
Usa la llave de Garfio para abrir la puerta (sur). Ahora estamos en un gran laberinto/calabozo. Atravi&eacute;salo, es la parte final de juego, no esperes mi ayuda!. Solo te dir&eacute; que debes buscar mucho puertas ocultas, y paredes ilusorias. Cuando llegues a la sala de la hermandad mueve el medallon (lo necesitaras para encontrar el trono de la virtud). Te teletransportara a una de las tres salas cada vez que te sientes en el. Una cuarta silla, la Silla del Cambio, har&aacute; que el trono de la virtud te transporte a un cuarto lugar, cuando te sientes en el. Este lugar es el sal&oacute;n de la Puerta Negra!!!<BR>
<BR>
<B>La Puerta Negra</P>
</B><P ALIGN="JUSTIFY"><BR>
AL FIN!!. Todos est&aacute;n aqu&iacute;, Batlin, Garfio y Forskis, Elizabeth y Abraham. MUESTRALES QUIEN ES EL AVATAR!!!!. Luego de la masacre (jeje), veras que Batlin escapa (ya lo mataran las serpientes, Ultima 7 parte 2 "Isla de la Serpiente", jeje). Ahora puedes ser un h&eacute;roe o un cobarde. Pon el cubo, la pir&aacute;mide y la esfera en sus lugares. SALVA AHORA!!!. Puedes destruir la puerta negra con la vara de Rudyom, o atravesarla volviendo a la Tierra (destruyendo Britannia). DESTRUYE LA PUERTA!!!!! EL GUARDIAN SABR&Aacute; QUIENES SOMOS!!!!! <BR>
LISTO, HEMOS TERMINADO!!!!!!!</P>
<P ALIGN="JUSTIFY"><BR>
<B>Ahora que hemos terminado</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que, que te ha parecido??, Creo que es el mejor juego que hay. Habr&aacute;s notado que no hemos visitado muchos lugares, como "Fuerte de la Serpiente". Hay muchos lugares que explorar y cosas que hacer. Existe una manera de ganar el juego en pocos minutos, y sin salir de Trinsic, pero eso es otra historia y debe de ser contada en otro momento ;). </P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpge.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

