<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

</p> <br><br><br><br>
<H3>Solución al Ultima VIII; Pagan</H3>
<table align="left">
<td><img src="jpg/u8box.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">

Ahora le toca el turno a uno de los juegos con que más me divertí. Se trata,
como es lógico, de otro producto Ultima y para ser más exactos, del último
producto de la saga Ultima (si descartamos al Ultima On-Line), hasta la fecha, si bien,
ya resuenan las campanas del Ascension....<br>
De este juego se pueden contar muchas cosas como que llegó a España muy
"juntíto" a las dos partes del Ultima VII (partes que, por cierto, llegaron bastante más
tarde que en el resto de paises del extranjero pero que supusieron el "aterrizaje",
al fin, de esta sensacional saga en España). Esto contribuyó a que, 
los jugadores que habían probado esos dos títulos y que se habían "educado" al
 sistema de Origin y, ¿por qué no decirlo?, a este género que mezcla rol y
aventura de una forma magistral, se llevaran ligeras decepciones cuando vieron
este producto con sospechosos tintes que no eran de Rol, sino más bien de arcade.<br><br>
Sin embargo, el Ultima VIII, es un juego muy bueno y de cita ineludible para todo
"Ultimero" que se precie de serlo, así que, si me permitís, procederé a "destripar" a otro
de los grandes clásicos.
<br><br>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Comenzando el juego </B></P>
<P ALIGN="JUSTIFY"><BR>
Luego de ser rescatado por Devon (el pescador), habla con el, toma lo que quieras, y nos encaminamos hacia esta peligros&iacute;sima aventura...</P>
<P ALIGN="JUSTIFY"><BR>
<B>Tenebrae</B><BR>
<BR>
Vamos al oeste. En uno de los barriles de puerto encontraras una daga. Sube las escaleras y ve al sur. UNA EJECUCION!!!. Despu&eacute;s de este espect&aacute;culo, habla con el guardia (obligado), y ve al norte. En la puerta otro guardia te para, y luego de esto entraremos en la ciudad. Explora un poco para familiarizarte con todo, y luego vamos al este, por la puerta norte-este. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Tenebrae Este</P>
</B><P ALIGN="JUSTIFY"><BR>
A tu derecha encontraras la biblioteca. Devon dijo que all&iacute; encontrar&iacute;amos a Bentic, as&iacute; que vamos. Habla con Bentic, y te ense&ntilde;ara bastante. Te dir&aacute; que conviene ir a ver a Mythran y a los nigromantes. Parece que tenemos algo que hacer, as&iacute; que vamos!. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Meseta, y como llegar a ella</P>
</B><P ALIGN="JUSTIFY"><BR>
Vuelve al palacio (Tenebrae central), y visita el transportador que hay en el techo (muy &uacute;til). Sal por la puerta norte, y sigue el camino hacia el noroeste hasta encontrar una cueva. Dentro de la cueva, rec&oacute;rrela hasta encontrar agua. Salva tu juego, e intenta saltar a trav&eacute;s de las piedras, hasta el otro lado. Ahora sube el escal&oacute;n y continua al oeste, a trav&eacute;s de una puerta el&eacute;ctrica y de nuevo al oeste. Encontraras un puente de madera, atravi&eacute;salo y llegaras a un edificio con palancas. Emp&uacute;jalas de manera que las de abajo est&eacute;n mirando hacia ti, y las de arriba mirando hacia la pared opuesta. Oir&aacute;s (y sentir&aacute;s) algo como un terremoto. Ahora vuelve y encontraras otra palanca (seguro que cuando ibas hacia le puente la habr&aacute;s visto). Tira de ella y las puertas que dan al sur se abrir&aacute;n. Sigue por ese camino, al sur, baja unos escalones y sal de la cueva. Continua por el camino al sur (cuidado con los hongos rojos, son explosivos) hasta encontrar una casa. Entra en ella y prep&aacute;rate a correr!!. Una vez pasado esto, recomiendo buscar en una sala al norte de la puerta por la que has entrado, encontraras dinero y una daga m&aacute;gica. Encuentra a Mythran (no hay nadie mas), y habla con el. Compra el hechizo de "puertas secretas". El te dar&aacute; un transportador (aparato de color rojo) una poci&oacute;n roja (sirve para cuando estas a punto de morir, te devuelve todas las energ&iacute;as). Visita el transportador en el cuarto superior y usa el aparato rojo para volver a Tenebrae. Ahora vamos con los nigromantes. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Cementerio</P>
</B><P ALIGN="JUSTIFY"><BR>
Vuelve a Tenebrae este. Sigue el camino hasta encontrar la puerta este que sale de la ciudad. Ahora sigue por el camino hasta la puerta norte. Encontraremos el cementerio (cuidado con los zombies), entra en el edificio principal y habla con Vividos, el descendiente. El te dir&aacute; que Mordea les ha robado la daga ceremonial, y que la recuperes. Dile que si (eres o no el avatar??) y vuelve a Tenebrae</P>
<P ALIGN="JUSTIFY"><BR>
<B>Tenebrae (2ª parte)</P>
</B><P ALIGN="JUSTIFY"><BR>
Ahora encuentra la casa de madera del entrenador (punto de referencia). Ve al este, luego sur, y luego este de nuevo. Encontraras una casa de madera con una valla por fuera. Esta casa permanece cerrada hasta el Alba (creo). Duerme o explora hasta entonces, luego entra y habla con Aramina, la ayudante de Mordea. Habla con ella hasta que te de una llave. Tambi&eacute;n te pedir&aacute; que hables con Devon sobre ella. Vuelve al palacio, y a la sala del trono. Aseg&uacute;rate de que Mordea no esta all&iacute;, y mueve un peque&ntilde;o cojin con una calavera pintada para encontrar una llave. Esta abrir&aacute; la habitaci&oacute;n de Mordea, solo accesible desde esta sala. Salva, y si Mordea esta dentro durmiendo, ten MUCHO CUIDADO!!!. Abre con la llave de Aramina el peque&ntilde;o cuarto con el cofre dentro. Abre el cofre con la misma llave y dentro encontraras la daga. T&oacute;mala y ll&eacute;vasela a Vividos. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Cementerio (2ª parte)</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Vividos estar&aacute; preparando la ceremonia, entr&eacute;gale la daga y mira la ceremonia. Ahora te convertir&aacute;s en su aprendiz. El te dir&aacute; que consiguas algunos reactivos (capucha de verdugo y algunas ramitas). Ahora vuelve por el camino de tierra, y en cuanto cruces la puerta, sigue solo unos pasos al sur, y luego al este. Encontraras un foso, entra en el y mata a los "cambiantes", en el medio habr&aacute; una especie de isla con las capuchas de verdugo (hongo negro). Vuelve a la ciudad ahora. </P>
<P ALIGN="JUSTIFY"><BR>
<B>C&aacute;rcel</P>
</B><P ALIGN="JUSTIFY"><BR>
Antes de que puedas entrar, un guardia te parara y te dir&aacute; que Bentic fue ejecutado y Devon esta en la c&aacute;rcel. Vuelve al Palacio, y encuentra la escalera hacia abajo , en la parte oeste. Baja, y busca el lugar con el cartel "Solo personal autorizado". Entra y habla con Devon, el te dir&aacute; que no sabe porque esta all&iacute;, ahora busca la habitaci&oacute;n donde no hay puertas ni entradas. Usa el hechizo de Mythran y encontraras la entrada. Dentro veras un libro. L&eacute;elo y WOW!!!. Ahora estamos en un l&iacute;o, d&eacute;jate arrestar y te querran ejecutar. Durante la ejecuci&oacute;n, diles a todos que Devon es el verdadero Tempest, y no nombres a mordea. Ahora tendr&aacute; lo que se merece. Devon te abandona, pero volver&aacute;. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Estudios de Nigromancia</P>
</B><P ALIGN="JUSTIFY"><BR>
Ahora vuelve al palacio, y ve a tenebrae oeste. Sigue el camino hacia el oeste hasta un edificio abandonado, junto a el encontraras las ramitas. Toma las que puedas y vuelve al cementerio. Habla con Vividos, y el te dar&aacute; la llave del sepulcro y te dir&aacute; que busques a los antiguos nigromantes. Ahora vete al piso superior y estudia los libros (anota los reactivos que te har&aacute;n falta para cada hechizo). Toma todos los reactivos que hay all&iacute; y vete. Para usar un hechizo de nigromante necesitaras una bolsa vac&iacute;a, all&iacute; pon los reactivos del hechizo, y usa la llave del sepulcro sobre ella. Dentro aparecer&aacute; un s&iacute;mbolo, doble click en el para activar el hechizo. Al norte del cementerio encontraras una valla, con la puerta custodiada por un fantasma. Entra al lugar, y luego al edificio. Dentro, usa el hechizo "campo abierto" sobre la roca, y se abrir&aacute;. Ahora entra en las catacumbas superiores. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Catacumbas Superiores</P>
</B><P ALIGN="JUSTIFY"><BR>
Continua al norte, a trav&eacute;s de las puertas dobles, hasta llegar a una puerta/reja. Empuja la palanca mas cercana a la puerta. Atravi&eacute;sala y ve al este hasta llegar al primer pasaje hacia el norte. Ve por ah&iacute;, y luego ve al este, hasta llegar a un lugar donde habr&aacute; un cartel y una reja. Desde aqu&iacute; al oeste y luego al norte, pasando la lava, y luego al este de nuevo. Cuando no puedas ir mas lejos ve al sur, deber&aacute;s llegar a un lugar con un cartel que dice "camina hacia tu destino" (el lugar de nacimiento de moriens, recuerda este lugar porque tendr&aacute;s que volver aqu&iacute;). Desde la puerta al sur y al este, busca agua en el suelo , pero no la pises. Da un giro al norte, y continua al sur y al este, pero toma el segundo pasaje al norte. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Encontraras un peque&ntilde;o edificio con un zombie dentro. Cuando entres el piso caer&aacute;. Los barriles junto al lugar donde has caido est&aacute;n llenos de reactivos. Puedes hacer todos los s&iacute;mbolos del hechizo "hablar con muerto" que necesitaras mas tarde. Necesitaras 6 (son 6 los nigromantes). Ahora al norte y al oeste. Cuando veas que caen rocas ve al sur y al oeste hacia el primer nigromante. Usa el hechizo "hablar con muerto", y el te ense&ntilde;ara el hechizo "mascara de muerte". Ahora ve al este, luego al norte, y al este hasta que no puedas mas, luego al norte hasta un escal&oacute;n. Sube al escal&oacute;n, y antes de bajar usa el hechizo "mascara de muerte". Ahora baja y corre a trav&eacute;s de los demonios. Ahora, al norte y al este, y luego al oeste para encontrar al 2º nigromante. El te ense&ntilde;ara el hechizo "carne de piedra". Ahora ve al norte y cuando llegues a un pasaje hacia el oeste, para y usa tu hechizo "carne de piedra". Ahora corre r&aacute;pido a trav&eacute;s del pasaje, y cuando este termine, ve al oeste, luego sur y luego este. Este nigromante te teletransportara a otro lugar. Salva ahora, puede ser peligroso. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora salta a trav&eacute;s de las puertas el&eacute;ctricas a la otra plataforma. Habr&aacute; algunos enemigos esper&aacute;ndote. Aqu&iacute; tambi&eacute;n encontraras al 4º nigromante. El te volver&aacute; a teletransportar. Ve al este hacia un lugar con hierba. Toma los reactivos que necesites, y entra a la sala del trono, y ser&aacute;s teletransportado de nuevo. Ahora ve al sur y salta el agua hacia donde esta el zombie. Si piensas hacerte con la armadura m&aacute;gica, ten mucho cuidado, salva y mant&eacute;nte cerca de las paredes, hay una trampa en medio. Ahora ve al oeste hasta encontrar lava. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aqu&iacute; hay un esqueleto en el suelo que tiene una llave. Sigue la lava al este y luego al norte, hacia la peque&ntilde;a meseta. Salta a la peque&ntilde;a isla , luego ve al noroeste y salta al este hacia otra isla, te veras transportado. Ahora sigue siempre al sur y oeste hacia el pr&oacute;ximo nigromante. El te ense&ntilde;ara "Soportar Muerte" y te teletransporta. Sigue este pasaje al norte y al este hasta algunas llamas. Usa el hechizo "soportar muerte" y corre a trav&eacute;s de ellas r&aacute;pidamente. Si tienes problemas con este hechizo prueba "Carne de Piedra". Sigue por aqu&iacute; hasta el pr&oacute;ximo nigromante. El te ense&ntilde;ara el ultimo hechizo (MUY importante!!) "Crear Golem". Ahora sube las escaleras y vuelves a las catacumbas.</P>
<P ALIGN="JUSTIFY"><BR>
<B>El Rey del Monte (Lithos)</P>
</B><P ALIGN="JUSTIFY"><BR>
Para llegar a el, ve al sur hasta llegar a una puerta, y atravi&eacute;sala. Este pasaje es MUY MUY importante, RECUERDALO SIEMPRE, LO LLAMARE A PARTIR DE AHORA "PASAJE HACIA LITHOS". Por ahora solo s&iacute;guelo generalmente al sur y al oeste. No te preocupes por las puertas que puedas encontrar, estar&aacute;n todas cerradas. Cuando encuentres unas puertas el&eacute;ctricas, sigue, vas bien. Al llegar a un lugar con algunas trampas sabr&aacute;s que has llegado, aqu&iacute; dejo que adivines, solo debes saber que debes llegar a trav&eacute;s de todo a una puerta al sur. Esta te llevara a un lugar con tierra y reactivos en el suelo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este lugar se llama "Cueva de Piedra". Habr&aacute;s visto algunas puertas, unas dobles y mas abajo una simple. Usa el hechizo "Crear Golem" y dile que abra ambas puertas, pero solo entra en las dobles, las de arriba. Ahora sigue hacia el norte, con cuidado de los agujeros, mant&eacute;nte cerca a las paredes. Llegaras a una sala con una palanca del lado de afuera. Primero salta la pared y usa la palanca dentro de la sala, y luego sal y usa la palanca del lado de afuera. Vuelve al sur, hasta encontrar un lago con unos bloques que desaparecen, cr&uacute;zalo. Luego encontraras otro igual, pero esta vez los bloques se mueven. Salva antes de intentarlo, es peligroso. Ahora cruza los pr&oacute;ximos bloques que desaparecen, hacia el norte, y luego al oeste. Ve al norte hasta un lugar lleno de campos de fuerza (sabr&aacute;s cuando llegues aqu&iacute;). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pase much&iacute;simo tiempo tirando hongos y setas hacia adelante para pasar entre los campos, pero me aburr&iacute; tanto que ahora solo paso corriendo hasta que estoy apunto de morir, entonces descanso, y luego vuelvo a pasar. Da igual lo que hagas, sigue al norte hasta encontrar un cofre. En el encontraras una gema que te hace inmune a las campos de fuerza y una llave que abre una puerta al sur. Cruza la puerta, y sigue al sur, oeste y sur hasta llegar a un lago (salva aqu&iacute;). Salta por las plataformas hasta llegar a la isla en medio, y toma la llave de uno de los cad&aacute;veres (Nota: se puede llegar a la isla dando toda la vuelta junto a las paredes, y entrar en ella por el norte). Ahora vuelve y ve al norte, manteni&eacute;ndote cerca a la pared oeste. Toma el segundo pasaje hacia el oeste que encuentres. Espera que caiga la roca. Salta por las rocas hasta una puerta al norte, que abrir&aacute;s con la llave. R&aacute;pidamente iras al oeste. Salva de nuevo y salta a trav&eacute;s de las plataformas que se mueven. </P>
<P ALIGN="JUSTIFY">Puedes llegar a la orilla desde la segunda plataforma. Vamos al oeste, hacia EL REY DEL MONTE!!!. Ahora, despu&eacute;s de hablar con el ve al sur y encontraras otro teletransportador que activar. Usa el aparato rojo para volver a Vividos.</P>
<P ALIGN="JUSTIFY"><BR>
<br><br>
<CENTER><TABLE><td>
<center><img src="jpg/u8t.jpg" border=1></center>
</td>
<tr>
</table></center>
<p align = justify>
<br><br>

<B>Enterrar a Lothian</B> </P>
<P ALIGN="JUSTIFY"><BR>
Vividos te preguntara por tu viaje. Ahora es momento de enterrar a Lothian. Sin salir del vallado del cementerio, ve al norte, hasta encontrar el cuerpo. Doble click en el, y la ceremonia comenzara. Ahora Vividos te dar&aacute; la llave del descendiente (MUY importante!), y te dir&aacute; que debes visitar el lugar de nacimiento de Moriens. Que esperas?? Vamos all&aacute;!</P>
<P ALIGN="JUSTIFY"><BR>
<B>Lugar de Nacimiento de Moriens</P>
</B><P ALIGN="JUSTIFY"><BR>
Vuelve a las catacumbas superiores (te dije que recordaras este lugar, no??). La llave del descendiente abrir&aacute; la puerta. Sigue por la cueva hasta encontrar cinco palancas juntas. Solo comienza a usarlas hasta encontrar la que abre la puerta (es un juego siempre distinto, deber&iacute;as salvar antes). Oiras un ruido cuando lo logres. Abre las puertas y ve hacia el norte, y luego al este, hasta encontrar un cofre, dentro hay un cr&aacute;neo, t&oacute;malo, y tambi&eacute;n puedes tomar la capucha de verdugo que hay all&iacute;, no encontraras ninguna hasta mucho mas adelante. Vuelve a oeste , y luego al norte. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La puerta se abre cuando pises una mancha en el suelo (la mancha no la puedes ver, esta contra la pared del este, camina por all&iacute; hasta pisarla. Atraviesa la puerta y salta el lago. Cuando encuentres la lapida, usa el hechizo "Campo Abierto", salta al agujero y ve al oeste y luego al norte. Luego al este, hasta un lugar con unas gemas rodantes y una mesa. Salva aqu&iacute;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay una puerta hacia el norte, que no puedes pasar, y una plataforma elevada al otro lado. Mueve al esqueleto a la plataforma para abrir la puerta. Cr&uacute;zala y toma las llaves que hay, una a la izquierda y la otra a la derecha. Luego salta el rayo de luz y ve al este. Aqu&iacute; hay un puzzle que puede ser dif&iacute;cil para algunos. Salva. El objetivo es pasar la escalera hacia el medio, pisando las plataformas junto a cada ubicaci&oacute;n. Si quieres pasar sin esforzarte, solo necesitas invocar a un Golem, y ordenarle que abra la puerta a la derecha, y luego invocar a otro para que abra la siguiente puerta. No importa lo que hagas, deber&aacute;s llegar a una gran puerta, este es la tumba de Khumash Gor.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Tumba de Khumash Gor</B> </P>
<P ALIGN="JUSTIFY"><BR>
Si has le&iacute;do alg&uacute;n libro en tenebrae, sabr&aacute;s quien es el, si no, no te lo dir&eacute;, jejeje. Para pasar necesitaras el escudo ceremonial zealan, es un escudo azul , dividido en 3 campos con un coraz&oacute;n, una balanza y algo mas. Si eres un tramposo , lo podr&iacute;as haber tomado en la casa de Mythran, si eres un avatar, sigue mis instrucciones. Seguramente habr&aacute;s visto uno viniendo hacia este lugar, pero era inaccesible. Pues bien, entra en la primera c&aacute;mara de la tumba (abre las puertas con las llaves que has encontrado en el camino) y toma una llave del esqueleto en el suelo (deber&aacute;s moverlo primero). Esta llave abre todas las puertas que habr&aacute;s visto hasta ahora. Ahora vuelve y cuando encuentres la puerta que conduce al escudo, &aacute;brela y t&oacute;malo. Vuelve a la tumba y col&oacute;calo en el altar. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las estatuas te hablaran. Te dir&aacute;n que necesitas un artefacto de Khumash Gor. Antes de cruzar la puerta crea el s&iacute;mbolo para el hechizo "otorgar paz". Ahora usa el pergamino con el hechizo de Mythran y abre la puerta. Del otro lado te atacara el fantasma de Khumash Gor, no intentes matarlo porque no podr&aacute;s (creo). Usa en &eacute;l el hechizo "otorgar paz", y listo. Busca por la tumba una pir&aacute;mide negra, no te olvides de llevarla contigo, y vuelve a hablar con las estatuas. Ellas te dar&aacute;n informaci&oacute;n muy &uacute;til. Vuelve a la puerta que dice "camina hacia tu destino" (lugar de nacimiento de moriens), ve al sur y al este buscando un lugar con un altar y en el un esqueleto (el altar esta rodeado por cuatro columnas). Sobre la pared oeste veras un circulo rojo, usa la calavera que llevas en el, y luego baja por la reci&eacute;n creada escalera, para activar otro teletransportador. </P>
<P ALIGN="JUSTIFY">Ahora es el momento de ir a por el segundo tit&aacute;n : Hydros, Del Agua.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Lago Carthax (Hydros)</P>
</B><P ALIGN="JUSTIFY"><BR>
Vuelve al "PASAJE HACIA LITHOS", y busca la puerta al sur y al este. La puerta no deber&iacute;a tener ninguna traba, y mira hacia el sur. &Aacute;brela con la llave del descendiente y entra. Deber&iacute;as salir a una grand&iacute;sima caverna de piedra (no hay tierra), y con un lago seco en medio. AVISO!!!. Si al cruzar la puerta encuentras un puente , o un lago de lava, NO ENTRES!!!!!, pero recuerda el sitio, ya volveremos. A la derecha de la puerta hay un teletransportador para activar. Bordea el lago seco hasta llegar al lado oeste, y busca un puente que parte del lado sur. Salva antes, cualquier ca&iacute;da es mortal. Cruza saltando hasta llegar al templo de Hydros (que r&aacute;pido llegamos esta vez, no?? lithos tendr&iacute;a que aprender de ella, jeje). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ella te pedir&aacute; que la liberes, as&iacute; que vamos a complacer a la dama. En el oeste de la caverna deber&aacute;s encontrar una cueva. Entra. Pasa del troll, y ve a la derecha, sube al muro, y sigue al norte hasta encontrar otro muro, con una puerta. Usa la palanca mas al sur y atravi&eacute;sala. Pasa del pr&oacute;ximo troll, y atraviesa la pr&oacute;xima puerta. Desde aqu&iacute; al sur, y sigue el pasaje, hasta encontrar una salida. Un poco al norte encontraras una lapida. Usa el hechizo "campo abierto" y har&aacute;s que el agua vuelva a fluir. Vuelve a hablar con Hydros, que parece que te esta muy agradecida, jeje. Si vuelves a Tenebrae, veras que Devon ha vuelto, pero no tiene poderes. Te dir&aacute; que hables con los hechiceros, pero eso vendr&aacute; despu&eacute;s. </P>
<P ALIGN="JUSTIFY"><BR>
<B>Isla Argentrock (Stratos)</P>
</B><P ALIGN="JUSTIFY"><BR>
Volvamos al "PASAJE HACIA LITHOS", pero esta vez busca una puerta que mira al este (si antes has equivocado la puerta, y te has encontrado en un lugar con un puente, vuelve all&iacute;, es este lugar). La puerta se abre con la llave del descendiente. Cruza el puente, y al final veras en las cercan&iacute;as otro teletransportador para activar. Ve ahora a la peque&ntilde;a villa, donde estudian los seguidores del tit&aacute;n del aire, Stratos. Deber&aacute;s hablar primero con Stellos, generalmente esta en su casa (junto a la puerta este), o en el templo. Cuando lo encuentres, p&iacute;dele unirte a su orden. El te enviara al hermano Xavier. Este es el &uacute;nico (junto con Torwin), que no lleva t&uacute;nica. Te hablara de dos pruebas, la del conocimiento, y la del equilibrio (creo que se llaman as&iacute;). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para pasar la del conocimiento deber&aacute;s responder a algunas de sus preguntas, y no te ayudare, pero te dar&eacute; pistas : La honestidad es lo mas importante, recibe al hijo prodigo, sabidur&iacute;a sobre todo, etc. Luego de las preguntas te enviaran a la cima de los vientos (creo), a cumplir la prueba de equilibrio. Vete de la villa hacia el oeste, hasta llegar a un escal&oacute;n, s&uacute;belo y luego sube el pr&oacute;ximo, que tendr&aacute; un s&iacute;mbolo sobre &eacute;l (s&iacute;mbolo de Stratos). La prueba consiste en no caer (te convendr&iacute;a salvar antes de intentarlo), lo cual es muy f&aacute;cil , solo camina en direcci&oacute;n contraria a la que el viento vaya tomando. Cuando termines, vuelve a hablar con Xavier, que te enviar&aacute; a Stellos. Stellos te dar&aacute; la llave de la mina, para conseguir plata. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el templo, busca la cocina, y la escalera que baja desde all&iacute;. Abre la puerta oeste con la llave y consigue ocho partes de plata. Si te interesa la habitaci&oacute;n sin puertas, la puedes abrir con el hechizo de Mythran. Dentro hay una espada protectora. Cuando tengas las 8 piezas de plata, usa el aparato rojo (teletransportador), y vuelve a Tenebrae. Ahora sal del palacio por la puerta oeste-sur, hacia Tenebrae oeste. Busca el negocio de Korick, el herrero. El te har&aacute; los 8 focos que necesitas. De nuevo usa el aparato rojo y vuelve a la Isla de Argentrock. (si no has activado el teletransporte antes, deber&aacute;s volver a trav&eacute;s del "PASAJE HACIA LITHOS"). Vuelve al templo, y usa cada uno de los focos en el altar. Vuelve a hablar con Stellos. Ahora es su turno de probarte. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Baja a la mina, pero ahora ve al oeste. Veras en la orilla contraria a un t&oacute;rax herido. Usa el hechizo "sirviente et&eacute;reo" para traerlo hacia ti, y el hechizo "restaurar" para curarlo. Vuelve con Stellos, y vendr&aacute; otra prueba (aunque no te dir&aacute;n que lo es). Usa el hechizo "escuchar la verdad", y habla con todos. Pronto descubrir&aacute;s que Torwin robo el foco, y que esta en el punto de los vientos. A POR EL!!. Luego de su gran (jeje) salto, regr&eacute;sale el foco a Xavier y habla con Stellos. Ahora es momento de hablar con Stratos. Vuelve al lugar del gran salto de Torwin, y salva. Ahora intenta lo que el , pero seguro que tu tienes mas suerte (he oido que a veces seg&uacute;n el salto que des, Stratos te lleva directamente con ella, pero lo he intentado mil veces, y nunca funciono). Deber&aacute;s ir saltando a trav&eacute;s de las plataformas, hasta llegar a Stratos. Luego que ella te hable, y te de el foco para el hechizo "hipersalto", usa el hechizo "revelar". WOW!!! alli esta el aliento del aire, pero aun no te lo lleves, mas tarde nos har&aacute; falta. Como dijo Devon, vamos a hablar con los hechiceros.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Enclave de los Hechiceros (Pyros)</P>
</B><P ALIGN="JUSTIFY"><BR>
Volvamos (otra vez) al "PASAJE HACIA LITHOS". La mejor manera es volver al Lago Carthax, salir de all&iacute;, atravesar la puerta el&eacute;ctrica (norte), y luego hacia el sur, donde veras una puerta. Esta puerta deber&aacute; tener unos muros que no permiten acceder a ella. Usa las palancas de manera que puedas estar parado en el primero, y usa el hechizo "serviente et&eacute;reo" en la palanca. Ahora abre la puerta con la llave del descendiente, y entra. (si antes hab&iacute;as visto un lago de lava , era aqu&iacute;). En cuanto entres veras un lago de lava. Sigue caminando, y pronto un hechicero aparecer&aacute; para hablarte (si previamente has hecho algo malo en Tenebrae, seguro que lo conoces, jjeje). Dice que debes llegar a donde esta el, as&iacute; que usa el hechizo "hipersalto", y SALTA!!. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Del otro lado encontraras un r&iacute;o, s&aacute;ltalo por donde creas que no caer&aacute;s, y encontraras una cueva, del otro lado esta el enclave, as&iacute; que cr&uacute;zala pronto!. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pronto encontraras un teletransportador para activar, pero debes saber que el aparato rojo no funciona en ninguna parte de los dominios de los hechiceros. Camina por ah&iacute;, y familiar&iacute;zate con la ciudad. Cuando est&eacute;s listo, habla con Bane o Vardion. Deber&aacute;s aprender el nombre verdadero de alguno de los dos, y dec&iacute;rselo a quien quieres que sea tu maestro (o a quien quieras que sobreviva!!, jeje). No te sientas mal por el perdedor, Bane minti&oacute; y Vardion te insulto. Te dar&aacute;n una llave para la librer&iacute;a, ve all&iacute;, y entrena en la hechicer&iacute;a (intenta anotar todos los puntos del pentagrama, y los hechizos para no olvidarlos). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando creas que estas listo, toma los reactivos, velas y focos para los hechizos de : "Puerta Dimensional", "Bola de Fuego" y "Soportar Calor". Dile a tu maestro que comience la prueba y hazla. Cuando pases te enviaran a la c&aacute;mara del Gran Maestro. Sigue el camino que pasa por la biblioteca, y encontraras un puente y luego una puerta, que se abrir&aacute; para ti (si como a mi, no se te abre, simplemente crea un Golem, y ord&eacute;nale abrir la puerta). Corre entre los demonios, o m&aacute;talos, y ve a la siguiente c&aacute;mara. Si has jugado al juego "Forja de la Virtud", sabr&aacute;s quien es este demonio, NO LO ATAQUES!!! habla con el. Antes de seguir haz los hechizos de "armadura de llamas", "alejar demonio", "soportar calor", "extinguir" y "puerta dimensional". Cuando estes listo, camina hasta la plataforma de piedras y ser&aacute;s transportado a la prueba.</P>
<P ALIGN="JUSTIFY"><BR>
<B>La Prueba</P>
</B><P ALIGN="JUSTIFY"><BR>
Las siguientes pruebas pueden hacerse en cualquier orden, lo &uacute;nico que necesitas es juntar los cuatro s&iacute;mbolos azules (y si quieres , tambi&eacute;n las armas m&aacute;gicas).</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Prueba del norte: </B></I>Encontraras un cartel que dice "Flam Por". Usa el hechizo "puerta dimensional" para pasar por las bolas que ruedan. Si los hongos/setas rojos (explosivos) te molestan, puedes usar "armadura de llamas". Sigue el pasaje hasta encontrar una espada y el s&iacute;mbolo azul. (esta espada es llamada "flagelo de fuego", y cada golpe que da suelta una llamarada de fuego que quema al enemigo, para mi es la mejor arma que hay).</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Prueba del Este : </B></I>Encontraras un cartel que dice "Vas Sanct Flam". Usa este hechizo y CORRE!!!. Al final encontraras un escudo y el 2º s&iacute;mbolo azul.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Prueba del Sur : </B></I>Aqu&iacute; el cartel dir&aacute; "An Flam". Sigue el pasaje (a algunas personas les es necesario usar "armadura de llamas") hasta encontrar un pentagrama en llamas. Usa "extinguir" en cada vela para conseguir el yelmo y el 3º s&iacute;mbolo azul.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Prueba del Oeste : </B></I>Este pasaje se divide en dos. El va al sur gu&iacute;a hacia un entagrama con un mago, si necesitas usar el pentagrama , M&Aacute;TALO!!. Tambi&eacute;n aqu&iacute; aprender&aacute;s un hechizo nuevo. El pasaje norte va hacia un lugar lleno de rocas, un verdadero laberinto. El cartel de aqu&iacute; dir&aacute; "Sanct Flam". Te tendr&aacute;s que abrir paso por entre las rocas, hasta llegar a un lago de lava. Aqu&iacute; usa el hechizo "resistir calor" y cruza la lava, pero solo por donde esta de un color mas oscuro, la lava amarilla es muy liquida, y no puedes permanecer parado sobre ella. Trata de hacerlo r&aacute;pido, si el hechizo desaparece en medio del lago, MORIRAS SIN REMEDIO!!. Aqu&iacute; encontraras una armadura y el ultimo s&iacute;mbolo azul. </LI></P></UL>

<P ALIGN="JUSTIFY"><BR>
Ahora volvamos al lugar del que partimos y regresaremos a la c&aacute;mara de Arcadion (el demonio). Ahora es momento de preparar los &uacute;ltimos hechizos (conviene hacerlos aqui, el pentagrama del maestro puede ser peligroso). Los hechizos necesarios ser&aacute;n "bola de fuego", "explosi&oacute;n" y "invocar demonio". Tambi&eacute;n deber&iacute;as tener el hechizo de "alejar demonio" desde antes. Y otra cosa importante, antes de ver al maestro, no te olvides de tener una vela roja y un hechizo de "ignici&oacute;n" en tu poder. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora vuelve a la plataforma, pero esta vez te transportara a la c&aacute;mara del maestro. Habla con el, te dir&aacute; que uses los hechizos en el. ADELANTE!!! no le puedes hacer da&ntilde;o. Cuando el invoque su demonio, usa el hechizo correspondiente. Ahora te llevara a ver a Pyros. TREMENDA CEREMONIA!!!. Ahora es momento de pagar!. Vuelve a su c&aacute;mara, y m&aacute;talo. S&Iacute;!!! M&Aacute;TALO!!!. Puede que no sea tan dif&iacute;cil como parece... </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Toma de su cuerpo la "lengua de las llamas" (roca negra", y lee el libro que tiene encima. Te dir&aacute; como liberar a Pyros. Puedes leer el libro en el cofre. Ahora libera a Pyros, y vuelve a Tenebrae. Devon (deber&iacute;a) darte una llave, que te permitir&aacute; hacerte con la "lagrima de los mares". <BR>
<BR>
<B>Coraz&oacute;n de la Tierra</P>
</B><P ALIGN="JUSTIFY"><BR>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="gif/u8intro1.gif" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">
Tenemos 3 de las 5 partes del obelisco. Ahora vuelve a la Cueva de Piedra, pero esta vez entra por la puerta peque&ntilde;a del sur. Una vez dentro usa el hechizo "campo abierto" junto a la lapida, y tendr&aacute;s el Coraz&oacute;n de la Tierra.</P>
<P ALIGN="JUSTIFY"><BR>
<B>Aliento del Aire</P>
</B><P ALIGN="JUSTIFY"><BR>
Vuelve a la isla Argentrock. Vuelve al lugar exacto donde hab&iacute;as hablado con Stratos, pero esta vez, si has usado el hechizo "revelar", habr&aacute;s visto el Aliento del Aire. Usa un "sirviente et&eacute;reo" para que te lo traiga, y huye r&aacute;pidamente (usa el aparato rojo). Ahora vuelve a hablar con Mythran<BR>
<BR>
<B>El Vac&iacute;o et&eacute;reo</B> </P>
<P ALIGN="JUSTIFY"><BR>
Habla con Mythran sobre rearmar el obelisco. Aprender&aacute;s el hechizo "viaje et&eacute;reo". Lee el libro y estar&aacute;s en el vac&iacute;o. Otra vez estar&aacute;s en el centro, y habr&aacute; caminos a los cuatro puntos cardinales. Cualquier orden sirve :</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Paso del norte (Hydros) </B></I>Empieza yendo hacia el oeste, todo lo que puedas. Salta por las rocas, usa "hipersalto" para llegar a la orilla desde la segunda piedra. Sigue a trav&eacute;s de algunos puentes, hasta verte bloqueado por una pared invisible. Usa "hipersalto" y salta al norte. Al oeste esta el templo de Hydros, usa la lagrima de las Mareas para calmarla.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Paso del este (Lithos): </B></I>No subas al escal&oacute;n frente a ti, pero ve al oeste y sube a ese. Ahora ve al norte, y cuidado con los agujeros por el camino. Cuando llegues a un vallado, y un lago de lava, usa "resistir calor" y cr&uacute;zalo. Al oeste y luego al norte desde aqu&iacute;, luego oeste de nuevo. Te cruzaras con mas lava y rocas sobre las que saltar. Del otro lado sigue mas o menos al sur y luego al oeste, hasta llegar a Lithos. Usa el Coraz&oacute;n de la tierra para calmarlo.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Paso del sur (Stratos): </B></I>Estando all&iacute;, ve al norte, salta unas rocas y no intentes hacerte con las armaduras, el suelo que las rodea caer&aacute;. Sigue al norte hasta encontrar a Stratos, y usa el Aliento del aire para calmarla.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<B><I><P ALIGN="JUSTIFY"><LI>Paso del oeste (Pyros)</B></I>: Empieza yendo al norte, luego oeste. Salta la lava y ve al norte hasta encontrar una estrella en el suelo. Busca entre los esqueletos para encontrar mas informaci&oacute;n de este aparato. Sigue al sur, y luego este. No uses el primer puente, cruza el segundo. Desde all&iacute; al norte. Sube por la monta&ntilde;a, con mucho cuidado. Sube hasta el final y sube la peque&ntilde;a escalera hasta la caja arriba del todo. Toma todo lo que hay dentro, y vuelve al aparato de la estrella. Usa una bola en cada cubo relampagueante, y salta la lava por las rocas que acaban de aparecer. Al este y al norte de aqu&iacute; esta Pyros. Usa r&aacute;pido la legua de las llamas en el, antes de que sus demonios acaben contigo. </LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora estamos listos para terminar. Vuelve al pentagrama del comienzo, y usa los trozos de roca negra en este orden :</P>
<B><I><P ALIGN="JUSTIFY">Aphelion = El Obelisco Mesostel Pa = Corazon de la Tierra Mesostel Ze = Aliento del Aire Perivolcan Pa = Lagrima de las Mareas Perivolcan Ze = Lengua de las Llamas.</P>
<P ALIGN="JUSTIFY"></P>
</B></I><P ALIGN="JUSTIFY"> Ahora al&eacute;jate del pentagrama, y doble click en el obelisco, y luego en ti. Vuelve a poner en su sitio el obelisco y <B>TERMINAMOS!!!!!!!!!!!</P>
</B><P ALIGN="JUSTIFY"><BR>
<B>Ahora que hemos terminado...</P>
</B><P ALIGN="JUSTIFY"><BR>
A que el juego es muy bueno?!?!. A mucha gente dice no gustarle, porque perdi&oacute; algo del rol tan puro de los ultimas anteriores, pero me divert&iacute; mucho igualmente al jugarlo, y el argumento es bastante bueno, aunque con tant&iacute;simos errores. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P></FONT>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpge.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

