<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
</p>
<br><br><br><br>

<H3>
Baldur’s Gate.<br>Cap&iacute;tulo Segundo: Problemas en Nashkel
</H3>
 
<P ALIGN="JUSTIFY">Al acercarnos a Nashkel nos encontramos con los problemas de frente. Una patrulla de soldados de Amn nos inform&oacute; de algunos de los m&uacute;ltiples asuntos que hab&iacute;an estado yendo mal en los &uacute;ltimos tiempos. La extra&ntilde;a debilidad del acero extra&iacute;do de las minas, rumor ya o&iacute;do previamente y que ahora quedaba confirmado, era una de las principales preocupaciones pero no la &uacute;nica. Por lo visto, el hasta entonces comandante de las tropas, el capit&aacute;n Brage, se hab&iacute;a vuelto loco tras la adquisici&oacute;n de una nueva espada y hab&iacute;a asesinado a varias personas, entre ellas a su propia familia. Prometimos ayudar en la medida de lo posible y cruzamos el puente de acceso a la ciudad.</P>

<table width=320 align="right">
<tr><td><img src="jpg/bgsol201.jpg"></td></tr>
<tr><td><font size=1 face=arial><center>El grupo ante el hermoso Templo del Yelmo, en Nashkel</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Est&aacute;bamos cansados del camino, as&iacute; que nos dirigimos a la posada… s&oacute;lo para encontrarnos con m&aacute;s sorpresas desagradables: otra cazarecompensas tras nuestro pellejo. Su nombre era Neira y eso fue todo lo que supimos de ella antes de que nos atacara. No tuvimos m&aacute;s remedio que defendernos a pesar de lo desigual de la batalla. Seis contra uno no fue demasiado reto, a pesar de sus dotes combinadas como guerrera y maga. Su bonito yelmo de infravisi&oacute;n pas&oacute; a ser m&iacute;o desde aquel d&iacute;a. S&iacute;, este mismo que yace junto a mi en la mesa, amigo caminante. A&uacute;n lo uso a pesar del tiempo transcurrido desde entonces… Est&aacute; bien, est&aacute; bien, continuar&eacute; con mi historia, no os impacient&eacute;is. ¡Pero mi garganta se reseca y no estar&iacute;a mal que esta vez otro pagase la ronda! …Como iba diciendo, el cad&aacute;ver de Neira qued&oacute; de adorno en el suelo de la posada y mis compa&ntilde;eros y yo nos fuimos a tomar un merecido reposo en una cama de verdad. A la ma&ntilde;ana siguiente ver&iacute;amos las cosas de diferente manera… no sab&iacute;a entonces lo cierto que iba a resultar ese pensamiento m&iacute;o… sobre todo despu&eacute;s del inquietante sue&ntilde;o que tuve aquella noche…</P>

<I><P ALIGN="JUSTIFY">…Me encontraba de regreso en Candelero, mas las puertas estaban fuertemente cerradas y aseguradas. Un extra&ntilde;o sentimiento se apoderaba de m&iacute;, cuando una luz y una voz se hicieron presentes. Vi como se materializaba ante mis asombrados ojos la imagen de mi querido padre adoptivo, Gorion, aunque aparec&iacute;a tan muerto en el sue&ntilde;o como tristemente lo estaba en la realidad. Sus frases resultaron bastante extra&ntilde;as pero consiguieron acuciar mi deseo de vengar su muerte y resolver todos los extra&ntilde;os acontecimientos que se estaban produciendo. La luz que lo ba&ntilde;aba y emanaba de &eacute;l ejerc&iacute;a una enorme atracci&oacute;n sobre mi esp&iacute;ritu, incit&aacute;ndome a acercarme. Me daba cuenta de que eso significar&iacute;a abandonar toda esperanza y unirme a Gorion, dondequiera que estuviese ahora. Con todas las fuerzas que pude reunir me resist&iacute; a la luz y me di la vuelta. Las &uacute;ltimas palabras del fantasma de Gorion me llenaron el coraz&oacute;n con el sentimiento de aprobaci&oacute;n que sent&iacute; en ellas…</P></I>

<P ALIGN="JUSTIFY">Tras compartir el extra&ntilde;o sue&ntilde;o con mis compa&ntilde;eros de aventuras salimos a explorar la ciudad de Nashkel. Pronto nos encontramos con el gobernador de la ciudad y viejo conocido de Jaheira, Berrun Ghastkill, que nos pidi&oacute; ayuda para investigar el misterio de las minas. Muchos de los lugare&ntilde;os nos confirmaron que las desapariciones en las minas eran cada vez m&aacute;s frecuentes, dejando a muchas mujeres sin marido de forma prematura. ¡No hab&iacute;a tiempo que perder! Hicimos una breve visita al hermoso Templo del Yelmo para reponer algunas pociones y seguimos camino atravesando la ciudad. Un tipo llamado Oublek nos confundi&oacute; con un supuesto cazarecompensas, un tal Greywolf, y nos ofrec&iacute;a un dinero que, obviamente, no merec&iacute;amos. Le saqu&eacute; de su error, lo que le dej&oacute; en un estado de estupor bastante evidente pero tambi&eacute;n muy agradecido por nuestra honestidad. Esta decisi&oacute;n m&iacute;a fue muy criticada por Kagain que estaba harto de mi bondad… ¡y yo empezaba a estar hasta las narices de su mezquindad! Por no hablar de sus continuos cruces de indirectas con el bueno de Khalid.</P>

<P ALIGN="JUSTIFY">Poco m&aacute;s al sur de la ciudad nos encontramos con Minsc, un tipo agradable que estaba muy preocupado por Dynaheir, una chica que le acompa&ntilde;aba y hab&iacute;a sido secuestrada por unos gnolls que ten&iacute;an su fortaleza lejos al oeste de Nashkel. Decidimos ayudarle y, de paso, librarnos de la molestia de Kagain, cuyos principios eran claramente irreconciliables con nuestro honesto proceder. A partir de entonces todo fue mucho m&aacute;s tranquilo entre nosotros, ya que Minsc se adaptaba mucho mejor al esp&iacute;ritu general. Lo &uacute;nico que me preocupaba eran los elogios que Jaheira empezaba a dirigir a Garrick y, sobre todo, que Khalid se diera cuenta y empezase a sentir celos. Hay que reconocer que Khalid era bastante apocado y falto de personalidad mientras que Jaheira era todo lo contrario pero estaba claro que, cada uno a su manera, eran buenas personas y se quer&iacute;an realmente. Si Garrick iba a ser fuente de problemas yo mismo lo echar&iacute;a a patadas sin pensarlo ni un instante.</P>

<P ALIGN="JUSTIFY">Cerca del puente de la parte sur de Nashkel conocimos a otro personaje curioso. Mis dotes de palad&iacute;n me advirtieron de sus malignas intenciones, lo que me puso sobre aviso de forma inmediata. Era un mago llamado Edwin y trataba de convencernos de ayudarle a acabar con una supuesta bruja de nombre… ¿lo adivin&aacute;is? ¡Dynaheir! A Minsc casi le da un ataque. Tuve que sujetarle para que no se cargara a aquel pobre diablo en un arrebato de ira. Simplemente rechazamos su ofrecimiento y el tipo desapareci&oacute;. Y es que mi &eacute;tica no me permit&iacute;a atacar a alguien, ni siquiera a alguien malvado, sin mediar provocaci&oacute;n o causa cierta que lo justificase. No obstante ten&iacute;a la sensaci&oacute;n de que nos encontrar&iacute;amos m&aacute;s adelante…</P>

<P ALIGN="JUSTIFY">Emprendimos camino hacia el oeste, en busca de la fortaleza de los gnolls, pero pronto nos dimos cuenta de que no est&aacute;bamos preparados para afrontar los peligros que nos acechaban en dicho trayecto. No fue f&aacute;cil convencer a Minsc de que lo m&aacute;s sensato era posponer la aventura pero finalmente accedi&oacute; a rega&ntilde;adientes. Las minas de Nashkel tampoco parec&iacute;an de momento a nuestro alcance as&iacute; que decidimos desandar el camino hacia Beregost y tratar de limpiar los bosques adyacentes de toda la chusma que merodeaba por all&iacute;. Al noroeste de Nashkel nos encontramos con una enorme compa&ntilde;&iacute;a de gnolls que no ofreci&oacute;, a pesar de su n&uacute;mero, gran resistencia. En medio de la batalla nos encontramos, en nuestra misma situaci&oacute;n, nada menos que con Drizzt. ¡S&iacute;, el aut&eacute;ntico Drizzt de la casa de los Do’Urden! Ya s&eacute; lo que me vais a decir, ya… todo el mundo presume de haberle conocido en un momento u otro… ¡pero os juro que digo la verdad! Y digo a&uacute;n m&aacute;s: nos pidi&oacute; ayuda en la lucha. Por supuesto, nos ofrecimos encantados, aunque ya metidos en faena, Drizzt demostr&oacute; sobradamente que no necesitaba en absoluto de nuestra colaboraci&oacute;n. Lo cierto es que fue un encuentro bastante extra&ntilde;o…</P>

<P ALIGN="JUSTIFY">Algo m&aacute;s al norte tuvimos una seria confrontaci&oacute;n con un grupo de bandidos bastante bien pertrechados y de los que quiz&aacute;s hay&aacute;is o&iacute;do hablar alguna vez, ya que fueron famosos en sus fechor&iacute;as: Jemby, Teyngan y Zekar. Pues ahora ya sab&eacute;is quienes fueron los responsables del fin de sus andanzas. La pelea fue dura pero salimos victoriosos gracias a nuestra buena coordinaci&oacute;n. Si alguna vez en vuestras andanzas os encontr&aacute;is ante una situaci&oacute;n en la que deb&eacute;is luchar contra un grupo en el que haya un mago poderoso os voy a dar un consejo que os ayudar&aacute; a salir vivos: atacad con todas vuestros efectivos al mago en primer lugar y evitad a toda costa que lance sus hechizos o estar&eacute;is perdidos en menos tiempo del que se tarda en decir &quot;proyectil m&aacute;gico&quot;.</P>

<P ALIGN="CENTER">* * * * *</P>

<P ALIGN="JUSTIFY">Bueno, amigos, creo que es hora de retirarnos a descansar. La noche ha sido larga y mi voz est&aacute; empezando a resentirse. Si lo dese&aacute;is podemos reunirnos ma&ntilde;ana en esta misma posada y continuar&eacute; para vosotros el relato de esta aventura. ¡Ahhh! Mis viejos huesos ya no soportan el esfuerzo como antes… Ya entender&eacute;is como me siento cuando llegu&eacute;is a mi edad.</P>

<hr>
<UL>
<li><a href="bgsol01.htm">[Volver al &iacute;ndice]</a></li>
<LI><a href="bgsolc00.htm">PROLOGO: Un Viaje Inesperado</a></LI>
<LI><a href="bgsolc01.htm">CAPITULO 1: En la Posada del Brazo Amigo</a></LI>
<LI><a href="bgsolc02.htm">CAPITULO 2: Problemas en Nashkel</a></LI>
</UL>

</font>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpge.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



