<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
</p>
<br><br><br><br>

<H3>
Baldur’s Gate.<br>Cap&iacute;tulo Primero: En la Posada del Brazo Amigo
</H3>
 
<P ALIGN="JUSTIFY">Sumido en negros pensamientos pas&eacute; el resto de la noche sin poder descansar ni el cuerpo ni la mente. Caminaba sin rumbo fijo cuando, al amanecer, alguien se acerc&oacute; a m&iacute; desde la espesura. No conoc&iacute;a a nadie capaz de moverse con tanto sigilo… a nadie excepto quiz&aacute;s a ¡Imoen!</P>

<P ALIGN="JUSTIFY">Efectivamente, la curiosa e inquieta Imoen nos hab&iacute;a seguido a Gorion y a m&iacute; la noche anterior. Hablamos durante largo rato sobre los motivos que la hab&iacute;an impulsado a seguirnos y la forma en que hab&iacute;a conseguido que Gorion no se diera cuenta de ello. A pesar de su gran talento para el sigilo y el ocultamiento, desarrollado gracias a multitud de juegos infantiles —y otros no tanto—, se me hac&iacute;a dif&iacute;cil creer que Gorion no se hubiese percatado de su presencia mediante sus habilidades m&aacute;gicas y su gran percepci&oacute;n. O quiz&aacute;s s&iacute; se percat&oacute; pero dej&oacute; seguir el rumbo de los acontecimientos pensando que yo podr&iacute;a llegar a necesitarla…</P>

<P ALIGN="JUSTIFY">En cualquier caso, su compa&ntilde;&iacute;a me hizo recuperar el &aacute;nimo y la confianza. Por primera vez agradec&iacute; su ch&aacute;chara, e incluso me pareci&oacute; que se mostraba algo m&aacute;s callada de lo habitual. Quiz&aacute;s su sincero dolor por los recientes acontecimientos le hac&iacute;a mostrarse as&iacute; por respeto. Superada la sorpresa inicial acept&eacute; su compa&ntilde;&iacute;a y, juntos los dos, nos dispusimos a explorar los alrededores confiando en encontrar el lugar de la emboscada y poder dar sepultura al cuerpo de Gorion como merec&iacute;a. No tardamos mucho en hallarlo, ligeramente hacia el norte de nuestro punto de encuentro. Recogimos algunos objetos de los atacantes fallecidos y, junto al cuerpo sin vida de Gorion, encontramos una carta. Era la carta de la que Imoen me hab&iacute;a hablado en Candelero. En ella, un personaje para m&iacute; desconocido y que solamente firmaba como &quot;E&quot; advert&iacute;a a mi mentor del peligro que se cern&iacute;a sobre nosotros y le instaba a abandonar nuestro lugar de refugio de forma inmediata.</P>

<P ALIGN="JUSTIFY">Aqu&eacute;l hab&iacute;a sido el motivo de nuestra precipitada marcha… La carta segu&iacute;a, aconsej&aacute;ndole que se dirigiera a la Posada del Brazo Amigo, hacia el norte, donde dos amigos suyos —Jaheira y Khalid— podr&iacute;an prestarle su apoyo. As&iacute; que decidimos encaminarnos hacia aquella posada, encontrarnos all&iacute; con esos viejos conocidos de Gorion y solicitarles su ayuda.</P>

<P ALIGN="JUSTIFY">Por el camino hacia la encrucijada del este nos encontramos con una pareja un tanto extra&ntilde;a, formada por un nigromante y un mediano de aspecto bastante sospechoso, de nombre Xzar y Montaron respectivamente. Quisieron solicitar nuestra ayuda para dirigirse a Nashkel pero algo en mi interior me dec&iacute;a que no eran la personas m&aacute;s adecuadas para compartir viaje. Quiz&aacute;s era una indicaci&oacute;n de mis incipientes habilidades como palad&iacute;n que me ayudaban a percibir la esencia de lo malvado en las personas. As&iacute; que declin&eacute; su ofrecimiento y se fueron hechos una furia, lanzando maldiciones contra m&iacute;. Creo que fue una decisi&oacute;n bastante acertada la de dejarlos ir. ¡Incluso trataban de cobrarnos por su compa&ntilde;&iacute;a!</P>

<P ALIGN="JUSTIFY">Seguimos adelante y, llegando a la encrucijada de caminos, un hombre de aspecto bastante peculiar, ataviado con t&uacute;nica y sombrero de mago rojos, nos detuvo y me hizo una extra&ntilde;a pregunta. En otras circunstancias hubiera resultado una pregunta impertinente pero algo en su forma de hablar me indicaba que no era simplemente un chalado, as&iacute; que le contest&eacute; con un poco de su propia medicina, cosa que pareci&oacute; agradarle, y desapareci&oacute; sin m&aacute;s. No supe por qu&eacute; pero me dio la sensaci&oacute;n de que volver&iacute;amos a encontrarnos m&aacute;s adelante… y no me equivocaba.</P>

<P ALIGN="JUSTIFY">Pronto tuve ocasi&oacute;n de utilizar mis crecientes habilidades en la lucha ya que la zona estaba plagada de peque&ntilde;as bestias de la condici&oacute;n m&aacute;s diversa. Nos atacaron individualmente y en grupos aunque nunca lo suficientemente numerosos como para entra&ntilde;ar serio peligro. En esos momentos apreci&eacute; a&uacute;n m&aacute;s, si cabe, la compa&ntilde;&iacute;a de Imoen. Su manejo del arco me salv&oacute; de m&aacute;s de un apuro y su capacidad para esconderse y explorar el terreno semioculta en las sombras tambi&eacute;n result&oacute; de gran utilidad.</P>

<P ALIGN="JUSTIFY">El encuentro m&aacute;s peligroso al que nos enfrentamos aquella noche fue con un descomunal ogro pero, gracias a una t&aacute;ctica combinada de ataque cuerpo a cuerpo y a distancia, logramos abatirlo no sin antes recibir algunas heridas. El bot&iacute;n, no obstante, fue suculento y obtuvimos un par de cinturones que no supimos identificar y que decidimos no utilizar hasta no tener claras sus propiedades. Despu&eacute;s me enterar&iacute;a de la maldici&oacute;n que pesaba sobre uno de ellos con gran alivio por mi parte, ya que &eacute;sta consist&iacute;a en cambiar el sexo de quien lo ci&ntilde;ese entorno a su cintura, convirtiendo a un hombre en mujer y viceversa.</P>

<table width=320 align="right">
<tr><td><img src="jpg/bgsol101.jpg"></td></tr>
<tr><td><font size=1 face=arial><center>Ante la entrada a la Posada del Brazo Amigo</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Con el bot&iacute;n en nuestro poder y el &aacute;nimo que da la victoria nos dirigimos hacia el norte, camino de la Posada del Brazo Amigo. Al amanecer llegamos a las puertas de lo que parec&iacute;a m&aacute;s bien un castillo que una posada pero que, sin duda alguna, deb&iacute;a ser el lugar que busc&aacute;bamos. Tras hablar con los guardias que vigilaban la entrada accedimos al interior de la fortaleza amurallada y nos encontramos con un lugar lleno de actividad. Hablando con los residentes nos enteramos de la extra&ntilde;a debilidad que, &uacute;ltimamente, aquejaba al acero extra&iacute;do de las minas de Nashkel as&iacute; como de lo peligrosos que se hab&iacute;an vuelto los caminos —algo que ya hab&iacute;amos tenido ocasi&oacute;n de comprobar por nosotros mismos—. Como si esto hubiera sido una premonici&oacute;n de lo que estaba por acaecer, apenas nos acercamos a las escaleras de la posada un siniestro individuo de nombre Tarnesh nos sali&oacute; al paso pretendiendo venir en nombre de nuestros amigos. Inmediatamente me di cuenta de que no era quien aparentaba ser y, con mi percepci&oacute;n de lo maligno, averig&uuml;&eacute; sus verdaderas intenciones. La lucha fue breve gracias a que no le dimos tiempo a pronunciar ninguno de sus hechizos. Cuando llegaron los guardias todo hab&iacute;a terminado.</P>

<P ALIGN="JUSTIFY">Una vez en la posada no fue dif&iacute;cil encontrar a los viejos amigos de Gorion, los cuales se mostraron tristes por la noticia de su muerte y deseosos de ayudarme en lo que pudieran, por lo que les permit&iacute; que se unieran a Imoen y a m&iacute; en la b&uacute;squeda de respuestas a todo lo que estaba aconteciendo. En la posada conocimos a la due&ntilde;a de uno de los cinturones que portaba el ogro de la noche anterior y, aunque la recompensa por su devoluci&oacute;n no fue lo que se dice espl&eacute;ndida, sent&iacute; que hac&iacute;a lo correcto. Tambi&eacute;n conocimos a una simp&aacute;tica mujer gnomo, llamada Landrin, que nos encarg&oacute; limpiar de ara&ntilde;as su casa de Beregost, prometiendo recompensa.</P>

<P ALIGN="JUSTIFY">Otro encuentro que recuerdo con agrado fue el de Joia, la cual nos solicit&oacute; ayuda para recuperar un anillo de gran valor que unos goblins le hab&iacute;an robado. No fue en absoluto dif&iacute;cil eliminarlos con la fuerza combinada de los cuatro compa&ntilde;eros. El agradecimiento de Joia por nuestra colaboraci&oacute;n fue tal que, a pesar de no tener dinero, habl&oacute; de nuestra haza&ntilde;a a todo el mundo en la posada. Nuestra reputaci&oacute;n se vio aumentada de forma considerable y pudimos darnos cuenta de que todos nos miraban a partir de entonces con m&aacute;s respeto. Ya no ten&iacute;amos mucho m&aacute;s que hacer all&iacute;, as&iacute; que decidimos investigar esa extra&ntilde;a enfermedad del acero de Nashkel y, de camino, har&iacute;amos un alto en Beregost. All&iacute; posiblemente tuvieran m&aacute;s noticias y podr&iacute;amos solucionar el &quot;peque&ntilde;o problema&quot; de Landrin.</P>

<P ALIGN="JUSTIFY">As&iacute; pues, nos encaminamos hacia el sur, volviendo sobre nuestros pasos de nuevo hasta la encrucijada, y poco despu&eacute;s nos hall&aacute;bamos en Beregost donde los lugare&ntilde;os nos contaron toda suerte de historias de lo m&aacute;s extra&ntilde;o. Muchos mencionaban con miedo unas supuestas ruinas de una antigua escuela de magos que atrajo nuestra curiosidad. Tras pedir recomendaci&oacute;n sobre los mejores lugares de reposo nos dirigimos a la Posada de Feldepost donde, nada m&aacute;s entrar, tuvimos un altercado con un hombre bastante arisco. Aunque intentamos calmarle, finalmente nos atac&oacute; y no tuvimos m&aacute;s remedio que matarle. Se llamaba Marl y, sinceramente, no creo que nadie lo echase mucho de menos, dado su car&aacute;cter. Sin embargo nunca dejo de atormentarme con la idea de que, si hubiese tenido m&aacute;s tacto, habr&iacute;a podido evitar una muerte in&uacute;til, una vida malgastada. Como palad&iacute;n era mi obligaci&oacute;n hacerlo as&iacute; y fracas&eacute;.</P>

<P ALIGN="JUSTIFY">Un momento de cierta nostalgia se produjo cuando nos encontramos con un viejo conocido de Candelero, Firebead Elvenhair, al cual hicimos un peque&ntilde;o favor tray&eacute;ndole un libro que deseaba leer. Nos lo agradeci&oacute; profundamente entreg&aacute;ndonos otro libro suyo como regalo. Con un afectuoso saludo nos despedimos de &eacute;l para continuar nuestro camino. En la plaza del pueblo averiguamos, por boca del pregonero, la suculenta recompensa que se ofrec&iacute;a por la cabeza de un tal Bassilus. Tambi&eacute;n en Beregost conocimos a Kagain, un enano, que nos pidi&oacute; ayudarle a buscar a un ni&ntilde;o perdido en un ataque de bandidos a una de sus caravanas. Se uni&oacute; a nosotros aunque pronto empez&oacute; a quejarse por nuestro &quot;exceso de escr&uacute;pulos&quot;. Siendo de car&aacute;cter malvado y ego&iacute;sta sab&iacute;amos que no durar&iacute;a mucho en nuestra compa&ntilde;&iacute;a pero, de momento, sus dotes para la lucha nos ser&iacute;an de utilidad.</P>

<P ALIGN="JUSTIFY">Frente a otra de las muchas posadas de Beregost, la llamada del Mago Ardiente, conocimos a Garrick, un bardo bastante &quot;r&aacute;pido de manos&quot;, si sab&eacute;is lo que quiero decir… Nos ofreci&oacute; defender a su jefa, Silke, de un supuesto intento de asesinato ordenado por Feldepost por no se qu&eacute; asunto personal. Nos pareci&oacute; una historia bastante rara pero decidimos ir a investigar. La tal Silke no era ni mucho menos trigo limpio y pronto qued&oacute; todo al descubierto. Intentaba enga&ntilde;arnos para que asesin&aacute;ramos a unos pobres inocentes, qui&eacute;n sabe con qu&eacute; prop&oacute;sito. Al negarnos, Silke nos atac&oacute;, demostrando poseer unas habilidades m&aacute;gicas en absoluto despreciables. La pelea fue equilibrada pero nuestra superioridad num&eacute;rica acab&oacute; imponi&eacute;ndose. Tras quedarse sin empleo, al morir su jefa, Garrick se uni&oacute; a nosotros pero no dej&eacute; de vigilarle atentamente pues no acababa de fiarme del todo de quien con tan poco acierto eleg&iacute;a sus compa&ntilde;&iacute;as. Con la gu&iacute;a de Garrick acabamos de explorar el pueblo y encontramos la vivienda de Landrin, donde realizamos una completa labor de fumigaci&oacute;n, llev&aacute;ndonos el cuerpo de una de las ara&ntilde;as como prueba, adem&aacute;s de los objetos que nos hab&iacute;a pedido. Volvimos a la Posada del Brazo Amigo a comunicarle las noticias y se mostr&oacute; muy complacida.</P>

<P ALIGN="JUSTIFY">De vuelta a Beregost exploramos brevemente el templo de Lathander, hacia el este, tratando de obtener informaci&oacute;n sobre el posible paradero de Bassilus, sin demasiado &eacute;xito por el momento. Tambi&eacute;n conocimos en Beregost a Zhurlong, un peque&ntilde;o y molesto ladronzuelo que hab&iacute;a perdido sus botas a manos de unos monstruos sin identificar que merodeaban por los alrededores. Me rob&oacute; parte de mi dinero pero prefer&iacute; no enfadarme y hacer como si no me diera cuenta. Quiz&aacute;s si le ayudaba con sus problemas se mostrase agradecido y yo recuperar&iacute;a lo que era m&iacute;o. De todas formas eso iba a tener que esperar ya que Jaheira se impacientaba, inst&aacute;ndome a dirigirnos de una vez a Nashkel. Decid&iacute; hacerle caso y tomamos rumbo hacia el sur, dejando otros muchos problemas sin resolver, de momento, como la petici&oacute;n de ayuda de Bjornin para eliminar una banda de semiogros en las cercan&iacute;as de la ciudad.</P>

<table width=320 align="right">
<tr><td><img src="jpg/bgsol102.jpg"></td></tr>
<tr><td><font size=1 face=arial><center>Talanthyr hizo un buen trabajo y Melicamp recuper&oacute; su forma humana</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Algo hacia el sudoeste de nuestra ruta nos encontramos con uno de los m&aacute;s extra&ntilde;os sucesos que me han ocurrido nunca: nos encontramos con un pollo ¡que hablaba! S&iacute;, ya veo vuestras caras de asombro, pero es absolutamente cierto. Le salvamos del ataque de varios lobos y &eacute;l, agradecido, nos cont&oacute; la historia de su desgracia. Result&oacute; ser un aprendiz de mago, de nombre Melicamp, que por jugar con conjuros fuera de su alcance acab&oacute; atrapado en esa forma animal sin esperanza de recuperar la normalidad. Como ninguno de nosotros ten&iacute;a las habilidades m&aacute;gicas necesarias para librarle de su maldici&oacute;n la &uacute;nica alternativa fue llevarle a presencia de su maestro, el mago Thalantyr, que resid&iacute;a en una peque&ntilde;a fortaleza al norte de all&iacute;. De camino a este lugar nos enfrentamos con varias criaturas procedentes del plano de los muertos, esqueletos concretamente. Quiz&aacute;s el maestro de Melicamp tambi&eacute;n jugaba con fuerzas que es mejor dejar tranquilas… Una vez hablamos con Thalantyr, &eacute;ste reconoci&oacute;… m&aacute;s o menos… que nuestro amigo el pollo era, o hab&iacute;a sido, su aprendiz. Sin embargo se mostr&oacute; incapaz de anular el hechizo que obraba sobre el pobre desgraciado. Cuando insistimos en ayudar pareci&oacute; reconocer que exist&iacute;a una soluci&oacute;n, aunque peligrosa. Para ello ten&iacute;amos que llevarle una calavera, lo cual no fue dif&iacute;cil habiendo tantos esqueletos en las cercan&iacute;as. El hechizo tuvo &eacute;xito y por fin dejamos a tan extra&ntilde;a pareja de magos seguir con sus estudios. Melicamp, desde luego, estaba de lo m&aacute;s agradecido.</P>

<P ALIGN="JUSTIFY">Ya nos hab&iacute;amos entretenido bastante y Nashkel esperaba as&iacute; que continuamos viaje hacia el sur. No fue un paseo, ni mucho menos, ya que muchos fueron los goblins de uno y otro tipo que nos encontramos en nuestro camino. Hubo tambi&eacute;n algunos bandidos que pretend&iacute;an nuestro oro y dem&aacute;s objetos de valor… ¡pobrecillos! No sab&iacute;an con quien se enfrentaban, si no mejor hubieran hecho con permanecer alejados de nosotros. Tras tantos avatares por fin llegamos al destino pretendido…</P>

<hr>
<UL>
<li><a href="bgsol01.htm">[Volver al &iacute;ndice]</a></li>
<LI><a href="bgsolc00.htm">PROLOGO: Un Viaje Inesperado</a></LI>
<LI><a href="bgsolc01.htm">CAPITULO 1: En la Posada del Brazo Amigo</a></LI>
<LI><a href="bgsolc02.htm">CAPITULO 2: Problemas en Nashkel</a></LI>
</UL>

</font>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpge.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



