<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
</p>
<br><br><br><br>

<H3>
Baldur’s Gate.<br>Pr&oacute;logo: Un Viaje Inesperado
</H3>
 
<P ALIGN="JUSTIFY">En aquellos d&iacute;as mi tutor Gorion y yo nos encontr&aacute;bamos residiendo en Candelero. En aquel lugar amurallado y protegido por la orograf&iacute;a nos sent&iacute;amos como en casa y a salvo de todo peligro, m&aacute;s no ser&iacute;a por mucho tiempo. En las semanas previas a la precipitaci&oacute;n final de los acontecimientos yo hab&iacute;a notado a Gorion muy alterado y algo distante, sin ser capaz de precisar el motivo y sin que &eacute;l, muy reservado y cauto por su naturaleza y experiencia, tampoco arrojase ninguna luz sobre esta circunstancia. Finalmente algo ocurri&oacute; que puso a Gorion en alerta hasta el punto de indicarme que hiciese a toda prisa el equipaje ya que part&iacute;amos inmediatamente. No me dijo a d&oacute;nde, lo cual no hizo m&aacute;s que aumentar mi preocupaci&oacute;n ante tan ins&oacute;lito comportamiento en el normalmente sosegado y cabal hombre al que yo apreciaba como a un padre.</P>

<table width=321 align="right">
<tr><td><img src="jpg/bgsol001.jpg"></td></tr>
<tr><td><font size=1 face=arial><center>Mafergut junto a Gorion ante la puerta de la biblioteca de Candelero</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Nunca olvidar&eacute; aquel d&iacute;a, aquel aciago d&iacute;a…</P>

<P ALIGN="JUSTIFY">Me encontraba frente a la puerta de la posada de Candelero. Una posada muy similar a &eacute;sta, bueno, realmente muy similar a cualquier otra posada. Hab&iacute;a llegado hasta all&iacute; sin casi darme cuenta, absorto como estaba en mis cavilaciones acerca de lo que pod&iacute;a estar sucediendo para obligarnos a partir as&iacute;, casi dir&iacute;a que huyendo... pero ¿de qu&eacute;? … Perd&oacute;n, creo que me estoy desviando del hilo de la narraci&oacute;n… Me encontraba frente a la puerta de la posada, donde esperaba comprar algunas cosas que podr&iacute;a necesitar en el inminente viaje. El posadero era el viejo Winthrop que estaba, como siempre, de buen humor y me quiso gastar una de sus t&iacute;picas bromas. Tras intercambiar los saludos de rigor adquir&iacute; una espada larga, un escudo grande y una armadura de cuero tachonado. De la posada sal&iacute; con un encargo de uno de los clientes, Firebead Elvenhair, para recuperar un pergamino. La verdad es que resulta curioso porque, en un d&iacute;a como aqu&eacute;l de tanta tensi&oacute;n, acab&eacute; como recadero de la mitad de los residentes en Candelero.</P>

<P ALIGN="JUSTIFY">De camino a uno de estos recados me encontr&eacute; con la peque&ntilde;a Imoen, compa&ntilde;era de miles de andanzas y travesuras de mi juventud y a la que siempre consider&eacute; como &quot;la peque&ntilde;a&quot; Imoen, a pesar de que tan s&oacute;lo era un par de a&ntilde;os m&aacute;s joven que yo mismo. Me abord&oacute; con su ch&aacute;chara habitual la cual he de reconocer que a veces llegaba a molestarme un poco. En el transcurso de la conversaci&oacute;n dio muestras de saber incluso m&aacute;s que yo del viaje que emprend&iacute;a y sin querer se le escap&oacute; algo acerca de una carta… m&aacute;s tarde supe a qu&eacute; carta se refer&iacute;a. El caso es que demostr&oacute; mucho inter&eacute;s por el viaje e incluso se atrevi&oacute; a sugerir el acompa&ntilde;arnos a Gorion y a m&iacute; aunque sin poner mucho &eacute;nfasis en sus palabras. Me desped&iacute; de ella y no volv&iacute; a pensar en todo aquello.</P>

<P ALIGN="JUSTIFY">Estaba deseoso de probar mi nuevo equipo, as&iacute; que me enfund&eacute; en la armadura, me ajust&eacute; el escudo al antebrazo izquierdo y, espada en mano, me dispuse a ir al encuentro de Gorion, que me esperaba en las escaleras de la biblioteca. El camino era muy corto pero me iba a encontrar con m&aacute;s de una sorpresa desagradable. Nunca una espada hab&iacute;a sido adquirida por guerrero alguno en momento m&aacute;s propicio.</P>

<P ALIGN="JUSTIFY">Aquel pobre hombre no tuvo opci&oacute;n. Incluso yo, que no era m&aacute;s que un aprendiz, lo elimin&eacute; en cuesti&oacute;n de segundos. Era la primera vez que mataba a una persona y, desde luego, tambi&eacute;n era la primera vez que alguien demostraba inter&eacute;s por matarme a m&iacute;. Todo aquello me desorient&oacute; terriblemente, pero tambi&eacute;n me hizo comprender los motivos de nuestra precipitada marcha: al parecer alguien quer&iacute;a acabar conmigo, por alguna oscura raz&oacute;n que escapaba a mi entendimiento. Fuera como fuese ya no estaba seguro en Candelero.</P>

<P ALIGN="JUSTIFY">Cuando fui atacado por segunda vez antes de llegar hasta la biblioteca empec&eacute; a preocuparme de verdad. El segundo agresor era algo m&aacute;s habilidoso que el primero y, aunque sal&iacute; victorioso del encuentro… cosa bastante evidente puesto que de otro modo no me hallar&iacute;a aqu&iacute; relatando esta historia… aunque sal&iacute; victorioso del encuentro, como digo, no fue sin antes recibir algunas heridas leves.</P>

<P ALIGN="JUSTIFY">Tras este segundo y desagradable encuentro en tan corto periodo de tiempo me dirig&iacute; a toda prisa a mi cita con Gorion y, sin m&aacute;s demora, partimos al atardecer de aquel d&iacute;a con destino a lo desconocido…</P>

<P ALIGN="JUSTIFY">Ocurri&oacute; poco m&aacute;s o menos a medio camino de la encrucijada. Era ya noche cerrada cuando, al atravesar un claro en el bosque, f&aacute;cilmente identificable por unos c&iacute;rculos de piedras, fuimos cogidos por sorpresa en una emboscada. Gorion se defendi&oacute; con su poderosa magia y despach&oacute; con rapidez a todos los atacantes… a todos menos a uno: un hombre enorme, con armadura oscura y brillante a la vez. Un hombre con voz maligna y una aparentemente inagotable vitalidad que acab&oacute; con la vida de mi mentor sin siquiera pesta&ntilde;ear. A petici&oacute;n de Gorion, yo hab&iacute;a huido momentos antes en la confusi&oacute;n de la batalla por lo que pude escapar a lo que de otra forma hubiera sido una muerte segura o algo a&uacute;n peor. Sab&iacute;a que, de haber permanecido all&iacute;, nada habr&iacute;a podido hacer por aqu&eacute;l a quien tanto deb&iacute;a salvo acompa&ntilde;arle en su triste final. Pero eso no aliviaba el dolor que sent&iacute;a en lo m&aacute;s profundo de mi coraz&oacute;n.</P>

<P ALIGN="JUSTIFY">Ten&iacute;a que averiguar lo que estaba ocurriendo, quien era aquel extra&ntilde;o personaje y si exist&iacute;a una forma de acabar con &eacute;l, mas no pod&iacute;a hacerlo solo. Necesitar&iacute;a ayuda si quer&iacute;a salir con vida de aquella aventura…</P>

<hr>
<UL>
<li><a href="bgsol01.htm">[Volver al &iacute;ndice]</a></li>
<LI><a href="bgsolc00.htm">PROLOGO: Un Viaje Inesperado</a></LI>
<LI><a href="bgsolc01.htm">CAPITULO 1: En la Posada del Brazo Amigo</a></LI>
<LI><a href="bgsolc02.htm">CAPITULO 2: Problemas en Nashkel</a></LI>
</UL>

</font>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpge.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



