<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>

<HR>		  







<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos de Aventuras</B><hr>

<FONT COLOR="#009933" size=3 face="arial"><B>D</B></font><FONT color="#000000" size=2 face="arial"><B>iseñando una aventura conversacional</B>

</FONT>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por</b><br>

<u><b><font color="0000ff">Spellcaster.</font></b></u><br>

<b>T</b></font><FONT color="#000000" size=2 face="arial"><b>raducción y adaptación de</b><br>

<A HREF="mailto:kilivor@geocities.com"><b>Daniel Cárdenas.</b></A>

</FONT>

<br><br>

<FONT size=2 color="#000000" face="Arial"><br><br><br>

<H3>

Capítulo 1.<br>Presentación del curso. El guión en la aventura.

</H3>

<font size=2 face=arial>

<P ALIGN=JUSTIFY><font size=2 face=arial>

El presente art&iacute;culo est&aacute; especialmente dirigido

a aquellos principiantes que desean realizar sus propios juegos.

Ya s&eacute; que las aventuras solo-texto est&aacute;n algo pasadas

de moda, pero hay que reconocer que los conceptos que hay tras

ellas son muy similares a los de las aventuras gr&aacute;ficas

y que, por tanto, pueden emplearse como base.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Ten en cuenta que todo lo que ver&aacute;s aqu&iacute;, ser&aacute;n

opiniones personales de c&oacute;mo una aventura solo-texto podr&iacute;a

ser dise&ntilde;ada y programada. Estos art&iacute;culos te mostrar&aacute;n

_TODOS_ los pasos en la creaci&oacute;n de una aventura, desde

el dise&ntilde;o y l&iacute;nea argumental, hasta la programaci&oacute;n,

con sugerencias e ideas de c&oacute;mo desarrollar m&aacute;s

a fondo el sistema.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Como esribo esto al mismo tiempo que programo la aventura, podr&iacute;a

ser que alguna vez metiera la pata&#133; As&iacute; que si descubres

alg&uacute;n error en el c&oacute;digo o en las explicaciones,

o si tienes alguna duda, s&oacute;lo tienes que escribirme.<BR>

<P ALIGN=JUSTIFY><font size=2 face=arial>

<B><FONT SIZE=4>El gui&oacute;n de la aventura</FONT></B>

<P ALIGN=JUSTIFY><font size=2 face=arial>

En esta parte del art&iacute;culo tratar&eacute; de dar algunas

pistas de como comenzar a crear la aventura.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Para m&iacute;, una de las partes m&aacute;s importantes de todo

juego es el gui&oacute;n&#133; Es lo primero que hago siempre,

porque creo que teniendo una buena historia, todo lo dem&aacute;s

(la jugabilidad y esas cosas) vendr&aacute;n solas. En este momento,

hay que tratar de ser original&#133; Como cada vez cuesta m&aacute;s

ser original con la historia, debes serlo en otras cosas&#133;

Por ejemplo, &#161;siempre trato de tener presente la idea de

SUSPENSE! Me gusta que el h&eacute;roe comience sin tener ni idea

de que es lo que se supone que debe cumplir&#133; Esa es mi idea

fundamental&#133; De cara a la originalidad habr&aacute; que cuidar

bien los detalles&#133; &Eacute;sto es muy importante, ya que

ayuda a crear la atm&oacute;sfera del juego&#133; Si sigues estos

consejos, podr&aacute;s hacer una aventura divertida de jugar,

incluso en estos tiempos con los juegos tipo DOOM tan de moda&#133;

<P ALIGN=JUSTIFY><font size=2 face=arial>

Y ya que lo he citado, dejadme deciros algo sobre &eacute;l: gr&aacute;ficos

y jugabilidad muy buena, &#161;pero una aut&eacute;ntica cagada

de historia! Admiro a los chicos de ID software (t&eacute;cnicamente

hablando), &#161;aunque a los del departamento de dise&ntilde;o

les dar&iacute;a un buen repaso! :)

<P ALIGN=JUSTIFY><font size=2 face=arial>

Otro aspecto importante al que hay que prestar atenci&oacute;n

es al tiempo y lugar donde se desarrollar&aacute; el juego&#133;

Si est&aacute;s haciendo una aventura situada en el espacio sideral,

no deber&iacute;as colocar un viejo Chevy en ella&#133; :)

<P ALIGN=JUSTIFY><font size=2 face=arial>

Bueno, pues para nuestra aventura, pensar&eacute; una peque&ntilde;a

y algo est&uacute;pida historia&#133; Dejadme pensar&#133; Hum&#133;

Es dif&iacute;cil&#133; :)

<P ALIGN=JUSTIFY><font size=2 face=arial>

Vale, &#161;ya lo tengo! Imaginemos que el t&iacute;o del h&eacute;roe

la palma (el 25 de abril de 1996&#133; detalles, que contribuyen

a la atm&oacute;sfera), y que te envi&oacute; una carta (sellada

el 23 de Abril de 1996&#133; otro detalle m&aacute;s) antes de

que pasara a mejor vida, cont&aacute;ndote que hay un tesoro escondido

en su mansi&oacute;n (situada en lo alto de una colina, cerca

del oc&eacute;ano), y que si lo encuentras, ser&aacute; tuyo&#133;

As&iacute; es como, por el ansia de oro, el h&eacute;roe se encaminar&aacute;

a la mansi&oacute;n. Una mierdecilla de historia, lo s&eacute;,

pero me permitir&aacute; explicar c&oacute;mo hacer una b&aacute;sica

aventura de texto.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Otra cosa que creo que es importante en todo juego es el nombre&#133;

No s&eacute;, pero siempre me paso un buen rato pensando en qu&eacute;

t&iacute;tulo ponerle&#133; El nombre tendr&iacute;a que dar al

usuario voluntad para adentrarse en el juego.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Un posible t&iacute;tulo para este juego podr&iacute;a ser 'La

Mansi&oacute;n', pero esto no llama demasiado la atenci&oacute;n&#133;

Podr&iacute;amos llamarlo 'El Tesoro de la Mansi&oacute;n', pero

es algo idiota, porque la palabra 'tesoro' ya ha sido utilizado

miles de veces en juegos y t&iacute;tulos que lo hace parecer

algo vulgar&#133; Otros ejemplos de palabras como &eacute;sta

ser&iacute;an 'Pr&iacute;ncipe', 'Pr&iacute;ncesa' o 'Drag&oacute;n'.

Intent&eacute;molos otra vez&#133; &#191;Qu&eacute; tal 'La Mansi&oacute;n

Demon&iacute;aca'? Vamos mejorando, pero a&uacute;n no pega demasiado&#133;

Posibles variaciones 'La Casa Demon&iacute;aca', 'La Casa del

Demonio', 'La Guarida del Demonio'&#133; Todav&iacute;a no, aunque

empiezan a sonar bien, recuerdan un juego donde hay una casa poseida

por un hechicero malvado&#133; Y &eacute;ste no es el caso (aunque

podr&iacute;a serlo)&#133; El &uacute;nico problema (en la historia

en la que estoy trabajando) es que hay un par de monstruos/fantasmas

en la casa&#133; Podr&iacute;amos titularlo 'La Casa Encantada'

o 'La Mansi&oacute;n Encantada', pero volver&iacute;amos a lo

de antes, pues 'Encantada' es una de esas palabras similares a

'tesoro'&#133; As&iacute; que, intentaremos ser un poco m&aacute;s

inventivos, con algo que pueda contribuir en la ambientaci&oacute;n.

Podriamos decir que la mansi&oacute;n se llama 'Fanglore', y dar

ese mismo nombre al juego&#133; de esta manera ganamos en atm&oacute;sfera

(porque hemos a&ntilde;adido el detalle del nombre de la casa),

y lo habremos bautizado con un nombre que no adelanta acontecimientos&#133;

:) Ahora s&iacute; que podemos decir que el proceso de crear la

gran aventura conversacional 'Fanglore' acaba de comenzar&#133;

:)<BR>

<P ALIGN=JUSTIFY><font size=2 face=arial>

<B><FONT SIZE=4>El gui&oacute;n</FONT></B>

<P ALIGN=JUSTIFY><font size=2 face=arial>

Lo siguiente (para m&iacute;) es la creaci&oacute;n del gui&oacute;n

y del mapeado. Estos dos pasos pueden hacerse simultaneamente&#133;

<P ALIGN=JUSTIFY><font size=2 face=arial>

El gui&oacute;n (plotline) ser&aacute; el curso de acontecimientos

y dem&aacute;s que el juego deber&iacute;a normalmente seguir.

En Fanglore, ser&iacute;a:

<P ALIGN=JUSTIFY><font size=2 face=arial>

Ir a Fanglore Encontrar el tesoro Escapar de la mansi&oacute;n

<P ALIGN=JUSTIFY><font size=2 face=arial>

Un juego puede tener varios finales, y diferentes soluciones,

contribuyendo &eacute;sto a un incremento de la complejidad del

juego (y tambi&eacute;n del inter&eacute;s que pueda despertar

el conjunto)&#133; Pero la forma de hacer todo esto siempre es

la misma.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Cada parte del gui&oacute;n es un paso diferente en el juego.

Ahora, cada paso del juego tiene diferentes objetivos (aunque

el juego s&oacute;lo tenga uno). Por ejemplo, el primer paso 'Ir

a Fanglore' tiene su propio objetivo, que no es otro que entrar

en la mansi&oacute;n. A parte, cada paso tiene su propia raz&oacute;n

de existencia&#133; Siempre deber&aacute;s explicar y dejar bien

claro como el jugador llega a cada uno de los puntos de la aventura.

El primer paso en Fangloria existe porque el taxi nos deja a las

puertas de la mansi&oacute;n, &eacute;stas han estado cerradas

durante a&ntilde;os, y no tienes la llave. Tambi&eacute;n, para

cada paso debe existir una manera de completar su objetivo y para

eso necesitar&aacute; ser definido. De nuevo, en el primer paso,

la forma de entrar en Fanglore ser&aacute; usando una pala, con

la echaremos abajo la puerta&#133; Tienes que pensar posibles

problemas, y en la manera de superarlos.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Los problemas en una aventura solo-texto no s&oacute;lo son puzzles

dif&iacute;ciles de resolver; los monstruos y cosas similares

tambi&eacute;n pueden servir&#133; En la primera parte no hay

problemas, pero en la segunda parte, hay una habitaci&oacute;n

llena de gas, en la que se tendr&aacute; que utilizar una mascarilla

para cruzarla, y para encontrar la m&aacute;scara, el jugador

deber&aacute; ir a la cocina de la casa y abrir el horno&#133;

Hay es donde se podr&aacute; encontrar la m&aacute;scara&#133;

<P ALIGN=JUSTIFY><font size=2 face=arial>

V&eacute;amos todo esto, esquem&aacute;ticamente:

<P ALIGN=JUSTIFY><font size=2 face=arial>

<h4>Ir a Fanglore</h4>

<font size=2  face=COURIER>

&#191;Objetivo ?

<BR><font size=2  face=COURIER>

Entrar en la mansi&oacute;n

<BR><font size=2  face=COURIER>

&#191;Por qu&eacute;?

<BR><font size=2  face=COURIER>

Porque el taxi nos deja en la puerta y no tenemos la llave

<BR><font size=2  face=COURIER>

&#191;C&oacute;mo?

<BR><font size=2  face=COURIER>

Conseguir la pala

<BR><font size=2  face=COURIER>

Derribar la puerta con &eacute;sta (la puerta se abre)<br>

<font size=2  face=arial>

Los otros pasos:

<font size=2  face=arial>

<h4>Encontrar el tesoro</h4>

<font size=2  face=COURIER>

&#191;Objetivo?

<BR><font size=2  face=COURIER>

Encontrar el tesoro

<BR><font size=2  face=COURIER>

&#191;Por qu&eacute;?

<BR><font size=2  face=COURIER>

Porque es precisamente el objetivo del juego.

<BR><font size=2  face=COURIER>

&#191;C&oacute;mo?

<BR><font size=2  face=COURIER>

Ir a la cocina

<BR><font size=2  face=COURIER>

Abrir el horno

<BR><font size=2  face=COURIER>

Coger la m&aacute;scara antig&aacute;s

<BR><font size=2  face=COURIER>

Ponerse la m&aacute;scara

<BR><font size=2  face=COURIER>

Cruzar la habitaci&oacute;n con gases

<BR><font size=2  face=COURIER>

Encontrar la biblioteca

<BR><font size=2  face=COURIER>

Empujar estante (encontrar&aacute; un pasaje secreto)

<BR><font size=2  face=COURIER>

Pasar por el pasaje

<BR><font size=2  face=COURIER>

Encuentra el ba&uacute;l con el tesoro

<BR><font size=2  face=COURIER>

&#191;Otros problemas?

<BR><font size=2  face=ARIAL><BR><P ALIGN="JUSTIFY">

Monstruos que pueden acabar con el jugador, en algunas habitaciones.

Se podr&aacute;n matar, si se tiene la espada (que est&aacute;

en la habitaci&oacute;n principal)&#133;<BR>

<font size=2  face=ARIAL>

<H4>Escapar de la mansi&oacute;n</H4>

<font size=2  face=COURIER>

&#191;Objetivo?

<BR><font size=2  face=COURIER>

Salir de Fanglore

<BR><font size=2  face=COURIER>

&#191;Por qu&eacute;?

<BR><font size=2  face=COURIER>

Resulta que el pasaje se cerr&oacute; al pasar al usarlo antes,

y el jugador est&aacute; atascado

<BR><font size=2  face=COURIER>

&#191;C&oacute;mo?

<BR><font size=2  face=COURIER>

Empujar un ladrillo de la pared (revela otro pasaje secreto)

<BR><font size=2  face=COURIER>

Usar el pasaje<BR>

<P ALIGN=JUSTIFY><font size=2 face=arial>

Ya veis, el gui&oacute;n est&aacute; listo&#133; Es aconsejable

el hacer un mapa a medida que planteas el gui&oacute;n.<BR>

<P ALIGN=JUSTIFY><font size=2 face=arial>

<B><FONT SIZE=4>Creaci&oacute;n del mapa de juego</FONT></B>

<P ALIGN=JUSTIFY><font size=2 face=arial>

Como he comentado antes, el mapa deber&iacute;a dibujarse al mismo

tiempo que el gui&oacute;n. No hay una forma estandar de hacer

un mapa&#133; La idea es: En el mapa, deber&aacute;s organizarlo

todo, salidas de cada localidad (relaci&oacute;n entre las diferentes

habitaciones) y tambi&eacute;n deber&iacute;as numerar todas y

cada una de ellas.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Un primer borrador podr&iacute;a ser &eacute;ste:

<P ALIGN=JUSTIFY><font size=2 face=arial><CENTER>

<IMG SRC="gif/curso1a1.gif" ALT="PRIMER BORRADOR"></CENTER>

<P ALIGN=JUSTIFY><font size=2 face=arial>

Tenemos 6 habitaciones:

<P ALIGN=JUSTIFY><font size=2 face=arial>

1. Cocina 2.Vest&iacute;bulo 3. Portal

<P ALIGN=JUSTIFY><font size=2 face=arial>

4. Habitaci&oacute;n con gases 5.Biblioteca 6. Habitaci&oacute;n

del Tesoro 

<P ALIGN=JUSTIFY><font size=2 face=arial>

Como m&aacute;s arriba he comentado el gui&oacute;n, ya conoces

la importancia de cada una de estas habitaciones.

<P ALIGN=JUSTIFY><font size=2 face=arial>

La l&iacute;nea amarilla conecta localidades entre las cuales

existe una salida de una a otra. Si no hay l&iacute;nea, es que

no hay salida. La l&iacute;nea naranja de puntos indica salida

condicional, es decir, que estamos ante una salida que s&oacute;lo

est&aacute; abierta en un momento determinado o despu&eacute;s

de realizar alguna acci&oacute;n (por ejemplo, la salida de la

habitaci&oacute;n 3 a la 2, s&oacute;lo est&aacute; accesible

cuando derribas la puerta). Por su parte, una flecha indicar&aacute;

un pasaje de unidireccional&#133; &Eacute;sto es, puedes ir al

este desde la localidad 5 a la 6, pero una vez all&iacute;, no

podr&aacute;s volver al oeste a la 5.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Todo esto no ofrece demasiado para explorar, ya que casi todos

los jugadores disfrutan m&aacute;s explorando docenas de habitaciones&#133;

Esto forma parte del detalle&#133; Por ejemplo, en una mansi&oacute;n

deber&iacute;a haber un comedor, y un gran jard&iacute;n&#133;

Esas habitaciones no aparecen en el boceto. Y una mansi&oacute;n

tambi&eacute;n deber&iacute;a tener dormitorios, y Fanglore tal

como lo hemos dise&ntilde;ado hasta ahora carece de ellas.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Es la hora de hacer un mapa m&aacute;s detallado&#133;

<P ALIGN=JUSTIFY><font size=2 face=arial><center>

<IMG SRC="gif/curso1a2.gif" ALT="SEGUNDO BORRADOR"></center>

<P ALIGN=JUSTIFY><font size=2 face=arial>

Tiene 22 habitaciones. Las habitaciones que est&aacute;n en verde

pertenecen al jard&iacute;n, el resto pertenecen propiamente a

la mansi&oacute;n. Tambi&eacute;n hemos a&ntilde;adido un comedor,

pero no una habitaci&oacute;n. Vale, si quieres, puedes omitir

ciertos detalles, siempre y cuando a&ntilde;adas otros. En el

caso de las habitaciones, podr&iacute;as decir que en el vest&iacute;bulo

hay unas escaleras, que lleva al piso de arriba, pero que al estar

bloqueada no puedes ir por ah&iacute;.

<P ALIGN=JUSTIFY><font size=2 face=arial>

Ya tenemos el mapa completo.<BR>

<P ALIGN=JUSTIFY><font size=2 face=arial>

<B>Pr&oacute;xima entrega:</B>

<P ALIGN=JUSTIFY><font size=2 face=arial>

El pr&oacute;ximo n&uacute;mero empezaremos a hacer cosillas en

PASCAL, y construiremos las bases de lo que debe ser un parser.

Hasta entonces, trata de hacerlo t&uacute; solo. :)

<P ALIGN=JUSTIFY><font size=2 face=arial>

<HR><P ALIGN=JUSTIFY><font size=2 face=arial>

<font color="#cc0000">Nota del traductor:</font>

Esta serie de art&iacute;culos sobre programaci&oacute;n de aventuras

 empezaron a aparecer en el n&uacute;mero

8 del magazine sobre programaci&oacute;n de juegos y demos 'The

Mag', cuyo responsable no es otro que Spellcaster, alias Diogo

de Andrade. Pod&eacute;is contactar con &eacute;l en la direcci&oacute;n

l42686@alfa.ist.utl.pt Si os interesa su publicaci&oacute;n (os

la aconsejo), podr&eacute;is encontrarla en http://alfa.ist.utl.pt/~l42686

<BR>



<BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>











<br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>
<A HREF="bpj.htm"><font FACE="ARIAL"><B>[Juegos de Aventuras]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>







<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



