<HTML>
<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">


<BODY>
<FONT color="#000000"  face="arial">
<p align="center">
<hr>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#0099CC" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#0099CC" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>quipo Macedo</B><FONT COLOR="#CC0000"><b>n</b></FONT><B>ia</B> <FONT color="#000000" size=6 face="arial"><B>Magazine</B><hr>
<FONT COLOR="#0099CC" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=3 face="arial"><b>oleccionables Macedo</B><FONT COLOR="#CC0000"><b>n</b></FONT><B>ia</B></font>
</font></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>

<br><br><br><br><br><br>
<br>
<center>
<TABLE BORDER=0 CELLSPACING=1 CELLPADDING=4 WIDTH=598>
<TR><TD WIDTH="32%" VALIGN="TOP">
<B><FONT FACE="Arial" SIZE=3 COLOR="#008080"><P>Miguel &Aacute;ngel Cividanes<br>
</B></FONT><FONT SIZE=2></FONT><A HREF="mailto:tear@ciudad.com.ar"><FONT FACE="Courier New" SIZE=2>tear@ciudad.com.ar</FONT></A></P>
<B><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#000000"><P ALIGN="JUSTIFY">Coordinador de<br>
Dimensi&oacute;n CRPG<br>
Escuela de Estrategia<br>
Macedonia de Ocio</B></FONT>
<br><br><br><br>
<center><img src="g_misc/colecm.gif"></center>
</TD>
<TD WIDTH="68%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Bueno, ah&iacute; voy con mi resumen.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Primero la presentaci&oacute;n. Mi nombre es Miguel Angel Cividanes, y se me conoce en esta magazine por el nickname de Beren Erchamion, aunque podr&aacute;n encontrarme por otros lugares con nombres como Tear, Tarod o Grey Angel. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entre otras cosas, estudio, vivo y duermo (bastante) en Buenos Aires, Argentina. Soy fan&aacute;tico de Independiente (un equipo de f&uacute;tbol de por aqu&iacute;), y tengo millares de hobbies. Entre ellos leo muchisimo (especialmente fantas&iacute;a &eacute;pica), colecciono todo tipo de manga y anime, escuchar m&uacute;sica, etc. Aunque parezca que escuchar m&uacute;sica es algo que hace todo el mundo, no lo hace como yo, porque vivo las 24 hs del d&iacute;a (y a veces mas) escuchando todo tipo de m&uacute;sica, sin parar. Atesoro una colecci&oacute;n de mas de 200 Cd´s. Soy joven, atractivo (jejej, a ver esas se&ntilde;oritas), estoy medio loco, me gusta la sal (¿?) Y soy un ferviente nacionalista argentino.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entr&eacute; a Macedonia en su segundo numero (creo, mi memoria falla mas de lo debido, demasiado heavy metal), por una invitaci&oacute;n de Fernando Rodr&iacute;guez, &quot;El Dire&quot;. Creo que hab&iacute;a surgido esta invitaci&oacute;n a ra&iacute;z de una pregunta relacionada con Ultima que intercambiamos, cuando yo aun viv&iacute;a en Espa&ntilde;a. Aqu&iacute; hago un par&eacute;ntesis para hablar de algo que es mi locura desde hace varios a&ntilde;os. Eso es la serie de juegos de rol &quot;Ultima&quot;. He jugado a cada uno de ellos, ganado cada uno de ellos, aprendido de memoria toda la historia del juego, aprendido el idioma r&uacute;nico y gargolico de los libros, le&iacute;do todas las publicaciones que han salido con respecto al tema, etc. Podr&iacute;a seguir infinitamente con el tema, que soy socio de Ultima Dragons, Guardians of Ultima, e infinidad de otros clubes dedicados al juego, pero paro ahora, YA!, Bueno, ya me calm&eacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, a ra&iacute;z de la invitaci&oacute;n yo pense, WOW, yo aparezco en una publicaci&oacute;n de Internet, fant&aacute;stico!, Y aunque no era lo mejor del mundo en aquella &eacute;poca, me enorgullec&iacute;a. Tengo la impresi&oacute;n de que el haber entrado en Macedonia me dio &aacute;nimos para seguir adelante y entrar en MeriStation, y luego formar parte del equipo de colaboradores del diario El Pa&iacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En Macedonia al principio no ca&iacute; muy bien, porque criticaba mucho (hasta desaf&iacute;e el director con el an&aacute;lisis de Heroes of Might and Magic II). A pesar de eso, fui el creador de la secci&oacute;n de soluciones, y me ocupe de llenar un poco mas la zona de juegos. </P>
<P ALIGN="JUSTIFY">Ahora soy el coordinador de las secciones &quot;Dimensi&oacute;n CRPG&quot;, &quot;Macedonia de Ocio&quot; y &quot;El Club de la estrategia&quot;. Me encanta estar en el magazine, realmente. Pongo mi coraz&oacute;n en ella y todos sus integrantes. Y aunque a veces no puedo cumplir con todo lo que prometo, como dice Fernando &quot;aunque llegue a ultimo momento, siempre lo hace de forma espectacular&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Eso fue todo por el d&iacute;a de hoy, soy Beren Erchamion, que les dejo algunas frases que me fascinaron toda la vida:</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=1><P ALIGN="JUSTIFY">&quot;Como a otros por la ternura, sobre tu juventud y tu vida yo quiero reinar por el miedo...&quot; Pablo de Santis, Pesadillas para Hackers.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;...pero el pivote de aquel conflicto, el eje final sobre el que girar&iacute;a su resultado, estaba en manos de los falibles mortales que durante siglos adoraron al Orden y que ahora se sent&iacute;an desligados de sus severas normas y libres de elegir su propio camino.&quot; Louise Cooper, El Se&ntilde;or del Tiempo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;Sean eternos los laureles que supimos conseguir.</P>
<P ALIGN="JUSTIFY"> Coronados de gloria vivamos, ¡O juremos con gloria, Morir!.&quot; Himno Nacional Argentino.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;En su desesperaci&oacute;n, Lord British llam&oacute; a un campe&oacute;n que saliera en defensa de la tierra. El H&eacute;roe que respondi&oacute; a sus llamadas se convertir&iacute;a muchos a&ntilde;os despu&eacute;s en el Avatar...&quot;  Una Reinterpretaci&oacute;n de la historia de Britania –Cap. III, La leyenda llamada &quot;La primera edad de la oscuridad&quot;-, Ultima 7, The Black Gate.</P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></B></FONT></TD>
</TR>
</TABLE></center>
<br><br>
<p align="right"><font size=2><a href="index10.htm">Volver a los créditos</a></font></p>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">CRÉDITOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

