<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Chicas y videojuegos
</FONT>
</H3>


<P align="justify">
<FONT color="#000000" size =2 face="arial" >        
<P ALIGN=JUSTIFY>
El otro d&iacute;a le&iacute; en una conocida revista
de videojuegos; &lt;&lt;La Asociaci&oacute;n Americana de Mujeres Universitarias
ha comenzado una campa&ntilde;a para que los videojuegos tengan en cuenta
al publico femenino, y empiecen a lanzarse mas t&iacute;tulos orientados
a las chicas. Seg&uacute;n esta asociaci&oacute;n, la clave de la ausencia
de este tipo de juegos est&aacute; en que la inmensa mayor&iacute;a de
los programadores y dise&ntilde;adores son hombres. [...] >>. Bien, para
empezar, aclarar el porqu&eacute; de que la inmensa mayor&iacute;a de programadores
y dise&ntilde;adores (y aunque no conste en el comunicado redactores de
revistas); simplemente porque es a nosotros a quienes nos atrae m&aacute;s
este mercado. El numero de mujeres que compra software esta comprendido
entre el 5 y el 10% mundial de ventas de software (despu&eacute;s se tendr&iacute;a
que comprobar esta estad&iacute;stica por pa&iacute;ses). Y si no miren
quienes escriben las revistas de inform&aacute;tica y videojuegos. Miren
quienes crean software. Y miren cualquier tipo de cr&eacute;ditos de un
trabajo relacionado con este mundo. Si no les falla la vista ver&aacute;n
que los porcentajes anteriormente nombrados se quedan cortos. A muy pocas
personas (proporcionalmente) del sexo femenino les atraen estas cosas.

<br><br>

<P align="justify">Y es que los juegos dirigidos al p&uacute;blico masculino
o para ambos pero m&aacute;s para el que ya sab&eacute;is son el 99%. Pocos
juegos salen dirigidos especialmente al publico femenino. Pero, mir&aacute;ndolo
de otro modo, &iquest;qu&eacute; publico femenino? &iquest;Acaso el poco
publico femenino que hay quiere al cien por cien juegos "para ellas"? Yo
creo que la mayor&iacute;a no. O almenos, las tres mujeres que conozco
que hagan videojuegos no los hacen para el publico femenino; ellas son
la dise&ntilde;adora de Tomb Raider (sin comentarios) de la cual no tengo
ganas de buscar el nombre, Lori Cole (saga Quest For Glory) y Roberta Williams
(King?s Quest entre muchos otros). Bueno, tal vez esta &uacute;ltima haya
tenido dos excepciones; King?s Quest 4 y 7, en los que se controlan a mujeres.
En el primero, una de las cosas que has de hacer es limpiar una casa para
los 7 enanitos cual Blancanieves y su bonito cuento. Si el protagonista
fuera el rey Graham o su hijo como en la mayor&iacute;a esto no pasaria.
Y en el segundo, la reina de Daventry y su hija deben intentar salir de
un lago encantado, pero la forma de resolver algunos puzles hubiera sido
diferente si el protagonista hubiera sido un chico, al igual que el trato
con los personajes. Pero esto son solo 2 casos muy aislados en un mundillo
que no fue pensado para chicas, y al que le est&aacute; costando mucho
corregir este... &iquest;error?

<br><br>

&iquest;Cuanto tiempo llevan las chicas diciendo
que los videojuegos no se hicieron pare ellas? &iquest;Cuantos a&ntilde;os
llevan las chicas jugando a mu&ntilde;ecas mientras los chicos jugaban
con sus nuevas consolas? Esto es algo muy contradictorio, el que ahora
quieran entrar.

<br><br>

Yo estoy convencido de que si ahora empezaran a sacar
juegos "para chicas" la mayor&iacute;a serian un fracaso. Porque esa asociaci&oacute;n
quiere juegos para el sexo femenino, pero &iquest;qu&eacute; cara pondr&aacute;n
cuando se les presentaran juegos en los que tienes que cocinar, maquillarte
y salir por ah&iacute; (que es lo &uacute;nico que diferenciar&iacute;a
un juego masculino o no definido)? &iquest;Es que qu&eacute; es lo que
ellas denominan juegos para chicas? Queda demostrado que no es un juego
con protagonista femenina con la aparici&oacute;n de Tomb Raider. Entonces,
&iquest;qu&eacute; demonios es? Que lo digan, y si es una buena idea, que
se lo hagan.

<br><br>

Pero tambi&eacute;n hay que tener en cuenta la postura
de las compa&ntilde;&iacute;as. &iquest;Puede decirme alguien la campa&ntilde;a
y el producto que utiliz&oacute; Nintendo para adaptar su m&aacute;s exitosa
consola al publico femenino? Fue una publicidad, que solo ocupaba media
p&aacute;gina por cierto, de una Game Boy Pocket Rosa y dec&iacute;a &lt;&lt;Nena,
&iquest;a qu&eacute; quieres jugar mientras esperas a tu pr&iacute;ncipe?>>,
y recomend&aacute;ndoles juegos de la talla de Aladd&iacute;n. &iquest;Y
las mujeres que he nombrado? &iquest;En que tipo de juegos est&aacute;n
trabajando? &iquest;Sabe alguien el &eacute;xito que tuvo el juego de la
subdivisi&oacute;n de American Laser Games, Games for Her, &lt;&lt;McKencie
&amp; Co>>? NULO. Incluso creo que tal divisi&oacute;n ya no existe, pero
no puedo confirmarlo. &iquest;Y sab&eacute;is de que iba el juego? Tenias
que saberte maquillar y elegir la ropa correctamente para salir y ligotear
al primer chico que se pusiera a tu paso (&iquest;?). No, si cuando empiecen
a sacar juegos "para ellas" en modo serio encima llamaran a sus creadores
machistas, cuando adem&aacute;s si alg&uacute;n d&iacute;a se hace lo mas
posible es que lo hagan chicas, as&iacute; que ya veis como todo se contradice
m&aacute;s que una contradicci&oacute;n perpetua (voy a descansar, a ver
si consigo descubrir que quiere decir esto que he dicho).<br>
</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniond.htm"><font FACE="ARIAL"><B>[Opinión Juegos]</B></font></a> <BR>

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
