<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Sid Meier's Civilization II.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Microprose.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Estrategia por turnos.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95. </b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 90%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<FONT color="#000000">
<P ALIGN=justify>
<FONT color="#000000">
<P ALIGN=justify>

<FONT color="#000000">
<img src="jpg/civpor.jpg" align=left>
<p align=justify>
¿Qu&eacute; os voy yo a decir de este juego que no sepáis?. Que no se haya escrito. Que
no se haya hablado que... El caso, es que creo que una 
&quot;publicaci&oacute;n&quot; como Macedonia no se pod&iacute;a permitir el lujo, de no 
comentar un juego que ha significado tanto para el mundo de la estrategia. 
Es por ello que, aunque el an&aacute;lisis va a ser para el Civilization II es, 
tambi&eacute;n un peque&ntilde;o homenaje al primer Civilization el cual, 
incomprensiblemente, nunca vio la luz de nuestro pa&iacute;s salvo, 
y por desgracia, de forma ilegal.
<br>
<br>
El objetivo de este JUEGO (con may&uacute;sculas) es el de tomar el control de 
una de las civilizaciones que se nos ofertan e intentar llevarla o conducirla 
a lo largo de la historia de la humanidad. Permitir un desarrollo cultural, 
econ&oacute;mico y militar del mismo y todo ello, teniendo en cuenta a nuestros 
ciudadanos, los cuales, no dudar&aacute;n en levantarse en protesta si nuestra 
gesti&oacute;n no es todo lo buena que deber&iacute;a. Hay distintos sistemas de 
gobierno y posibilidad de consultar con nuestros ministros y de entablar 
conversaciones con nuestros enemigos o aliados o incluso de espiarlos, traicionarlos, etc.
<br>
<br>
Creo (al igual que muchos jugadores) que jam&aacute;s ha existido un juego 
tan completo en la historia de los juegos de estrategia. Y digo esto porque 
Civilization introdujo, ya con su primera parte, tal cantidad de novedades y 
originalidades que la segunda parte no aspira a ser más que un lavado de cara 
de la primera. Con alguna que otra novedad. Pero no nos enga&ntilde;emos. Esto 
es as&iacute; porque la primera parte es simplemente increiblemente buena y no 
porque los dise&ntilde;adores de esta segunda hayan estado vageando durante todo 
el proyecto del mismo. Esto no es &oacute;bice para que no adquieras esta segunda 
parte si ya ten&iacute;as la primera. ¡Ni se te ocurra pensar eso!. Creo que el 
Civilization II es uno de esos pocos juegos que todo el mundo DEBERIA de 
tener porque con cada nueva partida siempre puedes aprender algo nuevo de &eacute;l, 
porque siempre puedes jugar de un modo distinto, porque te ofrece diferentes 
niveles de dificultad, porque tienes a tu disposici&oacute;n un magn&iacute;fico 
editor, porque es UNA MARAVILLA y es, sencillamente, imprescindible.
<br><br>
<p align=justify>
Despu&eacute;s de tanta alabanza vamos a hablar de lo que es el juego en sí. 
En primer lugar esta segunda parte incluye, respecto al Civilization original, 
unas cuantas y agradecidas novedades. Os comentar&eacute; que el interfaz se ha 
mejorado enormemente as&iacute; como la gesti&oacute;n de unidades y la 
inteligencia artificial (la cual es desquiciante si nos encontramos en el nivel 
m&aacute;s complicado). Por otro lado, se han incluido nuevas unidades, 
descubrimientos (acompa&ntilde;ados todos ellos con sus respectivos vídeos) y 
edificaciones. Tambi&eacute;n la diplomacia ha sido ampliamente redise&ntilde;ada, ya que 
se oferta una gran cantidad de nuevas opciones a la hora de entablar conversaciones
con el resto de las civilizaciones.
<br>
<br>
S&iacute;. Hay novedades. Algunas pesan m&aacute;s que otras en lo que es el aspecto global del producto, pero 
hay novedades, sin embargo, no os dejéis llevar por la emoci&oacute;n y esperéis 
encontraros con un Civilization totalmente redise&ntilde;ado, esto es, con todo "patas arriba" porque eso no ocurre 
en absoluto. Primero porque el Civilization original era ya lo suficientemente 
bueno como para aprovechar lo m&aacute;ximo de &eacute;l y segundo porque pese a
que parezca que existen tantas novedades estamos (gracias a Dios) ante el 
Civilization de toda la vida pero adaptado a los tiempos que corren. Sid Meier puso el listón del 
Civilization original muy alto.
<br>
<br>
<table align="left">
<td><img src="jpg/pciv2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b>En esta ocasión ya podemos manejar a los <br>españoles</b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

Los gr&aacute;ficos son todo lo bueno que deber&iacute;an de ser. Se ha pasado a 
la vista isom&eacute;trica y se han sustituido las "toscas", pero cl&aacute;sicas, 
figuras de antes por unidades perfectamente definidas y vistosas. La m&uacute;sica 
es la misma que la del Civilization original (con alguna que otra novedad), pero 
eso s&iacute;, est&aacute; grabada en formato digital. Los v&iacute;deos 
tamb&iacute;en son muy interesantes. Tanto los que acompa&ntilde;an a cada
maravilla del mundo (que tamb&iacute;en se han visto aumentadas) como las 
dedicadas a los actores que hacen de consejeros o ministros.
<br>
<br>
¿Qu&eacute; decir de la versi&oacute;n espa&ntilde;ola?. Pues lo de siempre. Una 
de cal y otra de arena. Pese a contar con el mismo manual y mapa que 
la versi&oacute;n norteamericana. Pese a contar con una maravillosa 
traducci&oacute;n (en textos. Las voces están en inglés). Pese a contar con todas 
las buenas intenciones de la casa distribuidora, Proein pese a todo eso, siempre 
se puede sacar alg&uacute;n error y es que no se que "narices" hicieron en
el c&oacute;digo, nuestros amigos de Proein, que cuando una civilizaci&oacute;n
enemiga, en la carrera espacial, te gana y llega antes a la Luna, sale la animaci&oacute;n de
cuando ganas t&uacute;, cuando t&uacute;, como acabo de decir, has perdido. Es un fallo que fastidia,
y de forma m&aacute;s que notable, el acabado final del juego. Y que conste que este estrepitoso error no ocurre en la
versión norteamericana.
<BR>Por lo dem&aacute;s nada más que criticar. Se ha invertido mucho esfuerzo 
en traducir todo el maremagnum de texto en ingl&eacute;s y el resultado ha sido notable.
<br>
<br>
Civilization II es el mejor juego de estrategia por turnos, de tem&aacute;tica
gereral, que existe y existir&aacute; durante mucho tiempo en el panorama 
del entretenimiento, sin embargo, pese a que se llame Sid Meier's Civilization II,
 el amigo Sid no ha intervenido como hiciera en el Civilization original (en ese
s&iacute; que llev&oacute; todo el peso del dise&ntilde;o). No me enrrollo más, el Civilization II es un juego imprescindible.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestrab.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

