<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Tecnología = 1 / Diversión.
</FONT>
</H3>

<FONT color="#000000" face="arial" size=2>        
<P ALIGN=JUSTIFY>Me parece genial que la tecnolog&iacute;a deba avanzar, s&iacute;, estoy de acuerdo, jam&aacute;s llegar&iacute;amos

a donde hemos llegado si siempre estuvieramos pensando entorno a lo mismo. Pese a que

mi &eacute;poca inform&aacute;tica favorita hayan sido los 8 bits, creo que ha sido enormemente 

positivo que tocara a su fin, jam&aacute;s se me pasar&iacute;a por la cabeza montones de tareas

comunes realizadas con aquellas m&aacute;quinas, sensacionales m&aacute;quinas.

<br>

<br>

El avance es algo obvio, el desarrollo de nuevos micros, tarjetas aceleradoras, 

tarjetas de sonido, la necesidad de m&aacute;s memoria, todo eso bueno, tarde o temprano

se tiene que imponer de un modo estandar, ahora bien, al final de todo ¿se utiliza

bien?. Me explico, con un juego de &uacute;ltima generaci&oacute;n, que utilice toda

la t&eacute;cnologia disponible, en el contexto dom&eacute;stico, para mostrar increibles gr&aacute;ficos

y sonido por la pantalla y altavoces, ¿realmente no diverte cuando jugamos con &eacute;l? ¿o lo que hacemos

es abrir la boca durante los 10 primeros minutos pensar que es el mejor juego que

hemos comprado durante la hora siguiente y tirarlo al ba&uacute;l de los recuerdos a las

24 horas después?, es decir, toda esta tecnolog&iacute;a 3D y dem&aacute;s historias

que nos venden, ¿hacen m&aacute;s divertidos a los juegos?. Mi opini&oacute;n personal es que, salvo 

muy pocos juegos hasta la fecha, no se consigue un nivel de diversi&oacute;n, ni por asomo,

tan agudo a como se consegu&iacute;a hace unos 3 o 4 a&ntilde;os (y paso de entrar en la &eacute;poca de

los 8 bits). 

<BR>

<BR>

Despu&eacute;s de haber visto hasta la fecha, alrededor de nueve a&ntilde;os de juegos que me han dejado

unos ojos un tanto miopes 8),

he llegado a la conclusi&oacute;n de que hace unos 3 o 4 a&ntilde;os (como m&iacute;nimo), yo jugaba a un juego de ordenador,

disfrutaba de &eacute;l, me met&iacute;a en la historia, vaya ¡me divert&iacute;a!. Eran juegos 2D, ten&iacute;an

la suficiente tecnolog&iacute;a como para que pensaras &quot;vaya, este nuevo interfaz no esta mal&quot;

o &quot;s&iacute;, creo que con esta nueva vista isom&eacute;trica mejoran el resultado&quot; o incluso 

&quot;vaya, que gran suavidad de movimientos&quot;, sin embargo ahora, lo &uacute;nico que puedes

decir de los juegos es &quot;Jode, cuando tenga el pentium #@$%! lo que voy a flipar&quot; y mientras

piensas esto, est&aacute;s moviendote con una especie de Doom a modo de todoterreno 4x4 con

una pegatina encima que pone &quot;3D Game&quot;. 

<br>

<br>

¡Basta!, yo quiero juegos que me divertan y se dejen de tanta historia 3D sin justificar,

puede que un juego la necesite realmente para representar lo que tiene que representar, caso

del Quake o las futuras promesas espa&ntilde;olas como Blade de Rebel Act o Energy de Zeus, pero,

¿por qué aplicar tantas florituras a todos los campos?. Creo que ya no se juega a los juegos,

s&oacute;lo se ven y en muy raras ocasiones se puede pasar un rato aut&eacute;nticamente divertido. Ahora

Sierra nos viene con que va a sacar sus aventuras de King Quest en 3D, nos viene el

Lands of Lore II con 4 CD's que hacen presagiar lo peor, pese a que tenga los mejores

gr&aacute;ficos del mundo, tenemos mil cl&oacute;nicos de juegos tipo Doom y tipo Dune II 

que llenan las p&aacute;ginas, ya de por si cargadas de publicidad, de las revistas de 

inform&aacute;tica, en definitiva, mucha tecnolog&iacute;a, mucho gr&aacute;fico pero nada de juego. 

¿D&oacute;nde estan juegos tan divertidos como un Monkey Island, o un Ultima VII, o 

un Wing Commander I o II, o....?.<br><br>

Yo os digo, que tanto juego de &uacute;ltima generaci&oacute;n,

no est&aacute; haciendo m&aacute;s que ir despertando, poco a poco pero con paso firme, la vuelta

a lo cl&aacute;sico y no tardando habr&aacute; una nueva corriente de casas creadoras de juegos

que vuelvan a basarse en los cl&aacute;sicos de toda la vida para realizar sus &uacute;ltimos

juegos, pensar que los emuladores tipo mame o de los ordenadores de 8 bits, est&aacute;n

llegando a m&aacute;s y m&aacute;s personas y ser&aacute;n estas las que, al no haber vivido aquellas

&eacute;pocas, se den cuenta de que, realmente, lo que quieren se lo est&aacute;n dando gratis

con sus emuladores y entonces todas las casas desarrolladoras pueden que centren

sus flamantes cerebros y piensen un momento en aquella palabra llamada diversi&oacute;n.

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniond.htm"><font FACE="ARIAL"><B>[Opinión Juegos]</B></font></a> <BR>

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>



