<HTML>
<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>a Clínica del Diseñador Gráfico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="caralo@infotel2.com.ar">Carlos Alonso</a>
</b></FONT>
<br><br>


<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Paisajes Naif en Corel Draw
</H3>

<p align=justify>

Habitualmente se asocia a la ilustraci&oacute;n por ordenador –espec&iacute;ficamente en este caso la realizada en Corel Draw, pero es aplicable a otros programas- con im&aacute;genes en que predominan las figuras geom&eacute;tricas o el dibujo de l&iacute;nea, como si estas aplicaciones fuesen incapaces de permitirnos expresiones m&aacute;s libres.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cierto es que las herramientas primitivas nos proporcionan respuestas de estas caracter&iacute;sticas, pero trabajando adecuadamente, es posible romper este condicionamiento.</P>
<P ALIGN="JUSTIFY">Como siempre, la premisa es que la herramienta no condicione el trabajo, para lo cual un buen camino a seguir es &quot;pensar&quot; primero la idea, si es posible bocet&aacute;ndola r&aacute;pidamente, para luego &quot;bajarla&quot; a t&eacute;rminos &quot;herramentales&quot;, es decir decidiendo c&oacute;mo hacerla.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En nuestro ejercicio de hoy vamos a realizar un <B>paisaje &quot;naif&quot;</B> o ingenuos, similar a aquellos en que el Coyote persegu&iacute;a al Correcaminos. Luego de concretado, el mismo se podr&aacute; completar con casitas, nubes, animales, y todo aquello que nuestra fantas&iacute;a y nuestra impresora nos permitan.</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Pues bien, hagamos primero un boceto r&aacute;pido de lo que nos proponemos <B>–fig. 1-</B> marcando los cambios m&aacute;s importantes de perfiles, o sea las colinas m&aacute;s salientes.</P></LI></UL>

<center><table><td><img src="jpg/fig1.jpg"></td><tr><td><center><b><font size=1>Figura 1</b></center></td></table></center>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Dibujamos, con la herramienta <B>RECTANGULO</B>, el marco para nuestro paisaje, y le colocamos el relleno que m&aacute;s nos interese, celeste cielo, una textura nubosa, o un degrade&eacute; de atardecer, aunque &eacute;ste &uacute;ltimo puede confundirse con las colinas. <B>–fig.2-</P></LI></UL>
<center><table><td><img src="jpg/fig2.jpg"></td><tr><td><center><b><font size=1>Figura 2</b></center></td></table></center>
</B><P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Hacemos una copia en el mismo lugar presionando la tecla +, y la comprimimos verticalmente, dejando que coincida el borde inferior con lo ya hecho. <B>–fig.3-</P></LI></UL>
<center><table><td><img src="jpg/fig3.jpg"></td><tr><td><center><b><font size=1>Figura 3</b></center></td></table></center>
</B><P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Para convertir este marco en una colina debemos trabajar con el men&uacute; de nodos, pero antes vamos a  transformar el rect&aacute;ngulo en una curva. Esta acci&oacute;n se halla en el men&uacute; <B>ORGANIZAR</B>. Ahora s&iacute;, con la herramienta de <B>FORMA</B>, agregaremos dos o tres nodos en la parte superior, curvamos los segmentos y le indicamos que los nodos sean <B>SUAVIZADOS</B>, es decir que ambas ramas de la curva tengan igual pendiente. Cuando hacemos esto, trataremos de copiar la parte superior de la primer colina del boceto que hicimos. <B>–fig. 4 y 5-</P></LI></UL>
<center><table><td><img src="jpg/fig4.jpg"></td><tr><td><center><b><font size=1>Figura 4</b></center></td></table></center>
<br>
<center><table><td><img src="jpg/fig5.jpg"></td><tr><td><center><b><font size=1>Figura 5</b></center></td></table></center>
</B><P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>La herramienta que dar&aacute; forma a nuestras colinas es el <B>EFECTO</B>, <B>MEZCLA</B> un men&uacute; que casi no se ha modificado desde la versi&oacute;n 4 de Corel. Lo que acabamos de hacer es la parte posterior o &quot;llegada&quot; de un grupo de mezcla. Para realizar la anterior o &quot;partida&quot; hacemos una copia (+) de la curva y, con la herramienta de <B>FORMA</B> seleccionamos todos los nodos de la parte superior y los bajamos un poco. Lo hacemos de esta manera y no con el cursor para que la curva no se &quot;aplane&quot;. Vamos a modificar la parte superior de esta nueva curva, pero –y esto es muy importante- no debemos modificar la cantidad de nodos, de lo contrario los resultados ser&iacute;an imprevisibles. <B>–fig. 6-</P></LI></UL>
<center><table><td><img src="jpg/fig6.jpg"></td><tr><td><center><b><font size=1>Figura 6</b></center></td></table></center>
</B><P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Una vez tenemos ambas curvas, con sus correspondientes colores, seleccionadas, s&oacute;lo nos falta <B>APLICAR</B> la <B>MEZCLA</B>. Recuerden que el grupo queda vinculado &quot;interactivamente&quot;, por lo que en cualquier momento podemos modificar una o ambas Curvas de Control y el resultado se reflejar&aacute; inmediatamente. <B>-fig.7-</P></LI></UL>
<center><table><td><img src="jpg/fig7.jpg"></td><tr><td><center><b><font size=1>Figura 7</b></center></td></table></center>
</B><P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Para iniciar otras colinas por delante, la recomendaci&oacute;n es no tomar la curva de &quot;partida&quot; del otro grupo, sino hacer una copia (+) de &eacute;ste objeto y reiniciar el proceso<B>. –fig.8-</B> Si no tenemos este cuidado, se forma un grupo llamado Objeto Compuesto de 5 –o m&aacute;s- objetos, bastante dif&iacute;cil de modificar.</P></LI></UL>
<center><table><td><img src="jpg/fig8.jpg"></td><tr><td><center><b><font size=1>Figura 8</b></center></td></table></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Fin de la primera parte. En nuestra pr&oacute;xima entrega, efectos especiales y otras yerbas. Nos resultar&aacute; muy grato recibir vuestras experiencias con &eacute;ste o similares ejercicios, y de paso, aprender algo m&aacute;s. Hasta pronto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">P.D.: ¿Qu&eacute; tal ser publicados? (s&iacute;, es una petici&oacute;n a todos los grafistas y dise&ntilde;adores para que escriban algo. No todo va a ser programar y programar, ¿no? :-)</P></FONT></BODY>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulah.htm"><font FACE="ARIAL"><B>[La Clínica del Diseñador Gráfico]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>




<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
