<HTML>
<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>a Clínica del Diseñador Gráfico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="caralo@infotel2.com.ar">Carlos Alonso</a>
</b></FONT>
<br><br>


<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Las Tipografías (I)
</H3>

<p align=justify>

Esas protagonistas involuntarias e inevitables de nuestros trabajos, desde un simple informe, hasta un cartel destinado a ser visto por miles de personas... Esas ingratas que en pantalla se ve&iacute;an bien y al imprimir... Esas irresponsables que cuando son llamadas por la impresora, sencillamente desaparecen dejando paso a otra colega espantosa, como la Courier o la Avant Garde... Ellas son, ¡S&iacute;! las tipograf&iacute;as, aquellas donde m&aacute;s tiempo tenemos la vista depositada mientras recorremos una pieza gr&aacute;fica, y a quienes no se les da la atenci&oacute;n que merecen, por lo cual se vengan.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta es la primera de una serie de notas destinadas a profundizar en este terreno, en la que abordaremos aspectos t&eacute;cnicos, estil&iacute;sticos, hist&oacute;ricos, bah! hasta donde se pueda sin que nadie se duerma.</P>
<P ALIGN="JUSTIFY">Vayamos a lo m&aacute;s urgente: Las tipograf&iacute;as en la computadora.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Windows se present&oacute; hace ya unos a&ntilde;os en el mercado con una aut&eacute;ntica novedad, que no era tal en el entorno Macintosh, pero que distaba kil&oacute;metros del enigm&aacute;tico D.O.S., con su pantalla negra. Esta novedad es que era <B>WYSIWYG</B> -¿y eso qu’es?- Pues significa &quot;<I>What you see is what you get</I>&quot; o, en cristiano, &quot;Lo que usted ve es lo que obtiene&quot;. Esto que parece obvio ahora, no era completamente cierto en el caso de las tipograf&iacute;as, algo que nosotros acomod&aacute;bamos en pantalla, luego en impresora sal&iacute;a un poquito m&aacute;s ancho o m&aacute;s angosto, lo que en un art&iacute;culo largo significaba que sobraban o faltaban dos o tres renglones. Cada programa de edici&oacute;n ten&iacute;a su propia denominaci&oacute;n de tipograf&iacute;as, y no todas eran completamente compatibles con Windows, lo que es decir que no funcionaban fuera de ese programa. La verdadera estandarizaci&oacute;n vino recientemente con Windows 3.1, luego 3.11, y finalmente con ’95. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La denominaci&oacute;n <B>True Type</B> –algo as&iacute; como <I>Tipo Verdadero</I>-, ya conocida en Mac pero reci&eacute;n difundida como standard por W’95, dio la posibilidad real de que una vez instalada una tipograf&iacute;a, cualquiera fuera el programa del que viniese, estuviera inmediatamente disponible para todos los otros. Lo mismo ocurri&oacute; con las impresoras, ya no era m&aacute;s necesario que las fuentes residieran en la impresora, sino que Windows se encargaba de &quot;descargarlas&quot; en la misma al momento de imprimir. Sin embargo, las filmadoras de calidad, con las que se realizan las pel&iacute;culas que van a la imprenta, necesitaban de mayor calidad en la definici&oacute;n de los perfiles de una determinada letra. M&aacute;s calidad significa m&aacute;s puntos de control para un contorno m&aacute;s preciso, y por tanto, m&aacute;s tiempo al enviar a filmar. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las l&iacute;deres en este mercado eran –y siguen siendo- las tipograf&iacute;as Tipo 1, patentadas por Adobe, las cuales, adivinen... no son WYSIWYG para Windows, es decir no se ven exactamente como se imprimir&aacute;n, con lo que... adi&oacute;s trabajo de calidad. ¿Entonces? Entonces Adobe, teniendo piedad de nosotros produce un <B>Manager</B> –Manejador- de tipograf&iacute;as, con el cual se convierten a la religi&oacute;n del WYSIWYG para todos los dispositivos <B>no-Postscript</B> (que son quienes tienen problemas con ellas). Este programa se llama... <B>Adobe Type Manager</B>, y de &eacute;l y de los dispositivos <B>Postscript</B> nos ocuparemos en la pr&oacute;xima nota. Mientras tanto... utilicen por ahora True Type’s y por favor, no instales fuentes –tipograf&iacute;as- de esas que vienen de a millares en un solo Compact: los invito a respetar el trabajo de los grandes dise&ntilde;adores de tipograf&iacute;as, entre otros <B>Garamond, Jenson, Caslon, Baskerville, Bodoni, Gill</B> -¿han visto alguna vez estos nombres?- que dedicaron mucho tiempo a crear signos que a&uacute;n usamos despu&eacute;s de varios siglos.</P>
<h4>Sobre un futuro artículo que puede interesar...</h4>
<P ALIGN="JUSTIFY">Por un raro accidente de la naturaleza, o mejor dicho de naturaleza desconocida, este cronista de Aula Macedonia fue invitado recientemente a <B>la presentaci&oacute;n que en Argentina realiz&oacute; Adobe</B> de sus nuevos productos, en especial <B>Adobe Photoshop 5</B>. Lamentablemente, tal invitaci&oacute;n coincide pr&aacute;cticamente con el cierre de esta edici&oacute;n por lo que el compromiso es, para la pr&oacute;xima, no s&oacute;lo comentar dicho evento sino que tambi&eacute;n testear el producto. ¿Ser&aacute; posible?. Bueno, tiene que ver con cuestiones de producci&oacute;n, entre ellas el costo del programa, as&iacute; que... haremos lo posible. Mientras tanto, si alguno de los asistentes ha tenido oportunidad de probarlo, agradeceremos sus impresiones, y de hecho las publicaremos.</P>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulah.htm"><font FACE="ARIAL"><B>[La Clínica del Diseñador Gráfico]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
