<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>a Clínica del Diseñador Gráfico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="caralo@infotel2.com.ar">Carlos Alonso</a>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
La grafísima trinidad
</H3>

<p align=justify>

Un interrogante asola a los noveles -y no tanto- dise&ntilde;adores: ¿cu&aacute;les programas necesito? La oferta es permanente, y a la aparici&oacute;n de versiones siempre renovadas de cada utilidad, se suman competidores que prometen "hacer lo mismo que...". ¿Es fundamental estar al tanto de todo? y, si esto es as&iacute;... ¿es posible?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aqu&iacute; viene en nuestra ayuda la estad&iacute;stica, con el teorema de Pareto: El 80% de las cosas que hacemos -en cualquier orden- lo resolveremos aproximadamente con el 20% de las herramientas. Incre&iacute;ble, pero se ha comprobado en los m&aacute;s variados terrenos, hasta en la literatura, aunque &eacute;sa sea materia para otra nota.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nuestro trabajo en la era pre-computadora ayuda en este sentido. En esa &eacute;poca de Letraset y papeles pegados y reparados con t&eacute;mpera blanca, la oferta de herramientas era tambi&eacute;n muy vasta. Sin embargo era mucho mejor tener unas pocas herramientas, eso s&iacute;, en buenas condiciones, y saber usarlas bien, que poseer un tablero de herramientas "de escaparate".</P>
<P ALIGN="JUSTIFY">¿Cu&aacute;les son entonces las herramientas b&aacute;sicas, las indispensables con las que encarar pr&aacute;cticamente todo lo que se nos ponga a tiro? Optamos, en nuestro caso particular, por las tres m&aacute;s cl&aacute;sicas, que han recorrido m&aacute;s largo camino.</P>
<h4>
Una herramienta para dibujar</h4>
<P ALIGN="JUSTIFY">Con la que ilustrar, crear logotipos, poder exportar a todos los formatos, inclusive hacer archivos entendibles para la Mac, y muy intuitiva. <B>Corel DRAW<I> </B></I>es la elecci&oacute;n, ya con una versi&oacute;n para la plataforma de la manzana, y con una pol&iacute;tica comercial inteligente, que, a precios accesibles, pone a nuestra disposici&oacute;n todo un paquete. Cada versi&oacute;n incorpora un ba&uacute;l de novedades -a&uacute;n no hemos probado la 8- pero su interfase amigable, f&aacute;cil de entender, hace que, desde el principio, sea posible explorar obteniendo resultados.</P>
<h4>
Una herramienta para retocar</h4>

<P ALIGN="JUSTIFY">Con la que manejar el esc&aacute;ner, retocar fotograf&iacute;as, crear efectos especiales incre&iacute;bles, hacer tapas de revista muy fuertes, y en general generar im&aacute;genes aceptables para cualquier programa, inclusive de otras plataformas. Con una larga trayectoria en Mac, la versi&oacute;n de PC de <B>Adobe Photoshop </B>es exactamente igual: uno casi no percibe diferencias trabajando en una u otra. Es, quiz&aacute;, el programa menos intuitivo, en el que al explorar nos dar&aacute; la impresi&oacute;n de que poco se puede hacer. Sin embargo es el m&aacute;s profesional de todos, pudiendo con algo de conocimiento -y de equipo- hacer trabajos de pri-me-ra. No olvidar que se usa tambi&eacute;n para realizar trucas de cine.</P>

<h4>Una herramienta para armar</h4>
<P ALIGN="JUSTIFY">Donde manejar bloques de texto con facilidad, corregir, dar estilos, y hospedar toda la gama de im&aacute;genes creada con las dos aplicaciones anteriores. Aqu&iacute; la opini&oacute;n est&aacute; dividida: Si bien por costumbre en Pc lideraba el <B>Adobe Page Maker<I> </B></I>-antes de la casa Aldus- se viene imponiendo cada vez con m&aacute;s fuerza el <B>Quark X'Press</B>, por distintas razones. ¿Qui&eacute;n ganar&aacute;? Creemos que en no mucho tiempo lo sabremos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otras utilidades no vendr&iacute;an mal, pero sus prestaciones ser&aacute;n sin duda m&aacute;s espec&iacute;ficas: Manejo de tipograf&iacute;as, Im&aacute;genes en 3D, texturas, requerir&aacute;n cierta inversi&oacute;n de tiempo de nuestra parte para un resultado siempre parcial, siempre particular. Con lo expresado vuestro estudio tiene mucho, pero mucho por andar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En breve, y de acuerdo a vuestros comentarios, profundizaremos en alguno o todos ellos, y si cuadra, en sus competidores.</P>
<P ALIGN="JUSTIFY">Hasta la pr&oacute;xima.</P></FONT>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulah.htm"><font FACE="ARIAL"><B>[La Clínica del Diseñador Gráfico]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
