<HTML>
<BODY BGCOLOR="#FFFFFF">
<CENTER><IMG src="g_sec/p_juegos.gif"></CENTER>
<BR>
<HR>
<IMG src="g_subsec/decolec.gif">
<HR>

<FONT color="#3399cc" size=2 face="arial" >
<img src="g_misc/69.gif" align=right>
<P align="right">

<B><I>
Art&iacute;culo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez "Kapit".</A>
</I></B>

</p>
<FONT color="#000000">
<br><br><br>
<H3>
The Secret of Monkey Island
</H3>
<p align=justify>
<table align="left">
<td><img src="jpg/pmonk.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><center><b>"The Secret of<br> Monkey Island"</b></center></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
<img src="g_misc/c.gif" align=left><P ALIGN=JUSTIFY>
uando uno menciona un juego llamado <B><I>Monkey Island</B></I>, est&aacute; mencionando un trocito de la mejor historia del software de entretenimiento. Gracias al Monkey island, <B><I>LucasArts</I> </B>se consagr&oacute; como una de las mejores casas del soft del planeta y, gracias al Monkey Island, la aventura gr&aacute;fica se convirti&oacute; en el g&eacute;nero n&uacute;mero 1, puesto que ocupar&iacute;a durante el tiempo suficiente como para poder saborear y disfrutar de aut&eacute;nticas joyas del software de entretenimiento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes del Monkey Island, todos tuvimos ocasi&oacute;n de disfrutar de otros juegos de la, por aquellas fechas, <B>LucasFilm Games</B>, esto es, juegos como <B><I>Indiana Jones y la &Uacute;ltima Cruzada</B></I> o, incluso m&aacute;s antiguos como el <B><I>Maniac Mansion</B> o el <B>Loom</B></I>. Estos juegos, ten&iacute;an ya una calidad m&aacute;s que notable y supon&iacute;an los primeros est&aacute;ndares de lo que era la evoluci&oacute;n de la aventura (sin contar los productos Sierra, por supuesto) o, al menos, de lo que en Europa entend&iacute;amos por aventura (y ahora mismo pienso, c&oacute;mo no, en las aventuras conversacionales).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es innegable que todas estas aventuras ten&iacute;an estupendas caracter&iacute;sticas pero, qu&eacute; quer&eacute;is que os diga, les faltaba ese peque&ntilde;o &quot;detalle&quot; para encumbrar el g&eacute;nero hasta la cima, para &quot;educar&quot; definitivamente al jugador Europeo. Sin embargo, un d&iacute;a nos lleg&oacute; un juego que pon&iacute;a en la portada que hab&iacute;a sido dise&ntilde;ado por un tal <B>Ron Gilbert</B> y, que despu&eacute;s de cargarlo y jugarlo durante 15 minutos, supuso como volver a nacer, c&oacute;mo descubrir por primera vez los juegos de ordenador, en definitiva, supuso el descubrimiento y a lo grande de un g&eacute;nero que promet&iacute;a ser el m&aacute;s jugado durante muchos a&ntilde;os.</P>
<P ALIGN="JUSTIFY"></P>
<H4>Redescubriendo el g&eacute;nero de la aventura
</H4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Recuerdo que la primera vez que vi anunciado el juego en una revista nacional, me llam&oacute; la atenci&oacute;n. Debo de reconocer que por, aquellas fechas era muy proclive a hacer caso a las puntuaciones, a los comentarios de las revistas y, como me estaba a&uacute;n descubriendo el mundo del PC, pues no me quedaba m&aacute;s remedio. </P>
<P ALIGN="JUSTIFY"></P>
<center>
<table>
<td><img src="jpg/cmonk1.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><center><b>La pantalla de inicio</b></center></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
<P ALIGN="JUSTIFY">Antes del Monkey, ya hab&iacute;a oido hablar del <I>Indiana Jones y la &Uacute;ltima Cruzada</I> (incluso recuerdo c&oacute;mo un antiguo y buen amigo m&iacute;o dijo una vez que vio dicho programa comentado en una revista &quot;vaya, yo s&oacute;lo me comprar&iacute;a un ordenador para jugar con ese juego&quot;), sin embargo, pese a que estuve &quot;tentado&quot; a&uacute;n me resist&iacute;a a salir de los juegos con los que hab&iacute;a crecido en Spectrum, casi que me negaba a descubrir nuevas formas de divertirme. Adem&aacute;s, dichos programas se alejaban de todo lo que yo sab&iacute;a sobre juegos de aventuras, ¿qu&eacute; era eso de utilizar un rat&oacute;n para dirigir al personaje?, ¿y eso de que tuvieras que utilizar verbos para realizar tus acciones? ¿y eso de...?. Ya veis, un completo miedoso.... Sin embargo, no se que ocurri&oacute; que, un buen s&aacute;bado por la ma&ntilde;ana me dio &quot;la venada&quot; y, junto al escaso dinero que yo y mi hermano ten&iacute;amos nos decidimos acudir a la tienda a la que habitualmente sol&iacute;amos acudir para hacernos con ese juego de caja verde y que &quot;emanaba&quot; una atracci&oacute;n tan irresistible....¿a ver c&oacute;mo se juega a un programa controlado por el rat&oacute;n?, pensamos...</P>
<P ALIGN="JUSTIFY"></P>
<H4>Esos primeros 15 minutos del Monkey....
</H4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los primeros 15 minutos a los que jugu&eacute; al &quot;Monkey&quot; yo los podr&iacute;a casi, equiparar a los primeros 15 minutos en los que disfrute con mi primer juego en Spectrum. Primero conociendo a el personaje y despu&eacute;s volviendo a saborear un g&eacute;nero, la aventura, que yo tan s&oacute;lo conoc&iacute;a por medio de las memorables de Aventuras AD. Y es que, quiz&aacute;s &quot;hice mal&quot; descubriendo este g&eacute;nero con el Monkey Island ya que, despu&eacute;s todo lo comparaba con esta joya del soft y claro, los juegos de aventura a los que posteriormente jugu&eacute;, salvo casi todos los de Lucas (y alguno de Sierra), me parec&iacute;an &quot;irrisorios&quot; comparados con mi querido Monkey.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C&oacute;mo os dec&iacute;a un poco m&aacute;s arriba, los primeros 15 minutos me bastaron para &quot;penetrar&quot; en esta nueva forma de jugar y es que, la personalidad de nuestro querido <B>Guybrush Threepwood</B>, era tan sumamente grande que, no es que te identificaras con &eacute;l sino que te sent&iacute;as como su compa&ntilde;ero de fatigas a lo largo de lo que duraba la aventura. Aqu&iacute; es donde yo querr&iacute;a recalcar el fuerte de este juego pues, el Monkey Island no era un juego en el que t&uacute; te encarnaras en un personaje, o al menos, no era lo que yo creo que Ron Gilbert (su principal dise&ntilde;ador y programador) quiso transmitir al jugador sino que, por el contrario, uno se sent&iacute;a m&aacute;s como el &quot;colega&quot; con el que, nuestro protagonista, Guybrush deb&iacute;a de llevar a cabo su irrepetible aventura. Tan s&oacute;lo hay que recordad los inolvidables gestos &quot;a la c&aacute;mara&quot;, los comentarios ir&oacute;nicos, en definitiva, la complicidad que exist&iacute;a entre el jugador y el personaje: algo &uacute;nico.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/cmonk2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><center><b>¿Os acordáis de la <br>primera vez en el bar...?</b></center></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>A mi, jam&aacute;s se me olvidar&aacute; la atm&oacute;sfera con la que este juego se &quot;alimentaba&quot;. ¿Qui&eacute;n no se acuerda de la &quot;paranoica&quot; primera secuencia que hay en el <B>SCUMM</B> BAR?, cuando tienes que hablar con los tres jefes piratas y te empiezas a meter en el juego (eso sin contar con las divertid&iacute;simas y disparatadas conversaciones que pod&iacute;a mantener con el resto de personajes que se encontraban el bar... ¿os acord&aacute;is del perro? ;) ). No se, quiz&aacute;s es algo especial haber comenzado a descubrir las aventuras gr&aacute;ficas con este juego pero, chicos, creo que las casi 8000 pts que mi hermano y yo pagamos por la versi&oacute;n EGA (s&iacute;, 16 magn&iacute;ficos colores) son una de las mejores inversiones que hemos realizado.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Una historia incopiable
</H4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, y despu&eacute;s de toda estos &quot;recuerdos&quot; ¿de qu&eacute; iba el juego?. Pues, bien, en el juego deb&iacute;as de &quot;conducir&quot; las peripecias de Guybrush Threepwood, un joven aprendiz de pirata. Para ello, comenzabas teniendo que realizar tres inolvidables pruebas que eran robar en la casa de la gobernadora, de Mel&eacute; Island (lugar en d&oacute;nde comienzas t&uacute; aventura). vencer a la &quot;terrible&quot; (s&iacute;, s&iacute;, era una mujer) <B>Sword Master</B>, (a base de una de las situaciones m&aacute;s memorables de la historia del videojuego: &quot;batalla de insultos&quot;) y, c&oacute;mo no, encontrar un tesoro. Todo ello adornado con magn&iacute;ficos di&aacute;logos, situaciones c&oacute;micas y disparatadas, inolvidables personajes y, montones de situaciones que pertenecen, (como dec&iacute;a nuestro buen amigo <I>Ra&uacute;l &Aacute;lvarez</I> en un art&iacute;culo realizado a propósito de
este juego en el fanzine <I><A HREF="http://www.geocities.com/TimesSquare/Dungeon/2687" target"_new">Spanish Quest</a></I>), ya a la historia de los videojuegos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No hace falta decir que esto s&oacute;lo era el comienzo de tu misi&oacute;n pues, justo cuando te... enamoras de la gobernadora (por cierto, ¿os acord&aacute;is de la escena en la que te enamoras...?, ¡sencillamente irrepetible!), uno de los malos m&aacute;s &quot;famosos&quot; y curiosos del mundo del videojuego, el pirata fantasma &quot;<B>Le Chuck</B>&quot;, hace acto de presencia y secuestra a tu &quot;amor plat&oacute;nico&quot; .</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como no pod&iacute;a ser de otro modo, deber&aacute;s de ir a buscarla y para ello tenias que hacerte, con un barco y eso significaba ir a &quot;negociar&quot; con otro de los grandes personajes de la historia de los videojuegos: <B>Stan</B>, el inolvidable e incorregible vendedor de la saga Monkey capaz de hacerte soltar las m&aacute;s grandes carcajadas, reclutar, despu&eacute;s a una tripulaci&oacute;n (y ya pod&eacute;is imaginaros...) y, c&oacute;mo no, encontrar la forma de llegar a la misteriosa isla de los monos, a Monkey Island, &quot;residencia&quot; de LeChuck.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El resto del juego, no es que no pueda contarlo es que no quiero hacerlo (bastantes cosas he dicho ya para la gente que a&uacute;n vive sin haber jugado a este juego). Son tantas y tantas las situaciones que hay en el coraz&oacute;n de la, muy probablemente, mejor aventura jam&aacute;s creada que a uno le da rabia no poder llenar Macedonia de comentarios de este juego. Pero, espero que me comprend&aacute;is, debo de ir acabando si no quer&eacute;is tener una gran cuenta de telef&oacute;nica el pr&oacute;ximo mes ;-) (y lo digo en serio, pues mucha gente que lee Macedonia se queja de eso, de que nuestros art&iacute;culos son muy largos... )</P>
<P ALIGN="JUSTIFY"></P>
<H4>En definitiva, algo &uacute;nico
</H4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Monkey Island, supuso la consagraci&oacute;n de una casa, Lucas Film Games y de un g&eacute;nero, la aventura gr&aacute;fica, dispuesto a ser explotado por las grandes productoras de software. Despu&eacute;s del Monkey vendr&iacute;a el <B><I>Monkey Island 2, &quot;LeChuk Revenge&quot;</B></I>, un juego que tambi&eacute;n era una aut&eacute;ntica maravilla y una joya, al igual que el anterior, del g&eacute;nero. En este punto hay montones y montones de opiniones divididas en cuanto a qu&eacute; fue mejor si la primera y original aventura de nuestro querido Guybrush o la segunda parte, una de las mejores segundas partes que jam&aacute;s se han creado en esta industria del software.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pol&eacute;micas a parte, el padre de la saga, Ron Gilbert, dej&oacute; la casa con la segunda parte y, aunque hace relativamente poco tiempo que sali&oacute; la tercera, (despu&eacute;s de una larg&iacute;sima e intensiva oleada de peticiones por parte de los fans incondicionales de la saga), jam&aacute;s, o al menos eso creo yo, volver&aacute; a ser lo mismo sin Ron....</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Monkey Island es uno de los mejores juegos de todos los tiempos. Cualquier jugador de este planeta con un m&iacute;nimo sentido com&uacute;n deber&iacute;a de tenerlo o, al menos, haberlo jugado. En caso contrario y a mi entender, est&aacute; cometiendo una aut&eacute;ntica calamidad... Si yo tuviera que quedarme con la mejor aventura gr&aacute;fica de todos los tiempos, muy probablemente pondr&iacute;a al Monkey Island en la cima. Muy pocos juegos, desde luego, pueden hacer &quot;sombra&quot; a esta obra de arte de Ron Gilbert. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si quieres saber a&uacute;n m&aacute;s de todo lo que rodeo al Monkey Island y a su dise&ntilde;ador, s&oacute;lo tienes que echar un vistazo al enorme art&iacute;culo - homenaje que se hizo en el n&uacute;mero 2 de Macedonia a <B><A HREF="ron.htm">Ron Gilbert</A>, su creador</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡<I>Detr&aacute;s de ti, un mono de tres cabezas! :o)</P>
</I></FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P></FONT>
</p>
<hr>
<FONT color="#000000" size=1 face="arial">
<P ALIGN=right>
<img src="g_misc/loglow.gif">
<P ALIGN=left>
<A HREF="index04.htm"><I>¡De vuelta a la Zona de Juegos!</I></A>
<br>
<br>
<center>
<a href="http://www.ciudadfutura.com" target="_new"><img src="g_misc/logocf.gif" border=0 ></a> 
</center>
</HTML>

