<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>ítulos de Coleccionista</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial"><br><br><br><br>
<H3>
La trilogía Eye of the Beholder
</H3>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>

Todos los aficionados a los juegos de rol tuvimos que esperar mucho 
tiempo hasta que <B>SSI</B> decidiera jubilar su viejo sistema y ofrecer, así, 
t&iacute;tulos acordes a los tiempos que corr&iacute;an por aquella primera mitad
de los años noventa. T&iacute;tulos, por cierto, 
que se nutr&iacute;an de la licencia de la <B>TSR</B>, 
o lo que es lo mismo, del famosos sistema <B>AD&amp;D</B>. 
Pero mereci&oacute; la pena pues, entre otras cosas, pudimos conocer a la que es, actualmente, una de las mejores casas del planeta: <B>Westwood Studios</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quiz&aacute;s esta peque&ntilde;a introducci&oacute;n sea demasiado solemne pero, es cierto, SSI, que inicialmente explot&oacute; la licencia de la TSR mediante producciones bastante &quot;oscuras&quot; para el p&uacute;blico masivo, tard&oacute; en reaccionar y utilizar todos los detalles que el <B>Dungeon Master</B>, el abuelo de los juegos de rol, hab&iacute;a convertido en est&aacute;ndar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La triolog&iacute;a de los <B>Eye of the Beholder</B> constituye, probablemente, la mejor muestra de rol que SSI produjo durante el tiempo que tuvo la citada licencia de la TSR entre sus manos (recientemente la poseedora de tal aval es <B>Interplay</B>). Estos juegos, que transcurr&iacute;an en el universo de <B>Forgotten Realms</B> (Reinos Olvidados), sirvieron para que muchos usuarios se introdujeran en el mundo de los juegos de rol.</P>

<center><table><td><img src="jpg/eye1.jpg" ></td></table></center>

<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
<P ALIGN="JUSTIFY"></P>
<h4>Pero pong&aacute;monos en antecedentes.</h4>
<P ALIGN="JUSTIFY">El primero de los juegos de los Eye of the Beholder 
se perfil&oacute; como el primer juego &quot;serio&quot; realizado por 
el peque&ntilde;o grupo de programaci&oacute;n que era entonces Westwood 
con <B>Brett Sperry</B> a la cabeza. Pese a ser el primer programa que hacían 
para una casa realmente 
grande, como SSI, result&oacute; ser uno de los mejores juegos de rol 
de todos los tiempos. No s&oacute;lo en el aspecto de plantar cara a series tan consagradas como las <B>Ultimas, Wizardry </B>o<B> Might and Magic,</B> sino en el de ir preparando un hueco en el pedestal ocupado por obras maestras como los Dungeon Master o <B>Bard’s Tale</B>, por poner ejemplos de los m&aacute;s cl&aacute;sicos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los tres programas de la serie Eye of the Beholder se 
caracterizaban por seguir la norma que impusiera, a finales de los 80, el 
Dungeon Master, esto es, perspectiva en primera persona, sistemas m&aacute;gicos 
no excesivamente complejos y combates en tiempo real con la posibilidad de huida.
 Fue una forma estupenda de acercar el rol al gran p&uacute;blico ya que, los 
 programas que hab&iacute;a de SSI hasta la fecha, se caracterizaban por exprimir
  al m&aacute;ximo los combates estad&iacute;sticos dejando en situaciones
   precarias temas tan importantes como el desarrollo general de la aventura, 
   es decir, los primeros juegos de SSI bajo la licencia TSR no desarrollaban
    el car&aacute;cter creativo de sus dise&ntilde;adores ya que 
	estos se limitaban a &quot;volcar&quot; todo el conglomerado de reglas 
	del sistema AD&amp;D en el juego. Sin ninguna caracter&iacute;stica que de verdad supusiera un nuevo reto para los usuarios de los famosos juegos de mesa.</P>
<P ALIGN="JUSTIFY"></P>

<table align="right"><td><img src="jpg/eye2.jpg" ></td><tr><td><B><FONT size=1><p align="right">Portada del Eye of the Beholder I</B></td></table>

<P ALIGN="JUSTIFY">Cabe a&ntilde;adir, para los que anden un poco perdidos en lo referente al g&eacute;nero de los juegos de rol de ordenador, que estos siempre se han podido dividir, en el pasado, en dos &quot;escuelas&quot; distintas. La primera era la de los juegos que se basaron en largos y complejos sistemas de combates inundando la pantalla del jugador de montones de datos estad&iacute;sticos con el &uacute;nico objetivo de reproducir fielmente las reglas de combate de sus hom&oacute;nimos, los juegos de rol de mesa. Luego estaban los de la escuela del juego de la casa <B>FTL</B>, esto es, el Dungeon Master. Este programa fue el primero en utilizar la perspectiva en primera persona, es decir, la que hace que veamos lo que se supone que nuestro (o nuestros) personajes ven. </P>
<P ALIGN="JUSTIFY">Otra de las novedades que incluir&iacute;a el Dungeon Master ser&iacute;an los sistemas m&aacute;gicos sencillos y, sobre todo, visuales adem&aacute;s de los combates en tiempo real cosa que, hasta la fecha, se realizaban a base de &oacute;rdenes que el ordenador ejecutaba por turnos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">SSI, la casa productora (los que lo programaron fueron los chicos de  Westwood), ten&iacute;a desde hac&iacute;a bastante tiempo los derechos para producir los juegos basados en el universo de la <B>Dragons Lance</B> y todos sus t&iacute;tulos, hasta el primer Eye of the Beholder, pertenec&iacute;an a la primera escuela con lo que exclu&iacute;an a un n&uacute;mero muy grande de jugadores, no rentabilizaban el dinero que pod&iacute;an obtener con la licencia y, para colmo, casas como <B>New World Computing</B> o Interplay<B> </B>se estaban llevando &quot;el gato al agua&quot; con la perspectiva del cl&aacute;sico Dungeon Master. Si os preguntabais qu&eacute; narices estaba haciendo <B>Origin</B> (la de los Ultima) por entonces, os dir&eacute; que, a parte de preparar la s&eacute;ptima entrega (hablo del periodo que va desde el primer Eye of the Beholder al &uacute;ltimo) estaban haciendo uno de los primeros juegos en entornos 3D reales, el <B>Ultima Undeworld</B>. Pero eso es otra historia...</P>
<P ALIGN="JUSTIFY"></P>
<h4>El mejor, sin duda, el Eye of the Beholder II</h4>
</FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El primer Eye of the Beholder, como he citado, supuso el salto de SSI, de la mano de Westwood, al gran p&uacute;blico pero, cuando de verdad lleg&oacute; la consagraci&oacute;n, fue con su segunda parte: <B>Eye of the Beholder II, The Legend of Darkmoon</B>. Un juego que encandilaba, que derrochaba personalidad en su creaci&oacute;n, que ten&iacute;a las m&aacute;s bellas im&aacute;genes est&aacute;ticas, que luc&iacute;a uno de los mejores desarrollos lineales jam&aacute;s realizados que, en definitiva, se convirti&oacute; en el mejor de su trilog&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El desarrollo del segundo Eye of the Beholder no inclu&iacute;a novedades sustanciales con respecto al anterior, realmente el salto fue un tanto proporcional y bien medido, es decir, se crearon mejores gr&aacute;ficos, dise&ntilde;os m&aacute;s cuidados y se enriquecieron temas como los di&aacute;logos, enigmas y desarrollo en general.</P>
<P ALIGN="JUSTIFY"></P>
<table align="left"><td><img src="jpg/eye3.jpg" ></td><tr><td><B><FONT size=1><p align="left">Captura del Eye of the Beholder II</B></td></table>
<P ALIGN="JUSTIFY">Si en el primer Eye of The Beholder deb&iacute;amos de bajar &quot;a ver que pasaba&quot; en las alcantarillas de la famosa ciudad de <B>Waterdeep</B>, en el segundo nos traslad&aacute;bamos a Darkmoon, m&aacute;s concretamente al templo de Darkmoon, en el cual se hab&iacute;an estado sucediendo desapariciones y extra&ntilde;os rumores entorno a posibles asesinatos protagonizados por los habitantes del templo. </P>
<P ALIGN="JUSTIFY">No me cansar&eacute; de repetir que esta segunda parte de la triolog&iacute;a de SSI posee el mejor desarrollo lineal que se ha creado nunca en un juego de este tipo ya que, pese a que la libertad en el desarrollo argumental estaba prefijada (como realmente ocurre en todos los juegos), los dise&ntilde;adores de Westwood supieron hacerlo de una forma en la que el jugador no se sintiera en ning&uacute;n momento presionado o conducido a trav&eacute;s de la aventura. Creedme que realizar algo as&iacute;, sin pecar de convertir al juego en algo totalmente previsible, es muy complicado y m&aacute;s en juegos de este tipo en los que es tan vital crear una atm&oacute;sfera que realmente te menta en el universo que los dise&ntilde;adores han creado. El Eye of the  Beholder II, m&aacute;s que ning&uacute;n otro de la factor&iacute;a SSI, lo consegu&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La tercera de las partes que vendr&iacute;a despu&eacute;s, esto es, <B>Eye of the Beholder III, Assault on Myth Drannor</B>, fue una total decepci&oacute;n y una forma desastrosa de poner punto final a la serie. El motivo de tal descalabro se encontraba en que la casa que produjo esta parte ya no era Westwood. Esta hab&iacute;a decidido no renovar el contrato con SSI y seguir su camino de la mano de <B>Virgin</B>, como ha hecho hasta ahora. La tercera parte, no aport&oacute; nada al g&eacute;nero al contrario que las dos primeras. Pose&iacute;a, adem&aacute;s, un desarrollo excesivamente mon&oacute;tono sin ning&uacute;n tipo de aliciente ni a nivel argumental ni a nivel de enigmas que resolver. Un fracaso.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">En definitiva</h4>
</FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">A cualquier jugador de rol que se le nombra esta trilog&iacute;a no duda un instante de regalar sonoras alabanzas pues fue una de las que hizo que el g&eacute;nero alcanzara su punto medio, su &quot;hemos puesto el list&oacute;n demasiado alto&quot;. La primera parte fue juego muy adictivo y que, sin quererlo, encandil&oacute; a toda la prensa especializada. Para la segunda todo el mundo esper&aacute;bamos m&aacute;s de lo mismo y nos llevamos una muy grata sorpresa porque el juego era realmente profundo. Un cl&aacute;sico. De la tercera mejor no hablar...</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgc.htm"><font FACE="ARIAL"><B>[Títulos de Coleccionista]</B></font></a> <br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

