<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>ítulos de Coleccionista</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial"><br><br><br><br>

<H3>

Dark Sun

</H3>

<FONT color="#000000" size=2 face=arial>

<P ALIGN=JUSTIFY>

<img src="jpg/dks1.jpg" align="left"><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Este gran juego de rol (que se caracteriz&oacute; por ser el primero en inspirarse en el sistema de desarrollo del <B>Ultima</B> <B>VII</B>) fue lanzado all&aacute; por el a&ntilde;o 1993. A&ntilde;o en el que los juegos de rol comenzaban su etapa m&aacute;s "oscura". Como en todos los t&iacute;tulos de <B>SSI</B>, Dark Sun, se nutr&iacute;a de la licencia que &eacute;sta casa ten&iacute;a con <B>TSR</B>, es decir, estaba basado en una novela del mismo t&iacute;tulo (realmente, la serie Dark Sun recoge un total de 5 novelas del autor <B>Troy</B> <B>Denning</B>). Desgraciadamente, pese a que el juego se basaba en ese notable primer libro, tomaba pocos aspectos del mismo y, salvo lo que es la primera parte del desarrollo (muy interesante, absorbente y trepidante), lo dem&aacute;s result&oacute; hecho sin demasiadas pretensiones. Para alargar el producto innecesariamente.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Un alumno aventajado.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Aunque parezca extra&ntilde;o, despu&eacute;s del lanzamiento de uno de los juegos de rol para ordenador por excelencia, esto es, el Ultima VII, muy pocos t&iacute;tulos utilizaron la misma perspectiva o desarrollo. Con el Ultima VII, se dejaron atr&aacute;s las complejas tablas estad&iacute;sticas para dar paso a un juego muy pr&oacute;ximo a la aventura. Hab&iacute;a una historia en la que primaba la conversaci&oacute;n y el di&aacute;logo con los <B>NPC's</B> antes que el combate para ir avanzando. El Dark Sun supo tomar el concepto UVII muy bien, llevando a la pr&aacute;ctica gran parte de las "reglas" de ese nuevo camino. Sin embargo, en el Dark Sun, brillaba por encima de todo la existencia de un universo bien medido, es decir, el juego no ca&iacute;a en el error de ofrecer al usuario un mapeado sencillo, sin inter&eacute;s y supeditado por completo a la misi&oacute;n a realizar. Por el contrario, nos encontr&aacute;bamos con &quot;mini-quest&quot; escasos, pero muy bien medidos. Mucho mejor medidos que los que aparecieron en la s&eacute;ptima parte del juego de <B>Richard</B> <B>Garriot</B>. El Dark Sun no ofrec&iacute;a al jugador un universo "infinito", de enormes proporciones o pesado en el desarrollo. Es ah&iacute; donde correg&iacute;a, si se me permite la expresi&oacute;n, al t&iacute;tulo de Garriot.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Combates y conversaciones</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Como se ha dejado claro ya, el Dark Sun pertenece a la "escuela" creada por el Ultima VII. Esto le infiere un desarrollo supeditado a una historia poco definida en los comienzos, pero que se complica a medida que vamos avanzando. En los juegos de rol, es muy dif&iacute;cil contentar a todo tipo de seguidores. Hay a quienes s&oacute;lo les interesa manejar a una cuadrilla de personajes en lo que lo m&aacute;s importante es la barra o los n&uacute;meros indicativos de su experiencia, la calidad de las armas que manejan y poco m&aacute;s. Dales una mazmorra y ser&aacute;n felices. Otros, por el contrario, se prestan m&aacute;s a tomar aspectos del mundo de las aventuras, estableciendo una l&iacute;nea muy clara entre lo que debe de ser el porcentaje del combate y el porcentaje de comunicaci&oacute;n en el juego. Este juego ca&iacute;a en este segundo grupo, al menos, en la primera parte de su desarrollo. </P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">A diferencia del sistema utilizado en el Ultima VII, el Dark Sun funcionaba con un sistema de conversaci&oacute;n basado en la utilizaci&oacute;n de frases "ya hechas". Algo id&eacute;ntico a las primeras aventuras gr&aacute;ficas creadas por LucasArts. Esto daba una mayor claridad al desarrollo pues el sistema basado en "temas de conversaci&oacute;n" que utilizaba el Ultima VII llegaba a ser un poco confuso. Las conversaciones, pese a configurar una parte esencial del juego, tampoco lo acaparaban de forma abusiva, es decir, estaban bien localizadas y no eran exageradamente extensas.</P>

<P ALIGN="JUSTIFY"></P>
<center><img src="jpg/dks3.jpg"></center>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">SSI ha sido la reina de los CRPG's basados en el combate estad&iacute;stico y de complejos sistemas de magia (al fin y al cabo, para algo ten&iacute;an la licencia de TSR). El Dark Sun luc&iacute;a, como era de esperar, un sistema de combate por turnos y fuertemente ligado a la tabla del personaje que manej&aacute;bamos (aprovecho para comentar que ten&iacute;amos la posibilidad de crearnos a los cuatro personajes protagonistas antes de comenzar la partida). El combate, todo hay que decirlo, resultaba a veces un poco "insufrible" pues en muchas ocasiones nos deb&iacute;amos de enfrentar con una cantidad ingente de enemigos no muy poderosos que convert&iacute;an al mismo en un larg&iacute;simo proceso. Se echaba en falta un sistema similar al utilizado en el UVII, es decir, un sistema en el que los combates fueran a tiempo real y las estrategias a seguir por cada personaje se definieran antes del mismo.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">El desarrollo</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El Dark Sun era un juego muy divertido. Trataba bien al jugador. No podemos afirmar que fuera apasionante al 100% porque, dada su linealidad, era muy f&aacute;cil adivinar qu&eacute; era lo que iba a ocurrir a continuaci&oacute;n. Desgraciadamente, si hab&iacute;as le&iacute;do las novelas, el juego te defraudaba m&aacute;s de la cuenta. Un servidor tuvo la oportunidad de leerlas despu&eacute;s de haber jugado. Hay que confesar que los libros fueron muy mal aprovechados por el juego pues, pese a prestarse estupendamente para ello, no fueron exprimidos ni por asomo en el desarrollo del producto. Con lo que ya os pod&eacute;is imaginar la maravilla que se pod&iacute;a haber creado si se hubiera puesto m&aacute;s empe&ntilde;o (o si el dise&ntilde;ador hubiera le&iacute;do los libros). </P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">El Dark Sun ten&iacute;a alguna que otra "sorpresa" argumental que no te esperabas, sin llegar a producir un desconcierto total al jugador (no creaba un universo tan grande y absorvente como el de su principal competidor), sin embargo, la primera mitad del desarrollo consegu&iacute;a meter al usuario de lleno en la historia, no le pon&iacute;a muchas trabas para avanzar y hac&iacute;a que se fuera identificando con la situaci&oacute;n de los protagonistas f&aacute;cilmente. </P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Un hecho muy interesante era que el juego daba la misma oportunidad al uso de la violencia que al de la conversaci&oacute;n para resolver los problemas. S&iacute;, resultaba interesante ver c&oacute;mo pod&iacute;amos ingeni&aacute;rnoslas para sobornar, convencer o intimidar a los NPC's del universo Dark Sun o bien, c&oacute;mo pod&iacute;amos armarla "gorda" enfrent&aacute;ndonos a toda una ristra de guardianes. Incluso, se nos daba la oportunidad de ponernos de un bando u otro, de ser unos protagonistas verdaderamente neutrales. Los dos primeros "episodios" del juego (La huida del circo de gladiadores y las alcantarillas), son una clara muestra de la utilizaci&oacute;n espl&eacute;ndida de estos factores. Eran las dos mejores situaciones del juego. Despu&eacute;s la calidad del desarrollo  descend&iacute;a peligrosamente.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">En conclusi&oacute;n.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El Dark Sun fue un gran juego que supo tomar la idea b&aacute;sica que hab&iacute;a desarrollado el Ultima VII para modelarla a su gusto. Introdujo ideas interesantes en el desarrollo de los juegos de rol - aventura, como es el hecho de imponer sistemas de conversaci&oacute;n id&eacute;nticos a los de las aventuras gr&aacute;ficas, ofrecer desarrollos lineales, pero muy bien encarrilados y, sobre todo, mostrar c&oacute;mo crear universos en los que el jugador no se sintiera perdido o incapaz de abarcar la situaci&oacute;n. </P>

<P ALIGN="JUSTIFY">El principal "pero" del juego se encuentra en su segunda mitad pues &eacute;sta, no fue tan cuidada como la primera y enseguida se notaba tal cadencia. Si en la primera parte de la historia el juego resulta ser absorbente, en la segunda nos vamos a encontrar ciertamente confusos, sin saber muy bien qu&eacute; es lo que hay que hacer o "por qu&eacute; pasa esto". Ah&iacute; los dise&ntilde;adores cayeron estrepitosamente en el error de alargarlo innecesariamente.</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="jpg/dks2.jpg"></center>
<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Despu&eacute;s de esta primera parte del Dark Sun, se edit&oacute; otra m&aacute;s bajo el t&iacute;tulo de "<B>Dark</B> <B>Sun</B> <B>II</B>; <B>La Legi&oacute;n Roja</B>" que se inspiraba en la segunda de las novelas de la serie literaria del universo. No tuve la suerte de jugar a fondo al mismo pero, este segundo t&iacute;tulo, s&iacute; que perd&iacute;a gran parte del encanto del anterior al dejar al jugador muy suelto por escenarios de elevada dificultad (no olvidemos que estos juegos tan amplios, siempre cortan los pasos iniciales del usuario. El Ultima VII nos ofrec&iacute;a una ciudad, Trinsic, en la que antes hab&iacute;a que hallar las pistas de un asesinato. El Dark Sun I, nos propon&iacute;a idear un plan de huida de las celdas en las que nos aloj&aacute;bamos como gladiadores. En definitiva, siempre est&aacute;bamos "controlados" por el dise&ntilde;o para no estar perdidos a las primeras de cambio), siendo complicado establecer los primeros l&iacute;mites de la zona en la que nos encontr&aacute;bamos.</P>

<P ALIGN="JUSTIFY">Ni el Dark Sun I ni el II, lograron tener un &eacute;xito reconocido. Buena parte de la culpa la tuvo la situaci&oacute;n del mercado de los juegos de rol de por aquellas fechas, pero tambi&eacute;n es cierto que no se les dedic&oacute; la atenci&oacute;n merecida, ni por la empresa distribuidora, ni por las revistas del sector. Una l&aacute;stima porque, al menos la primera parte, guardaba muchas joyas en su interior. Es, al fin y al cabo, un gran cl&aacute;sico desconocido de los juegos de rol.</P></FONT><br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>

<A HREF="rpgc.htm"><font FACE="ARIAL"><B>[Títulos de Coleccionista]</B></font></a> <br>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



