<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>ítulos de Coleccionista</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>
<br><br>

<FONT color="#000000" face="arial">


<H3>
Wing Commander.
</H3>
<p align=justify>
<table align="left">
<td><img src="jpg/wc1.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><center><b>"Wing Commander"</b></center></td>
</table>

<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>
<P ALIGN=JUSTIFY>
Hasta que el primer &quot;<B>Wing</B> <B>Commander</B>&quot; no sali&oacute; a la calle, los &uacute;nicos juegos que pod&iacute;an considerarse capaces de construir universos ricos, tanto en personajes como en historias, eran los de aventura primero y los de rol despu&eacute;s. El &quot;Wing Commander&quot; fue una aut&eacute;ntica maravilla. Fue uno de los primeros juegos que realmente ret&oacute; a la tecnolog&iacute;a y la llev&oacute; hasta sus l&iacute;mites, desencadenando la primera &quot;escapada&quot; del pelot&oacute;n de juegos que se hac&iacute;an pensando en el usuario medio, no en el que reclamaba lo &uacute;ltimo de lo &uacute;ltimo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien es cierto que lo anteriormente descrito no ser&iacute;a llevado hasta sus &uacute;ltimas consecuencias hasta la aparici&oacute;n de la segunda parte pero... el primer juego de la saga era una experiencia &uacute;nica, es decir, era de esos juegos que cuando lo ves, lo juegas y lo disfrutas est&aacute;s convencido de que, por mucha segunda parte, t&uacute; jam&aacute;s te divertir&aacute;s nunca como con la primera. Es cuando a un jugador del &quot;<B>Civilization</B>&quot; le preguntas por la primera o la segunda parte, o cuando haces lo mismo con alguien que haya disfrutado de toda la saga de &quot;<B>Alone in the Dark</B>&quot; no se como explicarlo, son casos excepcionales del mundo de los juegos, es arte, por decirlo claramente. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El &quot;Wing Commander&quot; un&iacute;a la facilidad de manejo y simplicidad, que todos los profanos a los simuladores ped&iacute;amos para poder saborear un juego de este tipo, con la riqueza de argumento y desarrollo que hac&iacute;a que te metieras totalmente en el producto. El &quot;Wing Commander&quot; era una maravilla en todos los aspectos, era un juego brillantemente dise&ntilde;ado, programado y terminado que cre&oacute; un subg&eacute;nero dentro de la simulaci&oacute;n espacial.</P>
<P ALIGN="JUSTIFY"></P>
<h4>¿Y qui&eacute;n estaba detr&aacute;s?</h4>
<FONT SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">A <B>Origin</B> se le pueden echar en cara muchas cosas. Desde luego no supieron mantener el tipo cuando se convirtieron, por el periodo de unos cuantos meses, en la casa m&aacute;s importante del planeta pero siempre han seguido fieles a su maravilloso eslogan de &quot;<I>We Create Worlds</I>&quot;. Es cierto, sus juegos crean y se desarrollan en mundos o universos realmente trabajados. El juego emblema de la casa el &quot;<B>Ultima</B>&quot; es un clar&iacute;simo ejemplo con 8 partes troncales (a la espera de la 9), y 4 fuera de dicha disciplina en mundos paralelos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tambi&eacute;n es cierto que, por aquellas fechas, hab&iacute;a poco m&aacute;s que juegos de rol intentado ser novelas. Todos los juegos que ten&iacute;an una trama argumental profunda y que sacaban saga tras saga, nutri&eacute;ndose de un universo, eran principalmente juegos de rol. Imaginaros por un momento que a alguien se le ocurriera hacer algo parecido pero en el espacio, en el futuro, y que, para rematar la faena, eligiera un juego perteneciente al g&eacute;nero de los simuladores. El resultado lo tuvimos en la genial obra de arte de <B>Christ Roberts</B>, la saga &quot;Wing Commander&quot; (nota: me centrar&eacute; principalmente en la primera parte).  </P>
<P ALIGN="JUSTIFY"></P>
<table align = right><td><img src="jpg/wc3.jpg" ></td>
<tr><td><font size=1><center><b>Los combates eran muy realistas</b></center></font></td></table>
<P ALIGN="JUSTIFY">Christ Roberts, antes de entrar en Origin, era un programador con un curriculum ciertamente importante dentro del campo de la programaci&oacute;n de juegos. Programador del <I>ZX-80</I> primero y del PC despu&eacute;s, realiz&oacute; en el a&ntilde;o 1985 &quot;<B>Wizardore</B>&quot; para <B>Imagine</B>, posteriormente, y tambi&eacute;n para <I>Spectrum</I>, realizar&iacute;a &quot;<B>Styker’s</B> <B>Run</B>&quot; pero esta vez para <B>Ocean</B>. Luego, casi por casualidad, conoci&oacute; a un artista gr&aacute;fico de Origin al quien ense&ntilde;&oacute; la beta de un juego que se encontraba dise&ntilde;ando. Se trato del &quot;<B>Times</B> <B>of</B> <B>Lore</B>&quot;, un juego que ten&iacute;a ciertos aspectos de Rol y que, evidentemente, sali&oacute; publicado bajo el sello de la casa de <B>Richard Garriot</B>, Origin. M&aacute;s tarde dise&ntilde;ar&iacute;a el &quot;<B>Bad</B> <B>Blood</B>&quot; para desembocar en la saga que tanto y tanto prestigio (y dinero :-) le han hecho ganar a &eacute;l primero y a Origin despu&eacute;s; la saga Wing Commander.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que Christ Roberst fue una de las personas m&aacute;s influyentes del panorama del desarrollo internacional, es innegable. Mucha gente piensa, no sin raz&oacute;n, que lleg&oacute; a rivalizar en popularidad con el mism&iacute;simo Richard Garriot. El caso es que, para bien o para mal, Christ Roberst se estableci&oacute; en Texas, lugar donde se encuentra Origin, y all&iacute; trabaj&oacute; en la saga de &quot;Wing Commander&quot;, en el &quot;<B>Strike</B> <B>Commander</B>&quot; y en el &quot;<B>Privateer</B>&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<h4>¿Pero qu&eacute; ten&iacute;a el Wing Commander?</h4>
<P ALIGN="JUSTIFY">El &quot;Wing Commander&quot; era, ante todo, un juego de acci&oacute;n y simulaci&oacute;n pero eso s&iacute;, bastante m&aacute;s medido de lo que pod&iacute;a parecer en un principio. Es cierto que t&uacute; misi&oacute;n era la de pilotar una nave pero tambi&eacute;n es cierto que ten&iacute;as que dialogar e ir descubriendo una magn&iacute;fica historia, conoc&iacute;as a los personajes del juego, aprend&iacute;as a identificarlos (cosa realmente important&iacute;sima) y te sent&iacute;as dentro de verdad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego &quot;narraba&quot; la historia de una guerra en un hipot&eacute;tico futuro, entre la raza humana y <B>Kilrathi</B> (de aspecto felino). Al comienzo eres un piloto de bajo rango, al que se le ir&aacute;n asignando misiones en concordancia al &eacute;xito obtenido en las mismas. As&iacute;, a medida que se hac&iacute;an las cosas bien, esto es, completabas la misi&oacute;n con &eacute;xito, sub&iacute;as de rango, recib&iacute;as naves mejores, etc. (<I>nota para los nost&aacute;lgicos</I>: ¿Os acord&aacute;is cuando el capit&aacute;n de la nave os llamaba a su despacho para comunicar las noticias...? ¡Jo, si es que era genial el ambiente conseguido!)</P>
<P ALIGN="JUSTIFY"></P>
<center><table><td><img src="jpg/wc2.jpg" ></td>
<tr><td><font size=1><center><b>Los combates "comunicados" <br>eran de lo mejor del juego</b></center></font></td></table></center>
<P ALIGN="JUSTIFY">Pero el Wing Commander era mucho m&aacute;s que eso. Durante el juego ibas conociendo tambi&eacute;n a la tripulaci&oacute;n y al resto de los pilotos. Estos pilotos volaban contigo y t&uacute; les dabas &oacute;rdenes para que actuaran. Estas &oacute;rdenes eran del tipo &quot;<I>Ataca al enemigo que tengo en el punto de mira&quot;, &quot;Ay&uacute;dame, estoy en peligro</I>&quot;, &quot;<I>Mant&eacute;nte a mi lado</I>&quot; y as&iacute; una gran cantidad de &oacute;rdenes que realmente eran una maravilla. Ya os pod&eacute;is imaginar lo que constitu&iacute;a un combate en pleno apogeo. Estabas como un loco con el Joystick y mandando ordenes para que el escuadr&oacute;n que t&uacute; dirig&iacute;as te cubrieran, te ayudaran, etc. Por si no fuera poco, tu propio escuadr&oacute;n te ped&iacute;a ayuda de vez en cuando y ten&iacute;as que ir a ayudarles, eso sin contar cuando antes y durante un combate pod&iacute;as emplear la lucha &quot;verbal&quot; con tus enemigos los Kilthari. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo un combate era una experiencia &uacute;nica y la IA estaba tan bien hecha que, de verdad, parec&iacute;as metido en una partida multijugador (y eso lo digo ahora que recuerdo mis &quot;sesiones&quot; con el juego porque, por entonces, eso de partidas multijugador como no fuera estar sentado mirando mientras el otro jugaba...). Es muy dif&iacute;cil de explicar porque el &quot;Wing Commander&quot; ten&iacute;a ese &quot;algo&quot; que lo convert&iacute;an en un juego &uacute;nico y que si te tocaba con su &quot;varita m&aacute;gica&quot; no pod&iacute;as dejar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y no s&oacute;lo los combates eran una maravilla sino tambi&eacute;n las misiones, que iban desde hacer de escolta a una nave de medicamentos, a tener que defender a tu propia base de un ataque enemigo (teniendo que salir como un loco a la defensa y vi&eacute;ndote en medio de una nube de naves Kilthari) hasta ataques sorpresa cuando menos te lo esperabas, luchas entre campos de asteroides. Guauuu, os prometo que cuanto m&aacute;s lo recuerdo m&aacute;s ganas me entran de abrir la caja de mi Wing Commander y echar una partida. Era tan sencillo de manejar y tan divertido... sinfff me pod&eacute;is creer cuando os digo que las cosas de antes no son como la de ahora... </P>
<P ALIGN="JUSTIFY"></P>
<h4>M&uacute;sica, gr&aacute;ficos y la serie Wing Commander</h4>
<P ALIGN="JUSTIFY">Todo, absolutamente todo, era magn&iacute;fico. Desde la caja del producto que ven&iacute;a con un par de p&oacute;sters en la que se pod&iacute;an ver las caracter&iacute;sticas de las naves que ten&iacute;as a tu servicio pasando, como no, por el manual de instrucciones. Pero bueno, qu&eacute; vamos a decir de Origin, aut&eacute;ntica especialista de hacer de lo mejorcito estos aspectos. La m&uacute;sica y los efectos especiales eran incre&iacute;bles y se acoplaban a la perfecci&oacute;n a cada una de las secuencias del juegos. Yo lo jugu&eacute; y me lo acab&eacute; 3 veces sin tarjeta de sonido y, m&aacute;s adelante, cuando finalmente me hice con una Sound Blaster Pro (est&aacute;bamos en el a&ntilde;o 1990-91 y esas cosas eran prohibidas para las econom&iacute;as de muchos de nosotros), volv&iacute; a jugar y me encontr&eacute; con un juego totalmente distinto. No hab&iacute;a comparaci&oacute;n entre jugar con o sin sonido y la verdad, el &quot;Wing Commander&quot; fue de esos juegos que obligaban casi al usuario a tener una tarjeta de audio en su equipo y que contribuyeron a la expansi&oacute;n de las mismas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los gr&aacute;ficos merecen una menci&oacute;n a parte pues eran, sencillamente, de lo mejorcito de por entonces. Nos encontr&aacute;bamos en un entorno 3D simulado pero muy realista y, sobre todo, r&aacute;pido. Ni que decir tiene que fueron lo mejor cuando sali&oacute; a la venta y que, si dispon&iacute;as de unos 2 megas de memoria RAM ten&iacute;as, adem&aacute;s, animaciones extra (t&uacute; control de mandos saltaba echo trizas cuando te daban por delante, se ve&iacute;a una animaci&oacute;n cuando t&uacute; nave estallaba, etc). Pod&iacute;as cambiar la vista de tu nave y elegir la que m&aacute;s te gustase, grabar la partida en v&iacute;deo, consultar el &quot;mapa&quot; de vuelo y mont&oacute;n de cosas m&aacute;s y todo perfectamente detallado.</P>
<P ALIGN="JUSTIFY"></P>
<table align = left><td><img src="jpg/wc4.jpg" ></td>
<tr><td><font size=1><center><b>Con algo más de memoria <br>teníamos animaciones <br>como esta</b></center></font></td></table>
<P ALIGN="JUSTIFY">La primera de las partes adjudic&oacute; a Christ Roberts la consagraci&oacute;n definitiva como uno de los mejores creativos y dise&ntilde;adores a nivel mundial y, todo hay que decirlo, fue uno de los juegos que empez&oacute; a utilizar, hasta el l&iacute;mite, la tecnolog&iacute;a existente (pol&iacute;tica que ser&iacute;a la seguida por Origin a partir de entonces, esto es, sacar los t&iacute;tulos con las mayores exigencias en prestaciones de hardware).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El resto de la serie empez&oacute; a degenerar, despu&eacute;s del &quot;Wing Commander II&quot;, en juegos en los que se utilizaba masivamente el v&iacute;deo para mostrar pel&iacute;culas, en lugar de animaciones cortas y adecuadas. Pese a que la calidad con que se llevaron a la pr&aacute;ctica dichas secuencias (y los actores que eran de primera, sobre todo por la aparici&oacute;n de <B>Mark Halmin</B>, - Luke Skywalker -) fueron sobresalientes, se descuid&oacute; la participaci&oacute;n del usuario en el juego. Ya no se jugaba y se disfrutaba con una buena secuencia "cuando te la merec&iacute;as". Ahora, todo era secuencia tras secuencia y, para eso, nos vamos al cine. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El segundo Wing Commander, no ten&iacute;a secuencias de v&iacute;deo con actores digitalizados pero s&iacute; que ten&iacute;a muchas m&aacute;s secuencias animadas que el primero sin embargo, en esta segunda parte, la hicieron muy bien y nunca te encontrabas animaciones sobrecargadas sino que segu&iacute;an su curso y cumpl&iacute;an su objetivo de dar ambientaci&oacute;n a la historia.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">¿Algo m&aacute;s?</h4>
<P ALIGN="JUSTIFY">La serie Wing Commander de Christ Roberts construy&oacute; un universo bastante s&oacute;lido en el que desarrollar m&aacute;s y m&aacute;s historias. Se sacaron t&iacute;tulos como el notable &quot;<B>Privateer</B>&quot; que era, por as&iacute; decirlo, la versi&oacute;n de Origin del legendario &quot;<B>Elite</B>&quot; de <B>David Braben</B>. Un juego muy bueno y en el que se adoptaba el papel de comerciante del espacio que discurr&iacute;a en medio del confrontamiento humano – Kilrathy.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Christ Roberts tambi&eacute;n produjo un simulador &quot;convencional&quot; llamado &quot;<B>Strike Commander</B>&quot; y que fue una bomba en su lanzamiento. Introduc&iacute;a una alt&iacute;sima calidad tecnol&oacute;gica y se hizo tanto de rogar, con las continuas notas de prensa al estilo de &quot;sale dentro de dos meses&quot;, que fue el t&iacute;tulo que mejor supo &quot;venderse antes de salir&quot;. Al final el &quot;Strike Commander&quot; fue muy bien puntuado pero Christ decidi&oacute; no volver a la carga con una segunda parte.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">El estupendo creador, Christ Roberts, dejar&iacute;a Origin despu&eacute;s de producir el &quot;Wing Commander IV&quot; para... bueno, si os digo que est&aacute; dirigiendo la pel&iacute;cula ahora mismo... S&iacute;, Christ Roberts declar&oacute;, cuando dej&oacute; Origin, que quer&iacute;a dedicarse al campo del Cine y bueno, ah&iacute; le ten&eacute;is dirigiendo nada m&aacute;s y nada menos que la pel&iacute;cula del mismo nombre, ¡eso es un creador!.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La serie Wing Commander, para finalizar, puede considerarse como la mejor saga de simuladores espaciales jam&aacute;s hecha. Pese a que t&iacute;tulos m&aacute;s novedosos incluyen mayor grado de jugabilidad y prestaciones para el usuario m&aacute;s exigente, no han conseguido crear un universo como los juegos de la serie que en esta edici&oacute;n comentamos. Si tienes oportunidad de hacerte con la primera o la segunda parte y eres un &quot;clasic&oacute;n&quot; volver&aacute;s a divertirte como nunca.</P></FONT>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulab.htm"><font FACE="ARIAL"><B>[Títulos de Coleccionista]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

