<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Commandos. Behind Enemy Lines.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Pyro Studios.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Estrategia / Táctica en tiempo real.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95. </b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 90%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<FONT color="#000000">
<P ALIGN=justify>

<table align="left">
<td><img src="jpg/pcom.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">

Bueno, pues por fin llega el esperado Commandos.
Y es que Commandos tiene un detalle que lo hace m&aacute;s apetecible a&uacute;n
para nosotros. Est&aacute; programado por una compa&ntilde;&iacute;a espa&ntilde;ola,
Pyro Studios. &iquest;Es capaz Commandos de estar a la altura de los juegos
de las compa&ntilde;&iacute;as extranjeras?.
<P ALIGN=JUSTIFY><B>Argumento:</B>Commandos es un juego de estrategia en tiempo real
basado en la segunda guerra mundial. &iexcl;No, tranquilos!. Esto no es
el cuento de siempre. No hay que gestionar recursos, levantar edificios
ni mandar 40 unidades al enemigo a ver qu&eacute; nos cepillamos. Lo cierto
es que en Commandos tan s&oacute;lo manejamos a 6 hombres, e incluso menos,
dependiendo de la misi&oacute;n. Commandos es una sucesi&oacute;n de misiones
de lo m&aacute;s variado, en las que empezaremos destruyendo una simple
antena y acabaremos visitando el Bismarck o arrasando alg&uacute;n que
otro castillo alem&aacute;n. Por desgracia, habr&aacute; que grabar a menudo,
pues si alguno de nuestros comandos la palma, no podr&aacute; terminarse
la misi&oacute;n con &eacute;xito. Alg&uacute;n que otro v&iacute;deo entre
misiones alegraran nuestra vista y nos meter&aacute;n m&aacute;s en situaci&oacute;n.
<P ALIGN=JUSTIFY><B>Gr&aacute;ficos</B>: El engine gr&aacute;fico de Commandos, sin destacar
especialmente, cumple perfectamente con su cometido. De entrada, podremos
usar nuestras resoluciones habituales, lo que permitir&aacute; que veamos
m&aacute;s terreno, algo muy &uacute;til siempre en este tipo de juegos.
Un zoom muy bien trabajado nos permitir&aacute; alejarnos o acercarnos
a la acci&oacute;n seg&uacute;n sea necesario. Muy buena opci&oacute;n
tambi&eacute;n es el poder dividir la pantalla principal en hasta 6 subpantallas,
lo que nos abre bastantes opciones, como ver a cada uno de nuestros hombres
cuando se separen, o echar un ojo al centinela que est&aacute; haciendo
la ronda, para echar piernas cuando se acerque.
<P ALIGN=JUSTIFY><table align="left">
<td><img src="jpg/command1.jpg" ></td>
</table><P ALIGN=JUSTIFY><B>Sonidos y M&uacute;sica</B>: Los sonidos est&aacute;n muy bien trabajados,
aunque pronto nos cansaremos del "si, se&ntilde;or", "to's techo, se&ntilde;or"
de nuestros hombres. Quiz&aacute; hubiera sido mejor que lo dijeran s&oacute;lo
cuando los seleccion&aacute;semos y no a cada orden. Por suerte, en la
configuraci&oacute;n podemos hacer que se callen. Otra opci&oacute;n de
la configuraci&oacute;n es la que nos deja m&aacute;s confundidos. Se trata
de una opci&oacute;n llamada Madre Naturaleza y que, la verdad, no sirve
para nada. Porque no se puede activar ni desactivar. Y lo cierto es que
a la madre naturaleza se la echa de menos, pues apenas puede oirse ning&uacute;n
sonido natural. &iquest;P&aacute;jaros, agua, viento en los &aacute;rboles?.
Nada. Quiz&aacute; si no estuviera esa opci&oacute;n en el men&uacute;
de configuraci&oacute;n no la habr&iacute;amos echado de menos ;)
<P ALIGN=JUSTIFY> M&uacute;sica: la verdad, poca y repetitiva. No es
que est&aacute; mal, pero despu&eacute;s de oirla una y otra vez al principio
y final de cada misi&oacute;n, nos cansamos de ella. En medio de las misiones
no hay ninguna m&uacute;sica. Quiz&aacute; algo en plan tranqui con m&uacute;sica
acelerada cuandos nos descubren habr&iacute;a estado bien. En cuanto al
formato, la poca m&uacute;sica disponible est&aacute; en el formato m&aacute;s
abultado, WAV, y lo que es peor, no se toca desde el CD, sino que se instala
en el disco duro, ocup&aacute;ndonos 10 megas a lo tonto. Tir&oacute;n
de orejas (el &uacute;nico) para Pyro en este apartado.
<P ALIGN=JUSTIFY><B>Jugabilidad</B>: Cada uno de los personajes tiene sus propias habilidades.
As&iacute; por ejemplo tenemos al esp&iacute;a, que puede disfrazarse de
alem&aacute;n e ir cuadrando centinelas, o al zapador, que puede poner
cargas explosivas y fundir desde casas a tanques. Aunque algunas de estas
habilidades se repiten en varios hombres, en general est&aacute;n muy bien
equilibradas y hacen que tenemos que ir pensando nuestros movimientos.
Pocas veces pasar&aacute; que cuando necesitamos un asesinato silencioso,
nuestro boina verde est&aacute; a&uacute;n aburrido en la salida. Se aprende
r&aacute;pido, m&aacute;s a&uacute;n con los tutoriales que vienen con
el juego, aunque curiosamente las sesiones te&oacute;ricas vengan en un
pixelado v&iacute;deo AVI y no en el propio engine del juego. Como en todos
los juegos de estrategia, ayuda mucho el aprenderse las teclas r&aacute;pidas,
que podemos encontrar dentro del propio juego en la secci&oacute;n ayuda.
Una novedad en este tipo de juegos son los campos de visi&oacute;n y sonoros.
Cada centinela tiene su propio campo de visi&oacute;n, dividido en cercano
y lejano, y si nos ven en el cercano, o nos ven en el lejano y no estamos
tumbados en el suelo, dar&aacute;n r&aacute;pidamente la alarma y cargar&aacute;n
contra nosotros. Igualmente, si hacemos alg&uacute;n ruido cerca de un
centinela (o un ruido fuerte un poco m&aacute;s lejos) obtendremos el mismo
resultado. Buen trabajo de Pyro.
<P ALIGN=JUSTIFY><table align="right">
<td><img src="jpg/command2.jpg" ></td>
</table><P ALIGN=JUSTIFY><P ALIGN=JUSTIFY> Como regla imprescindible que es, Commandos viene
con la posibilidad de jugarse entre varios. Seg&uacute;n los jugadores
que seamos, podremos manejar a uno o m&aacute;s Commandos cada uno. A veces
el esperar a que los dem&aacute;s hagan su parte antes de poder entrar
en acci&oacute;n puede ser un poco aburrido (sobre todo si estamos jugando
en Internet y no en una LAN), pero se hace muy entretenido, y algunas veces
nos llevaremos alg&uacute;n gorrazo por joder la misi&oacute;n con alg&uacute;n
acto her&oacute;ico y est&uacute;pido ;).
<P ALIGN=JUSTIFY><B>Puntos Negros</B>: Muy pocos, pero nunca puede evitarse rellenar
esta secci&oacute;n, &iquest;verdad?. Tenemos el ya mencionado de la m&uacute;sica.
Luego, para los puristas, est&aacute; el que desde el linde de un bosque
se pueda ver todo el escenario, d&oacute;nde est&aacute;n y qu&eacute;
hace cada uno de los centinelas (excepto aquellos que se encuentran en
edificios o veh&iacute;culos). Tambi&eacute;n sorprende un poco el que
el centinela t&iacute;pico no se asuste cuando sus 30 compa&ntilde;eros
no est&aacute;n por ning&uacute;n lado y no responden a sus llamadas, y
siga haciendo su ronda tan contento. Pero son casos puntuales.
<P ALIGN=JUSTIFY><B>En resumen</B>: Commandos merece la pena, porque es un juego realmente
entretenido, y porque adem&aacute;s por una vez no tendremos que disfrutar
de una mala traducci&oacute;n. No en vano el equipo del juego es espa&ntilde;ol.
No s&oacute;lo Commandos es un juego bueno. Es, adem&aacute;s, un juego
innovador que ha sido muy bien recibido en el extranjero. As&iacute; que
no esper&eacute;is m&aacute;s, en vuestra tienda m&aacute;s cercana os
est&aacute; esperando ;).
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestrab.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

