<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:dgarcfer@iees.es">David García "Gato".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Comanche 3.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Nova Logic.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Electronic Arts.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Simulador de vuelo.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 95%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">
<FONT color="#000000">
<p align=justify>
<FONT color="#000000" size=2 face=arial><p align="justify">
<table align="left">
<td><img src="jpg/com3por.jpg" ></td>
</table>
<P ALIGN="JUSTIFY">
Desde la primera entrega de este incre&iacute;ble simulador de helic&oacute;pteros la calidad de los gr&aacute;ficos y la jugabilidad han sido sus valores m&aacute;s destacables, inimaginados hasta ese momento. Desgraciadamente, en las anteriores versiones, el realismo en el movimiento del helic&oacute;ptero y los controles se sacrificaron en pos de la facilidad de manejo. Pero esto se ha terminado, el Comanche 3 es algo m&aacute;s que un helic&oacute;ptero invencible machacando tanques, es una obra maestra en el mundo de la simulaci&oacute;n. </P>
<P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">Los gr&aacute;ficos, una de las mejores bazas del Comanche desde su inicio, se han mejorado considerablemente gracias a la, ya famosa, tecnolog&iacute;a de Novalogic conocida como Voxel Space 2. Los escenarios son sorprendentemente realistas, creando un ambiente 3D que sobrepasa todo lo visto hasta ahora en simulaci&oacute;n. Los efectos de luz, los diferentes terrenos, la profundidad, el movimiento y, ante todo, la alucinante velocidad con la que se mueve, son verdaderamente inmejorables. Tambi&eacute;n ha mejorado el helic&oacute;ptero en si. Con las vistas externas podremos comprobar la magn&iacute;fica reproducci&oacute;n que se ha hecho del aparato real y los alucinantes efectos luminosos que se incluyen el Comanche.</P>

<P ALIGN="JUSTIFY">Esto no es la &uacute;nica novedad del Comanche 3. El juego ha cambiado pr&aacute;cticamente entero ya que empezaron de cero en casi todos los aspectos del programa. Las ecuaciones f&iacute;sicas de vuelo son 100% nuevas, logrando una sensaci&oacute;n de movimiento exacta a la que se ve en el helic&oacute;ptero real. Aqu&iacute; no acaban las mejoras... el sonido impresiona nada m&aacute;s moverse un poco por los inmensos escenarios del juego. Podr&aacute;s o&iacute;r todos los efectos sonoros del juego en Surround, escuch&aacute;ndose independientemente cada roce con tu aparato, el impacto de cada proyectil, los p&aacute;jaros de los &aacute;rboles, las vibraciones de tus rotores, etc. En el aspecto del sonido cave felicitar a Novalogic por haber traducido las voces, cosa que se empieza ahora a poner de moda entre las compa&ntilde;&iacute;as de juegos (menos mal). Podremos escuchar a nuestro instructor mientras nos ense&ntilde;a cada funci&oacute;n y caracter&iacute;stica de nuestro comanche, a nuestro compa&ntilde;ero coment&aacute;ndonos lo que ve y hace en ese momento, a la artiller&iacute;a confirmando la posici&oacute;n de los objetivos, interceptar as transmisiones enemigas en ruso, etc.</P>
<P ALIGN="JUSTIFY">
<center><table>
<td><IMG SRC="jpg/coman2.jpg"></td>
</table></center>
<P ALIGN="JUSTIFY">
Se ha aumentado considerablemente el n&uacute;mero de veh&iacute;culos, casas, aparatos, antenas, &aacute;rboles, barriles, trenes, coches, y todo lo que puedas imaginar encontrarte en medio del campo de batalla, todos con unos impresionantes gr&aacute;ficos, hasta podr&aacute;s ver las gaviotas volando alrededor del faro del puerto mientras sobrevuelas una localidad enemiga &oacute; los pinos nevados de las monta&ntilde;as &oacute; las secas plantas del desierto, verdaderamente espectacular.</P>
<P ALIGN="JUSTIFY">En lo referente al pilotaje del RAH-66 Comanche, la empresa se puso en contacto con Boeing-Sikorsky, los verdaderos creadores del Comanche, para ajustar los par&aacute;metros del movimiento y respuesta del aparato. ¿El resultado final? Que es tan real pilotar el Comanche en tu ordenador como el verdadero helic&oacute;ptero (en lo que a las respuestas del aparato se refiere). El cabeceo del comanche, el empuje de los rotores, los ligeros balanceos al girar... todo est&aacute; perfectamente medido para conseguir el mayor realismo posible. ¿Ser&aacute; entonces muy dif&iacute;cil de pilotar? Sigue siendo tan f&aacute;cil como en las versiones anteriores, destacando la sencillez y reducido n&uacute;mero de teclas a usar. Pero si lo que te gusta es el realismo &quot;a tope&quot; puedes seleccionar el modo avanzado de vuelo, que complica mucho m&aacute;s el pilotaje. Viene incluida adem&aacute;s una plantilla con todas las teclas, lo que hace que sea a&uacute;n m&aacute;s f&aacute;cil de usar. Si tienes un buen joystick dispondr&aacute;s de una gran ventaja.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero veamos lo que encontramos dentro del Comanche. Disponemos de un tutorial, un curso de vuelo en el que nuestro instructor nos ense&ntilde;ar&aacute; todos los trucos y capacidades de nuestro helic&oacute;ptero, a viva voz y en castellano. Tras graduarnos comenzaremos las misiones de combate. Tenemos cuatro campa&ntilde;as con siete misiones cada una, y una misi&oacute;n en cada campa&ntilde;a que solo podremos realizar cuando terminemos el resto. Antes de entrar en combate se nos informar&aacute; de todos los factores a tener en cuenta y podremos ver un plano de la zona con la &uacute;ltima posici&oacute;n de las unidades enemigas. Tras empezar la misi&oacute;n, despegaremos de nuestra base y comenzaremos la aproximaci&oacute;n al objetivo. Hay una gran variedad de vistas de nuestro helic&oacute;ptero, y del resto de aparatos y objetos que encontremos. Si vemos que no podemos controlar bien el helic&oacute;ptero existe un &quot;modo de vuelo sencillo&quot;, para los que sean m&aacute;s torpes, de todas formas el modo avanzado es, a mi parecer, m&aacute;s divertido.</P>
<table align="right">
<td><IMG SRC="jpg/coman1.jpg"></td>
</table>
<P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">Cuando usemos nuestro armamento podremos ver el realismo del mismo. Se ha reproducido a la perfecci&oacute;n las trayectorias que siguen cada uno de los misiles. La ruta de cada proyectil de nuestro ca&ntilde;&oacute;n de 20mm es calculada independientemente del resto, el misil AGM-114 cae sobre su objetivo tal y como lo hace el real y los Stinger persiguen su objetivo siguiendo los contornos del terreno. </P>
<P ALIGN="JUSTIFY">Tras finalizar la misi&oacute;n con &eacute;xito, o ser derribados (con una espectacular animaci&oacute;n), se nos presenta un men&uacute; en el que podremos ver una &quot;pel&iacute;cula&quot; con todo lo que hemos hecho, en la que podremos selecciona las vistas que queramos.</P>
<P ALIGN="JUSTIFY">Por &uacute;ltimo, dispone el juego de unas secuencias animadas en las que podremos ser testigos de las caracter&iacute;sticas de RAH-66 Comanche. Queda muy bonito y rellena CD.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En definitiva, el Comanche 3 se ha superado a si mismo, y a todos sus competidores, y ha puesto el nivel de los simuladores muy por encima de lo que hemos podido ver hasta ahora. El manual que trae es muy completo y sencillo, y el programa es insuperable. Si eres aficionado a los simuladores no puedes pasar sin jugar al Comanche 3. Por mucho que lo busco no puedo encontrarle defectos destacables, y eso que no soy fiel seguidor de la serie Comanche ya que los anteriores no me gustaron mucho, pero esto... es otra cosa totalmente diferente. Para acabar, perfecto y muy entretenido.</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

