<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Legado de Nintendo</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:srd@ctv.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Super Mario Bros 1
</FONT>
</H3>
<FONT COLOR="#000000" SIZE=2 FACE=ARIAL>

<P ALIGN=justify>
Despu&eacute;s del divertid&iacute;simo juego de &quot;batallas&quot; Mario Bros, Nintendo present&oacute; al mundo este gran videojuego, que era un lavado de cara del anterior citado y una secuela del ahora llamado The Lost Levels, que s&oacute;lo sali&oacute; en Jap&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego ten&iacute;a 8 mundos divididos en cuatro niveles cada uno. El modo de avance era &quot;recto y pa’lante&quot; en 2D hasta llegar a una bandera que marcaba la proximidad de un castillo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cada cuatro pantallas, es decir, cada final de mundo, el castillo que encontr&aacute;bamos al final del nivel 3, m&aacute;s grande de lo normal, era donde se desarrollaba la acci&oacute;n de final de mundo. Ten&iacute;amos que llegar al final sorteando litros y litros de lava hasta llegar a una tortuga gigante llamada Bowser, que hab&iacute;a raptado a la princesa. </P>
<P ALIGN="JUSTIFY"></P>
<img src="gif/mario11.gif" align=left><P ALIGN="JUSTIFY">&Eacute;l nos estaba lanzando fuego desde all&iacute;, y ten&iacute;amos que pasar por encima suyo para tocar ¿un hacha? y as&iacute; hacer que el puente donde se sosten&iacute;a cayera y &eacute;l detr&aacute;s, pero deb&iacute;a tener las vidas de un gato, porque a las 4 pantallas estaba ah&iacute; de nuevo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces avanz&aacute;bamos un poco m&aacute;s y encontr&aacute;bamos una seta que nos dice que gracias por rescatarla, pero (gracias a Dios) ella no es la princesita.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego ten&iacute;a varios tipos de pantallas; uno en que era de d&iacute;a en prados soleados, otro que se desarrollaba en un mundo de piedra bajo el suelo, el mar, nieve, y noche. Cada uno ten&iacute;a enemigos caracter&iacute;sticos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los prados soleados sol&iacute;an tener tortugas y champi&ntilde;ones traidores que pod&eacute;is ver en las im&aacute;genes. Estos eran los mismos enemigos que en los subterr&aacute;neos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El mar ten&iacute;a pulpos y peces que no hab&iacute;a forma alguna de matar. Al menos los pececitos segu&iacute;an su camino y te olvidaban, pero era extremadamente dif&iacute;cil deshacerse de los pesados de los pulpos, que nos segu&iacute;an hasta el final de fase. Hab&iacute;a una peque&ntilde;a variaci&oacute;n, que aparec&iacute;a en prados soleados, con multitud de puentes, y los pececillos saltaban para matarte. Si te daban por debajo les matabas; si te daban por encima te mataban ellos a ti. Esta era una de las m&aacute;s divertidas, puesto que ten&iacute;as que correr como un loco para librarte de ellos.</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/mario12.gif"></center>
<P ALIGN="JUSTIFY">En la nieve de quienes no te librabas era de las balas que sal&iacute;an de ca&ntilde;ones situados cada dos dedos en la pantalla, y eras considerado un verdadero genio si lograbas llegar al final. &Eacute;stos tambi&eacute;n aparec&iacute;an en algunas pantallas de noche, donde tambi&eacute;n sol&iacute;an aparecer mucho las tortugas y los hermanos martillo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los hermanos martillo eran como dos tortugas sobre dos patas que se asignaban cada una unos cuantos ladrillos seguidos y empezaban a tirar martillos, y era dif&iacute;cil conseguir llegar a matar uno, y a&uacute;n m&aacute;s salir de ah&iacute; sin haber sufrido da&ntilde;os.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Personajes carism&aacute;ticos que se repitieron en nuevas entregas, un personaje protagonista a&uacute;n m&aacute;s carism&aacute;tico que todos los dem&aacute;s juntos, y un juego con una dificultad alta y laaaaargo son una mil&eacute;sima parte de los ingredientes que hicieron de &eacute;ste juego un gran &eacute;xito en su &eacute;poca, y un gran cl&aacute;sico ahora.</P></FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="ltfnin.htm"><font FACE="ARIAL"><B>[El legado de Nintendo]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>


