<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Juegos</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformación</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<br>
<FONT FACE=ARIAL SIZE=2>
<h3>Criterio de puntación en los análisis de videojuegos</h3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Los art&iacute;culos de an&aacute;lisis de juegos que hay en Macedonia se caracterizan por estar divididos en dos grupos. Unos, los que tienen puntuaci&oacute;n y otros los que carecen de ella. Debido a que hay igualdad de apoyo a ambos grupos dentro del equipo, la existencia de puntuaci&oacute;n asociada a un art&iacute;culo se dejar&aacute; a libertad del redactor. De todos modos, a la hora de establecer dicha puntuaci&oacute;n se ha intentado crear un sistema, a partir del n&uacute;mero 10, que sirva para "homogeneizar", en todo lo posible, los comentarios vertidos, es decir, que las notas sean lo m&aacute;s proporcionales entre distintos redactores. He aqu&iacute; las bases de nuestro sistema de votaci&oacute;n.</P>
<P ALIGN="JUSTIFY">A la hora de puntuar se valoran de forma independiente tres apartados: <B>Aspectos t&eacute;cnicos </B>(calidad de gr&aacute;ficos, sonido, etc.)<B>, Jugabilidad / adicci&oacute;n </B>y<B> Originalidad</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cada uno de los tres apartados se punt&uacute;a de <B>0</B> a <B>10</B> seg&uacute;n el siguiente baremo:</P>
<P ALIGN="JUSTIFY"></P><DIR>


<B><P ALIGN="JUSTIFY">De 0 a 4:</B>&#9;El juego est&aacute; por debajo del m&iacute;nimo exigible. Una puntuaci&oacute;n as&iacute; en t&eacute;cnica o jugabilidad significa que es un t&iacute;tulo a olvidar. En originalidad indicar&aacute; que es una copia descarada de otros t&iacute;tulos anteriores sin aportar absolutamente nada nuevo, aunque si en las otras categor&iacute;as se porta bien quiz&aacute;s sea una opci&oacute;n a considerar.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">De 5 a 6:</B>&#9;El juego es simplemente aceptable. No entusiasma ni despierta pasiones, precisamente, pero cumple discretamente. Puntuaciones en este rango indicar&aacute;n que, salvo que el g&eacute;nero nos atraiga especialmente, ser&aacute; mejor poner la vista en otro t&iacute;tulo m&aacute;s logrado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">De 7 a 8:</B>&#9;El juego es bueno. Merecer&aacute; la pena dedicarle algo de atenci&oacute;n porque puede ser un buen candidato a formar parte de nuestra juegoteca, sobre todo si estamos escasos de mejores opciones a las que hincar el diente.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">De 9 a 10:</B>&#9;El juego es muy bueno / excelente. Con dos categor&iacute;as en este rango de puntuaci&oacute;n seguro que merece la pena comprarlo, sobre todo si el g&eacute;nero nos gusta. Con las tres categor&iacute;as en este rango el juego es de obligada adquisici&oacute;n… ¿a qu&eacute; est&aacute;s esperando para ir a la tienda a por &eacute;l? </P></DIR>


<P>Se otorgar&aacute; tambi&eacute;n una nota media entre 0% y 100% que se obtendr&aacute; mediante la siguiente f&oacute;rmula:</P>

<B><P ALIGN="CENTER">Nota media: 10 * (T&eacute;cnica + Jugabilidad + Originalidad ) / 3</P>
</B>
<P ALIGN="JUSTIFY">El resultado de la f&oacute;rmula se podr&aacute; ver modificado hasta en un <B>+/–10%</B> seg&uacute;n el <B>criterio subjetivo del redactor</B>. Para valorar este 10% se basar&aacute; en sus gustos personales, impresi&oacute;n general del juego, fidelidad del producto final a lo prometido por la publicidad del mismo en cuanto a g&eacute;nero, desarrollo, etc, cumplimiento de las expectativas provocadas por el juego (el juego est&aacute; a la altura de lo que se esperaba de &eacute;l), cualquier otra valoraci&oacute;n a criterio del redactor (relaci&oacute;n calidad / precio, presencia de &quot;bugs&quot;, calidad de la documentaci&oacute;n / instalaci&oacute;n, etc.).</P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<BR>
<CENTER><font face=arial size=2><b>[<A HREF="index04.htm">Regresar a Zona de Juegos</a>]</b></CENTER>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





