<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A href="mailto:ramis@lettera.net">Pablo Vázquez "Ramis"</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>
<H3>
<FONT color="#000000" face="arial">
"CROMOSOMA 6" por Robin Cook
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>

La misteriosa desaparici&oacute;n del cad&aacute;ver de un conocido mafioso y su desconcertante hallazgo posterior – decapitado y con el cuerpo casi irreconocible – lleva al doctor Jack Slapleton a emprender una investigaci&oacute;n de la que nadie saldr&aacute; indemne. En efecto, el abominable ultraje de que ha sido objeto el cad&aacute;ver es la punta del iceberg de un tenebroso programa de manipulaci&oacute;n gen&eacute;tica cuyo epicentro se halla en Guinea Ecuatorial, adonde Stapleton viaja acompa&ntilde;ado por dos intr&eacute;pidas doctoras y su atractiva novia. Al extremo del laberinto encontrar&aacute;n un complot de siniestros intereses cuyo &uacute;nico fin es enriquecerse, a&uacute;n a costa de provocar un desastre gen&eacute;tico de proporciones devastadoras. </P>
<P ALIGN="JUSTIFY">Este es el resumen escueto de la &uacute;ltima novela de Robin Cook. El habitual thriller de tem&aacute;tica m&eacute;dica enriquecido con una trama que participa del g&eacute;nero de aventuras y del techno – thriller.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El doctor Robin Cook estudi&oacute; medicina en la Universidad de Colombia y efectu&oacute; sus pr&aacute;cticas profesionales en Harvard. Como escritor, Cook, es el m&aacute;s brillante autor de literatura de terror inspirada en la ciencia m&eacute;dica. Sus libros se convierten invariablemente en bestsellers mundiales, y muchos de ellos han sido adaptados al cine. Otras obras de Cook son<I>: &quot;Como si fuera Dios</I>&quot;, &quot;<I>Epidemia</I>&quot;, &quot;<I>Intenci&oacute;n criminal</I>&quot;, &quot;<I>La manipulaci&oacute;n de las mentes</I>&quot;, &quot;<I>Miedo mortal</I>&quot;, &quot;<I>Mutilaci&oacute;n</I>&quot;, &quot;<I>Signos vitales</I>&quot;, &quot;<I>Ceguera asesina</I>&quot;, &quot;<I>Los archivos de Salem</I>&quot;, &quot;<I>Tratamiento letal</I>&quot; y &quot;<I>Contagio</I>&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La novela en si tiene varios aspectos destacables: el primero es que narra dos historias paralelas que al final se juntan: la de los forenses en Nueva York y la de los investigadores en Cogo (Guinea Ecuatorial). Como cuenta el resumen, tras los pasos de unos y de otros se encuentra una organizaci&oacute;n mafiosa a gran escala: en Nueva York dos familias de la t&iacute;pica mafia americana, m&aacute;s una organizaci&oacute;n cient&iacute;fica que extiende sus redes hasta Guinea Ecuatorial, donde establecieron sus laboratorio, comprando a las autoridades locales. Es tal la fuerza de la mafia que el gobierno guineoecuatoriano aplica la pena de muerte a todo aquel que se interfiera en el proyecto de Gen Sys, la empresa de dicha organizaci&oacute;n cient&iacute;fica. Ni que decir tiene que los forenses son visitados un par de veces por miembros de las familias mafiosas en Nueva York, de las que salen m&aacute;s o menos bien parados.</P>
<P ALIGN="JUSTIFY">A pesar de tal hostigamiento todos, tanto los forenses como los investigadores en &Aacute;frica, deciden ir contra dicha organizaci&oacute;n y finalmente remedian, en parte, el caos que empezaba a establecerse despu&eacute;s de que los cient&iacute;ficos perdieran el control de un descubrimiento cuyas consecuencias podr&iacute;an ser terribles.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como curiosidad en este libro se establecen distintas comparaciones que resultan sumamente interesantes:</P>
<P ALIGN="JUSTIFY"></P>
<UL>
<LI><font size=2> <p align="justify">En cuanto a la investigaci&oacute;n, se puede observar c&oacute;mo se investiga a nivel cient&iacute;fico y a nivel policial, y dentro de este nivel policial podemos comprobar las diferencias del trabajo de los polic&iacute;as y de los forenses en este campo.</LI></P></UL>
<UL>
<LI><font size=2> <p align="justify">En cuanto a los distintos tipos de mafias se comparan la mafia a nivel de familias con la industrial, y c&oacute;mo al final ambas se necesitan y se ayudan mutuamente, cada una imponiendo sus condiciones. A nivel m&aacute;s bajo se compara tambi&eacute;n los matones mafiosos con los t&iacute;picos pandilleros del Harlem.</LI></P></UL>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A pesar de ser un libro de tem&aacute;tica m&eacute;dica y estar escrito por un m&eacute;dico, no tiene demasiada terminolog&iacute;a cient&iacute;fica, por lo que se puede decir que nos encontramos con un libro de lectura bastante simple. Esto tampoco quiere decir que no tenga algunas palabras t&eacute;cnicas, ni que de vez en cuanto nos encontremos ante una explicaci&oacute;n de alg&uacute;n proceso cient&iacute;fico o m&eacute;dico, en concreto centrado en la gen&eacute;tica (y en el tema de transplantes). Tampoco nos encontramos ante una novela que se recrea con descripciones excesivamente morbosas en cuanto a sexo o violencia, sobre todo violencia, aunque en la etapa donde se trata el tema de la autopsia del cad&aacute;ver s&iacute; se describe, como es natural, cu&aacute;l es el estado del mismo y las posibles causas de las mutilaciones que pueden observarse en &eacute;l.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En cuanto al desarrollo, el libro est&aacute; compuesto de dos partes: la segunda comienza con el viaje de los neoyorkinos a Cogo y su posterior encuentro con los investigadores, finalizando en la resoluci&oacute;n de la novela. La primera parte se puede dividir a su vez en dos partes: lo que sucede en Nueva York con los forenses y lo que sucede en Guinea Ecuatorial con los investigadores y el proyecto cient&iacute;fico. Estas dos partes se desarrollan a la vez. El propio libro, en esta fase, va saltando de un sitio a otro. De todas formas esto no es un aspecto negativo ya que te lo se&ntilde;aliza y se sigue todo sin ninguna dificultad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para finalizar, como aspectos &quot;pseudonegativos&quot; podemos destacar un par de fases dentro del libro que se escapan de la ya curiosa realidad en que se envuelve la novela. Una es en la segunda fase del libro donde la aventura llega a los l&iacute;mites casi de la fantas&iacute;a cuando los investigadores son secuestrados por unos seres particularmente importantes en la novela. El otro aspecto negativo es la resoluci&oacute;n, bastante fant&aacute;stica, de la novela, pues despu&eacute;s de un embrollo demasiado profundo, a varios niveles, los problemas desaparecen por el &quot;hero&iacute;smo&quot; de los protagonistas, y otros desaparecen por arte de magia.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En mi opini&oacute;n el final feliz de la novela es un poco fantasioso.</P></FONT></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


