<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>ítulos de Coleccionista</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">
<font face=arial>
<H3>
F-29 Retaliator
</H3>


<BR>


<P align="justify"><img src="gif/f2900.gif" align="left">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los que alguna vez nos hemos tenido que enfrentar a un simulador de vuelo sin ser, para nada, aficionados a los aviones, pronto hemos desistido. Que si tener que utilizar hasta la &uacute;ltima tecla, que si tener que aprendernos de memoria todo un panel de datos de la cabina del avi&oacute;n, que si tener que enfrentarnos a un voluminoso manual de instrucciones... Estos inconvenientes (para los usuarios que s&oacute;lo quer&iacute;amos pasar un buen rato sin demasiadas complicaciones) comenzaron a ser factor com&uacute;n en todos y cada uno de los simuladores de vuelo que salieron a partir del a&ntilde;o 1990.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego que de verdad acerc&oacute; el g&eacute;nero de la simulaci&oacute;n a&eacute;rea al usuario &quot;de a pie&quot;, fue el cl&aacute;sico &quot;F-29 Retaliator&quot; de Ocean.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">¡Qu&eacute; f&aacute;cil!</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En efecto. Esas eran las palabras que a cualquier jugador novato de los simuladores de vuelo, le sal&iacute;an del alma tras cinco minutos de juego. El &quot;F-29 Retaliator&quot; se caracterizaba por no bombardear al jugador con montones de teclas imprescindibles. En lugar de ello, le dejaba  adentrarse en la mec&aacute;nica de manejo poco a poco. Hab&iacute;a una opci&oacute;n de juego r&aacute;pido, en la que comenz&aacute;bamos con el avi&oacute;n ya funcionando, en otras palabras, en pleno vuelo, con armamento &quot;infinito&quot; y con una buena cantidad de aviones y estructuras militares para destruir. &quot;Zulu Alert&quot;, que as&iacute; se llamaba la opci&oacute;n, mostraba el lado de m&aacute;s acci&oacute;n del simulador sin hacer de ello el desarrollo central del juego, es decir, permit&iacute;a al jugador aprender a manejar el avi&oacute;n, conocer las teclas de vuelo m&aacute;s importantes, o las estrategias de combate y bombardeo, sin tener que realizar ninguna misi&oacute;n espec&iacute;fica. Mostraba el juego en pleno apogeo, en lugar de obligarnos a tener que despegar para poder comenzar a disfrutar de las virtudes del simulador de combate a&eacute;reo. El hecho de dejar que el jugador aprendiese a manejar el avi&oacute;n, desde una perspectiva arcade, permit&iacute;a que &eacute;ste, al comprender r&aacute;pidamente el manejo, tuviera aut&eacute;nticas ganas de comenzar a jugar en serio al producto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El &quot;F-29 Retaliator&quot;, dispon&iacute;a de cuatro escenarios con un n&uacute;mero determinado de objetivos. Los escenarios eran Arizona (de entrenamiento m&aacute;s exhaustivo y coherente que el de la opci&oacute;n &quot;Zulu Alert&quot;), Oriente Medio, Oc&eacute;ano Pac&iacute;fico y Europa. Esta &uacute;ltima llegaba a poseer un total de 47 misiones distintas.</P>
<P ALIGN="JUSTIFY"></P>
<center><table width="313"> 
<td><img src="gif/f2901.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Aquí tenéis el menú principal del juego</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">La alta adicci&oacute;n del &quot;F-29 Retaliator&quot; se encontraba, adem&aacute;s de en un manejo relativamente sencillo, en una dificultad bien medida. En todos los escenarios en los que ten&iacute;amos oportunidad de jugar, las primeras misiones eran bastante sencillas. Esto permit&iacute;a que el jugador no se &quot;agobiara&quot; al ver que era derribado de forma insistente sin enterarse, es decir, le permit&iacute;a disfrutar del vuelo sabiendo que, adem&aacute;s, estaba metido de lleno en el verdadero desarrollo de un escenario. Que ten&iacute;a que cumplir una misi&oacute;n no muy complicada y que, adem&aacute;s, pod&iacute;a poner en pr&aacute;ctica las operaciones de despegue y aterrizaje.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Desarrollo de las misiones</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cada uno de los escenarios dispon&iacute;a de sus propias misiones por lo que, antes de nada, deb&iacute;amos elegir la &quot;campa&ntilde;a&quot; en la que quer&iacute;amos jugar. En cada una de ellas, siempre deb&iacute;amos sobrevolar el mismo mapa, esto es, el escenario de Europa, por ejemplo, no presentaba porciones de terreno diferentes sino que localizaba las misiones sobre el mismo terreno de vuelo (con lo que, pese a pecar de simplicidad, permit&iacute;a, de nuevo, que el usuario se familiarizara con el entorno a medida que iba completando objetivos). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A nuestra disposici&oacute;n ten&iacute;amos una cabina que no nos invad&iacute;a con montones de datos sobre la informaci&oacute;n del estado del avi&oacute;n. Era, pues, una cabina que ten&iacute;a s&oacute;lo la informaci&oacute;n que de verdad podr&iacute;a sernos &uacute;til. As&iacute;, ten&iacute;amos tres grandes paneles distintos. Uno que nos mostraba nuestra situaci&oacute;n en el mapa, otro que nos dec&iacute;a por d&oacute;nde ven&iacute;an los enemigos (un radar que, adem&aacute;s, ten&iacute;a tres modos distintos de visualizaci&oacute;n) y, por &uacute;ltimo, otro que nos facilitaba el estado armament&iacute;stico (misiles que nos quedaban sin lanzar; aqu&iacute; tambi&eacute;n pod&iacute;amos ver el camino que recorr&iacute;an nuestros misiles antes de dar en el blanco). Adem&aacute;s de estos paneles, pose&iacute;amos unos cuantas se&ntilde;alizaciones m&aacute;s como, por ejemplo, la velocidad, la altitud, el estado del tren de aterrizaje, el combustible, etc. </P>
</FONT><FONT SIZE=2>
</FONT>
<center><table width="313"> 
<td><img src="gif/f2902.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>El uso del panel de mando se hacía imprescindible</center></font></td> 
</table></center> 
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Las misiones que ten&iacute;amos que realizar, pese a no ser de una complejidad u originalidad suprema, eran divertidas y desafiantes. Desde tener que enfrentarnos a un escuadr&oacute;n de aviones enemigos, a tener que destruir alguna estructura militar, qu&iacute;mica, o, incluso, portaaviones o carros de combate. Eran, siempre, coherentes pues se nos ofrec&iacute;a un texto explicativo de la situaci&oacute;n y de la importancia de la misi&oacute;n que ten&iacute;amos encomendada (aunque como no tuvieras el producto original estabas perdido. Hab&iacute;a que utilizar la documentaci&oacute;n escrita para cada misi&oacute;n).</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Esto s&iacute; que era volar</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero en lo que de verdad se llevaba la palma el &quot;F-29 Retaliator&quot;, era en la conseguida sensaci&oacute;n de vuelo. El juego trasmit&iacute;a, a la perfecci&oacute;n, la sensaci&oacute;n de estar metido en un moderno caza de combate, de tener un control total sobre el avi&oacute;n y de vivir un verdadero combate a&eacute;reo, ya fuera contra los aviones enemigos o bombardeando alg&uacute;n puente clave, base enemiga, etc. Los gr&aacute;ficos, totalmente tridimensionales, no luc&iacute;an ning&uacute;n tipo de texturas (y, pese a que los jugadores modernos crean que era algo horrible, el sabio uso del color los detallaba estupendamente) lo que permit&iacute;a que el juego funcionara a la perfecci&oacute;n en equipos 286, es decir, la fluidez de movimiento era total (en aquellos tiempos, los programadores deb&iacute;an utilizar obligatoriamente el ensamblador para producir juegos r&aacute;pidos y suaves... y eso se notaba). Hab&iacute;a muchos detalles que favorec&iacute;an la sensaci&oacute;n de vuelo, a parte de la ya mencionada fluidez de movimiento, estos pod&iacute;an ser el volar por encima de las nubes, el perder el control al realizar maniobras bruscas (nos mare&aacute;bamos y la pantalla se oscurec&iacute;a mientras perd&iacute;amos el control del avi&oacute;n), el notar c&oacute;mo &eacute;ramos incapaces de controlar el avi&oacute;n ante un impacto de misil mientras &iacute;bamos cayendo en picado, etc.</P>
<P ALIGN="JUSTIFY"></P>
<table width="313" align="right"> 
<td><img src="gif/f2903.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Visto desde fuera todo era una gozada, pero el control se hacía muy difícil</center></font></td> 
</table> 
<P ALIGN="JUSTIFY">Por supuesto, el juego admit&iacute;a m&uacute;ltiples tipos de vista. Pod&iacute;amos estar viendo nuestro avi&oacute;n &quot;desde fuera&quot; o bien, jugar utilizando el panel de control. A decir verdad, resultaba muy complicado, por no decir imposible, manejar el avi&oacute;n sin recurrir al panel de mando. En primer lugar, porque no ten&iacute;as la posibilidad de consultar el mapa, ni la situaci&oacute;n del avi&oacute;n o los radares, mientras ve&iacute;as el &quot;F-29&quot; desde fuera. Adem&aacute;s, el control usando vista externa se hac&iacute;a insufrible. As&iacute; pues, el manejo del avi&oacute;n se realizaba siempre desde la cabina dejando constancia de que, pese a la facilidad de manejo del juego, era un simulador que requer&iacute;a del usuario una atenci&oacute;n a todos los par&aacute;metros del avi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Conclusiones</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aparte de todas las virtudes aqu&iacute; relatadas, el juego ten&iacute;a muchos m&aacute;s aspectos interesantes. Se pod&iacute;a jugar en modo multijugador mediante el uso de m&oacute;dem o cable serie, dispon&iacute;a de dos aviones distintos que manejar, el &quot;F-29&quot; y el &quot;F-22&quot;, se pod&iacute;a elegir el armamento m&aacute;s adecuado para cada misi&oacute;n, etc. La gran virtud, a mi entender, de este juego, se encontraba en la capacidad que ten&iacute;a para enganchar a jugadores que en absoluto eran amantes de los simuladores de vuelo. Todo jugador estaba preparado para aprender a manejar a la perfecci&oacute;n el &quot;F-29 Retaliator&quot;. Adem&aacute;s, pese a esa sencillez de manejo, el juego fue ampliamente jugado entre los m&aacute;s veteranos de la &eacute;poca. Y es que, este cl&aacute;sico, te enganchaba de forma irresistible quisieras o no. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de disfrutar del &quot;F-29 Retaliator&quot;, comenc&eacute; a interesarme mucho m&aacute;s por los simuladores de vuelo. Desgraciadamente, jam&aacute;s volv&iacute; a toparme con un simulador de vuelo, no espacial, tan accesible, divertido y emocionante. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un juegazo de la veterana Ocean. Si tienes oportunidad de hacerte con &eacute;l, no lo dudes ni un instante ya que, incluso en los modernos equipos de la actualidad, el juego se comporta a la perfecci&oacute;n, sin variar su velocidad de funcionamiento.</P></FONT>
<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>

<A HREF="simulab.htm"><font FACE="ARIAL"><B>[Títulos de Coleccionista]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







