<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodr&iacute;guez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Un a&ntilde;o de Macedonia.
</FONT>
</H3>

<font size=2 face=arial>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡Hemos cumplido un a&ntilde;o!. S&iacute;, el gran objetivo de cualquier publicaci&oacute;n, al comenzar a dar sus primeros "pasitos", es el de alcanzar un a&ntilde;o de existencia. Unos lo hacen a trav&eacute;s de 12 n&uacute;meros, otros con 6 y los m&aacute;s originales nos marcamos nuestro primer a&ntilde;o con 7 ejemplares. Todas las personas que integramos esta familia estamos muy contentos y, sobre todo, orgullosos de lo que hemos "parido".  Han sido muchas horas delante del monitor leyendo emails, haciendo art&iacute;culos, borrando p&aacute;rrafos, cont&aacute;ndonos nuestras vidas, ilusiones, opiniones, leyendo alg&uacute;n que otro chiste, discutiendo, decidiendo el mejor camino a tomar, corrigiendo cosas, anim&aacute;ndonos... En serio, son tantas cosas, an&eacute;cdotas, gente estupenda que conoces que... de poco valen todas las palabras que yo pueda poner. Esto hay que vivirlo y, despu&eacute;s, reflexionarlo. He aqu&iacute; esta especie de repaso que he preparado, en condici&oacute;n de coordinador, para uso y disfrute de nosotros mismos (nuestro ego lo ped&iacute;a a gritos).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hace m&aacute;s o menos un a&ntilde;o, cuando comenzaba el curso 1997/98, un se&ntilde;or llamado <B>Jos&eacute; Conde</B> o <B>Rewin,</B> para los amigos, me coment&oacute; que hab&iacute;a conseguido una p&aacute;gina web en <B>Geocities</B>. El caso es que Rewin me convenci&oacute; para meterme con el a "rellenar" la p&aacute;gina que acababa de conseguir. Al poco tiempo ya est&aacute;bamos discutiendo c&oacute;mo narices llamar a nuestra "criatura". "<I>Tenemos que poner una secci&oacute;n de 8 bits</I>", recuerdo que comentaba a Rewin, "<I>y algo de opini&oacute;n</I>", me dec&iacute;a el, "<I>y....</I> ". El caso es que, cuando miramos a la hoja de que nos hab&iacute;amos llevado para apuntar todo (¿d&oacute;nde estar&aacute; esa pieza de coleccionista ahora?), hab&iacute;a tal mezcla de temas que no ten&iacute;amos ni idea de qu&eacute; tipo de p&aacute;gina &iacute;bamos a crear. Hab&iacute;a programaci&oacute;n, m&uacute;sica, juegos, opini&oacute;n, una zona, c&oacute;mo no, de saludos... En fin un l&iacute;o. </P>
<P ALIGN="JUSTIFY">Iban pasando los d&iacute;as y Rewin iba metiendo ca&ntilde;a al tema de Geocities. Se hizo con un contador de visitas, aprendi&oacute; a moverse con soltura por la red y yo... ¡Yo le hab&iacute;a abandonado a su suerte!. La verdad es que no estaba nada motivado y, para colmo, ya me estaba empezando a "auto agobiar" por otros lares inform&aacute;ticos... En fin, que hasta que Rewin no me lanz&oacute; el primer "pu&ntilde;al" no me di en serio por aludido.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">El fue el primero que subi&oacute; algo a Geocities, el primero que puso un men&uacute; decente y el primero que se encarg&oacute; de buscar este genial nombre. Recuerdo nuestra primera "gran" aparici&oacute;n en sociedad. Hab&iacute;amos fundado "<B>Macedonia's World</B>". ¿El nombre?. S&oacute;lo recuerdo estar como un poseso, al lado de Rewin, diciendo uno y otro t&iacute;tulo para la p&aacute;gina hasta que Rewin solt&oacute; este. Ya os pod&eacute;is imaginar. Nos quedamos en silencio y empezamos a frotarnos la barbilla con un "<I>s&iacute;.....</I>" entre los labios. Y as&iacute; fue como decidimos llamarnos... La p&aacute;gina, eso s&iacute;, estaba vac&iacute;a. ¡Anda que no trabaj&oacute; el obrero que sal&iacute;a en el cartelito de <I>'Under Construction'</I>"!.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de que Rewin me lanzara una m&aacute;s que sonora indirecta y viendo que el proyecto del colega iba "pa´lante" no qued&oacute; m&aacute;s remedio que ponerse a realizar "algo". El caso es que, en el primer puente que hubo en octubre, Rewin aprovech&oacute; para regresar a casa. Un servidor decidi&oacute; quedarse y no se le ocurri&oacute; otra idea mejor que agarrar la pagina "por los cuernos" y ponerse a dise&ntilde;ar secciones, opciones, texto de encabezamiento, r&oacute;tulos, etc. Por cargarme hasta me cargu&eacute; el nombre del bueno de Rewin. Hab&iacute;a dejado de existir "Macedonian's World", ahora nos llam&aacute;bamos "<B>Macedonia</B> <B>Magazine</B>" y esa p&aacute;gina ideada por Rewin ya no era una p&aacute;gina "personal" sino una revista (y, mientras tanto, Rewin sin enterarse). </P>
<P ALIGN="JUSTIFY">Creo que aqu&iacute; traicion&eacute; las ideas de mi "socio". Rewin jam&aacute;s hab&iacute;a pensado en crear una revista sino una p&aacute;gina un tanto alocada de dos personajes inform&aacute;ticos bien distintos. Su idea era tener "algo" en Internet no complicarse la vida m&aacute;s de lo normal. Pero bueno, se fue a juntar con un experto en eso de a&ntilde;adir problemas y problemas a su existencia as&iacute; que cuando Rewin regres&oacute; del puente, ah&iacute; estaba yo, con una sonrisa de oreja a oreja ense&ntilde;&aacute;ndole el nuevo aspecto de nuestra "p&aacute;gina". Y... ah&iacute; estaba Rewin, con una sonrisa de oreja a oreja pensando en la que nos &iacute;bamos a meter con todo este tinglado... (y, por fortuna, lo que Rewin pens&oacute; ocurrir&iacute;a m&aacute;s tarde).</P>
<CENTER><TABLE><td>
<center><img src="jpg/cumple11.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1 face=arial>
<center>
<b>Así aparecía el primer número de Macedonia.</font></b>
</center></td>
</table></center>
<FONT color="#000000" size=2 face="Arial">
<br><br>
<P ALIGN=justify>

<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">A partir de ese momento me fui tomando el tema de la p&aacute;gina con mucha mayor responsabilidad. Incluso dej&eacute; aparcado otros proyectos que hab&iacute;a estado perfilando durante todo el verano. ¡Hab&iacute;a que impulsar la revista!. Pronto comenzaron a salir art&iacute;culos que no pararon hasta que pudimos hablar de el verdadero n&uacute;mero 1. Hab&iacute;a bastante material. Se empezaron cursos, se comentaron juegos, se hicieron art&iacute;culos de opini&oacute;n, se implant&oacute; una zona de descarga... y bueno, creo que el trabajo mereci&oacute; la pena. </P>
<P ALIGN="JUSTIFY">La parte gr&aacute;fica era muy rudimentaria (cosa que no acept&eacute; hasta empezar a sufrir las primeras indirectas) pero serv&iacute;a para salir del paso. ¡Qu&eacute; narices!, hab&iacute;a nacido Macedonia Magazine n&uacute;mero 1!.  A partir de aqu&iacute; todo ser&aacute; una locura. Una locura que, de ser llevada sobre los hombros de 2 personas, es llevada sobre los hombros de m&aacute;s de 20 de forma totalmente organizada.</P>
<BR>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A&uacute;n recuerdo ese primer aspecto de la revista, de c&oacute;mo pusimos los primeros anuncios en las news, de cu&aacute;n largo nos pareci&oacute; llegar a los primeros 1000 visitantes (¡Dios m&iacute;o, que suplico tuvimos que pasar! ) y, c&oacute;mo no, de la parte en la que tuvimos que presentarnos "en sociedad".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La primera edici&oacute;n de Macedonia se prolong&oacute; desde finales de Octubre - principios de Noviembre hasta el d&iacute;a 1 de Enero. Durante ese primer n&uacute;mero fueron apareciendo personas clave para la evoluci&oacute;n de este fanzine. Ah&iacute; tenemos a redactores, intocables, de la talla de <B>Antonio Montesinos</B>. Antonio fue una persona que se interes&oacute; y nos felicit&oacute; en nuestra iniciativa y, c&oacute;mo no, se sum&oacute; a nuestro equipo dotando a la publicaci&oacute;n de una calidad, en la redacci&oacute;n y presentaci&oacute;n de los art&iacute;culos, alt&iacute;sima. Antonio Montesinos es el colaborador m&aacute;s antiguo de Macedonia. Gracias Monte. </P>
<P ALIGN="JUSTIFY">Si hablamos de Antonio Montesinos tambi&eacute;n debemos de citar a <B>Miguel Angel S&aacute;ez</B>. Miguel Angel fue otra de las personas que se interes&oacute; en los comienzos aportando un extenso art&iacute;culo de opini&oacute;n que, m&aacute;s adelante, servir&iacute;a incluso para que otra persona, importante persona, hiciera un r&eacute;plica. Desgraciadamente los diversos asuntos de trabajo de Miguel han terminado priv&aacute;ndole de su participaci&oacute;n en nuestra particular familia. Gracias Miguel. </P>
<P ALIGN="JUSTIFY">Otro colaborador casual que mostr&oacute; un gran estima por Macedonia fue <B>Jos&eacute; Ignacio Canales</B> que puso un letrero bien grande en su p&aacute;gina personal para que la gente nos visitara.  M&aacute;s tarde, en el n&uacute;mero 4, podr&iacute;amos leer un art&iacute;culo de opini&oacute;n suyo. Gracias Jos&eacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Adem&aacute;s de estas personas, que fueron los primeros colaboradores reales de Macedonia, hab&iacute;a otros... Como os imaginar&eacute;is no qued&oacute; m&aacute;s remedio que "echar mano" de nuestros respectivos colegas. Gracias a ellos pudimos "engordar" la lista de miembros en el n&uacute;mero 2 del fanzine. Ah&iacute; estaba, y est&aacute;, salvando la secci&oacute;n de ocio <B>Pablo V&aacute;zquez (Ramis)</B>, y ah&iacute; estuvieron el inimitable <B>Javier Otero (Nuada)</B> y los incorregibles <B>Alvaro Toledo (Koka)</B> y<B> Jos&eacute; Angel D&iacute;ez (Vise)</B>. A Pablo V&aacute;zquez, este gran amigo, se le deben muchas cosas. Como son tantas no voy a ponerme a enumerar sus aportaciones a esta revista porque me llevar&iacute;a un buen rato pero si hay algo que le define es su labor callada y su capacidad de "aguante" ;). Gracias a todos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta serie de personas supusieron, sin ninguna duda, el gran apoyo para seguir haciendo algo. Pero, honestamente, la persona que m&aacute;s contribuy&oacute; a que Macedonia siguiera adelante fue <B>Juanjo Mu&ntilde;oz</B>. Juanjo, todo un se&ntilde;or miembro de "<I>Aventuras AD</I>"<I> </I>y responsable del fanzine m&aacute;s antiguo de Espa&ntilde;a sobre el mundo aventurero, esto es, el "<I>CAAD</I>", se dign&oacute;, a escribirnos cuando est&aacute;bamos comenzando. Ya os pod&eacute;is imaginar la ilusi&oacute;n y el orgullo que sentimos. ¡Juanjo era alguien perteneciente a la &eacute;poca de los 8 bits!. ¡A la &eacute;poca en la que nos formamos inform&aacute;ticamente!. ¡Pero si hab&iacute;amos jugado con juegos suyos en nuestra tierna infancia!. S&oacute;lo si se es un apasionado de este mundillo se puede entender lo que significa recibir emails de gente de relevancia en el panorama inform&aacute;tico. Tanto presente como pasado. Gracias Juanjo; no te puedes ni imaginar la obligaci&oacute;n moral, de continuidad, que imprimiste a los responsables de este fanzine. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A parte de la gran importancia de Juanjo, como se&ntilde;al indudable de que &iacute;bamos por el buen camino, hubo otras personas, pertenecientes a otras "instituciones", que tambi&eacute;n jugaron su particular papel en todo este "tinglado". Ah&iacute; esta la gente de "<I>Spanish Quest</I>", <B>Ra&uacute;l Alvarez</B> y <B>Daniel C&aacute;rdenas</B>... ¡Qu&eacute; os voy a contar yo que no sep&aacute;is ya!. Empezamos pidi&eacute;ndoles ayuda, que nos pusieran en sus links, y hemos terminado fusion&aacute;ndonos. El equipo que "<I>Spanish Quest</I>" ha traido a  Macedonia es de lujo. Colaboradores de Spanish Quest como <B>David Torrens</B>, fueron protagonistas del cambio de imagen totalmente radical que lucimos actualmente. Gracias SQ.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n habr&iacute;a que hablar de "<I>El Mundo del Spectrum</I>", es decir, de <B>Alejandro Ib&aacute;&ntilde;ez</B>. A &eacute;l tambi&eacute;n le debemos valiosos consejos en nuestros inicios como fanzine y a &eacute;l tambi&eacute;n le debemos que el apartado sobre los 8 bits est&eacute; alcanzando una importancia vital. Ah&iacute; le ten&eacute;is, macedonio perdido. Alex tambi&eacute;n fue de los grandes amigos que siempre confi&oacute; en nuestra proyecci&oacute;n como fanzine y cuya integraci&oacute;n en la nueva Macedonia tambi&eacute;n se hace imprescindible para hablar de una evoluci&oacute;n real. Gracias Alex.</P>
<P ALIGN="JUSTIFY">Otro de los que se han vuelto macedonio perdido ha sido el conocido director de "<I>Emulatron&iacute;a"</I>, <B>Jos&eacute; Antonio Albero</B>, es decir, Pts. Este gran "colega" ha pasado a formar parte de nuestro equipo. Aqu&iacute; tengo que decir que el bueno de Pts tambi&eacute;n nos ofreci&oacute; y, sobre todo, anim&oacute; en los comienzos para que sigui&eacute;ramos. La verdad es que fue una de las personas que m&aacute;s confianza ten&iacute;a en nuestro desarrollo como fanzine. Gracias Pepe.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No podr&iacute;a pasar a hablar de lo que supuso el n&uacute;mero dos del fanzine sin referirme tambi&eacute;n a <B>Stratos</B>. Esta asociaci&oacute;n, dirigida por el incansable <B>Antonio Arteaga</B>, se mostr&oacute; interesada desde un principio por el fanzine de hecho, fuimos recibidos con los brazos abiertos en su asociaci&oacute;n. Hechos como este animan mucho y suponen grandes dosis de autoestima pues Stratos no es, precisamente, una entidad "cualquiera". Stratos es la asociaci&oacute;n de desarrolladores independientes de habla hispana m&aacute;s importante que existe. Gracias Antonio.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si el n&uacute;mero uno se bas&oacute;, principalmente, en ir "de puerta en puerta" el n&uacute;mero 2 comenz&oacute; a atraer a m&aacute;s y m&aacute;s gente como colaboradores. El caso es que el salto fue abismal. Recuerdo que Pablo V&aacute;zquez y yo nos tiramos la semana antes de volver a casa, por vacaciones de Navidad, redise&ntilde;ando la revista de arriba abajo. Buscando fondos, creando nuevos r&oacute;tulos, nueva disposici&oacute;n... y, c&oacute;mo no, nuevo logo pues el que luc&iacute;amos en el n&uacute;mero uno era bastante lamentable. </P>
<P ALIGN="JUSTIFY"></P>
<CENTER><TABLE><td>
<center><img src="jpg/cumple12.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1 face=arial>
<center>
<b>El número 2 de Macedonia fue un salto en <br>cantidad y calidad decisivo.</font></b>
</center></td>
</table></center>
<FONT color="#000000" size=2 face="Arial">
<br><br>
<P ALIGN=justify>

<P ALIGN="JUSTIFY">El n&uacute;mero dos de Macedonia supuso un salto muy grande en calidad de dise&ntilde;o y de elegancia en general. Con tales "avales" ya s&iacute; que nos atrevimos a llamar a las puertas de "<I>MeriStation</I>" y, Voil&aacute;, fuimos recibidos por un amable y ocupado <B>Pep S&aacute;nchez</B> que no s&oacute;lo nos incorpor&oacute; a su particular "clan" o "alianza" sino que tambi&eacute;n nos sac&oacute; en las noticias. Como os pod&eacute;is imaginar el 3 de enero, que fue cuando salimos en las noticias de  MeriStation, recibimos un tir&oacute;n de visitas muy grande. Posiblemente el salir en las noticias de MeriStation fuera el mejor regalo de Navidad para Macedonia. </P>
<P ALIGN="JUSTIFY">Antes de dejar este p&aacute;rrafo dedicado a  MeriStation, tambi&eacute;n querr&iacute;a dar las gracias adelantadas a <B>F&eacute;lix de la Concepci&oacute;n</B> por su posterior ayuda para iniciar una secci&oacute;n que ha sido tan importante para nosotros como "Entrevistas y Firmas Invitadas" y, en especial, <B>a Jordi Espunya</B>, una persona excelente en todos los aspectos, una persona que "hay que conocer". Gracias MeriStation.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Fue en este n&uacute;mero cuando comenzaron a hacer acto de presencia m&aacute;s y m&aacute;s colaboradores que, con el paso del tiempo, se han convertido en piezas clave para la evoluci&oacute;n de esta publicaci&oacute;n. Algunos vinieron por propia iniciativa, otros fueron animados para que ingresaran y los terceros fueron "fichados" despu&eacute;s de la desaparici&oacute;n de los fanzines en los que hab&iacute;an colaborado. <B>Oscar Garc&iacute;a</B> pertenece al primer grupo. A&uacute;n recuerdo c&oacute;mo nos escribi&oacute; desde EEUU para felicitarnos por la publicaci&oacute;n... Obviamente no le permitimos que se "escapara" y para el n&uacute;mero tres ya ten&iacute;amos un curso sobre OpenGL que quitaba, y quita, el "hipo". Gracias a Oscar tuvimos un curso realmente de los que ponen los "pelos de punta" (de los que dan verdadero prestigio). Es m&aacute;s, somos el primer fanzine en castellano en lucir el curso m&aacute;s importante sobre OpenGL que hay actualmente. Gracias a Oscar Macedonia inici&oacute; otra etapa bien distinta en la revista pues pronto se dej&oacute; ver su ilusi&oacute;n por el fanzine. Una ilusi&oacute;n que acab&oacute; por contagiar al resto de miembros y por renovar las energ&iacute;as del director. Gracias Oscar por estar siempre ah&iacute;. </P>
<P ALIGN="JUSTIFY">Otro tanto se puede decir de <B>Jos&eacute; Antonio Su&aacute;rez</B> que, escribiendo a la redacci&oacute;n para mostrar su parecer acerca de un art&iacute;culo de opini&oacute;n, fue, casi, casi, obligado a unirse a filas. A el le debemos el estupendo y personal curso de Delphi (que es, todo hay que decirlo, uno de los estandartes de la Zona de Aula), entre otros y, c&oacute;mo no, la idea y programaci&oacute;n principal del visor de Macedonia. Jos&eacute; Antonio ha demostrado un saber estar impecable en todas las situaciones que ha atravesado el fanzine (algunas m&aacute;s crispadas de lo normal) mostrando una calidad excelente como amigo primero y como un profesional, como la copa de un pino, despu&eacute;s. Gracias Jos&eacute; por ser tan aut&eacute;ntico pese a comunicarnos por correo electr&oacute;nico.</P>
<P ALIGN="JUSTIFY">Estas dos estupendas personas, junto a <B>I&ntilde;aki Ecenarro</B>, miembro que fue "fichado" tras la desaparici&oacute;n del fanzine <I>Game Developer Forum</I>, trajeron una alt&iacute;sima calidad en sus art&iacute;culos. I&ntilde;aki aport&oacute;, entre otras cosas, los dos art&iacute;culos que hab&iacute;a publicado <I>en "Games Developer Forum</I>" sobre DirectX, la idea de la lista de correo privada y de noticias, las cuales se han convertido en algo b&aacute;sico para que este "tinglado" evolucionara. Gracias I&ntilde;aki por todas tus iniciativas. </P>
<P ALIGN="JUSTIFY">Creo que de no haber contado con los trabajos de estas tres personas Macedonia no hubiera crecido tan r&aacute;pidamente, o m&aacute;s a&uacute;n, Macedonia jam&aacute;s hubiera llegado nunca a tener la calidad que ahora luce.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro de los redactores cl&aacute;sicos de esta revista se llama <B>Miguel Angel Cividanes</B>. Pese a que siempre llega a "&uacute;ltima hora" a cada cita de Macedonia siempre lo hace de forma espectacular. A Miguel le debemos un mont&oacute;n de cosas como, por ejemplo, la creaci&oacute;n del apartado de soluciones de "Zona de Juegos" o las primeras grandes cr&iacute;ticas constructivas dispuestas a mejorar la publicaci&oacute;n. Miguel es uno de esos miembros de Macedonia polifac&eacute;ticos que es capaz de adaptarse a situaciones muy distintas aportando todo cuanto est&eacute; en su mano. Gracias por todo Miguel.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Otro de los grandes de Macedonia ha sido, y es, <B>David Garc&iacute;a</B>. Aunque no es inform&aacute;tico de pro, al igual que Miguel Angel Cividanes, s&iacute; que lleva "alma de Silicio". David fue literalmente fichado para Macedonia. Le escribimos para felicitarle por su p&aacute;gina e informarle que &iacute;bamos a incluirla en nuestro apartado de links y luego nos decidimos a animarle para que se uniera al equipo. Y ah&iacute; ten&eacute;is su estupendo legado. Un curso de programaci&oacute;n de scripts para mIRC extens&iacute;simo, y m&aacute;s que est&aacute;n por llegar, art&iacute;culos de opini&oacute;n o comentarios de juegos. Ultimamente el bueno de David anda bastante liado de trabajo pero eso s&iacute;, nos ha prometido que no nos dejar&aacute; y, de hecho, ha vuelto para este n&uacute;mero estrella con fuerzas m&aacute;s que renovadas. Gracias David.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque <B>Marta Ma&ntilde;anes</B> colabor&oacute; (y colabora de forma espor&aacute;dica ahora) durante el tiempo que el n&uacute;mero 2 estuvo "en el aire", no fue ni fichada ni escribi&oacute; para felicitarnos. Marta pertenece al grupo de personas que fueron "obligadas" a realizar algo. Te he dado la gracias por todo desde hace mucho m&aacute;s tiempo del que lleva Macedonia funcionando pero te las voy a volver a dar. Gracias Marta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Uno de los fugaces de Macedonia fue un misterioso <B>Chodak</B> que realiz&oacute; dos comentarios para nuestra secci&oacute;n de juegos. <B>Ricardo Carrero</B> tambi&eacute;n participar&iacute;a como colaborador casual haciendo un art&iacute;culo de opini&oacute;n.  Gracias a los dos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Toda esta gran cantidad de gente que se apunt&oacute; durante el tiempo que el n&uacute;mero 2 de Macedonia estaba "en la calle" fue realmente imprescindible para la buena marcha de la revista. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de que saliera el n&uacute;mero tercero, se produjo un gran cambio en la direcci&oacute;n de Macedonia. El verdadero creador de este "proyecto", Jos&eacute; Conde, ten&iacute;a que dejarnos. La verdad es que el bueno de Rewin ten&iacute;a un a&ntilde;o muy importante en su vida como universitario pues deb&iacute;a de sacar un n&uacute;mero considerable de asignaturas para sentenciar la carrera. Finalmente tom&oacute; la decisi&oacute;n adecuada e hizo el curso de su vida. Enhorabuena Rewin, pero para la pr&oacute;xima vez que decidas hacer algo parecido avisa y as&iacute; no sentiremos tanta verg&uuml;enza al ir a ver nuestras notas junto a las tuyas ;). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, que Macedonia quedaba "a mis manos". Afortunadamente esto no ha sido del todo cierto pues hemos formado un verdadero equipo y, al fin y al cabo, el rumbo de esta publicaci&oacute;n se lleva entre todos no entre uno.</P>
<P ALIGN="JUSTIFY">Y as&iacute;, sin quererlo, pasamos otro cap&iacute;tulo en nuestra breve pero intensa historia. El n&uacute;mero 3 empezaba a hacer crecer los cr&eacute;ditos de forma m&aacute;s que considerable y, c&oacute;mo no, atrajo a m&aacute;s y m&aacute;s personas que forman, ya, parte de la historia del fanzine. </P>
<P ALIGN="JUSTIFY"></P>
<TABLE align="left"><td>
<center><img src="jpg/cumple13.jpg" border=0></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1 face=arial>
<center>
<b>He aquí la primera numeración profesional<br> de mano de Santi.</font></b>
</center></td>
</table>
<FONT color="#000000" size=2 face="Arial">
<P ALIGN=justify>

<P ALIGN="JUSTIFY">Una de esas personas fue, sin duda, <B>Santiago Reinoso</B>. La historia es curiosa porque Santi, vino, por as&iacute; decirlo, para mostrarnos su trabajo a ver si le pod&iacute;amos publicar algo y, al final, fuimos nosotros los que le suplicamos que los publicara... El caso es que las aportaciones de Santiago han sido much&iacute;simas e imprescindibles en todos y cada uno de los aspectos imaginables que se esconden detr&aacute;s de una publicaci&oacute;n como esta. Es cierto, Santi es de esas personas que trabajan, por as&iacute; decirlo, "sin hacer ruido". Ni que decir tiene que con sus gr&aacute;ficos Macedonia termin&oacute; por consagrarse. Gracias Santi. Desde luego bien merece la pena crear cosas como esta aunque sea s&oacute;lo para conocer a gente como t&uacute;.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Pero no s&oacute;lo Santi ha sido una de las estupendas personas que conocimos y aglutinamos en el equipo. Ah&iacute; est&aacute; el se&ntilde;or <B>Carlos P&eacute;rez-G&aacute;ndaras,</B> otro de esos colegas que Internet te "brinda". Nos escribi&oacute; para felicitarnos y dejarnos "caer" su posible colaboraci&oacute;n y, bueno, ya os pod&eacute;is imaginar; nos lanzamos "a por el", como quien dice. A Carlos se le deben esos art&iacute;culos y reportajes que han dado a la "Zona de Juegos" un car&aacute;cter m&aacute;s solemne y profesional. Adem&aacute;s, en el momento en que le prepar&aacute;bamos un sitio en Macedonia, tuvo que tomar una decisi&oacute;n muy importante desde el punto de vista personal. Espero, Carlos, que esa decisi&oacute;n haya sido, a d&iacute;a de hoy, la m&aacute;s positiva para ti. Gracias por todo.</P>
<B><P ALIGN="JUSTIFY">Emilio Rubio</B>, un profesional como la copa de un pino, tambi&eacute;n se uni&oacute; al equipo durante el tiempo que estuvo el n&uacute;mero 4 a la vista. A Emilio se le deben los art&iacute;culos de SQL Server. Es una l&aacute;stima que hayamos perdido contacto con &eacute;l. De todas formas, esperamos que pronto se pueda poner en contacto con nosotros... Te esperamos Emilio.</P>
<P ALIGN="JUSTIFY">De Emilio pasamos a un aut&eacute;ntico fichaje de Macedonia, <B>Juan Manuel Hern&aacute;ndez</B> (<B>Diablillo</B>), que fue, literalmente, "contratado" en las news. Despu&eacute;s de observar como este experto en Ultima Online repart&iacute;a a diestro y siniestro instrucciones para los novatos en las lides de este popular juego, nos decidimos por ofrecerle un sitio en la revista. Y bueno, no s&oacute;lo no lo rechaz&oacute; sino que produjo, posiblemente, la primera gu&iacute;a hecha en Espa&ntilde;a sobre el Ultima On-Line (ahora continuada por otro gran maestro, Miguel Angel Cividanes). Jos&eacute; Manuel ha comunicado su marcha del equipo por diversos temas, entre ellos, la etapa final de su carrera. Desde aqu&iacute; un abrazo Juan y que sepas que te esperamos con los brazos abiertos para cuando decidas regresar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hasta aqu&iacute; hemos hablado de las vitales uniones al equipo que se produjeron en esa tercera edici&oacute;n sin embargo, tampoco hay olvidar que, tambi&eacute;n en ese n&uacute;mero, hab&iacute;a nacido la secci&oacute;n m&aacute;s prestigiosa de la revista, esto es, "Entrevistas y Firmas Invitadas". Por esta zona ha pasado gente muy importante dentro del mundo del videojuego en Espa&ntilde;a. Miembros de un grupo de desarrollo o, incluso, grupos enteros, tanto actuales como legendarios, han sido extensamente entrevistados. Al mismo tiempo que personalidades nos han honrado escribiendo algunas l&iacute;neas en forma de opini&oacute;n que son una delicia. </P>
<P ALIGN="JUSTIFY">Para el n&uacute;mero tres no pudimos empezar mejor. Ten&iacute;amos la entrevista m&aacute;s larga jam&aacute;s hecha a uno de los miembro de la cl&aacute;sica Aventuras AD y ya buen amigo de Macedonia, <B>Juanjo Mu&ntilde;oz</B> y, para rematar la faena, nos hicimos con los servicios de <B>Felix de la Concepci&oacute;n</B>, el conocido redactor de MeriStation que m&aacute;s en contacto ha estado y est&aacute;, con el "proyecto" "Blade". Muchas Gracias a los dos por aportarnos esa ayuda tan necesaria.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y seguimos avanzando para pasar al que fue autentico punto de inflexi&oacute;n de la revista. El n&uacute;mero 4. Este n&uacute;mero lucir&iacute;a, por fin, un gr&aacute;fico hecho por un dibujante profesional; Santiago Reinoso dise&ntilde;ar&iacute;a el emblema de la revista.</P>
<P ALIGN="JUSTIFY">Otro e los hechos m&aacute;s importantes del n&uacute;mero cuatro fue el referido al traslado de servidor. Dejamos Geocities, que nos hab&iacute;a visto nacer, para irnos a Ciudad Futura, que nos ha visto en plena "adolescencia". En Ciudad Futura tuvimos acceso a un espacio ilimitado para alojar nuestro contenido y, sobre todo, tuvimos acceso a una gran cantidad de nuevos lectores. Ni que decir tiene que aumentamos, en los primeros 15 d&iacute;as, nuestras visitas en un 110% / 130%. Lo m&aacute;ximo lleg&oacute; al tercer d&iacute;a de estar en Ciudad Futura. S&iacute;, cuando alcanzamos los 333 hits reales. Esta cifra es todo un r&eacute;cord en nuestra historia. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como es l&oacute;gico la salida en Ciudad Futura atrajo a m&aacute;s y m&aacute;s colaboradores. Miembros que ya tienen su peso espec&iacute;fico en el equipo. Ah&iacute; tenemos a los dos "Pedros". Por un lado a <B>Pedro Ferrera</B> que nos trajo un curso sobre Hacking. Pese a que m&aacute;s de una vez hemos tenido miedo de ser censurados por el curso de Pedro Ferrera, hemos decidido mantenerlo porque son tantas y tan buenas las cosas que explica nuestro redactor que ser&iacute;a una locura omitirlo. Conviene aclarar que nunca hemos incitado a nadie a realizar actos que se consideren delito pero est&aacute; claro que la informaci&oacute;n es libre y cada uno debe de ser consciente de lo que puede y no puede hacer. <B>Pedro A. Carrasco</B>, ha sido el encargado de traer el, siempre querido, curso sobre Linux a Macedonia. La verdad es que un fanzine que aborde los temas de programaci&oacute;n sin un curso de Linux es algo realmente triste. Pedro se ha encargado de cerrar ese &aacute;rea con unas excelentes aportaciones, con una calidad de matr&iacute;cula y, sobre todo, con una eficiencia estupenda. As&iacute;, con los trabajos de estos dos miembros del equipo, pudimos encontrar sentido a nuestro nombre en la secci&oacute;n de Aula. Infinitas gracias a los dos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otras personas que aparecer&iacute;an en el n&uacute;mero 4 ser&iacute;an <B>Juan Carlos Gilarranz, Antonio Monreal</B>, <B>Felipe Ram&iacute;rez</B> y <B>Francisco Dom&iacute;nguez</B>. <B>Juan Carlos</B> es otra de esas personas s&uacute;per ocupadas de Macedonia. Este miembro trajo los cursos sobre Word, particip&oacute; en los art&iacute;culos de opini&oacute;n y fue, todo hay que decirlo, el primero que intent&oacute; establecer una "quedada" entre los miembros de Macedonia (repartidos por toda Espa&ntilde;a, Argentina y M&eacute;xico). <B>Antonio Monreal</B>, por su parte, tambi&eacute;n fue una de las personas que se incorporar&iacute;a a Macedonia en el n&uacute;mero 4. Aport&oacute;, y aporta, importantes trabajos a la "Zona de Juegos" adem&aacute;s de cr&iacute;ticas constructivas para seguir mejorando todos los aspectos de la revista. <B>Felipe Ram&iacute;rez</B> fue uno de los primeros miembros que se volc&oacute; con la reci&eacute;n nacida secci&oacute;n de Internet en Macedonia comandada, c&oacute;mo no, por Antonio Montesinos. Felipe ayud&oacute; a construir esta secci&oacute;n y se mostr&oacute;, desde el principio, como un fiel miembro de nuestra familia. <B>Francisco Dom&iacute;nguez</B> fue el primer valiente que se atrevi&oacute; a trabajar en una secci&oacute;n de Hardware. Por desgracia el tiempo, las ocupaciones y, todo hay que decirlo, el n&uacute;mero de personas dispuestas a ayudarle con la secci&oacute;n, le apartaron de tal proyecto. Pero como "Paco es mucho Paco" en el n&uacute;mero actual, el 7, ha vuelto a la carga con la secci&oacute;n (incluida en la secci&oacute;n de "Aula Macedonia") creando art&iacute;culos excelentes que le han convertido ya en un miembro imprescindible para el futuro de Macedonia. Mi admiraci&oacute;n, Paco, por esta exhibici&oacute;n de energ&iacute;a que llevas dentro. Much&iacute;simas gracias a todos vosotros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otros dos profesionales de una indiscutible importancia en Macedonia son <B>Koldobica Meso Ayerdi</B> y <B>Carlos Alonso</B>. El primero escribi&oacute; a Macedonia solicitando informaci&oacute;n para as&iacute; poder completar un trabajo que estaba haciendo sobre los "fanzines en Internet". No s&oacute;lo le contestamos sino que le ofrecimos un sitio en Macedonia. Creo que pocas veces se puede tener la suerte que tuvimos al hacernos con un "monstruo" de la talla de Koldo. La calidad de nuestro amigo a la hora de escribir informes o reportajes hace palidecer a m&aacute;s de una revista comercial.  Muchas gracias Koldo.</P>
<P ALIGN="JUSTIFY">Y qu&eacute; decir de el inimitable <B>Carlos Alonso</B>. Este Argentino que lleg&oacute; justo al cierre de la edici&oacute;n del n&uacute;mero 4 de Macedonia, ha sido uno de los principales motores de la misma desde que se uni&oacute; a nuestra familia. A Carlos se le deben muchas cosas. Desde traer, en sus primeros d&iacute;as como miembro, un excelente ajetreo a nuestra lista de correo, hasta haber dado ese toque de profesionalidad en los dise&ntilde;os de Macedonia. Ah&iacute; ten&eacute;is nuestro nuevo logo, toda una obra "Made in Carlos Alonso", o la idea de implementar un mapa como men&uacute; en "Macedonia Off-Line". No cambies nunca Carlos. </P>
<CENTER><TABLE><td>
<center><img src="jpg/cumple14.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1 face=arial>
<center>
<b>La evolución de los logos de Macedonia está íntimamente<br> 
relacionada con etapas concretas de la publicación.
</font></b>
</center></td>
</table></center>
<FONT color="#000000" size=2 face="Arial">
<br><br>
<P ALIGN=justify>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el apartado de "Entrevistas y Firmas Invitadas" nos volvimos a vestir con nuestras mejores galas. En esta ocasi&oacute;n nos hicimos con la entrevista a la persona que hab&iacute;a creado la &uacute;ltima gran producci&oacute;n de software en nuestro pa&iacute;s. Era <B>Daniel Navarro</B>, el creador del "<I>DIV Games Studio"</I>. Tengo que mostrar desde aqu&iacute; mi asombro por su efectividad no s&oacute;lo en ponerse en contacto con nosotros sino en responder a la extensa entrevista en tiempo record. Lastima que, despu&eacute;s de que se viera publicada, no volvi&eacute;ramos a saber m&aacute;s de &eacute;l. Mucha suerte con tus futuros "DIV's" y recuerda que a&uacute;n esperamos noticias tuyas despu&eacute;s de la publicaci&oacute;n de la entrevista ;).</P>
<P ALIGN="JUSTIFY">Si en el n&uacute;mero 2 "secuestramos" a Felix de la Concepci&oacute;n, en el n&uacute;mero 4 luc&iacute;amos un estupendo art&iacute;culo de <B>Pep S&aacute;nchez</B>, el m&aacute;ximo responsable de <I>MeriStation</I>. En el, tuvimos el placer de leer su reflexi&oacute;n sobre lo que hab&iacute;a significado un a&ntilde;o al frente de esta intocable publicaci&oacute;n. Publicaci&oacute;n que es la mejor que existe en todo Internet sobre el mundo del software de entretenimiento en general. De nuevo, luc&iacute;amos nuestras mejores galas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y otro n&uacute;mero m&aacute;s que pasar&aacute; a nuestra historia entre &aacute;nimos, despu&eacute;s del lanzamiento en el seno de la lista, y entre un largo respiro por parte de todos despu&eacute;s de haber estado trabajando durante 60 d&iacute;as entre ex&aacute;menes, mucho caf&eacute; y ganas de que llegaran unas vacaciones tan merecidas (que seguir&iacute;an, para algunos, dedicadas a Macedonia). ¡Ya ten&iacute;amos 5 n&uacute;meros a nuestras espaldas!. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Durante el tiempo que estuvo editado el n&uacute;mero 5 se produjeron los m&aacute;s importantes cambios ocurridos desde que... pues desde que se uni&oacute; el primer colaborador. El caso es que el n&uacute;mero de personas que participaban activamente en esta revista se hab&iacute;a multiplicado y resultaba muy dif&iacute;cil que la coordinaci&oacute;n se realizara por una sola figura. Se tom&oacute;, pues, la decisi&oacute;n de dividir en "parcelas de responsabilidad" la publicaci&oacute;n.  Se cre&oacute; la figura de subdirector, la de dise&ntilde;ador y grafista, la de un administrador de la lista de correo, un coordinador del proyecto Off-Line, se dividieron los apartados de la revista en distintas coordinaciones, se establecieron redactores y se especificaron los colaboradores casuales. Adem&aacute;s de esta perfecta pir&aacute;mide de responsabilidades, tambi&eacute;n se elabor&oacute; el primer FAQ, serio, para que hubiera unas reglas m&aacute;s o menos "est&aacute;ndar" de trabajo. Todas estas decisiones, ahora que me paro a reflexionar, quiz&aacute;s fueron excesivamente pretenciosas o exageradas pero no es menos cierto que sin ellas Macedonia no hubiera crecido. Es bueno valorar, incluso m&aacute;s de la cuenta, cualquier tipo de iniciativa para animarte a dar lo m&aacute;ximo de ti mismo, y de los que te rodean, en ella.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Durante el tiempo que se edit&oacute; el n&uacute;mero 5 aparecieron en escena importantes personas que han aportado ideas y formas imprescindibles para la publicaci&oacute;n. <B>Andr&eacute;s Almansa</B> pertenece al grupo de profesionales en activo de Macedonia. Andr&eacute;s ha sido y es una pieza de gran valor como lo demuestran sus trabajos concernientes a redes. Andr&eacute;s es todo un autodidacta digno de admiraci&oacute;n. Gracias Andr&eacute;s. </P>
<B><P ALIGN="JUSTIFY">Miguel Angel Fern&aacute;ndez</B> fue otra de las personas que han dado a Macedonia una calidad exquisita. Este incansable colaborador, programador y escritor ocasional, pertenece a esa clase de "lujos" con los que hemos ido creciendo y evolucionando. Miguel tiene muchos compromisos externos y cuando lees sus trabajos se nota su gran calidad. Gracias Miguel, no s&eacute; de donde sacas tiempo para todo.</P>
<B><P ALIGN="JUSTIFY">Gustavo Herrera</B> es otro de los redactores "internacionales" de Macedonia. Gustavo ha tra&iacute;do trabajos claros, elaborados e interesantes a la revista. Posiblemente lo trabajos que demuestran la cara m&aacute;s humana de la inform&aacute;tica. Gustavo es el primer miembro Mexicano de la revista. Gracias Gustavo.</P>
<P ALIGN="JUSTIFY">Otro de los que se han hecho un merecido sitio en Macedonia ha sido <B>Samuel R&iacute;squez</B>. El joven Samuel ha aportado constantemente ideas a la publicaci&oacute;n, ha metiendo "ca&ntilde;a" al director y se ha hecho con un sitio bien merecido como redactor destacado. Samuel es uno de los personajes inimitables de Macedonia. Gracias Samuel.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El apartado estrella del n&uacute;mero 5 estuvo ocupado por trabajos realmente extraordinarios. Trabajos que pusieron el list&oacute;n de calidad de la publicaci&oacute;n muy, muy alto. Por un lado en "Entrevistas" tuvimos el honor de tener en la revista al grueso de <B>P&eacute;ndulo</B> <B>Studios</B>, esto es, <B>Rafael Latiegui</B>, <B>Ram&oacute;n Hern&aacute;ez</B> y <B>Felipe G&oacute;mez</B>. Estas conocidas personas no s&oacute;lo nos regalaron la entrevista m&aacute;s larga que han concedido sino que tambi&eacute;n nos obsequiaron con alguna que otra exclusiva. Desde aqu&iacute; un gran saludo a los tres y, en especial, a Rafael Latiegui, un estupendo "colega". Gracias Rafa.</P>
<P ALIGN="JUSTIFY">En el apartado de "Firmas Invitadas", tuvimos la oportunidad de leer un art&iacute;culo muy interesante de <B>Antonio Arteaga</B>. Antonio es el coordinador de <B>Stratos</B>, asociaci&oacute;n sobre la que sobran cualquier tipo de comentarios. Con su art&iacute;culo descubrimos muchas de las verdades que se esconden detr&aacute;s de la producci&oacute;n de un juego en nuestro pa&iacute;s. Su "Firma Invitada" es una de los m&aacute;ximos tesoros que guarda la publicaci&oacute;n. Gracias Antonio.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y del n&uacute;mero 5 saltamos al 6. La edici&oacute;n sexta de la revista fue lanzada en verano, a principios de agosto m&aacute;s exactamente.  Fue un n&uacute;mero muy tranquilo. No tuvimos a tiempo la entrevista que realizamos a algunos de los m&iacute;ticos de Opera Soft, esto es<B>, Jos&eacute; Antonio Morales, Paco Su&aacute;rez y Paco Men&eacute;ndez</B> a los que aprovecho para darles gracias infinitas por la paciencia que han tenido esperando a ver su entrevista publicada en este n&uacute;mero. El apartado de "Firmas invitadas" tambi&eacute;n estuvo vac&iacute;o en el n&uacute;mero 6 pues la persona a la que invitamos no pudo comprometerse. Todos estos factores obligaron a realizar un n&uacute;mero 100% macedonio, es decir, s&oacute;lo con aportaciones del equipo. Sin ninguna entrevista "bomba" o sin ning&uacute;n art&iacute;culo de alguien conocido del mundillo. El resultado fue un n&uacute;mero muy personal, muy aut&eacute;ntico y, sobre todo, un n&uacute;mero que volvi&oacute; a situar el list&oacute;n m&aacute;s alto a&uacute;n pues pasamos, y de largo, el n&uacute;mero de art&iacute;culos con respecto a la edici&oacute;n quinta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A partir de la edici&oacute;n sexta de Macedonia van a suceder un mont&oacute;n de cosas que han desembocado en un n&uacute;mero, en una revista, madura. Para empezar se consum&oacute;, despu&eacute;s de numerosos FAQ, c&oacute;mo ser&iacute;a la uni&oacute;n del fanzine "<I>Spanish Quest"</I> en Macedonia y, por otro lado, se defini&oacute; el nuevo formato de la revista con el fin de poder albergar, de una forma inteligente, todo el contenido de Macedonia iba a tener para la edici&oacute;n s&eacute;ptima. Aqu&iacute; es donde entr&oacute; en escena otra de las personas que han permitido alcanzar tal madurez; <B>Albert Feliu.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Albert ha sido el encargado de coger las riendas del dise&ntilde;o y disposici&oacute;n de la revista. Gracias a Albert Macedonia tiene un dise&ntilde;o robusto y digno capaz de albergar todo lo que se nos "venga encima". La incorporaci&oacute;n de Albert al equipo se debe a una confianza y seguridad en nosotros mismos plena. </P>
<P ALIGN="JUSTIFY">A mediados de septiembre, cuando comenz&oacute; a plantearse en serio la remodelaci&oacute;n de la p&aacute;gina, nos dimos cuenta de que la tarea realizar era tit&aacute;nica. Ya no era cuesti&oacute;n de hacer unos cuantos archivos .htm en forma de &iacute;ndice e ir insertando enlaces como hasta ahnora. No. Todo iba "m&aacute;s all&aacute;" que esa gran simpleza Deb&iacute;amos de alcanzar una soluci&oacute;n de compromiso entre elegancia, carga gr&aacute;fica, flexibilidad de lectura entre distintos navegadores y, c&oacute;mo no, facilidad de acceso a la informaci&oacute;n de Macedonia. Las tareas de direcci&oacute;n y las propias habilidades en dicha &aacute;rea imposibilitaban que yo pudiera llevar la carga en todos esos temas. Se hac&iacute;a necesario que alguien del equipo se encargara de mantener la Web de forma exclusiva. El problema estaba en que no hab&iacute;a nadie del equipo con tiempo suficiente como para poder "tirar del carro". </P>
<P ALIGN="JUSTIFY">Para intentar solucionar el problema no qued&oacute; m&aacute;s remedio que poner un anuncio en la p&aacute;gina solicitando a un WebMaster de calidad. Aunque todos sab&iacute;amos que conseguir a alg&uacute;n valiente con la calidad suficiente como para llevar todo el tinglado era ciertamente imposible hab&iacute;a que intentarlo. Y as&iacute;, al cabo de unos 5 o 6 d&iacute;as, recibimos noticias de Albert. Much&iacute;simas gracias por todo Albert.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El n&uacute;mero 7 de Macedonia puede considerarse el emblema de la publicaci&oacute;n. Detr&aacute;s de esta edici&oacute;n se esconden cantidades ingentes de problemas que hemos tenido que superar. Todos estos problemas, que fueron maldecidos en un principio, han venido bien para que hayamos evolucionado. S&iacute;, efectivamente ha sido bueno el tener que encontrar f&oacute;rmulas para poder salir al paso, para demostrarnos que Macedonia es mucho m&aacute;s que cualquier obst&aacute;culo que haya podido surgir o pueda surgir, que lo que hemos construido sigue con tanta energ&iacute;a como el primer d&iacute;a y, sobre todo, para ver c&oacute;mo uno se siente orgulloso de estar metido el algo como esto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Gracias a todos. A los lectores que nos han visitado en alguna ocasi&oacute;n, a los que han escrito para animarnos, a las personalidades que nos han tomado en serio, a las entidades y grupos que nos han ayudado a salir adelante y, desde lo personal, a todos los colegas del equipo; merece la pena montar cosas como esta s&oacute;lo para conocer a gente como vosotros.</P></FONT></BODY>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
