<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>A</b></font>nexos / Otros.</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Características del Delphi 4 (1).
</H3>

<FONT color="#000000" size=2 face="arial">
<br>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
<FONT FACE="Arial" SIZE=2></P>
<P ALIGN="JUSTIFY">
<h4>Sobrecarga de m&eacute;todo</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Con el soporte de sobrecarga de m&eacute;todos, el dise&ntilde;o de objetos que son m&aacute;s f&aacute;ciles de utilizar se ha simplificado enormemente. Los objetos pueden ahora tener m&aacute;s de un m&eacute;todo con el mismo nombre; como resultado de ello, la interoperatividad entre objetos se facilita enormemente.</P>
<h4>Arrays din&aacute;micos</H4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Con el soporte de arrays din&aacute;micos, Delphi soporta ahora una estructura de datos a la medida de cualquier necesidad. Los arrays din&aacute;micos simplifican enormemente la utilizaci&oacute;n y reutilizaci&oacute;n de memoria. Los arrays din&aacute;micos especifican informaci&oacute;n sobre el tipo (el n&uacute;mero de dimensiones y el tipo de los elementos) pero no el n&uacute;mero de elementos.</P>
<h4>Enteros de 64 bits</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Para aplicaciones que requieren el uso de n&uacute;meros de gran magnitud, Delphi ahora soporta la creaci&oacute;n de enteros de 64 bits.</P>
<h3>MENOR TIEMPO DE COMERCIALIZACION</h3>
<h4>IDE AppBrowser</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El nuevo IDE AppBrowser incrementa enormemente la productividad del desarrollador simplificando el proceso de leer, escribir y examinar c&oacute;digo. El editor de c&oacute;digo facilita ahora la tarea de navegar dentro de una unidad o entre unidades asociadas. La met&aacute;fora del editor es ahora similar a un navegador web que permite al desarrollador examinar el c&oacute;digo del proyecto. El IDE aprovecha ampliamente las funciones del IntelliMouse de Microsoft, manteniendo al desarrollador centrado en el c&oacute;digo en lugar de en el IDE.</P>
<h4>Explorador de c&oacute;digos</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El c&oacute;digo es ahora mucho m&aacute;s f&aacute;cil de comprender y mantener con el examinador de c&oacute;digo, que mantiene un TreeView estructurado activo de la unidad actual. Esta vista estructurada se convierte en un &iacute;ndice dentro del c&oacute;digo fuente, facilitando el proceso de codificaci&oacute;n completo.</P>
<h4>El gestor de proyectos avanzado facilita a&uacute;n m&aacute;s complejos desarrollos</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 incluye el nuevo gestor de proyectos avanzado para la sencilla compilaci&oacute;n en varios objetivos, como archivos EXE y DLL. Una aplicaci&oacute;n puede consistir en dos proyectos; uno para un ejecutable, uno para una DLL. Ahora se puede trabajar y crear ambos proyectos al mismo tiempo a&ntilde;adiendo los proyectos al mismo grupo de proyectos. Esto mejora enormemente la habilidad para compartir unidades entre varios proyectos.</P>
<h3>CODEINSIGHT</h3>
<h4>Asistente de finalizaci&oacute;n de clases</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El asistente de finalizaci&oacute;n de clases facilita enormemente el mantenimiento de la definici&oacute;n y la implementaci&oacute;n de las clases. Para desarrolladores principiantes y avanzados, esta funci&oacute;n mejorar&aacute; enormemente la productividad. Para el principiante que no se encuentre todav&iacute;a del todo c&oacute;modo con la sintaxis de las clases de Delphi, el asistente de finalizaci&oacute;n de clases reduce enormemente el conocimiento necesario para ello. La productividad del desarrollador avanzado se elevar&aacute; exponencialmente cuando, de la tediosa tarea de terminar el c&oacute;digo requerido para crear clases, se encargue este innovador asistente. Este asistente es una Two-Way Tool, que utiliza avanzadas t&eacute;cnicas de an&aacute;lisis de c&oacute;digo de fondo para estar totalmente sincronizado con el c&oacute;digo de la clase en todo momento.</P>
<h4>Ayuda de Symbol Insight</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>El nuevo Symbol Insight facilita enormemente el proceso de escribir c&oacute;digo. Mientras est&aacute; codificando, el desarrollador obtiene acceso a la informaci&oacute;n que el compilador de fondo almacena sobre cada s&iacute;mbolo. Esta funci&oacute;n le da una idea al desarrollador en el momento del dise&ntilde;o sobre los s&iacute;mbolos que se van a procesar y utilizar en el momento de la ejecuci&oacute;n, reduciendo as&iacute; la confusi&oacute;n.</P>
<h4>Asistente de plantillas de c&oacute;digo</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Proporciona plantillas de c&oacute;digo est&aacute;ndares para sentencias como IF, FOR, WHILE y CASE de modo que la sintaxis de la programaci&oacute;n sea siempre correcta. En el editor, basta con iniciar una sentencia de c&oacute;digo para que Delphi 4 se encargue de derminarla, reduciendo as&iacute; errores y acelerando el desarrollo. Delphi 4 permite adem&aacute;s a los desarrolladores a&ntilde;adir sus propias plantillas de c&oacute;digo de modo que el entorno de desarrollo est&eacute; personalizado para sus est&aacute;ndares corporativos.</P>
<h4>Asistente de finalizaci&oacute;n de c&oacute;digo</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Ayuda a los desarrolladores en el uso de la biblioteca de componentes visuales o de sus propios componentes. A medida que se escribe, Delphi 4 proporciona autom&aacute;ticamente la lista de propiedades, m&eacute;todos o nombres de evento para el componente dado. Ya no es necesario recordar los m&eacute;todos o nombres de propiedades, o consultar la ayuda. Esto ahorra un valioso tiempo de desarrollo y facilita la reducci&oacute;n de la curva de aprendizaje de Delphi.</P>
<h4>Asistente de par&aacute;metro de c&oacute;digo</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Muestra autom&aacute;ticamente en una ventana de ayuda ToolTip par&aacute;metros para procedimientos, funciones, m&eacute;todos y eventos a medida que el desarrollador los utiliza en el c&oacute;digo. Esto ahora un valioso tiempo eliminando la navegaci&oacute;n en el editor, poniendo a disposici&oacute;n la informaci&oacute;n cuando se necesita.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Tambi&eacute;n reduce los errores asegur&aacute;ndose de que los par&aacute;metros de funci&oacute;n se pasan en el orden correcto de la declaraci&oacute;n.</P>
<h4>Creaci&oacute;n de componentes visual</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Simplifica la capacidad de reutilizaci&oacute;n de componentes introduciendo creaci&oacute;n de componentes visuales. Los desarrolladores pueden crear f&aacute;cil e instant&aacute;neamente componentes combinados con el c&oacute;digo asociado, y situar del nuevo componente en la p&aacute;gina de paletas de Delphi. Los desarrolladores pueden entonces reutilizar estos objetos en el mismo proyecto o en otros, facilitando y acelerando as&iacute; el desarrollo.</P>
<h4>Ayuda de la Evaluaci&oacute;n de expresiones</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>La ayuda para la Evaluaci&oacute;n de expresiones hace que el c&oacute;digo sea m&aacute;s comprensible y f&aacute;cil de depurar. Esto ahorra tiempo de desarrollo y permite que se comercialicen m&aacute;s deprisa aplicaciones robustas. La Ayuda del Evaluador de expresiones permite al desarrollador situar el cursor sobre un objeto, una variable, un par&aacute;metro, una constante o cualquier otra expresi&oacute;n, y ver el valor asignado en una ventana de ayuda ToolTip.</P>
<h4>Depuraci&oacute;n DLL</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Permite al desarrollador depurar DLL dentro del entorno Delphi. No es necesario un programa de depuraci&oacute;n diferente y costoso para poder crear aplicaciones complejas que contienen DLL. Simplemente estableciendo la aplicaci&oacute;n principal y un punto de control en la DLL, el desarrollador ahorra tiempo en la creaci&oacute;n y depuraci&oacute;n de DLL para su uso en WebServer y otras herramientas.</P>
<h3>DEPURACION AVANZADA PARA COMERCIALIZAR PROYECTOS EN MENOS TIEMPO</h3>
<h4>Vista de m&oacute;dulo para una depuraci&oacute;n detallada de bajo nivel</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Se puede utilizar la vista de m&oacute;dulo para ver distintos m&oacute;dulos, como .EXE y DLL, dentro de una sola sesi&oacute;n de depuraci&oacute;n. La vista de m&oacute;dulo es una vista en tres partes que muestra informaci&oacute;n detallada sobre los distintos m&oacute;dulos que son cargados por el proceso que est&aacute; siendo depurado.</P>
<h4>Registro de eventos para detectar problemas dif&iacute;ciles de producirse </h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>Tambi&eacute;n se puede ver un registro de eventos desde el depurador. Muestra mensajes de control de proceso, mensajes de puntos de control, mensajes OutputDebugString y mensajes de ventana. Utilizando el men&uacute; local se puede vaciar el registro de eventos, guardar el registro como archivo de texto, a&ntilde;adir un comentario al registro y configurar sus opciones.</P>
<h4>Puntos de control: DataWatch</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El depurador soporta ahora puntos de control DataWatch, que le permiten detectar complejos problemas de puntero. Cuando se configura, el depurador se bloquea si la memoria se escribe en una determinada direcci&oacute;n. Se puede establecer un punto de control DataWatch de dos maneras.</P>
<h4>Depuraci&oacute;n de DLL integrada</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 permite al desarrollador depurar DLL dentro del entorno Delphi. No es necesario un programa de depuraci&oacute;n diferente y costoso para crear complejas aplicaciones que contengan DLL. Simplemente estableciendo la aplicaci&oacute;n principal y estableciendo un punto de control en la DLL, el desarrollador ahorra tiempo creando y depurando DLL para su uso en WebServer y otras herramientas.</P>
<h4>Inspecci&oacute;n autom&aacute;tica de variables locales para productividad en la depuraci&oacute;n</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Estando en el modo de depuraci&oacute;n, se pueden ver las variables locales de la funci&oacute;n actual. Para ello, se puede seleccionar Run | Inspect local variables y las variables que est&eacute;n al alcance se mostrar&aacute;n y actualizar&aacute;n autom&aacute;ticamente. Esto aumenta la productividad de la depuraci&oacute;n.</P>
<h4>Depuraci&oacute;n remota</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>La depuraci&oacute;n remota facilita enormemente el control de objetos en m&aacute;quinas remotas. Se ha simplificado enormemente la compleja tarea de la depuraci&oacute;n de varios procesos.</P>

<h3>EL SOPORTE MEJOR Y MAS COMPLETO PARA EL ENTORNO WINDOWS</h3>
<h4>Acoplamiento</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los desarrolladores pueden crear visualmente aplicaciones con acoplamientos de ventanas sin escribir c&oacute;digo. A medida que las aplicaciones se han hecho cada vez m&aacute;s complejas y ricas en funciones, se ha hecho importante permitir a los usuarios finales un mayor grado de control sobre el modo de personalizar el entorno de sus aplicaciones. Con Delphi, la complejidad de las aplicaciones puede gestionarse mediante la introducci&oacute;n de acoplamiento de formularios. Los formularios, que normalmente flotan libremente, pueden ahora acoplarse uno a otro de modo que se junten, pudiendo as&iacute; organizarse mejor la pantalla. Delphi ha simplificado enormemente esta t&eacute;cnica de interfaz de usuario gr&aacute;fica avanzada normalmente muy dif&iacute;cil. </P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Con esta funci&oacute;n acoplamiento avanzado, la capacidad de utilizaci&oacute;n de Delphi y las aplicaciones creadas, se incrementan enormemente. Esto significa aplicaciones m&aacute;s r&aacute;pidas de aprender a manejar.</P>
<h4>ControlBar</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>El nuevo componente de barra de control reduce enormemente la complejidad de la creaci&oacute;n de interfaces de usuario, que se parecen al funcionamiento y aspecto de Microsoft Office 97. El usuario final de estas aplicaciones tiene control total sobre la ubicaci&oacute;n de las barras de herramientas en un formulario. La ControlBar puede actuar como un contenedor de acoplamiento para cualquier control Delphi, ofrece mucha m&aacute;s flexibilidad y es m&aacute;s intuitiva en operaciones de gesti&oacute;n de capas y arrastrar y soltar. </P>
<h4>Controles comunes de Windows 98</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>Para aplicaciones espec&iacute;ficamente destinadas a cumplir los est&aacute;ndares de la Interfaz de Usuario de Windows 98, Delphi incluye NUEVOS componentes de Windows 98 para soportar funciones como MonthCalendar, PageScroller y Flat Scrollbars. Con los nuevos componentes de Windows 98, se pueden dise&ntilde;ar elegantes aplicaciones aptas para Windows 98, y a&ntilde;adirles potencia con componentes reutilizables.</P>
<h4>Soporte de IntelliMouse</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 proporciona soporte total del SDK del IntelliMouse de Microsoft. Este soporte permite al usuario final de su aplicaci&oacute;n desplazarse, ampliar la visualizaci&oacute;n y navegar libremente sin retirar la mano del rat&oacute;n.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Utilizando la rueda, los usuarios finales de sus aplicaciones pueden desplazarse suavemente por las pantallas de informaci&oacute;n, y ampliar la visualizaci&oacute;n de los datos en lugar de tener que buscar barras de desplazamiento, botones y men&uacute;s en el formulario.</P>
<h4>ActionLists</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>Las ActionLists reducen la complejidad de la creaci&oacute;n de interfaces de usuario gr&aacute;ficas modernas y complejas. Las ActionLists permiten al desarrollador una posici&oacute;n convenientemente centralizada para manejar la respuesta a los comandos de usuario. Proporciona control sobre elementos de la interfaz de usuario como men&uacute;s y botones, y sobre c&oacute;mo responden a los comandos de usuario. Delphi lleva de nuevo el desarrollo orientado a objetos al siguiente nivel, permitiendo al desarrollador separar la actividad de la interfaz de usuario de la l&oacute;gica de la aplicaci&oacute;n, reduciendo as&iacute; las l&iacute;neas de c&oacute;digo, la complejidad del c&oacute;digo, la reutilizaci&oacute;n y la robustez. Delphi 4 incluye muchas acciones est&aacute;ndares predefinidas, reduciendo as&iacute; m&aacute;s el tiempo necesario para crear aplicaciones Windows ricas en funciones totalmente operativas.</P>
<h4>Servicios Windows NT</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>Los servicios proporcionan la posibilidad de crear aplicaciones que funcionan en el fondo y se activan autom&aacute;ticamente con el inicio del sistema operativo. Dos NUEVOS asistentes simplifican la creaci&oacute;n de estas avanzadas tareas de programaci&oacute;n. Una vez creadas, las propiedades y eventos de un servicio se personalizan f&aacute;cil y visualmente en un dise&ntilde;ador de servicios Delphi NT.</P>
<h3>ACTIVEINSIGHT</h3>
<h4>ActiveX de un solo paso</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Es un entorno de aplicaci&oacute;n de m&aacute;xima productividad para crear componentes ActiveX est&aacute;ndares del mercado de alta velocidad. Crea f&aacute;cilmente componentes ActiveX que pueden utilizarse con las herramientas de desarrollo existentes, como C++, Java, Visual Basic o PowerBuilder, que se est&aacute;n utilizando en la empresa. Los controles ActiveX de Delphi 4 est&aacute;n compilados con c&oacute;digo m&aacute;quina original y no requieren un entorno en tiempo real distribuible.</P>
<h4>Soporte COM interno</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Integra COM (Common Object Model: modelo de objetos com&uacute;n) de Microsoft de manera transparente en su entorno de desarrollo r&aacute;pido de aplicaciones de modo que los desarrolladores puedan crear f&aacute;cil y r&aacute;pidamente objetos comerciales interoperativos y reutilizables. Delphi utiliza objetos COM en un entorno de varios niveles para proporcionar soluciones comerciales integradas y reutilizables.</P>
<h4>Packages</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Proporciona una soluci&oacute;n para el desarrollo de ejecutables de aplicaci&oacute;n eficaces que necesitan ser distribuidos r&aacute;pida y f&aacute;cilmente mediante una intranet a un gran n&uacute;mero de usuarios. Permite recompilar con Packages para reducir el tama&ntilde;o del ejecutable en una magnitud.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Packages es una avanzada y &uacute;nica tecnolog&iacute;a de compilador que ofrece a los desarrolladores la posibilidad de dividir aplicaciones en fragmentos compilados y reutilizables sin que se ralentice el rendimiento. Las aplicaciones a las que se ha aplicado Packages, utilizan un entorno de aplicaci&oacute;n personalizado que se entrega y configura una sola vez, reduciendo as&iacute; tanto la complejidad de configuraci&oacute;n de la aplicaci&oacute;n y la necesidad de recursos de distribuci&oacute;n adicionales.</P>
<h4>La creaci&oacute;n de bibliotecas de tipos integrada reduce el n&uacute;mero de tareas de programaci&oacute;n</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El editor de bibliotecas de tipos es una herramienta gr&aacute;fica esencial que permite a los desarrolladores examinar y crear f&aacute;cilmente informaci&oacute;n de tipos para controles ActiveX y objetos COM. Esta informaci&oacute;n de tipos se puede proporcionar con un objeto, o bien individualmente en un archivo de biblioteca de tipos (.TLB), o bien integrada en el EXE u OCX como recurso. Utilizar y crear IDL (Interface Definition Language: lenguaje de definici&oacute;n de interfaz) nunca ha sido m&aacute;s f&aacute;cil. Como el editor de bibliotecas de tipos est&aacute; integrado en el desarrollo COM y ActiveX, el desarrollador tiene la habilidad de cambiar cosas en el c&oacute;digo, en IDL o gr&aacute;ficamente, y siempre tiene una vista sincronizada en el complejo COM. Esto ahorrar&aacute; horas de programaci&oacute;n frustrada y la curva de aprendizaje COM/DCOM/ActiveX se alisar&aacute;.</P>

<h3>WEBBROKER PARA LA DISEMINACION ACELERADA DE INFORMACION DE BASES DE DATOS</h3>
<h4>Componentes Internet VCL originales</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>La colecci&oacute;n de componentes de mayor rendimiento del mundo que implementa los est&aacute;ndares de Internet, especialmente protocolos de comunicaciones. Estos componentes se escriben en Delphi puro a trav&eacute;s del est&aacute;ndar WinSock abierto. Esta colecci&oacute;n es esencial para desarrolladores de Delphi profesionales, que creen aplicaciones cliente/servidor y de escritorio aptas para Internet.</P>
<h4>Aplicaciones WebServer</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Con Delphi 4 se crean aplicaciones de datos de alta velocidad, alto rendimiento y entregadas utilizando los conocimientos cliente/servidor ya existentes. La arquitectura abierta de Delphi y su soporte de DLL de sistema original, permiten este desarrollo r&aacute;pido de aplicaciones de alta productividad para Internet. Las aplicaciones WebServer son DLL del lado del servidor, que se unen directamente con ISAPI y NSAPI, interfaces de servidor web de Microsoft y Netscape respectivamente.</P>
<h4>WebBridge</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Para simplificar el desarrollo Internet, WebBridge permite a los desarrolladores programar en una API com&uacute;n para NSAPI e ISAPI. Esta flexibilidad protege el c&oacute;digo base a medida que evolucionan los est&aacute;ndares Internet competitivos. El desarrollador puede concentrarse en la implementaci&oacute;n de soluciones comerciales referentes al servidor web remoto.</P>
<h4>WebModules</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los WebModules centralizan el env&iacute;o de peticiones de cliente web, las respuestas para la petici&oacute;n y la creaci&oacute;n de contenido HTML. Estas acciones espec&iacute;ficas de la Web se combinan con acceso a los datos y reglas comerciales para diseminar datos de alto rendimiento a lo largo de la Web sin codificaci&oacute;n. El WebModule controla visualmente varias peticiones que llegan a un subsitio web, dando como resultado la funcionalidad cliente/servidor total a lo largo de la Web.</P>
<h4>WebDispatcher</h4>
</B><P ALIGN=JUSTIFY><font size=2 face=arial>WebDispatcher es el componente responsable del manejo de eventos de la aplicaci&oacute;n Web Server. Funciona transparentemente con componentes de tabla y consulta existentes, para producir aplicaciones CGI y HTML. Esto permite al desarrollador Delphi producir contenido web con las mismas utilidades empleadas en el desarrollo cliente/servidor. Cuatro componentes adicionales producen contenido web para consultas, tablas, aplicaciones CGI y HTML sencillo.</P>
<h4>ActiveForms</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Se puede convertir cualquier formulario Delphi en un ActiveForm. Los ActiveForm son controles ActiveX que utilizan el formulario Delphi como contenedor para otros componentes Delphi. Los ActiveForm publican p&aacute;ginas de propiedad y bibliotecas de tipos ActiveX para a&ntilde;adir funcionalidad de alta velocidad a otros entornos de desarrollo; por ejemplo, Internet Explorer, Visual Basic, Optima o PowerBuilder. O bien utilice estos formularios para entregar aplicaciones en Internet. Los ActiveForms de Delphi y el DataBroker Remoto facilitan la entrega de clientes de configuraci&oacute;n cero ultrafinos, en una arquitectura de base de datos de varios niveles entregada en Web.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Despliegue web Delphi 4 utiliza la arquitectura ActiveX para desplegar f&aacute;cilmente aplicaciones de cliente fino y configuraci&oacute;n cero a lo largo de la Web, reduciendo as&iacute; el coste de la configuraci&oacute;n y distribuci&oacute;n de software. El despliegue web utiliza mecanismos de entrega de aplicaci&oacute;n est&aacute;ndares de Microsoft (entrega de archivos CAB) y la infraestructura web para distribuir sus aplicaciones a un n&uacute;mero creciente de usuarios de Internet, intranet y a lo largo de la empresa.</P>
<br><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>


<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulac.htm"><font FACE="ARIAL"><B>[Curso de Delphi]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

