<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>A</b></font>nexos / Otros.</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Características del Delphi 4 (2).
</H3>

<FONT color="#000000" size=2 face="arial">
<br>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
<FONT FACE="Arial" SIZE=2></P>
<P ALIGN="JUSTIFY">
<font face=arial>
<h3>INTEROPERATIVIDAD JAVA</h3>
<h4>Cliente MIDAS para Java (disponible por separado)</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El NUEVO componente de cliente Java para MIDAS de Inprise asegura al desarrollador de Delphi un alto grado de posibilidad de compartir y reutilizar c&oacute;digo. Estos componentes permiten a los clientes Java comunicarse con servidores de broker de datos remotos MIDAS de Delphi 4. En los entornos donde el c&oacute;digo debe compartirse entre distintos desarrolladores, departamentos o divisiones, esto aumenta enormemente la reutilizaci&oacute;n de c&oacute;digo Delphi. La interoperatividad entre el desarrollo Delphi y JBuilder es adem&aacute;s mucho m&aacute;s sencilla. El desarrollo de aplicaciones de parte visible Java para servidores de nivel medio MIDAS de Delphi 4, ofrece al desarrollador flexibilidad en el despliegue de aplicaciones en entornos heterog&eacute;neos como la empresa o Internet.</P>
<h3>BUSINESSINSIGHT</h3>
<h4>DecisionCube --An&aacute;lisis multidimensional</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Pase m&aacute;s potencia a los sistemas de soporte de decisiones utilizando el nuevo DecisionCube de Delphi 4, an&aacute;lisis multidimensional de los datos. Drill Down, Pivot y //Aggregation proporcionan nuevas formas de visualizar datos y tomar mejores decisiones.</P>
<h4>DecisionGrid</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>DecisionGrid muestra din&aacute;micamente datos multidimensionales de modo que los usuarios vean la informaci&oacute;n seg&uacute;n las necesidades de la empresa. Los datos pivotables, los res&uacute;menes articulados y una interfaz de arrastrar y soltar se integran de manera transparente con los gr&aacute;ficos comerciales para conducir la empresa.</P>
<h4>TeeCharts</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 proporciona el modo m&aacute;s r&aacute;pido de convertir datos de toda la empresa en informaci&oacute;n. Los desarrolladores utilizan un experto para mostrar gr&aacute;ficamente datos de empresa o de Internet con m&aacute;s de once estilos distintos. Por ejemplo, los estilos de gr&aacute;ficos comerciales de l&iacute;neas, barras, polares, vela y otros aceleran la interpretaci&oacute;n de los datos, lo que da lugar a una toma de decisiones mejor y m&aacute;s r&aacute;pida.</P>
<h4>QuickReports</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>QuickReports permite dise&ntilde;ar informes visualmente con componentes originales y el dise&ntilde;ador de formularios Delphi. Los informes se crean con bandas y pueden contener t&iacute;tulos, encabezados y pies de p&aacute;gina, varios conjuntos de detalle, res&uacute;menes y encabezados y pies de grupo. Cree informes de cualquier DataSource, incluyendo TTable y TQuery o  incluso de arrays, listas o de cualesquiera datos que desee, y utilice la potente previsualizaci&oacute;n en pantalla para comprobar los resultados. Realice c&aacute;lculos como res&uacute;menes y cuenta de campos autom&aacute;ticamente. Los c&aacute;lculos pueden reiniciarse a nivel de grupos.</P>
<h3>ARQUITECTURA BROKER DE VARIOS NIVELES</h3>
<h4>Business Broker</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Business Broker es un servicio de nombre distribuido que une indirectamente aplicaciones con objetos remotos basados en criterios de equilibrio de carga o disponibilidad de objetos. Delphi 4 utiliza Business Broker para asegurarse que los sistemas fundamentales para la empresa siguen funcionando en un entorno de veinticuatro horas y siete d&iacute;as a la semana, asegurando al mismo tiempo un rendimiento de alta velocidad para un n&uacute;mero ilimitado de usuarios.</P>
<h4>Remote Data Broker</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El Remote Data Broker de Delphi 4 es una tecnolog&iacute;a esencial que permite una arquitectura de cliente ultrafino con unos costes de configuraci&oacute;n y distribuci&oacute;n m&aacute;s bajos. Utilizando OLEnterprise y Remote Data Broker, el desarrollador puede comunicar de manera eficaz datos de un servidor de aplicaci&oacute;n a un cliente en un entorno de aplicaci&oacute;n de varios niveles. El Remote Data Broker &uacute;nico de Delphi 4 reduce el tr&aacute;fico en la red, centraliza la gesti&oacute;n de transacciones, la seguridad y el rendimiento, reduce las cargas sobre al red y reduce el n&uacute;mero de conexiones de base de datos simult&aacute;neas.</P>
<h4>Broker de limitaciones. Propagaci&oacute;n de limitaciones autom&aacute;tica </h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 propaga autom&aacute;ticamente limitaciones de gesti&oacute;n de base de datos relacional mediante los controladores SQL Links originales de alta velocidad al cliente, reduciendo as&iacute; el tr&aacute;fico en la red asociado a la validaci&oacute;n de una entrada de usuario de nuevo en el servidor de base de datos. Tambi&eacute;n se propagan desde el servidor valores iniciales de campo que, en combinaci&oacute;n con las limitaciones, permiten mantener la integridad de datos a lo largo de toda la empresa. </P>
<h4>Inteligencia de detalle principal con tablas anidadas</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>MIDAS de Inprise entrega aplicaciones de cliente fino distribuidas que son m&aacute;s f&aacute;ciles de mantener, modificar y actualizar mediante su soporte mejorado de relaciones de detalle principal y sus tablas anidadas. La informaci&oacute;n de base de datos relacional, incluyendo estructuras de tabla, puede distribuirse a clientes finos sin escribir una sola l&iacute;nea de c&oacute;digo. El soporte de actualizaciones a todos los datos principal y detalle es autom&aacute;tico. </P>
<h4>Soporte de login</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>MIDAS facilita la implementaci&oacute;n del desarrollador de seguridad en la aplicaci&oacute;n con soporte interno para login de usuario. </P>
<h4>CORBA de un solo paso</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los servidores MIDAS soportan ahora la infraestructura est&aacute;ndar CORBA abierta, proporcionando servidores de aplicaci&oacute;n de mayor rendimiento en las plataformas m&aacute;s diversas. Se dispone de m&aacute;s opciones para desplegar sus servidores de aplicaci&oacute;n con comunicaci&oacute;n de cliente fino apta para CORBA. </P>
<h4>Blob diferidos</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>MIDAS acelera enormemente la recuperaci&oacute;n de resultados al cliente, permitiendo al usuario ver datos no blob  inmediatamente, retrasando la recuperaci&oacute;n de datos blob hasta que otros datos no se hayan recuperado, o permitiendo que sean enviados bajo petici&oacute;n. </P>
<h4>Configuraci&oacute;n cero</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>La configuraci&oacute;n cero de aplicaciones de cliente final distribuidas significa la eliminaci&oacute;n total de problemas para tratar con dificultades de configuraci&oacute;n de usuario. S&oacute;lo se necesitan el ejecutable cliente y una DLL para disponer de soporte repleto de funciones en el lado del cliente.</P>
<h4>Reglas comerciales</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>MIDAS proporciona un mantenimiento menor y una mayor respuesta a las necesidades cambiantes de la empresa mediante actualizaciones autom&aacute;ticas en el cliente de las reglas comerciales mantenidas en el servidor.</P>
<h4>Modo Malet&iacute;n</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Responda a las crecientes necesidades de aplicaci&oacute;n de base de datos m&oacute;vil y sin cables de su compa&ntilde;&iacute;a con las operaciones de base de datos separables de MIDAS. Todas las actualizaciones de los datos, incluyendo inserciones, borrados y modificaciones se detectan autom&aacute;ticamente en el conjunto de datos. El proceso de resincronizaci&oacute;n de un solo paso gestiona autom&aacute;ticamente datos de detalle principal, e incluso puede proporcionar resoluci&oacute;n de conflictos robusta a la aplicaci&oacute;n cliente desde el servidor.</P>
<h4>Comunicaci&oacute;n eficaz</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Las aplicaciones de cliente fino distribuidas de MIDAS producen menos tr&aacute;fico en la red que las soluciones de otros fabricantes, aumentando enormemente el rendimiento en redes de modem o sin cables de bajo ancho de banda, como Internet. MIDAS utiliza solamente est&aacute;ndares abiertos y existentes como TCP/IP, CORBA y DCOM para comunicaci&oacute;n.</P>
<h4>OLEnterprise</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>OLEnterprise permite centralizar la l&oacute;gica de aplicaci&oacute;n y el acceso a los datos en un servidor de aplicaciones y utilizarlos despu&eacute;s en un entorno distribuido. El servidor de aplicaciones se convierte en un proveedor de servicio uno a muchos de objetos y procesos comerciales. De esta forma, la l&oacute;gica comercial puede reutilizarse entre varias aplicaciones, y como la l&oacute;gica de aplicaci&oacute;n s&oacute;lo necesita cambiarse en una &uacute;nica posici&oacute;n, el mantenimiento de las aplicaciones es mucho m&aacute;s sencillo.</P>
<h3>ACCESO A BASES DE DATOS ABIERTAS Y DIMENSIONABLES</h3>
<h4>Soporte de varios motores de bases de datos</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 soporta varios motores de bases de datos mediante una API abierta, de modo que cualquier resultado de motor de base de datos funcione de manera transparente con potentes controles aptos para base de datos de Delphi 4. Delphi 4 utiliza una arquitectura abierta para soportar varios motores de base de datos ligeros. El desarrollador dispone de control completo para proporcionar los servicios de base de datos esenciales (por ejemplo, cach&eacute;, recuperaci&oacute;n, cotejado de idioma, acceso heterog&eacute;neo, soporte de cursor gen&eacute;rico) necesarios para una determinada aplicaci&oacute;n.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>SQL Links de 32 bits con despliegue ilimitado Delphi 4 incluye un amplio conjunto de controladores originales SQL Links de 32 bits y alto rendimiento para controladores originales Oracle, InterBase, Sybase, MS SQLServer, Informix y DB2. La suite cliente/servidor de Delphi incluye una licencia de despliegue ilimitada para todos los controladores.</P>
<h4>Controlador de base de datos original de Access97</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 es la &uacute;nica soluci&oacute;n para capacidad de dimensi&oacute;n desde el escritorio de Access a la empresa. Los controladores de base de datos originales de alta velocidad con bases de datos de Microsoft Access combinan la herramienta RAD m&aacute;s f&aacute;cil de utilizar, Delphi, con la base de datos de escritorio m&aacute;s conocida.</P>
<h4>Controlador original de FoxPro</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Disfrute de soporte sin compromisos con las bases de datos de FoxPro dentro de Delphi 4, el entorno de desarrollo RAD m&aacute;s r&aacute;pido. Los desarrolladores pueden ahora crear aplicaciones Delphi 4 de alta velocidad y mantener bases de datos FoxPro existentes sin incompatibilidades. Delphi 4 tiene soporte total de &iacute;ndices FoxPro, lo que asegura una compatibilidad remota para las aplicaciones existentes.</P>
<h4>Potente SQL Builder</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>SQL Builder es una potente herramienta de base de datos que permite crear y ejecutar consultas SQL sin tener que recordar o conocer la sintaxis de SQL. Cuando se utiliza SQL Builder, se puede visualizar y editar el SQL resultante. Tan f&aacute;cilmente como apuntando y haciendo clic, se puede crear una amplia gama de consultas SQL, desde la SELECT m&aacute;s sencilla hasta una complicada uni&oacute;n multitabla con campos calculados y uniones basadas en expresiones, eliminando errores en las consultas.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Las funciones de SQL Builder incluyen lo siguiente:</P>

<UL>
<LI>Genera y analiza SQL. </LI>
<LI>Soporta expresiones anidadas. </LI>
<LI>Cambia formatos de fila din&aacute;micamente. </LI>
<LI>Permite a los usuarios especificar cadenas sin comillas. </LI>
<LI>Proporciona robustas funciones de b&uacute;squeda y sustituci&oacute;n. </LI>
<LI>Permite a los usuarios unir y manipular varias tablas de base de datos f&aacute;cilmente. </LI></UL>

<h4>BLOB de Oracle</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Las aplicaciones multimedia y otras que requieren datos no estructurados pueden tener ahora varios objetos binarios, cada uno de hasta 4 Gb de tama&ntilde;o, almacenados en una sola fila de una tabla de base de datos. Los tipos Large Object (LOB) almacenan localizadores que especifican la ubicaci&oacute;n de objetos grandes almacenados fuera de l&iacute;nea (almacenando solamente el localizador en la fila de datos, no los datos LOB reales) o en un archivo externo. </P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Se puede optimizar una base de datos para que utilice estos nuevos tipos binarios. BLOB (Binary Large Object) es un tipo de datos binarios que puede utilizarse para almacenar cualquier tipo de dato. Para sistemas de gesti&oacute;n de documentos o de recuperaci&oacute;n de textos, los tipos CLOB (Character Large Object) puede utilizarse para almacenar grandes bloques de informaci&oacute;n textual. Se pueden consultar archivos externos editados por otras aplicaciones (como archivos de sonido, AVI, im&aacute;genes de mapa de bits, etc.) sin tener que duplicar estos, generalmente, enormes archivos en el interior de la base de datos, porque los datos BFILE se almacenan en archivos de sistema operativo exteriores a la base de datos. </P>
<h3>EXTENSIONES RELACIONALES DE OBJETO DE ORACLE 8</h3>
<h4>Tipos de datos abstractos</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los tipos de datos abstractos (ADT: Abstract Data Types) permiten definir tipos de datos u objetos comerciales propios correspondientes a las reglas comerciales corporativas del usuario. Estos tipos de datos pueden ser tipos de datos escalares existentes (como enteros y fechas), y pueden adem&aacute;s incluir anidado de otros ADT. Se pueden implementar objetos comerciales que pueden almacenarse en una base de datos y consultarse o recuperarse cuando sea necesario. Estos objetos comerciales pueden representar a personas, dep&oacute;sitos de datos, elementos de inventario, direcciones, pedidos, facturas o cualquier cosa que defina sus procedimientos operacionales.</P>
<h4>VARRAY (Arrays de longitud variable)</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Se pueden crear tipos nuevos de aplicaciones que modelan con precisi&oacute;n una organizaci&oacute;n comercial con soporte de VARRAY. Pueden almacenarse tipos de datos tradicionales y nuevos datos relacionales de objeto con una flexibilidad sin precedentes con este persistente tipo de array.</P>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los VARRAY pueden almacenar listas de objetos comerciales, que pueden referirse a ADT adicionales.</P>
<h4>Tablas anidadas</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Las tablas anidadas son perfectas para informaci&oacute;n estad&iacute;stica y tareas de seguimiento. Este tipo de tablas permite almacenar grupos repetitivos de informaci&oacute;n directamente en una tabla existente, sin la necesidad de generar claves para cada fila de la tabla anidada. Se incluyen las funciones para determinar el n&uacute;mero de filas anidadas y manipularlas.</P>
<h4>REF (Punteros a objeto)</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Los REF aceleran el acceso a los datos relacionales de objeto. Las referencias a objetos anidados se almacenan con este nuevo tipo de dato. Cuando el puntero REF se resuelve, sus objetos referenciados se llevan al espacio de objeto cliente para su examen y modificaci&oacute;n. La referencia para cada objeto es un identificador globalmente &uacute;nico, que en Oracle se llama ID de Objeto. Estos identificadores &uacute;nicos permiten a los punteros REF ser cruzados bajo petici&oacute;n (conocido como navegaci&oacute;n de objetos o seguimiento de puntero), de modo que s&oacute;lo la informaci&oacute;n que se necesite en cada momento se cargue en el espacio de objeto cliente.</P>
<h4>BFILE (Referencias a archivo externas)</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Ahora se puede hacer referencia a archivos almacenados externamente a la base de datos, eliminando la duplicaci&oacute;n de archivos grandes (como documentos comerciales), aumentando el rendimiento de base de datos, proporcionando acceso a archivos m&aacute;s flexible y reduciendo los requisitos de almacenamiento.</P>
<h3>MICROSOFT TRANSACTION SERVER (MTS)</h3>
<h3>Reserva de recursos</h3>
<P ALIGN=JUSTIFY><font size=2 face=arial>M&aacute;s usuarios de la red de Informaci&oacute;n de una empresa pueden acceder a sus servidores de base de datos y hacer an&aacute;lisis de datos m&aacute;s r&aacute;pido gracias al soporte de Delphi 4 de reserva de recursos. La reserva de recursos proporciona unas conexiones m&aacute;s r&aacute;pidas y una menor carga sobre la red, lo que aumenta el rendimiento y la capacidad de respuesta de sus aplicaciones de base de datos.</P>
<h4>Entrega en dos fases</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>Las aplicaciones de base de datos pueden ahora realizar transacciones a lo largo de distintos servidores de base de datos (como Sybase, Oracle y DB2), para sistemas operativos de Microsoft y entornos heterog&eacute;neos. Ahora est&aacute; disponible un sistema de transacciones m&aacute;s fiable y robusto para cualquier base de datos soportada originalmente por el motor de base de datos de Borland a trav&eacute;s del uso de la funci&oacute;n de entrega en dos fases de MTS.</P>
<h4>Soporte de X/Open XA</h4>
<P ALIGN=JUSTIFY><font size=2 face=arial>El est&aacute;ndar abierto XA permite a servidores de transacciones (como Oracle) comunicarse con el gestor de recursos de MTS. Ahora, la aplicaci&oacute;n cliente puede ver un solo &eacute;xito o fallo para un paquete de transacciones que han sido sometidas a los servidores de un entorno heterog&eacute;neo.</P>
<br><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>


<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulac.htm"><font FACE="ARIAL"><B>[Curso de Delphi]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

