<HTML>

<BODY BGCOLOR="#FFFFFF">

<br>

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>A</b></font>nexos / Otros.</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>

</b></FONT>

<br><br>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

Introducción al Delphi 4.

</H3>



<FONT color="#000000" size=2 face="arial">

<br>

<FONT color="#000000" size=2 face="arial">

<P ALIGN=justify>

<FONT FACE="Arial" SIZE=2></P>

<H4>Introducci&oacute;n</H4>

<P ALIGN=JUSTIFY><font size=2 face=arial>Inprise Corporation ha anunciado Borland Delphi 4, la nueva versi&oacute;n de la conocida herramienta de desarrollo r&aacute;pido de aplicaciones para Windows.</P>

<P ALIGN=JUSTIFY><font size=2 face=arial>Dise&ntilde;ado para ayudar a las corporaciones a desarrollar aplicaciones de escala corporativa de manera mucho m&aacute;s r&aacute;pida y eficiente, Delphi 4 simplifica radicalmente la integraci&oacute;n del desarrollo de herramientas cliente, de capa intermedia y de bases de datos. Delphi 4 ahora incluye soporte tanto para CORBA como para COM, los est&aacute;ndares de la inform&aacute;tica distribuida, as&iacute; como para Microsoft Transaction Server (MTS) y el nuevo servidor de bases de datos Oracle8. Delphi 4 deber&aacute; esta disponible el pr&oacute;ximo mes en las versiones: Delphi 4 Client/Server, Delphi 4 Professional y Delphi 4 Standard. </P>

<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 es el &uacute;ltimo paso en la estrategia de Inprise Corporation para ayudar a las corporaciones de todo el mundo a desarrollar, implantar y gestionar aplicaciones distribuidas a gran escala. Es la primera herramienta de desarrollo r&aacute;pido de aplicaciones que mejora la escalabilidad y el rendimiento de las aplicaciones distribuidas basadas en COM y CORBA.</P>

<P ALIGN=JUSTIFY><font size=2 face=arial>Los desarrolladores que necesiten una herramienta para crear aplicaciones distribuidas de m&uacute;ltiples capas encontrar&aacute;n en Delphi 4.0 todo lo que necesitan ya que el soporte para aplicaciones distribuidas est&aacute; muy bien implementado, utilizando est&aacute;ndares de la industria que funcionar&aacute;n en los entornos m&aacute;s heterog&eacute;neos. </P>

<H4>Aplicaciones distribuidas de m&uacute;ltiples capas: cualesquiera datos, en cualquier momento, en cualquier sitio. </H4>

<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 incluye un n&uacute;mero de mejoras que permitir&aacute;n a las organizaciones integrar los datos distribuidos a lo ancho de su empresa y ponerla a disposici&oacute;n de cualquier equipo en cualquier momento, incluyendo: </P>



<UL>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>MIDAS (Multi-Tier Distributed Application Services), que permite a las organizaciones comunicarse e intercambiar datos empresariales a trav&eacute;s de aplicaciones de m&uacute;ltiples capas. MIDAS acelera el desarrollo y el mantenimiento de aplicaciones distribuidas al gestionar la comunicaci&oacute;n entre servidores de bases de datos, reglas de empresa en la capa intermedia y clientes dotados de una tecnolog&iacute;a eficiente de gesti&oacute;n de paquetes. MIDAS ofrece soluciones para entornos heterog&eacute;neos, con soporte para clientes CORBA y Java. </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>El soporte en un solo paso de CORBA y COM ofrece a las organizaciones la m&aacute;xima flexibilidad y escalabilidad para desarrollar aplicaciones basadas en objetos CORBA o COM. Los servidores MIDAS ofrecen soporte para las infraestructuras de COM y CORBA, permitiendo a las aplicaciones implantar sus soluciones distribuidas.. </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>El soporte para Microsoft Transaction Server (MTS) incluye un Asistente para Componentes MTS y un Asistente de Implantaci&oacute;n MTS que permiten a las corporaciones implantar la gesti&oacute;n de transacciones distribuidas en cualquier aplicaci&oacute;n. La integraci&oacute;n sin fisuras de los servicios CORBA en la tecnolog&iacute;a MIDAS basada en COM/DCOM de Delphi 4 ofrece a nuestros proyectos de m&uacute;ltiples capas basados en Delphi una vida renovada en t&eacute;rminos de reutilizaci&oacute;n </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 es el primer entorno de desarrollo r&aacute;pido que incluye soporte de alto rendimiento para el acceso bases de datos de Oracle8, incluyendo las nuevas extensiones orientadas a objetos. El soporte nativo para la m&aacute;s reciente versi&oacute;n del motor de bases de datos de Oracle garantiza que las organizaciones podr&aacute;n r&aacute;pidamente hacer uso de esta tecnolog&iacute;a a todos los niveles. </LI></UL>



<H4>Productividad mejorada.</H4>

<P ALIGN=JUSTIFY><font size=2 face=arial>Para reducir la duraci&oacute;n del ciclo de desarrollo y aumentar la productividad de, Delphi 4 ahora incluye las siguientes mejoras: </P>



<UL>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>Entorno integrado AppBrowser, que simplifica el proceso de lectura, escritura y navegaci&oacute;n del c&oacute;digo. </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>Gestor de proyectos avanzado, que permite a los desarrolladores ahorrar tiempo al compila r&aacute;pidamente sus proyectos para m&uacute;ltiples destinos. </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>Nuevas tecnolog&iacute;as de depuraci&oacute;n, incluyendo una vista de m&oacute;dulo, registros de eventos, inspecci&oacute;n de objetos y variables locales, depuraci&oacute;n integrada de DLLs y depuraci&oacute;n remota. </LI>

<LI><P ALIGN=JUSTIFY><font size=2 face=arial>Nuevas mejoras en el lenguaje, incluyendo sobrecarga de m&eacute;todos, vectores din&aacute;micos y enteros de 64 bits. </LI></UL>



<H4>Mejoras para Windows, incluyendo controles comunes de Windows 98 </H4>

<P ALIGN=JUSTIFY><font size=2 face=arial>Delphi 4 incluye m&uacute;ltiples nuevas caracter&iacute;sticas para el desarrollo de aplicaciones basadas en Windows, incluyendo soporte para los nuevos controles comunes de Windows 98. Delphi 4 tambi&eacute;n incluye dos nuevos servicios de Windows NT que brindan a los desarrolladores la habilidad de construir aplicaciones que ejecutan en segundo plano y arrancan autom&aacute;ticamente con el arranque del sistema operativo.</P>





<BR>

<BR>







<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



