<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>C</b></font>urso de programación.</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>



<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
El Entorno de Programaci&oacuten de Delphi 4. (1 de 2)
</H3>

<!-- PEGAR AQUI EL ARTICULO (se puede borrar la línea que viene a continuación) -->

<FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">Delphi 4 puede resumirse r&aacute;pidamente como una herramienta de cuarta generaci&oacute;n, basada en la metodolog&iacute;a orientada a objetos (OMT), el desarrollo r&aacute;pido de aplicaciones (RAD), y la programaci&oacute;n visual.</P>
<P ALIGN="JUSTIFY">Pero cuando se habla de Delphi 4, no solo hay que referirse al lenguaje, que en realidad se llama Object Pascal 4, sino tambi&eacute;n al conjunto de herramientas que componen el paquete de desarrollo.</P>
<P ALIGN="JUSTIFY">En este caso, se ha analizado la versi&oacute;n Profesional, cuyas diferencias con las dem&aacute;s versiones est&aacute;n reflejadas en las tablas finales de este an&aacute;lisis.</P>
<P ALIGN="JUSTIFY">El paquete Profesional consta de los siguientes componentes que se han clasificado independientemente dentro del mundo CASE:</P>
<B><P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Herramienta para el Desarrollo y Dise&ntilde;o de Interfaces</P>
</B><P ALIGN="JUSTIFY">&#9;Integrated Development Enviroment (IDE)</P>
<B><P ALIGN="JUSTIFY">Herramientas de Soporte </P>
</B><I><P ALIGN="JUSTIFY">Herramientas de Documentaci&oacute;n</P>
</I><P ALIGN="JUSTIFY">&#9;&#9;OpenHelp</P>
<P ALIGN="JUSTIFY">&#9;&#9;WinHelp</P>
<I><P ALIGN="JUSTIFY">Herramienta de Bases de Datos</P>
</I><P ALIGN="JUSTIFY">&#9;&#9;DataBase Desktop</P>
<P ALIGN="JUSTIFY">&#9;&#9;DataBase Explorer </P>
<P ALIGN="JUSTIFY">BDE Administrator</P>
<P ALIGN="JUSTIFY">&#9;ImageEdit</P>

<B><P ALIGN="JUSTIFY">Herramienta de An&aacute;lisis Din&aacute;mico, Intrusiva</P>
</B><P ALIGN="JUSTIFY">&#9;Winsight</P>
<P ALIGN="JUSTIFY">&#9;Integrated Debugger</P>
<B><P ALIGN="JUSTIFY">Documentaci&oacute;n para los Desarrolladores</P>
</B><P ALIGN="JUSTIFY">&#9;Referencia MAPI para Programadores</P>
<P ALIGN="JUSTIFY">&#9;Gu&iacute;a del Programador para Windows 95</P>
<P ALIGN="JUSTIFY">&#9;Referencia OLE para el Programador</P>
<P ALIGN="JUSTIFY">&#9;Referencia OpenGL</P>
<P ALIGN="JUSTIFY">&#9;Referencia RPC</P>
<P ALIGN="JUSTIFY">&#9;Referencia Win32 para el Programador</P>
<P ALIGN="JUSTIFY">&#9;Referencia de Windows SDK y OLE</P>
<P ALIGN="JUSTIFY">&#9;Desarrollo de Componentes VCL</P>
<P ALIGN="JUSTIFY">&#9;Creaci&oacute;n de Ayudas WinHelp</P>
<P ALIGN="JUSTIFY">&#9;Desarrollo de Aplicaciones Distribuidas</P>
<P ALIGN="JUSTIFY">&#9;Desarrollo de Aplicaciones COM-based</P>
<P ALIGN="JUSTIFY">&#9;Desarrollo de Aplicaciones de Bases de Datos</P>
<P ALIGN="JUSTIFY">&#9;Desarrollo de Aplicaciones Intranet</P>
<P ALIGN="JUSTIFY">&#9;Referencia de Object Pascal</P>
<P ALIGN="JUSTIFY">&#9;Programaci&oacute;n con Delphi</P>
<P ALIGN="JUSTIFY">&#9;Creaci&oacute;n de Informes QuickReport</P>
<P ALIGN="JUSTIFY">&#9;Referencia VCL</P>
<B>
</FONT><FONT FACE="Arial,Helvetica"><P ALIGN="JUSTIFY">1. Herramienta para el Desarrollo y Dise&ntilde;o de Interfaces</P>
</FONT><FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">1.1. Integrated Development Enviroment (IDE)</P>
</B><P ALIGN="JUSTIFY">El IDE de Delphi 4 es el centro de desarrollo de los proyectos que se van a desarrollar con &eacute;l. Act&uacute;a como enlace y gestor de la comunicaci&oacute;n de todos los elementos que componen el paquete.</P>
<P ALIGN="JUSTIFY">En su pantalla principal podemos acceder a todas las opciones y herramientas, actuando como un gestor de proyectos cuando se trabaja en grupo desde red.</P>

<center><table width="554"> 
<td><img src="gif/d4_1.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 1. Secci&oacute;n de la Pantalla Principal.</center></font></td> 
</table></center> 

<P ALIGN="JUSTIFY">Desde el punto de vista de las herramientas CASE orientadas a Objetos, Delphi 4 se basa en un entorno para la programaci&oacute;n Visual, con generaci&oacute;n autom&aacute;tica de c&oacute;digo, soporte de trabajo en grupo, repositorio de objetos y de expertos y centralizaci&oacute;n de c&oacute;digo para acceso remoto.</P>
<P ALIGN="JUSTIFY">No se puede decir que Delphi 4 sea una herramienta CASE, ni mucho menos decir que es una herramienta CASE orientada a Objetos, pero mantiene un conjunto de caracter&iacute;sticas comunes con &eacute;sta &uacute;ltima, ya que, como entorno de desarrollo, posee un conjunto de herramientas que se centran en las fases de Desarrollo, Codificaci&oacute;n y Documentaci&oacute;n de un proyecto software.</P>
<P ALIGN="JUSTIFY">Las caracter&iacute;sticas comunes con las herramientas CASE son las que se detallan a continuaci&oacute;n.</P>
<B><P ALIGN="JUSTIFY">1.1.1. Generaci&oacute;n Autom&aacute;tica de C&oacute;digo</P>
</B><P ALIGN="JUSTIFY">La generaci&oacute;n autom&aacute;tica no se basa en la definici&oacute;n de diagramas de metodolog&iacute;a OMT ni de otras similares, sino en la interacci&oacute;n de los desarrolladores con los objetos disponibles en las paletas de componentes visuales (VCL).</P>
<P ALIGN="JUSTIFY">En el Gr&aacute;fico 1, en la secci&oacute;n inferior se pueden apreciar una serie de iconos organizados en "paletas", los cuales ser&aacute;n seleccionados y "arrastrados" (mediante Drag&amp;Drop) sobre el formulario o ficha que se desee. Inmediatamente, el c&oacute;digo necesario para incluir ese componente en el proyecto ser&aacute; generado autom&aacute;ticamente, incluyendo desde las declaraciones de librer&iacute;as necesarias hasta la definici&oacute;n de variables con nombres autom&aacute;ticos para poder referenciarlo.</P>
<P ALIGN="JUSTIFY">Otra herramienta es Code Insight, que se encarga de la terminaci&oacute;n del c&oacute;digo que se est&aacute; tecleando, si as&iacute; se elige. De esta forma, a medida que se est&aacute; escribiendo el nombre de una funci&oacute;n, adem&aacute;s de aparecer un mensaje (hint) donde se indica el nombre m&aacute;s parecido a lo que se lleva escrito, nos indica, una vez determinado si es una funci&oacute;n (por ejemplo), el tipo de datos que devuelve, el tipo de los par&aacute;mentros necesarios para su llamada... agilizando y automatizando en parte la creaci&oacute;n del c&oacute;digo fuente. En este punto cabe destacar un hecho, y es el siguiente: uno de los focos principales de p&eacute;rdida de tiempo a la hora de la implementaci&oacute;n de c&oacute;digo (dependiendo del conocimiento del lenguaje) es la sintaxis de llamada de funciones, de sentencias, de declaraci&oacute;n de clases..., y si se utiliza Code Insight el tiempo perdido se reducir&aacute; dram&aacute;ticamante al no tener que consultar ficheros de ayuda o documentaci&oacute;n de cualquier otro tipo.</P>
<P ALIGN="JUSTIFY">Esto, junto a las caracter&iacute;sticas propias del proyecto, pueden ser especificadas individualmente para cada uno. E incluso es posible personalizar la configuraci&oacute;n del IDE mediante la siguiente pantalla:</P>
<center><table width="443"> 
<td><img src="gif/d4_2.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 2. Configuraci&oacute;n del IDE</center></font></td> 
</table></center> 
<B><P>1.1.2. Desarrollo Visual</P>
</B><P ALIGN="JUSTIFY">Una vez seleccionados los componentes, que en realidad son objetos con un formato especial, interviene otra parte de la prograci&oacute;n visual del IDE. Se trata del Inspector de Objetos, mediante el cual se podr&aacute;n cambiar las caracter&iacute;sticas de los objetos visuales (componentes) en tiempo de edici&oacute;n, simplificando sobremanera la codificaci&oacute;n manual.</P>
<center><table width="301"> 
<td><img src="gif/d4_3.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 3. Inspector de Objetos.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">Cuando los componentes son configurados, es decir, las propiedades han recibido los valores pertinentes y los eventos y procedimientos han sido implementados, en el momento de la compilaci&oacute;n, se "linka" en el ejecutable el c&oacute;digo necesario para su inicializaci&oacute;n y creaci&oacute;n autom&aacute;tica, as&iacute; como el c&oacute;digo necesario para asignarle los valores establecidos mediante el Inspector de Objetos en tiempo de edici&oacute;n, sin que sea necesaria la codificaci&oacute;n manual en ning&uacute;n momento.</P>
<B><P>1.1.3. Desarrollo Centralizado y Distribuido</P>
</B><P ALIGN="JUSTIFY">Una de las opciones que las herramientas CASE deben poseer es la posibilidad de trabajo en grupo.</P>
<P ALIGN="JUSTIFY">Delphi 4 dispone de la posibilidad de trabajar varios puestos en red local sobre el mismo proyecto, encarg&aacute;ndose autom&aacute;ticamente de las actualizaciones de versiones del c&oacute;digo y del protocolo de red, siendo pr&aacute;cticamente transparente para los desarrolladores.</P>
<P ALIGN="JUSTIFY">Para el desarrollo centralizado se dispone de los denominados "paquetes" de componentes, que son librer&iacute;as compiladas de objetos (VCL, OCX, ActiveX...) que pueden ser accedidas remotamente de forma que cada uno de los IDE remotos que trabajen sobre el mismo proyecto, las utilicen sin necesidad de tener que utilizar copias locales.</P>
<center><table width="424"> 
<td><img src="gif/d4_4.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 4. Gestor de Librer&iacute;as Compiladas.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">De esta forma la utilizaci&oacute;n de c&oacute;digos compilados generados anteriormente queda excluida de la problem&aacute;tica de actualizaci&oacute;n continua que sufre un proyecto cuando se est&aacute; trabajando sobre &eacute;l desde diversos puestos, empaquetando el trabajo anterior y siguiendo adelante en el desarrollo.</P>
<B><P>1.1.4. Reutilizaci&oacute;n</P>
</B><P ALIGN="JUSTIFY">Pero esta utilizaci&oacute;n de componentes u objetos no termina aqu&iacute;, sino que es posible crear aplicaciones enteras que podr&aacute;n ser reutilizadas por todos los puestos como si se tratasen de simples objetos, independientemente de su complejidad.</P>
<P ALIGN="JUSTIFY">Esto significa un paso m&aacute;s all&aacute; de la reutilizaci&oacute;n de c&oacute;digo, ya que se trata en realidad de la reutilizaci&oacute;n de todo lo que se desarrolle con Delphi 4.</P>
<P ALIGN="JUSTIFY">Para ello se encuentra la Librer&iacute;a de Expertos, donde se podr&aacute;n almacenar desde formularios, asistentes para generar informes, unidades precompiladas en formato DLL o ActiveX...</P>
<center><table width="443"> 
<td><img src="gif/d4_5.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 5. Librer&iacute;a de Expertos.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">Otro paso m&aacute;s all&aacute; de los est&aacute;ndares es el uso de Paquetes de Distribuci&oacute;n, que son n&uacute;cleos de c&oacute;digo compilados que ser&aacute;n comunes a todos los ejecutables independientemente de su funcionalidad.</P>
<P ALIGN="JUSTIFY">Estos paquetes tienen la finalidad de reducir dr&aacute;sticamente el tama&ntilde;o de los ejecutables, eliminando las partes comunes a todos ellos y centralizando parte de su funcionamiento en librer&iacute;as externas. As&iacute;, varios ejecutables desarrollados con Delphi 4, tan solo ejecutar&aacute;n unas pocas decenas de Kb, compartiendo los paquetes precompilados.</P>
<B><P>1.1.5. Explorador de C&oacute;digo</P>
</B><P ALIGN="JUSTIFY">Cuando un proyecto crece en tama&ntilde;o y complejidad desmesuradamente, se hace necesario el uso del explorador de c&oacute;digo de Delphi 4. </P>
<center><table width="600"> 
<td><img src="gif/d4_6.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 6. Explorador de C&oacute;digo.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">Mediante este explorador, que se usa conjuntamente con el cuadro de texto donde se escribe el c&oacute;digo fuente, permite una localizaci&oacute;n inmediata de cualquier variable, procedimiento, declaraci&oacute;n o tipo que se desee. Est&aacute; estructurado jer&aacute;rquicamente, siendo el nodo inicial del &aacute;rbol el formularo (objeto padre) que contiene al resto de componentes y c&oacute;digo. La informaci&oacute;n se presenta siguiendo los patrones de la orientaci&oacute;n a objetos, es decir, cada nodo ser&aacute; un objeto cuyos nodos hijos ser&aacute;n o bien otros objetos, o declaraciones de funciones (m&eacute;todos) y variables (propiedades).</P>
<P ALIGN="JUSTIFY">1.1.6. Control de Versiones</P>
</B><P ALIGN="JUSTIFY">Otra caracter&iacute;stica fundamental de las herramientas CASE orientadas a objetos es el control de versiones de los proyectos.</P>
<P ALIGN="JUSTIFY">El control que brinda Delphi 4 se encarga de la generaci&oacute;n interna (tanto para los desarrolladores como incluida en el ejecutable), de las versiones incrementales en el tiempo que se van creando durante el desarrollo.</P>
<center><table width="424"> 
<td><img src="gif/d4_7.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 7. Control de Versiones.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">Este control permite en todo momento identificar una copia de seguridad de un determinado proyecto, ya que, como si de una base de datos se tratase, almacena toda la informaci&oacute;n necesaria para ello.</P></FONT>

<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>&Uacute;</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISI&Oacute;N EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="index03.htm">
<FONT FACE="ARIAL"><B>Aula Macedonia</B></FONT>
</A>
<HR>
<A HREF="aulac.htm">
<FONT FACE="ARIAL"><B>Curso de Programación Visual en Delphi</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
AULA MACEDONIA
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>



