<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>C</b></font>urso de programación.</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Capítulo2.<br> La Historia de Delphi
</H3>

<FONT color="#000000" size=2 face="arial"><br><br><br>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Delphi es el descendiente de Turbo Pascal, uno de los lenguajes m&aacute;s populares de la d&eacute;cada de los 80 en el entorno de desarrollo de aplicaciones importantes en PC (al igual que C). </P>
<P ALIGN="JUSTIFY">Fue creado por Borland International y sali&oacute; a la luz a principios de 1995 con el prop&oacute;sito de unirse a la ola de herramientas de programaci&oacute;n visuales, justo en el momento en que Microsoft Visual Basic 3.0 era el rey, y al que no tard&oacute; en desbancar.</P>
<P ALIGN="JUSTIFY">El motivo de su superioridad se basaba en que era un compilador y no un int&eacute;rprete de pseudoc&oacute;digo </P>
<P ALIGN="JUSTIFY">(p-code) como Visual Basic. Su biblioteca de controles visuale (VCL) cubr&iacute;a todo lo necesario para la programaci&oacute;n en Windows 3.1, a&ntilde;adiendo innumerables facilidades de uso, e incluso permit&iacute;a crear nuestros propios controles y a&ntilde;adirlos a la librer&iacute;a, algo tan solo posible con los compiladores de C.</P>
<P ALIGN="JUSTIFY">El lenguaje de Delphi se apoy&oacute; en Object Oriented Pascal, conformando un verdadero lenguaje orientado a objetos llamado Object Pascal.</P>
<P ALIGN="JUSTIFY">Por esto, y teniendo en cuenta que pertenec&iacute;a a Borland, la empresa de lenguajes de programaci&oacute;n por excelencia, parec&iacute;a que pod&iacute;a equipararse incluso a los compiladores de C++, verdaderos reyes internacionales de la programaci&oacute;n profesional en ese momento, y de hecho as&iacute; fue y continua siendo en estos momentos en los que todo lo dem&aacute;s cede terreno a velocidades alarmantes ante el Delphi (y ante el Java).</P>
<P ALIGN="JUSTIFY">Actualmente existen 3 versiones fundamentales de Delphi: Delphi 1 para Windows 3.1 y Windows 3.11, y Delphi 2, junto a Delphi 3, para Windows 95-Windows NT.</P>
<P ALIGN="JUSTIFY">Su situaci&oacute;n en el mercado es inmejorable, ya que cuenta con miles de p&aacute;ginas WEB, cientos de servidores dedicados exclusivamente a &eacute;l, as&iacute; como innumerables Foros de Debates, Sitios de FTP plagados de librer&iacute;as, Chats e IRCs donde s&oacute;lo se discute sobre Delphi, Servidores de News… y todo lo que pueda darse a trav&eacute;s de Internet, adem&aacute;s de una extens&iacute;sima bibliograf&iacute;a internacional, con o que cualquier programador avanzado podr&aacute; buscar ayuda en cualquier sitio, resolver dudas compartiendo sus conocimientos con miles de programadores como &eacute;l. Incluso para los que se inician en el mundo de Delphi, todo esto es un a&ntilde;adido m&aacute;s para que caiga en las redes de esta incre&iacute;ble plataforma de desarrollo, que hace que la programaci&oacute;n de aplicaciones de verdad sea lo m&aacute;s asequible posible.</P>
<P ALIGN="JUSTIFY">Pero no nos dejemos llevar por la euforia, no todo van a ser facilidades.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">2. Requisitos para aprender Delphi</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Los compiladores de Delphi ofrecen toda la potencia que una m&aacute;quina apoyada en Windows puede ofrecer sin que ning&uacute;n otro entorno se le acerque desde lejos (tan solo el de Visual Basic 5 se puede comparar al del Delphi 3, perdiendo por muy poco… pero como sigue siendo Basic…). Pero es necesario poner de parte del programador el tiempo y el esfuerzo necesario para convertirse en un verdadero profesional de la programaci&oacute;n mediante Delphi, ya que la mejor herramienta no hace al artista.</P>
<P ALIGN="JUSTIFY">Hasta el momento tan s&oacute;lo un lenguaje (de los que verdaderamente sirven) es m&aacute;s f&aacute;cil de aprender que Delphi. Este lenguaje es el Visual Basic, por supuesto. Pero ¿para qu&eacute; utilizar un lenguaje si cuando se quiere hacer algo de verdad nos encontramos limitados por su falta de potencia?</P>
<P ALIGN="JUSTIFY">Para empezar a aprender Delphi no es necesario ning&uacute;n conocimiento avanzado en ning&uacute;n tema (claro que si se tiene, obviamente ser&aacute; mucho mejor).</P>
<P ALIGN="JUSTIFY">Si se conoce el lenguaje Pascal, se encontrar&aacute; con que la sintaxis b&aacute;sica es pr&aacute;cticamente la misma (esto tambien sirve para Modula). Pero si tan s&oacute;lo se conoce C, el cambio de sintaxis le costar&aacute; m&aacute;s que a ning&uacute;n otro porque la flexibilidad, y por qu&eacute; no decirlo, los verdaderos jerogl&iacute;ficos que se pueden hacer en C, ser&aacute;n totalmente imposibles debido a la mayor estructuraci&oacute;n y rigurosidad del Object Pascal (no creo que exista nunca un concurso en Delphi como el Ofuscated-C, donde el premio es al programa en C m&aacute;s ilegible, m&aacute;s enrevesado y que, por supuesto, haga algo).</P>
<P ALIGN="JUSTIFY">As&iacute; que lo primero en lo que hay que centrarse es en la sintaxis del lenguaje Object Pascal, pasando posteriormente al aprendizaje de la Programaci&oacute;n Orientada a Objetos.</P>
<P ALIGN="JUSTIFY">Otro de los puntos fuertes donde insistir es la Orientaci&oacute;n a Eventos, debido a que al estar basado en Windows, todo lo que se haga se tendr&aacute; que preparar para este "sistema operativo", bas&aacute;ndolo todo en el rat&oacute;n y sus "eventos" como fuente principal de entrada de &oacute;rdenes.</P>
<P ALIGN="JUSTIFY">Habr&aacute; que saber qu&eacute; son los formularios, los botones, las cajas de texto, las listas desplegables, las listas combo, los contenedores de im&aacute;genes…; es decir, todas las cosas que conforman Windows y lo convierten en un manejador de eventos (sucesos tales como pulsar el rat&oacute;n, desplegar una lista, maximizar un formulario, etc).</P>
<P ALIGN="JUSTIFY">Pero no hay que alarmarse, ya que, gracias a Delphi, se puede decir sin exagerar que su manejo es un aut&eacute;ntico juego de ni&ntilde;os.</P>
<P ALIGN="JUSTIFY">Resumiendo: estos son los tres pilares de Delphi:</P>

<UL>
<P ALIGN="JUSTIFY"><LI>Object Pascal</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows-Orientaci&oacute;n a Eventos</LI></P>
<P ALIGN="JUSTIFY"><LI>Orientaci&oacute;n a Objetos</LI></P></UL>

<P ALIGN="JUSTIFY">En un primer lugar, tan s&oacute;lo ser&aacute;n necesarios los dos primeros para hacer peque&ntilde;as aplicaciones, pero cuando el proyecto a desarrollar sea lo suficientemente importante, el tercer pilar ser&aacute; fundamental. Con esto no se pretende afirmar que sin la orientaci&oacute;n a objetos no se pueda conseguir todo, es m&aacute;s, algunos programadores acostumbrados durante toda su vida a la programaci&oacute;n funcional no usan los objetos (ni quieren saber nada de ellos). Pero cuando un programador cambia su modo de pensar "funcional" al de "objetos", se puede decir que ha alcanzado el mayor nivel para poder desarrollar con garant&iacute;as aplicaciones profesionales, rigurosas, reutilizables y r&aacute;pidas de desarrollar que al fin y al cabo es lo que importa.</P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a ver dos partes que nos introducir&aacute;n en lo que consiste hoy en d&iacute;a la programaci&oacute;n a nivel profesional, ya que considero que quiz&aacute;s sea m&aacute;s interesante saber adem&aacute;s de los precedentes del lenguaje Delphi expuestos anteriormente, la actualidad en el mundo de la programaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Por esto, la primera parte va a estar totalmente centrada en:</P>
<B><P ALIGN="JUSTIFY">Programaci&oacute;n Orientada a Objetos, </P>
<P ALIGN="JUSTIFY">&nbsp;</B>y la segunda en el Dise&ntilde;o:</P>
<B><P ALIGN="JUSTIFY">Programaci&oacute;n Orientada a Eventos, </P>
<P ALIGN="JUSTIFY">Entorno de Desarrollo Visual y</P>
<P ALIGN="JUSTIFY">Herramienta de Desarrollo R&aacute;pido.</P>
</B><P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Pero antes que nada, una aclaraci&oacute;n. Lo expuesto no va a estar todo lo rigurosamente que deber&iacute;a si esto fuera dirigido a otro tipo de p&uacute;blico, as&iacute; que como lo que importa es que se entienda, el puritanismo y las formalidad absolutas han sido erradicadas.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4>3. Programaci&oacute;n Orientada a Objetos (OOP)</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para situarnos antes que nada, vamos a clasificar los lenguajes de programaci&oacute;n en tres categor&iacute;as:</P>
<OL>

<P ALIGN="JUSTIFY"><LI>Funcionales (C, Pascal, Modula2, Basic...)</LI></P>
<P ALIGN="JUSTIFY"><LI>Declarativos (Lisp, Prolog, Goffer-Haskell...)</LI></P>
<P ALIGN="JUSTIFY"><LI>Orientados a Objetos (Java, Delphi... ¿C++?)</LI></P></OL>

<P ALIGN="JUSTIFY">Delphi se basa en Object Pascal, un lenguaje totalmente orientado a objetos, categor&iacute;a en la que tan solo se pueden incluir lenguajes tales como Smalltalk (pero que tan solo sirve para el &aacute;mbito universitario), Eiffel (siquiera m&aacute;s in&uacute;til que el anterior hoy en d&iacute;a), Java (el verdaderamente &uacute;til si no se le saca de su terreno: Internet y multiplataformas) y C++ (con este &uacute;ltimo no me cansar&eacute; nunca de decir que es C con una librer&iacute;a de Objetos a&ntilde;adida, por muy potente que sea).</P>
<P ALIGN="JUSTIFY">La OO (Orientaci&oacute;n a Objetos) hace de Object Pascal un lenguaje muy potente, ya que simplifica en gran medida muchos de los problemas que se plantean en el desarrollo de aplicaciones complejas usando un lenguaje procedural, como pueden ser Pascal, C o Basic. ¿Y por qu&eacute; esta afirmaci&oacute;n? Pues porque cuando los programas que se realizan hoy en d&iacute;a en el mundo profesional dejan de llamarse "programas" para denominarse "Proyectos", la metodolog&iacute;a funcional aplicada a un trabajo que raramente se hace ya por una sola persona, practicamente no sirve. Esto se produce en el momento en el que la programaci&oacute;n es realizada por un equipo de programadores. </P>
<P ALIGN="JUSTIFY">Imaginemos a varias personas programando en C o Pascal sobre un mismo programa, con un resultado final de decenas de miles de l&iacute;neas de c&oacute;digo, centenares de rutinas que seguramente podr&aacute;n ser reutilizadas en futuros proyectos... y seguro que habr&aacute; un mont&oacute;n de esas rutinas que uno de los programadores ha creado y hace pr&aacute;cticamente lo mismo que la de otro compa&ntilde;ero, pero que est&aacute; en m&oacute;dulo distinto al suyo... </P>
<P ALIGN="JUSTIFY">Seguro que la coordinaci&oacute;n tan s&oacute;lo se tratar&aacute; de hacer al final, cuando todas las partes est&eacute;n terminadas, asegurando cuelgues, cabreos, noches perdidas buscando el maldito bug que hace que al pulsar sobre un simple bot&oacute;n REVIENTE el programa con mensajes tan conocidos como: Abnormal Program Termination, o Stack Overflow (para los amantes del DOS), o los (Exception Halting Error at: 13243:2354:000h in Runtime.DLL, para los programadores de Visual C...)</P>
<P ALIGN="JUSTIFY">Y es que ya no vale que se diga: Quiero un programa que haga la gesti&oacute;n de mi VideoClub.</P>
<P ALIGN="JUSTIFY">Y que el programador se cree un esquema de todo lo que va a ser el programa, en media hora, para r&aacute;pida y &aacute;vidamente pasar a escribir l&iacute;neas de c&oacute;digo como un descosido.</P>
<P ALIGN="JUSTIFY">Es verdad que existen t&eacute;cnicas de desarrollo de proyectos tipo Ingenier&iacute;a del Software con Ciclos de Vida en Cascada, Desarrollo de Prototipos, incluso M&eacute;trica, Diagramas de Flujo de Datos, Diagramas de Arquitectura, Diagramas de Estados... (vamos, lo que se suele dar en 3º o 4º de Inform&aacute;tica en nuestras queridas Universidades Espa&ntilde;olas).</P>
<P ALIGN="JUSTIFY">Estas t&eacute;cnicas sirven para dise&ntilde;ar lo que va a ser el producto final, bas&aacute;ndose en las especificaciones del cliente que pide el programa, y que pasar&aacute;n por sucesivas fases de refinamiento de requisitos hasta que todo quede bien atado y se pueda firmar un contrato que d&eacute; lugar al comienzo de la programaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Pero todas esas t&eacute;cnicas, cuando se basan en la programaci&oacute;n funcional, est&aacute;n totalmente desfasadas. Esto ya ha sido m&aacute;s que probado con el mejor m&eacute;todo que conoce el hombre para cerciorarse de algo: Tras un a&ntilde;o de trabajo, la conclusi&oacute;n sobre el trabajo obtenido es: ¡ESTO NO SIRVE!, o ¡ESTO NO ES LO QUE HABIA PEDIDO!</P>
<P ALIGN="JUSTIFY">As&iacute; que nadie se desanime si esto es lo que tiene que estudiar porque lo dicen los planes de estudio, ya que en algunos sitios se da tambien el dise&ntilde;o de proyectos basados en Metodolog&iacute;a de Objetos, que al final lo que produce es un conjunto de diagramas y esquemas que los programadores tendr&aacute;n que convertir en c&oacute;digo de un lenguaje OO.</P>
<P ALIGN="JUSTIFY">Este dise&ntilde;o tiene en com&uacute;n con los anteriores en que los desarrollan analistas especializados en esta tarea, en que se definen una etapas por las que necesariamente se tiene que pasar para alcanzar el final. Pero difieren radicalmente en el planteamiento de las soluciones a los problemas presentados.</P>
<P ALIGN="JUSTIFY">En la programaci&oacute;n funcional siempre se basa en pensar desde el punto de vista de los procesos, es decir: </P>
<P ALIGN="JUSTIFY">¿Que se necesita que se aplique una f&oacute;rmula sobre un conjunto de datos? </P>
<P ALIGN="JUSTIFY">Pues se piensa directamente en la funci&oacute;n o procedimiento que lo resuelva. </P>
<P ALIGN="JUSTIFY">¿Que se necesita una representaci&oacute;n de esos datos en forma de tabla en pantalla? </P>
<P ALIGN="JUSTIFY">Pues se hace la pertinente funci&oacute;n. </P>
<P ALIGN="JUSTIFY">Y esto se aplica a todo, obteniendo al final un conjunto de funciones y procedimientos que resuelven todos los requisitos planteados, para, posteriormente, crearse una rutina principal que las vaya llamando seg&uacute;n se necesiten, y haga de interfaz y control. Por supuesto que cualquier proyecto se puede llevar a cabo mediante esta t&eacute;cnica, de hecho as&iacute; es como se viene haciendo desde que la inform&aacute;tica naci&oacute; hace ya 40 a&ntilde;os o m&aacute;s. </P>
<P ALIGN="JUSTIFY">Pero pong&aacute;monos ahora en el caso de que el macroprograma que se ha conseguido desarrollar ha tenido tanto &eacute;xito que vamos a sacar una nueva versi&oacute;n. Lo t&iacute;pico es coger el c&oacute;digo antiguo, y comenzar a "trastocar" y "mejorar" todas las rutinas. Pero lo suyo es partir desde cero aplicando la &uacute;nica reutilizaci&oacute;n de c&oacute;digo posible en la programaci&oacute;n funcional: Copy-Paste. O sea, coger una funci&oacute;n que queremos reutilizar y copiarla en el nuevo programa. Ante esto, se puede tener la seguridad de que ser&aacute; una ardua tarea coger las funciones que estaban preparadas para el c&oacute;digo antiguo, que depend&iacute;an de variables globales para funcionar de una forma u otra, a la que se hab&iacute;an a&ntilde;adido par&aacute;metros para poder utilizarla en varios casos distintos, con lo que la dependencia del c&oacute;digo alrededor suya era total... y ahora se quiere reutilizar en otro sitio...</P>
<P ALIGN="JUSTIFY">Es cierto que existen mejoras a la programaci&oacute;n funcional, como por ejemplo, la abstracci&oacute;n, la declaraci&oacute;n de variables locales, la modularidad intentando crear cajas negras de las que tan s&oacute;lo interesa saber qu&eacute; hacen y n&oacute; c&oacute;mo lo hacen..., pero ha llegado un momento en el que todo esto es insuficiente.</P>
<P ALIGN="JUSTIFY">Desde hace varios a&ntilde;os y debido a todos estos problemas que provocaron terribles quebraderos de cabeza conforme la complejidad del software aumentaba, comenz&oacute; a tomarse en serio lo de la programaci&oacute;n OO. No es que naciera hace poco, ya que como tal existe desde hace much&iacute;simos a&ntilde;os (el Smalltalk es de los 60-70), sino que al ser una forma de considerar la programaci&oacute;n totalmente distinta, fue dejada de lado expresamente.</P>
<P ALIGN="JUSTIFY">¿Y qu&eacute; es lo que puede aportar la programaci&oacute;n OO?</P>
<P ALIGN="JUSTIFY">Pues en primer lugar, hay que trastocar completamente la forma de representar las cosas. Ahora no vamos a centrarnos en los procesos, funciones y todo lo que sea el funcionamiento del programa desde el punto de vista del ordenador. ¡Ahora vamos a pensar como humanos! Se tendr&aacute; que pensar en las cosas como "Objetos", sobre los cuales se van a hacer determinadas operaciones, que en principio van a ser independientes del lugar en el que est&eacute;n implementados (ya hemos solucionado el problema de la reutilizaci&oacute;n, algo que de por s&iacute; ya ser&iacute;a suficiente para su uso).</P>
<P ALIGN="JUSTIFY">Estos objetos van a clasificarse seg&uacute;n clases o colecciones, como por ejemplo los objetos: C&iacute;rculo, Cuadrado, Tri&aacute;ngulo, agrupados en la Clase: Figuras.</P>
<P ALIGN="JUSTIFY">As&iacute; tendremos objetos agrupados en clases, independientes entre s&iacute;, que se podr&aacute;n utilizar en cualquier lugar, que podr&aacute;n ser modificadas internamente sin que los programas que las utilizan se percaten de ello a no ser que sea para mejor... (bueno, algunas veces las mejoras tan solo son publicidad... como Windows).</P>
<P ALIGN="JUSTIFY">&nbsp;Pues bien, con este repaso de lo que es la OO he intentado plantear como est&aacute;n las cosas desde un punto de vista informal, pero como existen gustos para todo, ahora es necesario que lo expuesto anteriormente sea expresado m&aacute;s formalmente, de modo que los futuros programadores de OO vayan conociendo los nombres propios de esta nueva forma de entender la programaci&oacute;n. Pero ahora vamos a ir relacion&aacute;ndolos con Delphi. Estos nombres propios son:</P>

<UL>
<P ALIGN="JUSTIFY"><LI>Objetos y Clases</LI></P>
<P ALIGN="JUSTIFY"><LI>Encapsulaci&oacute;n</LI></P>
<P ALIGN="JUSTIFY"><LI>Herencia y</LI></P>
<P ALIGN="JUSTIFY"><LI>Polimorfismo.</LI></P></UL>

</FONT><B><FONT FACE="Arial" SIZE=3>3.1 Objetos y Clases</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">En Delphi pr&aacute;cticamente todo son objetos, desde un bot&oacute;n hasta un formulario (que son componentes de Delphi).</P>
<P ALIGN="JUSTIFY">Existen objetos predefinidos, como los citados componentes, pero nosotros tambi&eacute;n podemos definir nuestros propios objetos.. </P>
<P ALIGN="JUSTIFY">Un objeto siempre parte de un molde, al que habitualmente se conoce como Clase. En la definici&oacute;n de esta clase se establecen las caracter&iacute;sticas de los objetos y se implementan sus funciones y procedimientos, as&iacute; como sus variables internas, sus valores inciales, la forma en que van a ser llamados, las partes que son p&uacute;blicas, las partes privadas...</P>
<P ALIGN="JUSTIFY">Una vez que se tiene la clase, podemos crear objetos de esa clase, que se llamar&aacute;n instancias de esa clase. Por ejemplo, dada la clase "Figuras" anterior, si queremos utilizarla, tendremos que hacer una instancia de ella. Puede que esto ahora no se entienda, as&iacute; que pongamos un ejemplo m&aacute;s claro.</P>
<P ALIGN="JUSTIFY">Supongamos la clase "Integer".</P>
<P ALIGN="JUSTIFY">Ahora si se pone: </P>
<B><P ALIGN="JUSTIFY">var</B> contador:<B>Integer</B>;</P>
<P ALIGN="JUSTIFY">Se puede decir que "contador" es un objeto que es una instancia de la clase "Integer"</P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">3.2 Encapsulaci&oacute;n</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Se conoce con este nombre a una de las tres principales caracter&iacute;sticas de la programaci&oacute;n OO. Un objeto contiene en su interior las variables necesarias para almacenar los datos sobre los que va a trabajar, as&iacute; como los procedimientos y funciones precisas para manipularlos. Ning&uacute;n c&oacute;digo externo al propio objeto puede acceder a sus variables (a menos que se declaren como p&uacute;blicas), lo que evita muchos problemas.</P>
<P ALIGN="JUSTIFY">De esta forma el c&oacute;digo interno del objeto puede estar seguro de que su contenido no ha sido alterado externamente, y que, por tanto, ser&aacute; v&aacute;lido en cualquier momento</P>
<P ALIGN="JUSTIFY">Un objeto desde esta perspectiva, es como una c&aacute;psula en la cual est&aacute;n contenidas las herramientas y los materiales necesarios para desempe&ntilde;ar la funci&oacute;n que corresponda. </P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">3.3 Herencia</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La herencia es la segunda palabra m&aacute;gica de la orientaci&oacute;n a objetos, y seguramente la caracter&iacute;stica m&aacute;s &uacute;til dado que permite ahorrar la escritura de mucho c&oacute;digo. Mediante la herencia, es posible definir una nueva clase de objetos a partir de otra que ya existe, quedando todos sus miembros, tanto datos como procedimientos disponibles por la nueva clase. E incluso es posible a&ntilde;adir nuevos miembros a esta clase, ampliando la anterior. De esta forma, la clase nueva va a ser una heredera de la clase padre antigua. Tomar&aacute; toda su implementaci&oacute;n y le a&ntilde;adir&aacute; nuevas cosas.</P>
<P ALIGN="JUSTIFY">Esto constituye una jerarqu&iacute;a de clases entre padres e hijos que a su vez pueden ser padres de otros hijos, y lo que puede ser la clase inicial totalmente tonta, en los hijos finales se puede convertir en la repera. (¿Se ve la similitud de esto con la evoluci&oacute;n humana?)</P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">3.4 Polimorfismo</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Seguramente este aspecto es el m&aacute;s incomprendido de la programaci&oacute;n OO, pero tambi&eacute;n es de los m&aacute;s &uacute;tiles. Un objeto polim&oacute;rfico es aquel que en tiempo de edici&oacute;n, (cuando estamos escribiendo c&oacute;digo), no conoce su tipo (la clase la que pertenece), informaci&oacute;n que obtiene posteriormente en tiempo de ejecuci&oacute;n.</P>
<P ALIGN="JUSTIFY">El polimorfismo permite que un programa manipule de una forma homog&eacute;nea a objetos que son diferentes, ahorrando de paso la escritura de mucho c&oacute;digo. Como es l&oacute;gico, estos objetos deben disponer de una informaci&oacute;n m&iacute;nima en tiempo de edici&oacute;n, y van a consumir muchos m&aacute;s recursos que los objetos normales. </P>
<P ALIGN="JUSTIFY">Podr&aacute; parecer algo muy extra&ntilde;o este tipo de objetos, pero algunas veces son muy &uacute;tiles. </P>
<P ALIGN="JUSTIFY">Y hasta aqu&iacute; lo concerniente a la OO.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">4. Desarrollo.</P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">4.1 Programaci&oacute;n Orientada a Eventos (EOP)</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para tratar de que esto quede lo m&aacute;s sencillo de entender posible, pongamos un ejemplo de lo que sucede en Windows cuando se pulsa un bot&oacute;n.</P>
<P ALIGN="JUSTIFY">Al que usa un programa y simplemente desplaza el cursor hasta ponerlo encima de un control y luego pulsa el bot&oacute;n izquierdo para que se haga una acci&oacute;n, no le importa para nada lo que est&aacute; sucediendo dentro del programa; lo &uacute;nico que quiere es que lo que se supone que realiza el control se haga cuando se pulse. Pero para los programadores es pr&aacute;cticamente imprescindible saber qu&eacute; est&aacute; pasando.</P>
<P ALIGN="JUSTIFY">Ante todo, lo primero que hay que tener en cuenta es que se trabaja sobre Windows, es decir, en un entorno donde en cada segundo se generan cientos de mensajes internos, entre todas las cosas que hay en pantalla por un lado, y el propio Windows interiormente por otro.</P>
<P ALIGN="JUSTIFY">Los mensajes podemos verlos inicialmente como una especie de cartas que son escritas por un objeto del sistema y enviados a trav&eacute;s de un sistema de manejo de mensajes que conforma el n&uacute;cleo de Windows.</P>
<P ALIGN="JUSTIFY">Imaginemos a una persona que escribe una carta, que ser&aacute; un objeto y un mensaje respectivamente. Al enviar la carta, se deja en el servicio de correos (en nuestro caso Windows), para que se encargue de hacer llegar la informaci&oacute;n a su destinatario o destinatarios.</P>
<P ALIGN="JUSTIFY">Ahora pong&aacute;mosle nombres propios a las cosas.</P>
<P ALIGN="JUSTIFY">Supongamos que tenenos un objeto Rat&oacute;n, un objeto bot&oacute;n, y Windows de por medio.</P>
<P ALIGN="JUSTIFY">Supongamos tambien que el bot&oacute;n cambia al color rojo cuando el cursor est&aacute; sobre &eacute;l, y que vuelve a su color anterior cuando deja de estarlo.</P>
<P ALIGN="JUSTIFY">Cuando se desplaza el cursor sobre la pantalla, el objeto Rat&oacute;n est&aacute; continuamente mandando mensajes a Windows para que actualize su posici&oacute;n y se vea donde se debe ver (mientras tanto, el bot&oacute;n est&aacute; en espera de que pase algo). Pues cuando decidimos poner el cursor del rat&oacute;n sobre el bot&oacute;n, ocurrir&aacute;n los siguientes mensajes (hay muchos m&aacute;s, pero ahora nos centramos en los m&aacute;s importantes).</P>
<OL>

<P ALIGN="JUSTIFY"><LI>Rat&oacute;n a Windows: Actualiza mi posici&oacute;n.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows a V&iacute;deo: Pon el Cursor en la nueva posici&oacute;n.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows a Bot&oacute;n: El Cursor ha entrado en tu zona.</LI></P>
<P ALIGN="JUSTIFY"><LI>Bot&oacute;n a Windows: Cambia mi color al rojo.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows a V&iacute;deo: Pon el Bot&oacute;n en rojo.</LI></P>
<P ALIGN="JUSTIFY"><LI>Rat&oacute;n: BOTON IZQUIERDO PULSADO</LI></P>
<P ALIGN="JUSTIFY"><LI>Rat&oacute;n a Windows: Bot&oacute;n Izquierdo pulsado.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows a Bot&oacute;n: El Rat&oacute;n ha pulsado con el bot&oacute;n izquierdo sobre t&iacute;.</LI></P>
<P ALIGN="JUSTIFY"><LI>Bot&oacute;n: ORDEN DE EJECUCION.</LI></P>
<P ALIGN="JUSTIFY"><LI>Bot&oacute;n a Windows: Ejecuta mi c&oacute;digo.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows a V&iacute;deo: Pon el Bot&oacute;n primero hundido y luego no hundido.</LI></P>
<P ALIGN="JUSTIFY"><LI>Windows: EJECUTA CODIGO BOTON.</LI></P></OL>

<P ALIGN="JUSTIFY">¡Y esto es tan solo un bot&oacute;n, una de las cosas m&aacute;s simples de Windows!</P>
<P ALIGN="JUSTIFY">Puede parecer un aut&eacute;ntico foll&oacute;n, pero no hay que alarmarse ya que esto es pr&aacute;cticamente transparente para el programador que use un entorno de programaci&iacute;n Visual, teniendo tan s&oacute;lo que preocuparse de escribir el c&oacute;digo que tiene que ejecutarse cuando se pulse el bot&oacute;n del rat&oacute;n sobre el bot&oacute;n de la pantalla. Otra cosa ser&iacute;a si se quisieran hacer efectos de movimiento, cambios de colores y formas… </P>
<P ALIGN="JUSTIFY">Podemos pensar ahora que cada vez que movamos el rat&oacute;n pasar&aacute;n cosas como esta, y se estar&aacute; en lo cierto. Y adem&aacute;s, tambien hay mensajes internos entre los objetos sin que medie el rat&oacute;n, o el teclado, por ejemplo la ejecuci&oacute;n de aninaciones, de m&uacute;sica… en definitiva, de todo.</P>
<P ALIGN="JUSTIFY">Pues para que el programador se encargue tan solo de los eventos que le interesen, despreocup&aacute;ndose de los dem&aacute;s, Delphi tiene una forma muy sencilla de hacerlo por nosotros.</P>
<P ALIGN="JUSTIFY">Para cada objeto que se suelte sobre un formulario, y tal y como dijimos antes, hay un conjunto de propiedades y un conjunto de procedimientos predefinidos. Pues ahora es el momento de decir que esos procedimientos no son otra cosa que manejadores de los eventos m&aacute;s importantes que se pueden dar en ese objeto, es decir, son procedimientos para responder ante los mensajes de Windows.</P>
<P ALIGN="JUSTIFY">Casi todos los objetos tienen en com&uacute;n un conjunto de procedimientos llamados: OnClick, OnMouseDown, OnMouseUp, OnKeyPress, OnKeyDown, OnKeyUp… y tan solo hay que traducir su significado al espa&ntilde;ol para darnos cuenta de su utilidad.</P>
<P ALIGN="JUSTIFY">Centr&eacute;monos por ejemplo en OnMouseDown.</P>
<P ALIGN="JUSTIFY">Si no hacemos nada, cuando a nuestro objeto llegue el cursor y se pulse el bot&oacute;n izquierdo del rat&oacute;n, Windows le enviar&aacute; un mensaje indic&aacute;ndoselo y como no hemos dicho qu&eacute; hacer, nuestro objeto ignorar&aacute; ese mensaje. Pero si hemos creado c&oacute;digo dentro de OnMouseDown, este c&oacute;digo se ejecutar&aacute; siempre que se reciba el mensaje de Windows de que han pulsado sobre &eacute;l.</P>
<P ALIGN="JUSTIFY">As&iacute; se puede f&aacute;cilmente reaccionar ante todo lo que se produzca. </P>
<P ALIGN="JUSTIFY">Ahora parece m&aacute;s sencillo ¿no?</P>
<P ALIGN="JUSTIFY">Una vez expuesto todo esto, lo que queda por decir en esta parte es qu&eacute; es la programaci&oacute;n orientada a eventos. Es un modo de programar (que se tendr&aacute; que tener en cuenta juntamente con la programaci&oacute;n orientada a objetos), totalmente distinto al modo tradicional del DOS. Ahora hay que pensar que s&oacute;lo se va a reaccionar ante la entrada del usuario a trav&eacute;s del rat&oacute;n, teclado o cualquier otro dispositivo, estando mientras tanto nuestro programa inactivo y tan solo respondiendo las partes que se vean afectadas en un determinado momento sin que se pueda decir que hay un procedimiento principal que se encargue del control. Cada objeto se encargar&aacute; de reaccionar por s&iacute; mismo. Vale que su modo de funcionar dependa de lo que se haya hecho previamente, pero es &eacute;l el que tiene que encargarse de su propio funcionamiento, pudiendo verse todo esto como innumerables islas dentro de la aplicaci&oacute;n, que responden tan solo si las cosas van dirigidas hacia ella.</P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">4.2 Entorno de Desarrollo Visual (IDE)</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El t&eacute;rmino Visual se refiere al hecho de que Delphi permite crear aplicaciones "cogiendo" los componentes o elementos que necesitemos y "solt&aacute;ndolos" sobre un formulario de Windows. Pero lo realmente importante es el entorno de desarrollo en su conjunto, ya que como en el fondo un programa Delphi es una colecci&oacute;n de objetos (componentes) relacionados entre s&iacute;, cuando se "suelte" un bot&oacute;n por ejemplo, sobre un formulario, autom&aacute;ticamente Delphi generar&aacute; el c&oacute;digo necesario para declarar y utilizarlo. Tan solo ser&aacute; necesario (y esto es lo verdaderamente importante) centrarnos en lo que debe hacer el bot&oacute;n cuando se pulse, y no perder el tiempo con declaraciones manuales, petici&oacute;n y liberaci&oacute;n de recursos, manejadores de contexto, punteros a estructuras de mensajes…; vamos, todo lo que habr&iacute;a que hacer en Visual C manualmente si queremos salirnos algo de lo com&uacute;n (y eso que es Visual), lo hace el Delphi autom&aacute;ticamente, y aqu&iacute; es donde est&aacute; la gran diferencia entre los dos lenguajes.</P>
<P ALIGN="JUSTIFY">En resumen, el Entorno Visual de Delphi se encarga de generar autom&aacute;ticamente los manejadores de mensajes de cada objeto, de sus declaraciones, de la importaci&oacute;n de las librer&iacute;as de objetos en las que se encuentran, de permitirnos ver durante la edici&oacute;n el modo en que se va a ver durante la ejecuci&oacute;n, algo verdaderamente importante.</P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">4.3 Herramienta de Desarrollo R&aacute;pido (RAD)</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El conjunto de objetos que nos ofrece Delphi para su uso, junto al entorno visual y su generador autom&aacute;tico de c&oacute;digo, adem&aacute;s de la orientaci&oacute;n a objetos, lo hacen id&oacute;neo para desarrollar aplicaciones lo m&aacute;s r&aacute;pidamente posible, ya que se puede dise&ntilde;ar un interfaz (lo que se va a ver externamente del programa) en muy poco tiempo.</P>
<P ALIGN="JUSTIFY">Hoy en d&iacute;a, lo que importa es la productividad a la hora de desarrollar software, y si se pierde el poco tiempo que se suele tener para la programaci&oacute;n en cosas que son externas al funcionamiento principal de la aplicaci&oacute;n, tales como rutinas de manejo de mensajes, manejo de memoria, de dispositivos, el fracaso profesional est&aacute; asegurado. Por eso, hoy en d&iacute;a, cualquier lenguaje o es Visual o no sirve, as&iacute; de claro.</P>
<P ALIGN="JUSTIFY">Y si adem&aacute;s permite la reutilizaci&oacute;n de c&oacute;digo (Delphi, Visual Basic, Visual C, Java), la reprogramaci&oacute;n de los objetos que siempre usamos de la misma forma (Delphi, Visual C, Java), el entorno de desarrollo verdaderamente Visual (Delphi, Java, Visual Basic), y la potencia en todos los campos (Delphi), mejor que mejor ¿no?.</P>
</FONT><FONT FACE="Arial"><H3>5. Algunos ejemplos de programas comerciales desarrollados con Delphi</H3>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para acabar este segundo cap&iacute;tulo, vamos a conocer algunas curiosidades acerca de los programas hechos con Delphi.</P>
<P ALIGN="JUSTIFY">El siguiente es un comunicado desde SCOTTS VALLEY, California. 7 de Octubre de 1996 </P>
<P ALIGN="JUSTIFY">El reciente aterrizaje del U.S. Space Shuttle Atlantis concluy&oacute; una excepcional semana para la NASA y Borland International, un l&iacute;der en el suministro de herramientas de desarrollo de software. </P>
<P ALIGN="JUSTIFY">Un mapa computerizado construido con la herramienta Borland Delphi, fue usado en el Atlantis y en la estaci&oacute;n espacial rusa Mir mientras orbitaban en una misi&oacute;n de identificaci&oacute;n y fotografiado de la Tierra. </P>
<P ALIGN="JUSTIFY">La misma semana, otro programa de la NASA desarrollado con Delphi fue galardonado con el premio a la mejor aplicaci&oacute;n Cliente/Servidor por InfoWorld Magazine, un l&iacute;der en la industria de la comunicaci&oacute;n de temas inform&aacute;ticos.</P>
<P ALIGN="JUSTIFY">Otro ejemplo de uso de Delphi, es el reciente premio nacional al mejor programa espa&ntilde;ol de gesti&oacute;n de control de datos y pacientes oncol&oacute;gicos, otorgado por la SEGO (Sociedad Espa&ntilde;ola de Ginecolog&iacute;a y Obstetricia). Este programa se llama CODEON-G (Control de Datos en Oncolog&iacute;a Ginecol&oacute;gica) y fue desarrollado por VESALIO Software en 1997 (s&iacute;, por si alguien lo ha notado es la empresa donde trabajo, y fui uno de los programadores de CODEON). Esto no pretende ser autopublicidad, ya que lo que es el programa en s&iacute; y su codificaci&oacute;n, conforman una peque&ntilde;&iacute;sima parte de lo que supone este descomunal proyecto, donde las partes de investigaci&oacute;n durante m&aacute;s de 3 a&ntilde;os han sido desarrolladas por verdaderos profesionales, tanto inform&aacute;ticos como m&eacute;dicos. Tan solo quiero hacer ver que es posible que mortales como nosotros realicemos programas de calidad sobresaliente en nuestra propia tierra.</P>
<P ALIGN="JUSTIFY">Por otro lado, corren tambi&eacute;n ciertos rumores de que desde la versi&oacute;n 6 de Corel Draw, el c&oacute;digo desarrollado en Delphi sustituy&oacute; a una buena parte del desarrollado en C, sobre todo la parte concerniente al entorno del usuario e interfaces.</P>
<P ALIGN="JUSTIFY">Tambien hay cientos de centros que se dedican al procesamiento de im&aacute;genes (sobre todo universidades) que est&aacute;n poco a poco traspas&aacute;ndose a Delphi, aunque si es verdad que las librer&iacute;as m&aacute;s importantes de este tipo (como las Lead Tools que utilizan Adobe PhotoShop y Corel PhotoPaint) a&uacute;n son desarrolladas en C, tambien es cierto que comienzan a estar disponibles ficheros de declaraciones, de conversi&oacute;n de tipos y de reutilizaci&oacute;n de DLLs para su uso en Delphi.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>



<B><h4>Cuelgues Mentales</h4> 
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como no toda la Inform&aacute;tica es seria… ¿acaso no existe Windows 95?</P>
<P ALIGN="JUSTIFY">Bueno, a lo que iba, como no toda la inform&aacute;tica tiene que ser vista desde el mismo punto de vista, en esta secci&oacute;n que cerrar&aacute; todos los cap&iacute;tulos de este curso de Delphi voy a poner lo mejor del humor inform&aacute;tico que he podido recopilar. </P>
<P ALIGN="JUSTIFY">Pero antes quiero dejar claro que no me pertenecen, tan solo las he traducido.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En esta primera ocasi&oacute;n vamos a conocer lo errores de Windows no documentados que Microsoft olvid&oacute; poner en sus manuales:</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">"Windows Error-codes"</P>
</B><P ALIGN="JUSTIFY"></P>

<P><FONT FACE="Arial" SIZE=1><B>WinErr</B>: <B>001</B> Windows loaded - <I>Sistema en peligro</P>
</I><B><P>WinErr</B>: <B>002</B> No Error - <I>A&uacute;n…</P>
</I><B><P>WinErr</B>: <B>003</B> Dynamic linking error - <I>Tu error est&aacute; ahora en cada fichero que hayas abierto</P>
</I><B><P>WinErr</B>: <B>004</B> Erronious error - <I>Nada est&aacute; mal</P>
</I><B><P>WinErr</B>: <B>005</B> Multitasking attempted - <I>Sistema confuso</P>
</I><B><P>WinErr</B>: <B>006</B> Malicious error - <I>No muevas el rat&oacute;n, pero puedes seguir haciendo lo que quieras</P>
</I><B><P>WinErr</B>: <B>007</B> System price error <I>- Cantidad insuficiente de dinero gastado en tu hardware</P>
</I><B><P>WinErr: 008</B> Broken window - <I>Ten cuidado con los fragmentos del disco duro</P>
</I><B><P>WinErr: 009</B> Horrible bug encountered - <I>Solamente Dios sabe lo que ha pasado</P>
</I><B><P>WinErr: 00A</B> Promotional literature overflow - <I>Mailbox lleno</P>
</I><B><P>WinErr: 00B</B> Inadeqaute disk space - <I>Libera al menos 1GB para el Sistema Operativo</P>
</I><B><P>WinErr: 00C</B> Memory hog error - <I>Se necesita m&aacute;s memoria… m&aacute;s, m&aacute;s, ¡MAS!</P>
</I><B><P>WinErr: 00D</B> Window closed - <I>No mires fuera</P>
</I><B><P>WinErr: 00E</B> Window open - <I>No mires dentro</P>
</I><B><P>WinErr: 00F</B> Unexplained error - <I>Por favor, dinos qu&eacute; est&aacute; pasando</P>
</I><B><P>WinErr: 010</B> Reserved for future mistakes by our developers - <I>NO COMMENT</P>
</I><B><P>WinErr: 011</B> Window open - <I>¡Te he dicho que no mires fuera! ¡A la pr&oacute;xima casco!</P>
</I><B><P>WinErr: 012</B> Window closed - <I>!Te he dicho que no mires dentro! ¡A la pr&oacute;xima casco!</P>
</I><B><P>WinErr: 013</B> Unexpected error - <I>¿Mande?</P>
</I><B><P>WinErr: 014</B> Keyboard locked - <I>Piensa cualquier otra cosa que se te ocurra y pulsa una tecla</P>
</I><B><P>WinErr: 018</B> Unrecoverable error - <I>El sistema ha sido destruido. Compra uno nuevo</P>
</I><B><P>WinErr: 019</B> User error - <I>No tenemos la culpa ¡No y NO!</P>
</I><B><P>WinErr: 01A</B> Operating system overwritten - <I>Por favor, reinstala Windows por primera vez</P>
</I><B><P>WinErr: 01B</B> Illegal error - <I>Este error no te est&aacute; permitido, tienes una falta grave</P>
</I><B><P>WinErr: 01C</B> Uncertainty error - <I>Incierto podr&iacute;a ser inadecuado</P>
</I><B><P>WinErr: 01D</B> System crash - <I>No creemos que sea culpa de nuestro c&oacute;digo</P>
</I><B><P>WinErr: 01E</B> Timing error - <I>Por favor, espere… espere hasta que el sistema sea estable</P>
</I><B><P>WinErr: 01F</B> Reserved for future mistakes of our developers. - <I>REQUETE NO COMMENT</P>
</I><B><P>WinErr: 020</B> Error recording error codes - <I>Los errores no grabados se perder&aacute;n</P>
</I><B><P>WinErr: 042</B> Virus error - <I>¿Como te atreves a instalar OS/2 en otra partici&oacute;n?</P>
</I><B><P>WinErr: 079</B> Mouse not found - <I>Por favor, pulse el bot&oacute;n izquierdo del rat&oacute;n para continuar</P>
</I><B><P>WinErr: 103</B> Error buffer overflow - <I>Has provocado demasiados errores. Resetea y luego salva</P>
</I><B><P>WinErr: 678</B> This will end your Windows session. - <I>¿Quieres crear un acceso directo?</P>
</I><B><P>WinErr: 683</B> Time out error - <I>Debes cambiar el procesador, es demasiado lento</P>
</I><B><P>WinErr: 815</B> Insufficient Memory - <I>O tienes 64Mb o no puedes usar el rat&oacute;n</P>
</I>


<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulac.htm"><font FACE="ARIAL"><B>[Curso de Delphi]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

