<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Visual en Delphi.<hr> <font color="#009933"><b>C</b></font>urso de programación.</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>


<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
El Entorno de Programaci&oacute;n de Delphi 4. (2 de 2)
</H3>

<!-- PEGAR AQUI EL ARTICULO (se puede borrar la línea que viene a continuación) -->

<B><FONT FACE="Arial,Helvetica"><P ALIGN="JUSTIFY">2. Herramientas de Soporte </P>
</B></FONT><FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">Junto al IDE, que se encarga de centralizar todo el desarrollo y de ofrecer acceso a otras opciones, existen herramientas tambien accesibles desde &eacute;l. Estas herramientas se engloban en las siguientes categor&iacute;as CASE:</P>
<B><P ALIGN="JUSTIFY">2.1. Herramienta de Dise&ntilde;o Gr&aacute;fico</P>
</B><P ALIGN="JUSTIFY">En Delphi 4 se incluye ImageEdit, una peque&ntilde;a aplicaci&oacute;n para la creaci&oacute;n de iconos, cursores y peque&ntilde;os bitmaps que cumple su funci&oacute;n espec&iacute;fica a la perfecci&oacute;n.</P>
<B>
<P ALIGN="JUSTIFY">2.2. Herramientas de Documentaci&oacute;n</P>
</B><P ALIGN="JUSTIFY">OpenHelp y WinHelp.</P>
<P ALIGN="JUSTIFY">Estos dos programas sirven para la creaci&oacute;n de la documentaci&oacute;n del programa.</P>
<P ALIGN="JUSTIFY">Principalmente se suelen usar para la distribuci&oacute;n final de los ficheros de ayuda que acompa&ntilde;ar&aacute;n al producto software final que llegar&aacute; a manos de los usuarios, pero tambien pueden ser utilizados para la documentaci&oacute;n interna del proyecto.</P>
<P ALIGN="JUSTIFY">La mejor de ellas es OpenHelp, que es un nuevo formato de ayuda basado en HTML din&aacute;mico, permitiendo una mejor estructuraci&oacute;n de la informaci&oacute;n y por consiguiente, de b&uacute;squeda y localizaci&oacute;n de un tema determinado.</P>
<P ALIGN="JUSTIFY">WinHelp es el cl&aacute;sico compilador de ayuda de Windows 9x.</P>
<B><P ALIGN="JUSTIFY">2.3. Herramientas de Bases de Datos</P>
</B><P ALIGN="JUSTIFY">Delphi 4 es uno de los m&aacute;s potentes entornos de desarrollo de bases de datos, tanto para Desktop y redes locales, como Cliente-Servidor, implementando los protocolos m&aacute;s usados mundialmente.</P>
<P ALIGN="JUSTIFY">Las herramientas que se incluyen son aplicaciones que sirven de soporte al desarrollo de las bases de datos de un programa de gesti&oacute;n. </P>
<P ALIGN="JUSTIFY">Mediante DataBase Desktop se podr&aacute;n crear tablas de tipo:</P>
<P ALIGN="JUSTIFY">Paradox, DBase, Informix, Oracle, Access, SyBase... v&iacute;a ODBC, o v&iacute;a los drivers nativos incluidos en Delphi.</P>
<center><table width="507"> 
<td><img src="gif/d4_8.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 8. DataBase Desktop.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">El DataBase Explorer permitir&aacute; la navegaci&oacute;n por las bases de datos de los proyectos que se encuentren en una determinada m&aacute;quina (local o remota), permitiendo una r&aacute;pida navegaci&oacute;n entre las distintas tablas de cada uno.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<center><table width="600"> 
<td><img src="gif/d4_9.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 9. DataBase Explorer.</center></font></td> 
</table></center> 

<P ALIGN="JUSTIFY">Adem&aacute;s del DataBase Explorer, el BDE Administrator puede configurar los drivers de los distintos tipos de bases de datos que se encuentren instalados en el sistema.</P>
<P ALIGN="JUSTIFY">Estas herramientas ayudan considerablemente al desarrollo de aplicaciones de bases de datos, evitando la necesidad de utilizar aplicaciones externas para ello y centralizando adem&aacute;s de garantizando la compatibilidad del trabajo.</P>
<B></FONT><FONT FACE="Arial,Helvetica"><P ALIGN="JUSTIFY">3. Herramienta de An&aacute;lisis Din&aacute;mico, Intrusiva</P>
</B></FONT><FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">Winsight es la soluci&oacute;n que Delphi aporta para el an&aacute;lisis de programas ya concluidos o en desarrollo. Es capaz de monitorizar toda la actividad que genera un programa en Windows, capturando y mostrando en tiempo real el tr&aacute;fico de mensajes entre todos y cada uno de los objetos que conforman el programa.</P>
<P ALIGN="JUSTIFY">Se pueden definir filtros para localizar el foco de atenci&oacute;n en un determinado tipo de eventos o de mensajes entre objetos, constituyendose en una herramienta indispensable cuando se utiliza Delphi para aplicaciones que tienen que "bajar" al m&aacute;s profundo nivel de la arquitectura de Windows.</P>
<P ALIGN="JUSTIFY">El Debugger que se encuentra integrado dentro del IDE, es una excelente herramienta de depuraci&oacute;n y traceado de c&oacute;digo, que permite monitorizar el programa durante su ejecuci&oacute;n en modo IDE, es decir, con la supervisi&oacute;n del IDE durante su ejecuci&oacute;n, a diferencia con Winsight, que se trata de una aplicaci&oacute;n aparte que monitoriza el ejecutable final, independientemente del IDE.</P>
<center><table width="443"> 
<td><img src="gif/d4_10.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Gr&aacute;fico 10. Debugger.</center></font></td> 
</table></center> 
<P ALIGN="JUSTIFY">Adem&aacute;s, existe la posibilidad de visualizar todos los valores de las variables locales del punto en donde se encuentre la ejecuci&oacute;n del programa en un determinado momento.</P>
<P ALIGN="JUSTIFY">Esto, junto al Evaluador de Expresiones, que consiste en que al situar el cursor sobre una expresi&oacute;n dentro de la ventana de c&oacute;digo y aparece autom&aacute;ticamente su valor en un hint, reduce de una forma important&iacute;sima el tiempo de depuraci&oacute;n.</P>
</FONT><B><FONT FACE="Arial,Helvetica"><P ALIGN="JUSTIFY">4. Documentaci&oacute;n para los Desarrolladores</P>
</B></FONT><FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">Una de las cosas indispensables para el desarrollo de programas es la documentaci&oacute;n para los programadores y analistas programadores, ya que se minimiza sobremanera el tiempo invertido en la localizaci&oacute;n de la sintaxis de determinadas funciones, o la b&uacute;squeda de cualquier otro tipo de informaci&oacute;n que pueda ayudar al desarrollo.</P>
<P ALIGN="JUSTIFY">Delphi 4 incluye un amplio abanico de documentaci&oacute;n en formato WinHelp y OpenHelp que a continuaci&oacute;n se muestran:</P>
<B><P>&nbsp;</P>
<center><table width="218"> 
<td><img src="gif/d4_11.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center></center></font></td> 
</table></center> 
<center><table width="246"> 
<td><img src="gif/d4_12.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center></center></font></td> 
</table></center> 
</FONT><FONT FACE="Arial,Helvetica"><P>En Resumen</P>
</B></FONT><FONT FACE="Arial,Helvetica" SIZE=2><P ALIGN="JUSTIFY">Delphi 4 no puede ser catalogado como una herramienta CASE, debido a que no es su prop&oacute;sito el abarcar todo el ciclo de vida del software, pero posee caracter&iacute;sticas que s&iacute; pueden ser catalogadas bajo el punto de vista CASE, desde el momento en que se encarga de varias fases: Desarrollo, Codificaci&oacute;n, Documentaci&oacute;n...</P>
<P ALIGN="JUSTIFY">Es ideal para el ciclo de vida de prototipos, para el de orientaci&oacute;n a objetos y el de desarrollo visual, no en vano es catalogado como una herramienta RAD (Rapid Application Development), siendo considerado como la herramienta m&aacute;s potente para programas de Bases de Datos bajo plataformas WIntel, dejando atr&aacute;s a VisualBasic, PowerBuilder (multiplataforma), Visual C++, Builder C++ y VisualFox.</P>
<P ALIGN="JUSTIFY">En cuanto a herramienta de prop&oacute;sito general, tan solo es aventajado por Visual C++ en el momento en que hay que programar al m&aacute;s bajo nivel de m&aacute;quina. Pero la dificultad de aprendizaje de este &uacute;ltimo no llega a compensar la poca diferencia de potencia en este campo.</P>
<P ALIGN="JUSTIFY">Delphi lleva el desarrollo orientado a objetos al siguiente nivel, permitiendo al desarrollador separar la actividad de la interfaz de usuario de la l&oacute;gica de la aplicaci&oacute;n, reduciendo as&iacute; las l&iacute;neas de c&oacute;digo, la complejidad del c&oacute;digo, la reutilizaci&oacute;n y la robustez. Delphi 4 incluye muchas acciones est&aacute;ndares predefinidas, reduciendo as&iacute; m&aacute;s el tiempo necesario para crear aplicaciones Windows ricas en funciones totalmente operativas.</P></FONT>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>&Uacute;</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISI&Oacute;N EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="index03.htm">
<FONT FACE="ARIAL"><B>Aula Macedonia</B></FONT>
</A>
<HR>
<A HREF="aulac.htm">
<FONT FACE="ARIAL"><B>Curso de Programación Visual en Delphi</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
AULA MACEDONIA
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>



