<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rónicas de una Creación</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:angigon@arq.upv.es">Antonio Giner.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">



<FONT color="#000000" size=2 face="arial"><br><br><br>

<FONT color="#000000">        

<H3>Remake de "La Abadía del Crimen"</h3>

<P ALIGN=justify>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face=arial>
<table width="198" align="left"> 
<td><img src="gif/abadia00.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Este remake es una de las iniciativas más importantes que hemos conocido</center></font></td> 
</table>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">¡Hola amigos! Os voy a presentar el proyecto que ha minado mi expediente acad&eacute;mico durante los &uacute;ltimos tiempos. Est&aacute; destinado a los nost&aacute;lgicos, pero mi ilusi&oacute;n real es que guste tambi&eacute;n a las nuevas generaciones. Naci&oacute; en mi disco duro y no iba salir de all&iacute;, pero mis amigos me animaron a que lo diera a conocer, y ante mi sorpresa por el inter&eacute;s suscitado, he aqu&iacute;, &quot;el remake&quot;...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La Abad&iacute;a del Crimen... cu&aacute;ntas cosas se han dicho sobre este juego. Todo aquel que lleve cierto tiempo en el mundillo acabar&aacute; en alg&uacute;n momento haciendo referencia a &quot;la abad&iacute;a&quot;. ¿Por qu&eacute;? ¿Qu&eacute; es lo que ten&iacute;a este juego que lo hac&iacute;a tan diferente de sus contempor&aacute;neos, tan especial? La respuesta es TODO.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si tuviera qu&eacute; explicarle a alguien cuales son los objetivos que debe cumplir un buen juego, le dir&iacute;a que se empollase la Abad&iacute;a. Este juego es una especie de manifiesto sobre c&oacute;mo se deben hacer las cosas. Vale, de acuerdo, estamos en 1999, ha llovido mucho desde el 88, las tarjetas aceleradoras son algo cotidiano, el Imperio de Gates Vader nos ofrece las DirectX versi&oacute;n tras versi&oacute;n y muchos somos los que nos hemos pasado ya al Lado Oscuro de la Fuerza. De acuerdo, los tiempos cambian: Do the evolution!! Es bueno que sea as&iacute;. Pero de todos modos, la actual avalancha de miles de pol&iacute;gonos convenientemente texturizados no deber&iacute;a cegar nuestros ojos, impidi&eacute;ndonos disfrutar de vez en cuando del sabor a&ntilde;ejo de los cl&aacute;sicos. Y es que de juegos como la Abad&iacute;a, todos podemos todav&iacute;a aprender un mont&oacute;n de cosas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El proyecto empez&oacute; hace alg&uacute;n tiempo, cuando decid&iacute; hacer un cargador para la versi&oacute;n PC de la Abad&iacute;a del Crimen, de forma que pudiera correr en mi nuevo Pentium. Los que tuvisteis un PC en los 80 recordar&eacute;is que los juegos de Opera ven&iacute;an en discos de autoarranque de 5 '' 1/4. El hecho de que estos juegos arrancasen desde el disco significa que ni siquiera necesitaban correr bajo un sistema operativo: ellos mismos gestionaban todo el tema E/S, por s&iacute; solos o mediante la BIOS. Los discos no ten&iacute;an un sistema de archivos reconocible por el DOS. Mi objetivo era poder cargar el juego desde el disco duro, y de ah&iacute; que fuera necesario el cargador. Concluido el trabajo del cargador, pude ver una vez m&aacute;s a Adso y a Guillermo danzando orgullosos por la pantalla, como a&ntilde;os atr&aacute;s. Era incre&iacute;ble. Pero entonces me di cuenta de un detalle. El juego era el mismo y yo era el mismo (quiz&aacute; 10 a&ntilde;os m&aacute;s viejo, vale), pero hab&iacute;a algo que no era lo mismo: los colores. Me vinieron a la mente aquellos tonos sobrios que me ofrec&iacute;a anta&ntilde;o el f&oacute;sforo verde, con los sutiles matices que se consegu&iacute;an al entrelazar sabiamente las cuatro posibles tonalidades. Pero, ¿qu&eacute; es lo que ten&iacute;a ante mis ojos?. Pues lo siguiente: el modo 320x200x4c de la pleistoc&eacute;nica y maravillosa CGA, emulado cuidadosamente por mi nueva SuperVGA, y plasmado por &uacute;ltimo en un monitor concebido para el True Color. El resultado son unos colores un poco carnavalescos. S&iacute;, recuerdo con cari&ntilde;o la CGA, la program&eacute; con esmero durante a&ntilde;os, pero siempre me disgustaron los colores del modo 320x200x4c. Hab&iacute;a dos paletas para &eacute;ste modo, no se cu&aacute;l m&aacute;s canalla, fruto del trabajo de alg&uacute;n ingeniero dalt&oacute;nico de IBM. A pesar de ello me gusta la CGA :-). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, se me ocurri&oacute; que una versi&oacute;n de la Abad&iacute;a para VGA podr&iacute;a estar muy bien. Adem&aacute;s, ¿qu&eacute; es lo que yo siempre hab&iacute;a querido programar? ¿Un comecocos? ¿Un pinball? Pues nada de eso. Yo siempre quise hacer algo como la Abad&iacute;a. Pero, ¿era una buena idea intentar adaptar un juego de los 80? Me explico: Paco Men&eacute;ndez y Juan Delc&aacute;n hab&iacute;an creado una obra de arte. Los ordenadores de la &eacute;poca dispon&iacute;an de unas capacidades muy modestas en comparaci&oacute;n con los modernos, y ellos aun as&iacute; consiguieron un juego de una complejidad argumental ins&oacute;lita por aquel entonces. Lograron introducirnos en una historia que realmente te absorb&iacute;a, y &eacute;sta fue la primera clave del &eacute;xito. Me preocupaba el hecho de que sacar al juego del contexto de los 80 pudiera quitarle toda su magia. Hab&iacute;a que actuar con sensibilidad, como si se tratase de una restauraci&oacute;n. Mi intervenci&oacute;n deb&iacute;a ser transparente. Sab&iacute;a que pod&iacute;a resultar algo infame. ¿Ser&iacute;a acaso como colorear Casablanca? Quiz&aacute; no, pero de todos modos merec&iacute;a la pena intentarlo, sobre todo por la cantidad de cosas que iba a aprender.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Era necesario dotarlo de un interfaz m&aacute;s amable, y esto obligar&iacute;a quiz&aacute; a a&ntilde;adir nuevos elementos. De hecho, una de las posibles pegas del juego original era su dificultad. El juego era realmente dif&iacute;cil de acabar, pero no imposible. Lo que ocurre es que mucha gente no sab&iacute;a como salvar las partidas, y ten&iacute;a que empezar de nuevo cada vez que los pillaba el abad. De cualquier modo empec&eacute; a convertir el juego. Mi idea era &quot;injertar&quot; mis nuevas rutinas sobre el juego original. Con esto consegu&iacute;a dos cosas: el juego seguir&iacute;a siendo el mismo, con id&eacute;ntico argumento y, adem&aacute;s, esto me obligaba a estudiar c&oacute;mo funcionaba la Abad&iacute;a por dentro.       </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de darme cuenta, ya estaba editando los gr&aacute;ficos. Surgi&oacute; una pregunta, ¿qu&eacute; modo de v&iacute;deo utilizar? Lo m&aacute;s inmediato era usar el modo 13h. Por la sencilla raz&oacute;n de que tiene 320x200 pixels. Cada pixel nuevo para la VGA coincidir&iacute;a con uno de los originales de la CGA. Pero, ¿por qu&eacute; no usar el modo 320x400, o el 640x400? En cualquier caso, las modificaciones en el c&oacute;digo no ser&iacute;an importantes, y la resoluci&oacute;n ser&iacute;a mucho mejor.  ¿No es la resoluci&oacute;n del modo 13h muy tosca para los tiempos que corren? (m&aacute;s a&uacute;n cuando se trata de un juego de &quot;decorados fijos&quot;). Tras darle muchas vueltas me decant&eacute; por el modo 13h normal. Y no fue por comodidad. Lo que pas&oacute; es que tras experimentar con los gr&aacute;ficos originales, me di cuenta de que cada pixel estaba ah&iacute; por una raz&oacute;n, no hab&iacute;a nada al azar. Uno no pod&iacute;a cambiar un s&oacute;lo pixel sin que aquello perdiera su forma. Antes, un pixel m&aacute;s o menos era muy importante. Los pixels ten&iacute;a mucha fuerza, mucho peso. El &quot;look pixelado&quot; no era algo malo. Hoy en d&iacute;a las altas resoluciones permiten gr&aacute;ficos muy detallados y preciosistas, y esto es bueno. Pero el precio es la &quot;desmaterializaci&oacute;n&quot; del pixel. Juan Delc&aacute;n hab&iacute;a hecho un trabajo exquisito, de hecho esta fue la segunda clave del &eacute;xito de juego. Tratar de adaptarlo a resoluciones mayores ser&iacute;a pisotearlo, el juego perder&iacute;a su sabor. 320x200x256c era la respuesta. Y as&iacute; fui editando los gr&aacute;ficos del juego, mientras mi colega Eduardo Ruiz program&oacute; un editor para las pantallas de la Abad&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Diciembre del 98: termino las nuevas rutinas para los sprites, las &quot;injerto&quot; y pruebo el juego con los nuevos gr&aacute;ficos. Tras varios monjes dejadores de rastro marr&oacute;n y otros tantos monjes sin cabeza, consigo que aquello funcione. Y he aqu&iacute; las im&aacute;genes actuales. ¿Qu&eacute; tal, os gusta? (por favor, sed misericordiosos con este hombre que ha sacrificado su expediente por tan noble causa).</P>
<P ALIGN="JUSTIFY"></P>

<CENTER><TABLE>
<TD><IMG SRC="gif/abadia01.gif"></TD><TD><IMG SRC="gif/abadia02.gif"></TD>
<tr>
<TD><IMG SRC="gif/abadia03.gif"></TD><TD><IMG SRC="gif/abadia04.gif"></TD>
</TABLE></CENTER>

<P ALIGN="JUSTIFY"></P>
<h4>¿Qu&eacute; falta por hacer? </h4>
<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI><p align="justify">Me sobra paleta por todos los lados. Probablemente opte por convertir el juego 16Mc, y le a&ntilde;ada en tiempo real unos filtros de color. Esto puede quedar muy bien como sustituto a los efectos de paleta, para crear luces, sombras, suciedad, musgo, y efectos de iluminaci&oacute;n que puedan cambiar en tiempo real. Esto le dar&iacute;a m&aacute;s variedad a los gr&aacute;ficos, que sufren de cierta monoton&iacute;a, ya que fueron concebidos para cuatro colores, y no para 256. La ambientaci&oacute;n ser&aacute; lo mas importante. </LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI><p align="justify">El sonido. Seguramente incluya sonido tipo MOD, a&ntilde;adiendo dos o tres pistas m&aacute;s para mezclar las muestras de los pasos, las voces, las puertas, etc. S&eacute; que va a ser duro. Como banda sonora, tratar&eacute; de componer algo inspirado en la BSO de &quot;El Nombre de la Rosa&quot;. La compuso James Horner, y si no la conoc&eacute;is, os la recomiendo.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI><p align="justify">El resto: interfaz para salvar y cargar partidas, el di&aacute;logo del juego, ...</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI><p align="justify"><font color="#cc0000">Lo m&aacute;s importante: la <b>aprobaci&oacute;n de Paco Men&eacute;ndez</b>. Paco, sin tu &quot;s&iacute;, adelante&quot;, todo esto dormir&aacute; eternamente en el limbo de los proyectos imposibles. Ten en cuenta que esto es un homenaje, que nadie quiere ganar un duro. ¡Dinos algo, por favor! Aprovecho para saludarte ;-)</font></LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, y nada m&aacute;s. Os recuerdo que si program&aacute;is en ensamblador o sois buenos dibujantes y os gusta La Abad&iacute;a del Crimen tanto como a m&iacute;, quiz&aacute; pod&aacute;is echarme un cable este verano para acabar con esta peque&ntilde;a obra fara&oacute;nica. Me despido agradeciendo al equipo de Macedonia el hueco que me han hecho en sus p&aacute;ginas, y en especial a Fernando por el inter&eacute;s demostrado.</P>


<BR><BR>



<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="dhispb.htm"><font FACE="ARIAL"><B>[Crónicas de una Creación]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>




<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



