<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rónicas de una Creación</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<br>


<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:cbotana@hotmail.com">César Botana.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">



<FONT color="#000000" size=2 face="arial"><br><br><br>

<FONT color="#000000">        

<H3>Así se hizo UGO</h3>

<P ALIGN=justify>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face=arial>



<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">UGO es una librer&iacute;a para Turbo Pascal que ayuda en la creaci&oacute;n de videojuegos. Su nacimiento se remonta a comienzos del 98. En un principio me hice una librer&iacute;a que conten&iacute;a unas cuantas funciones y procedimientos b&aacute;sicos, poco despu&eacute;s cre&eacute; otra para el manejo de sprites, fue entonces cuando decid&iacute; unir lo que llevaba hecho, y a su vez incorporar nuevas cosas para ir mejorando poco a poco la reci&eacute;n nacida librer&iacute;a.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Y fue as&iacute; como comenz&oacute; todo. Empec&eacute; a introducir funciones b&aacute;sicas (PonPixel, Linea...). Una vez tuve esto hecho, empec&eacute; con los sprites. Constru&iacute; una versi&oacute;n bastante primitiva del programa SPROW, y cre&eacute; un tipo b&aacute;sico de sprite. Manejar los sprites individualmente es bastante pesado, por lo que constru&iacute; otra herramienta, SPR2BSF, que "compactaba" todos los sprites indicados en un solo fichero BSF, lo que hac&iacute;a las cosas m&aacute;s sencillas. Una vez hechos los programas, a&ntilde;ad&iacute; sus correspondientes funciones a la librer&iacute;a (CargaSprite, PonSprite...).</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Lo siguiente fueron los formatos gr&aacute;ficos, comenc&eacute; con los "archifamosos" PCX y RAW, a los que a&ntilde;ad&iacute; posteriormente el LBM, formato que usa el programa Deluxe Paint. Que ser&iacute;a un juego sin pantallas virtuales?, nada, ya que no se podr&iacute;a hacer. Llegado este momento codifique una rutina para copiar pantallas virtuales que era MUY lenta, por lo que no tuve m&nbsp;s remedio que sacarme un libro de ensamblador de la biblioteca y aprender un poco. Al poco volv&iacute; a codificar la rutina, y ahora si iba bien. (La rutinas de copiar pantallas virtuales y de poner sprites, son de las que m&aacute;s orgulloso me siento, ya que no ten&iacute;a (ni tengo) ni idea de ensamblador, y al final quedaron bastante curiosillas :).</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Ya ten&iacute;a algo hecho, pero a&uacute;n faltaba mucho. El teclado por ejemplo, segu&iacute;a usando las rutinas que trae Pascal (READKEY, KEYPRESSED), que adem&aacute;s de lentas no detectan m&aacute;s de una pulsaci&oacute;n de teclas a la vez, por lo que (por ejemplo) mover una nave a la derecha y disparar a la vez se hac&iacute;a imposible. ¡Ale!, pues manos a la obra, como no era muy complicado, al poco tiempo ya estaba hecho.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Ahora ya ten&iacute;a algo m&aacute;s o menos curioso, pero no ten&iacute;a nada hecho de ejemplo y no sab&iacute;a si todo "rulaba" bien. Un d&iacute;a, mi amigo Isma me pidi&oacute; la librer&iacute;a para probarla, y gracias a ‚l pude solucionar bastante problemas, y a su vez cre&oacute; ejemplos y un juego para distribuir conjuntamente con la librer&iacute;a, otro amigo (Angel), convirti&oacute; el fichero TXT de ayuda a formato NG (ayuda interactiva). Fue entonces cuando decid&iacute; sacar la versi&oacute;n 0.666. Versi&oacute;n que solo pudieron "disfrutar" los compa&ntilde;eros de clase, ya que solo fue a ellos a los que se lo comuniqu&eacute;.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Todo esto fue un poco antes del verano, entonces lleg&oacute; la pausa obligada por los ex&aacute;menes (¿que qu&eacute; tal?, ¡muy mal!). Durante el verano, inclu&iacute; un generador de ficheros BTF, que no es ni m&nbsp;s ni menos que otro "compactador", solo que esta vez se pod&iacute;an unir todos los ficheros que se usaban en el juego en un solo fichero, es decir, es vez de tener (por ejemplo) 3 ficheros de sprites BSF, 10 im&aacute;genes PCX, y 2 paletas, solo se tiene un solo fichero con todo lo anterior. Durante esta ‚poca, tambi&eacute;n inclu&iacute; los ficheros de sonido por la Sound Blaster y comenc&eacute; a crear las funciones GUI, las interfaces gr&aacute;ficas de usuario (tipo g&uuml;in2), antes de acabarlas, envi&eacute; a varias revistas la versi&oacute;n 1.0 del programa, siendo elegido como unos de los mejores programas del mes por la revista HOT SHAREWARE.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Y por &uacute;ltimo, hace dos meses, realic&eacute; la &uacute;ltima actualizaci&oacute;n. Incorporando como novedades la memoria EMS (640 kb est&aacute;n muy limitados), las GUI, rutinas de scroll por tiles (gracias Isma!) y un n&uacute;mero considerable de programas de apoyo: creador de iconos, de ficheros PCX, de mapas, etc.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Por &uacute;ltimo quer&iacute;a hacer una &uacute;ltima actualizaci&oacute;n a la versi&oacute;n definitiva 2.0, incorporando ya SVGA, pero actualmente dispongo de muy poco tiempo para poder dedicarlo a UGO, por lo que es posible que la versi&oacute;n 1.63 (la actual) sea la &uacute;ltima versi&oacute;n de UGO que salga.</P>

<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Para cualquier cosilla, me ten&eacute;is en: </FONT><A HREF="mailto:cbotana@hotmail.com"><FONT FACE="Arial" SIZE=2>cbotana@hotmail.com</FONT></A><FONT FACE="Arial" SIZE=2>. ¡Un saludete!</P>

<BR><BR>



<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="dhispb.htm"><font FACE="ARIAL"><B>[Crónicas de una Creación]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>




<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



