<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rónicas de una Creación</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">



<FONT color="#000000" size=2 face="arial"><br><br><br>

<FONT color="#000000">        

<H3>Creando un fanzine</h3>

<P ALIGN=justify>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face=arial>



<P align="justify">

<FONT FACE="Arial" SIZE=2>

<P ALIGN="JUSTIFY">En este art&iacute;culo voy a intentar plasmar una serie de puntos que deber&iacute;an de considerarse a la hora de crear un fanzine. Espero que mi experiencia (humilde experiencia), en el trabajo realizado en com&uacute;n con todo el equipo de Macedonia, pueda servir a alguien interesado en iniciar un fanzine. </P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Aspectos previos.</B></P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">El primer gran paso que hay que dar es el de decidirse a crear la revista de una forma seria y constante. Es normal que, una vez que pasan los primeros momentos de "emoci&oacute;n" y llegan los de trabajo "a fondo", a uno se le vayan quitando las ganas de meterse en este maravilloso l&iacute;o. Para qu&eacute; nos vamos a enga&ntilde;ar, la creaci&oacute;n de un fanzine, lo que son los tres o cuatro primeros meses (si se logra llegar a ellos), llevan consigo un trabajo ingente (realmente s&iacute; quita mucho tiempo). Despu&eacute;s, una vez cogido el ritmo, es m&aacute;s f&aacute;cil pasar por alto todo el sacrificio a realizar porque las tareas dedicadas a la publicaci&oacute;n pasan a formar parte de tu rutina diaria.</P>

<P ALIGN="JUSTIFY">Un factor muy importante es el referente a las personas que van a estar detr&aacute;s de ese primer y b&aacute;sico n&uacute;mero. Lo normal es que siempre haya como m&aacute;ximo una o dos que tengan la iniciativa. Excepcionalmente, puede existir m&aacute;s gente metida o incluso ser un grupo el responsable, pero no suele ser lo habitual. En cualquier caso, es muy importante que siempre se trabaje bajo la referencia de una persona que act&uacute;e de coordinador general. M&aacute;s tarde, cuando el fanzine crezca, se deber&aacute; de pensar en dejar las secciones coordinadas por personas muy ligadas a lo que ha sido la maduraci&oacute;n de la revista (coordinadores de secci&oacute;n) para que, junto al director, trabajen en un &aacute;rea en exclusiva. Si alguien no trabaja a la altura de las circunstancias, al existir una organizaci&oacute;n, pronto se ver&aacute; y se podr&aacute; actuar en consecuencia. L&oacute;gicamente, el comienzo ser&aacute; muy duro y el creador, o los creadores, deber&aacute;n de "tirar del carro" solos. </P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Hay que huir de los fanzines personalistas.</B></P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Es perfectamente comprensible que en el primer n&uacute;mero del fanzine os ve&aacute;is como los verdaderos h&eacute;roes de la "faena" y quer&aacute;is resaltar muy bien y muy claro vuestros nombres, nicks o dem&aacute;s historias. Pues bien, queda much&iacute;simo mejor que vuestra identificaci&oacute;n s&oacute;lo aparezcan ligada a los art&iacute;culos que escrib&iacute;s y en una secci&oacute;n destinada a ello (la de cr&eacute;ditos). No es bueno que cre&eacute;is r&oacute;tulos gigantescos con vuestros nombres o que pong&aacute;is vuestras fotos cada dos por tres o que cont&eacute;is vuestras vidas en un "rinc&oacute;n personal". Sed humildes y no vay&aacute;is de "s&uacute;per m&aacute;quinas" (o "s&uacute;per fantasmas") pues, a fin de cuentas, un fanzine no puede salir adelante sin un grupo que est&eacute; trabajando como una sola persona. Y esto mismo se puede aplicar al nombre de la publicaci&oacute;n. No hay que llamarla del mismo modo que a t&uacute; nick o por el nombre del grupo que la ha creado ya que dar&aacute;s un car&aacute;cter cerrado a la misma. Lo que puede ser un trabajo m&aacute;s o menos soportable (por los escasos fundadores) en la primera edici&oacute;n, puede pasar a ser algo horrible en la segunda y dif&iacute;cilmente se llegar&aacute; a la tercera si no existe m&aacute;s gente que se anime a colaborar. Es vital que los nuevos miembros que vayan entrando se sientan como parte integrante de la revista, que vean c&oacute;mo su nombre sale tanto en los art&iacute;culos como en los cr&eacute;ditos, que no se d&eacute; m&aacute;s importancia a unos que a otros de buenas a primeras. </P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Estructuraci&oacute;n y secciones iniciales.</P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">La primera de las cosas a tener en cuenta versa sobre el contenido del fanzine, es decir, hay que decantarse sobre uno o varios temas que se consideren interesantes, tengan alg&uacute;n tipo de nexo y que, por supuesto, se dominen moderadamente bien. Una vez elegido el campo sobre el que trabajar, se ha de establecer una serie de secciones b&aacute;sicas en las que ir alojando los art&iacute;culos. Por experiencia, es mejor crear pocas secciones con un buen n&uacute;mero de art&iacute;culos que crear muchas y dejarlas con muy poco o nulo material. No es recomendable poner secciones y que cuando nuestros lectores vayan a entrar se encuentren con un texto que les diga<I> "Esperamos vuestras aportaciones</I>". Lo importante es que el primer n&uacute;mero de la revista d&eacute; a entender que todos y cada uno de los apartados han sido trabajados, que merece la pena participar. Que si alguien se ha "currado" todos esos art&iacute;culos es porque tiene la seguridad de que va a haber otra persona que los lea. Hay que tomarse muy en serio la revista o no se lograr&aacute; sacarla adelante.</P>

<P ALIGN="JUSTIFY">Las secciones que deber&aacute;n de acompa&ntilde;ar al primer n&uacute;mero han de ser originales (t&iacute;tulos sugerentes, temas interesantes, etc), con art&iacute;culos de media a larga longitud y bien acabados. Si los trabajos son muy cortos o est&aacute;n mal escritos (m&aacute;s faltas de ortograf&iacute;a de la cuenta o muy mala redacci&oacute;n) el lector tender&aacute;, irremediablemente, a crearse una mala imagen de la persona que hay detr&aacute;s y, por consiguiente, del fanzine en general. Tan importante es encontrar temas y art&iacute;culos interesantes como escribirlos bien y de forma clara. De todas formas, a medida que se van haciendo n&uacute;meros, la pr&aacute;ctica hace que se perfeccione la redacci&oacute;n de uno mismo (suele ser habitual repasar art&iacute;culos antiguos y actualizar su redacci&oacute;n).</P>

<P ALIGN="JUSTIFY">Dos secciones que no se pueden dejar pasar por alto son la de <I>editorial</I> y la de <I>colaboraciones</I>. De la primera decir que es vital para configurar la personalidad del fanzine. Si no se crea un editorial, el fanzine perder&aacute; gran parte de su "magia". El apartado de colaboraciones es tambi&eacute;n muy importante. En &eacute;l, hay que dejar los datos para que los lectores que quieran participar puedan ponerse en contacto con la direcci&oacute;n f&aacute;cilmente. Aqu&iacute;, hay que aprovechar y animarles para que ayuden a desarrollar el fanzine pero no hay que caer en la tentaci&oacute;n de lanzar s&uacute;plicas o dar a entender que sin ellos dejaremos de existir. Se deben dar muestras de confianza en uno mismo. Para la comunicaci&oacute;n, hay que ofrecer las m&aacute;ximas facilidades, es decir, se ha de dejar una direcci&oacute;n de email y otra de correo convencional y por este orden de prioridad (el uso de correo electr&oacute;nico es esencial).</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">La periodicidad de salida de un nuevo n&uacute;mero.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Antes de sacar la edici&oacute;n n&uacute;mero 1 hay que plantearse la periodicidad a seguir. Un fanzine editado cada mes puede convertirse en un trabajo muy complicado y que haga, a los m&aacute;ximos responsables (y a los colaboradores), demasiado esclavos del mismo. La mejor periodicidad es la bimestral porque ofrece un intervalo de tiempo bastante flexible, tanto para trabajar en los art&iacute;culos como para pensar nuevas ideas con que sorprender en el pr&oacute;ximo n&uacute;mero. </P>

<P ALIGN="JUSTIFY">Es muy importante cumplir con la periodicidad establecida. Si hubiera alg&uacute;n problema de retrasos hay que avisarlo correctamente mediante emails, cartas o alg&uacute;n mensaje en la web. Nunca hay que dejar que pase el tiempo y que los lectores desconozcan la situaci&oacute;n.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Compromete al fanzine present&aacute;ndole en sociedad.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El mejor apoyo para que un fanzine pueda seguir existiendo (incluso mejor que el que los lectores pueden ofrecer), es el de contar con el reconocimiento por parte de otros fanzines colegas, grupos del sector o instituciones conocidas. Cuando se lance el primer n&uacute;mero, ser&iacute;a bueno que se estableciera comunicaci&oacute;n con los directivos de alg&uacute;n otro fanzine para que sepan de nuestra existencia y nos puedan echar una mano. Posteriormente, esta ayuda puede permitir que se creen alianzas, actividades comunes, que se compartan art&iacute;culos, etc. Repito, es muy importante contar con la ayuda y el reconocimiento del resto de fanzines compa&ntilde;eros.</P>

<P ALIGN="JUSTIFY">Otro de los aspectos por los que esto resulta interesante es por el hecho de comprometer al fanzine. Al presentarse en sociedad, se crea una especie de compromiso de continuidad, es una peque&ntilde;a dosis de presi&oacute;n que el equipo responsable se echa encima (no ir&aacute;s a quedar en rid&iacute;culo delante de otros fanzines, ¿verdad?).</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Hay que ser constante con el trabajo.</P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Por experiencia, la prueba de madurez de un fanzine se encuentra en los 5 o 6 n&uacute;meros (si la periodicidad del mismo es bimestral). Hay que ser constante con el trabajo y tomarse muy en serio lo que uno est&aacute; haciendo. Del mismo modo que animar a la gente que rodea la publicaci&oacute;n a que participe en su construcci&oacute;n, para que aporte sus ideas, etc. Jam&aacute;s hay que agobiarse con el fanzine. No hay que dejar que te esclavice pero quiz&aacute;, no sea malo darle una prioridad muy alta al comienzo (incluso es &uacute;til valorarlo m&aacute;s de lo que realmente es). Es, en definitiva, un gran reto equiparable a cualquier otro desarrollo.</P>

<P ALIGN="JUSTIFY">Un buen ritmo de trabajo, en una publicaci&oacute;n de tipo bimestral, puede ser el que implica dedicarle una hora o dos al d&iacute;a (si el puesto es de coordinador general o de una secci&oacute;n importante). Puedes trabajar por la noche, o bien en los ratos libres (que seguro tendr&aacute;s dispersos por todo el d&iacute;a), pero ded&iacute;cale algo de tu tiempo o de lo contrario, se ir&aacute; dejando de lado y poco a poco se perder&aacute; la ilusi&oacute;n. En general, somos muy entusiasmados al comienzo de un proyecto pero, al final, cuando de verdad hay que dar la cara, fallamos. Intenta que t&uacute; trabajo no caiga en saco roto porque, por muy bonito que se haga todo al comienzo, lo que cuenta es que el fanzine llegue a cumplir su objetivo (x n&uacute;meros, un a&ntilde;o de existencia, continuidad indefinida...).</P>

<P ALIGN="JUSTIFY"> </P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">No dejes que te desborde.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Uno de los problemas que pueden darse en un fanzine en alza ocurre cuando los m&aacute;ximos responsables no dan abasto; se ven desbordados por la participaci&oacute;n de los lectores (el coordinador se encuentra con montones de cartas o emails con cr&iacute;ticas, sugerencias, de gente que quiere apuntarse, etc). No hay que permitir que el fanzine te desborde. Hay que controlarlo siempre y para poder controlarlo hace falta algo b&aacute;sico; la organizaci&oacute;n.</P>

<P ALIGN="JUSTIFY">En el momento que se note que la publicaci&oacute;n empieza a crecer en n&uacute;mero de lectores y, sobre todo, de colaboradores (si hay muchos colaboradores es que hay much&iacute;simos m&aacute;s lectores), hay que tomar medidas urgentemente. Una buena idea para ir equilibrando el trabajo, es la de ofrecer, a los colaboradores m&aacute;s entusiastas, un puesto de responsabilidad (coordinaci&oacute;n, administraci&oacute;n, grafismo, maquetaci&oacute;n, WebMaster, etc) de esta forma, se lograr&aacute;n dos cosas. Por un lado, el trabajo quedar&aacute; totalmente repartido y se ganar&aacute; tanto en velocidad como en calidad. Y por otro lado, el director podr&aacute; trabajar sin ning&uacute;n tipo de apuro, centr&aacute;ndose m&aacute;s en temas de coordinaci&oacute;n general que de gesti&oacute;n interna (el creador del fanzine deja de tener que hacer de "s&uacute;per m&aacute;quina" capaz de enfrentarse el s&oacute;lo a todos los problemas). </P>

<P ALIGN="JUSTIFY">Otra de las buenas ideas es crear FAQ's de car&aacute;cter externo e interno. En el externo, los lectores podr&aacute;n conocer cu&aacute;les son los pasos a seguir para ingresar en fanzine, qu&eacute; beneficios les aporta, cuales son las condiciones previas, las responsabilidades, etc. En el interno, se definir&aacute;n las reglas que todo miembro activo del fanzine debe de seguir, instrucciones para poder entregar un trabajo, plazos m&aacute;ximos, direcciones de los coordinadores y del director, derechos de cada puesto, etc. </P>

<P ALIGN="JUSTIFY">Este gran paso que debe de efectuar un fanzine en crecimiento es muy duro y no va a funcionar bien a la primera. Habr&aacute; que pasar unos dos n&uacute;meros de adaptaci&oacute;n. Pensad que se pasa de un sistema centralizado y supervisado por unos pocos, a otro repartido y trabajado por unos muchos. De no seguir un plan de organizaci&oacute;n, el creador o los escasos creadores del fanzine, pronto se ver&aacute;n hasta arriba de trabajo, ser&aacute;n incapaces de responder a todo el correo y se dar&aacute;n por vencidos. </P>

<P ALIGN="JUSTIFY">Ya veis, al principio se sale en busca de ayuda pero luego, cuando se tiene en cantidades suficientes, hay que saber administrarla.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Uso de Internet como plataforma de trabajo.</P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">La comunicaci&oacute;n por Internet, entre los miembros de la revista, es algo imprescindible. El correo electr&oacute;nico ha de ser utilizado masivamente. Los emails le sirven al director para coordinar m&aacute;s eficientemente la revista, para ponerse en contacto con los miembros de forma instant&aacute;nea o para recibir los trabajos de &eacute;stos de inmediato.</P>

<P ALIGN="JUSTIFY">Otro de los temas que resulta interesantes de la red son las listas. Las listas permiten que las personas que est&eacute;n suscritos en ellas puedan escribir a una especie de foro com&uacute;n en la que los dem&aacute;s miembros leen sus mensajes. Son como las "news" pero a un nivel mucho m&aacute;s restringido. Si se crea una lista para los miembros en activo de la publicaci&oacute;n, podremos mandar mensajes de inter&eacute;s general, crear "ambiente" de equipo, discutir entre todos sobre determinados aspectos, anunciar c&oacute;mo van los preparativos para un nuevo n&uacute;mero, cambiar informaci&oacute;n de forma global, archivos, documentos, etc. El establecer un sistema descentralizado implica el establecer tambi&eacute;n una lista de trabajo.</P>

<P ALIGN="JUSTIFY">En definitiva, Internet es un aliado incuestionable para hacer que el fanzine se convierta en algo s&oacute;lido y con perspectivas de futuro.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">¿Vas a cobrar por leer el fanzine?.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">No creo que cobrar dinero por la lectura de un fanzine, hecho por y para entusiastas, sea el mejor m&eacute;todo de popularizarlo. No tiene sentido que algo que se hace con entusiasmo, por puro placer, porque te gusta, tenga que cobrarse a la gente. Esta decisi&oacute;n es cr&iacute;tica pues si decides realizar t&uacute; trabajo de forma altruista, por "amor al arte", no deber&aacute;s de cobrar nada por todo el trabajo que, tanto t&uacute;, como el resto del equipo, hag&aacute;is. La decisi&oacute;n es muy importante.</P>

<P ALIGN="JUSTIFY">Naturalmente, a eso de cobrar dinero, hay excepciones. Un fanzine impreso necesariamente tiene que estar ligado a un abono por parte de sus lectores, al igual que uno que s&oacute;lo se pueda conseguir en soporte en disco (no exista una p&aacute;gina web que le d&eacute; cobertura, o un servidor ftp que permita "bajarlo"). </P>

<P ALIGN="JUSTIFY">Hagas lo que hagas, recuerda que al pedir dinero se est&aacute;n adquiriendo unas responsabilidades excesivas, tanto de continuidad futura, como de calidad general en todos y cada uno de los n&uacute;meros. Adem&aacute;s, se est&aacute; destruyendo uno de los m&aacute;ximos factores del &eacute;xito de la revista, el de la expansi&oacute;n. T&uacute; decides (insisto, "lo mejor de la vida es gratis").</P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Implementaci&oacute;n del fanzine.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">A menos que pretendas realizar un fanzine como cobertura de un club o con importantes vistas de cara al futuro, no es aconsejable montarse todo el "tinglado" de realizar una publicaci&oacute;n impresa pues ser&aacute; necesario cobrar dinero para costear los gastos m&iacute;nimos, esto es, impresora, papel y distribuci&oacute;n. Este camino necesita de grupos o asociaciones bien establecidas, con amplia experiencia y con mucho, mucho tiempo para hacer funcionar todo el proceso de forma estable.</P>

<P ALIGN="JUSTIFY">Lo mejor es realizar el fanzine en formato electr&oacute;nico y para ello, podemos trabajar directamente en lenguaje HTML, sabiendo que con cualquier visor actual de Internet (todos gratuitos) se podr&aacute; leer. La &uacute;nica desventaja que existe aqu&iacute; es que deberemos de aprender el lenguaje HTML si bien, su facilidad y amplia oferta de herramientas de edici&oacute;n, hacen que se convierta en algo trivial. Por lo dem&aacute;s, el uso del HTML, reporta siempre ventajas. Otra de las posibilidades que hay es la utilizar alg&uacute;n programa de edici&oacute;n destinado para estos temas como es el NeoBook, por ejemplo. En mi opini&oacute;n, herramientas como &eacute;stas son mucho menos beneficiosas que el uso del HTML pues el resultado final tiende a ocupar m&aacute;s espacio, hace falta comprar una licencia (hay que ser legales si quieres que la gente sea legal con lo que t&uacute; haces), es m&aacute;s inc&oacute;moda su actualizaci&oacute;n y, adem&aacute;s, no tiene la capacidad de expansi&oacute;n que el HTML (no olvidemos que podemos publicar sin ning&uacute;n esfuerzo extra la revista en Internet si la hemos hecho en HTML).</P>

<P ALIGN="JUSTIFY">Cuando el MS-DOS fue el rey de los Sistemas Operativos para PC, la proliferaci&oacute;n de fanzines electr&oacute;nicos fue muy alta. Estos siempre se caracterizaron por ir sobre visores exclusivos que el grupo, o la persona, que estaba detr&aacute;s, se encargaba de programar. As&iacute;, se pudieron ver aut&eacute;nticas maravillas de visores bajo DOS. Con la llegada de Windows, esa "magia" que hab&iacute;a antes a la hora de hacer un fanzine se ha ido perdiendo y es muy dif&iacute;cil encontrar programas visores exclusivos funcionando bajo Windows (el visor Off-Line de Macedonia es una maravillosa excepci&oacute;n). Lo que quiero decir es que, hasta que no se haya consolidado el fanzine (cre&aacute;ndose un grupo m&aacute;s o menos estable de personas dispuestas a trabajar para &eacute;l a un ritmo constante) no merece la pena invertir tiempo en la programaci&oacute;n de un visor exclusivo. Hasta que llegue esa madurez, lo mejor es trabajar en las secciones de la revista, aprovecharse de las herramientas que hay en la actualidad (sobre todo del HTML) y de procurar hacer un buen contenido.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Establece un buen canal de distribuci&oacute;n.</P>

<P ALIGN="JUSTIFY"></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Uno de los aspectos que no se te deben de pasar por alto es el referente a la distribuci&oacute;n del fanzine. Si no se va a realizar una publicaci&oacute;n "On-Line" (en sitio web), se ha de facilitar, en todo lo posible, la expansi&oacute;n por v&iacute;as alternativas. Tendremos que estudiar la posibilidad de dejar la revista en servidores Ftp, en p&aacute;ginas Web dedicadas a la descarga de Shareware y Freeware (o montarnos la nuestra utilizando servidores de car&aacute;cter gratuito) o mandarlo a revistas que la publiquen en sus CD's de portada. A estas opciones hay que a&ntilde;adir la posibilidad de que los lectores puedan utilizar una direcci&oacute;n tradicional de correo con el fin de pedirlo por esa v&iacute;a a la revista. Una buena idea es abrir un apartado de correos as&iacute;, el que quiera, podr&aacute; escribir para solicitar un n&uacute;mero determinado (y el director no tendr&aacute; que dar la direcci&oacute;n de su propia casa). Obviamente, aqu&iacute; habr&aacute; que cobrar al lector el disquete y los costes del env&iacute;o.</P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Algunas consideraciones finales.</P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Nadie nace aprendiendo. Como en todo, la creaci&oacute;n, administraci&oacute;n y direcci&oacute;n de un fanzine se ha de "ejercitar" con el transcurso del tiempo. No dudes en pedir consejos tanto a los lectores como a fanzines "colegas" para que puedas ir innovando en cada n&uacute;mero. Al fin y al cabo, los fanzines se crean para que entusiastas puedan intercambiar opiniones y aprender los unos de los otros. Lee y estudia las f&oacute;rmulas que se utilicen en otras publicaciones, s&eacute; original, pon secciones que sepas que van a interesar a los lectores, anima a todo el mundo a participar y, sobre todo, si&eacute;ntete, y haz sentir, orgulloso de lo que est&aacute;s haciendo. Piensa que todos los fanzines, revistas profesionales o publicaciones "On-Line" tuvieron que pasar por un n&uacute;mero 1 tan duro como el de tu reci&eacute;n nacida revista. </P>

<P ALIGN="JUSTIFY">No hay nada f&aacute;cil, todo es tan dif&iacute;cil y maravillosamente complicado como t&uacute; y el equipo del fanzine en general, quer&aacute;is. Y recuerda, "s&oacute;lo vencen los que luchan".</P></FONT>

<BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="dhispb.htm"><font FACE="ARIAL"><B>[Crónicas de una Creación]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>




<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



