<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rónicas de una Creación</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<br>


<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:jmaura@mx3.redestb.es">Javier Maura.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">



<FONT color="#000000" size=2 face="arial"><br><br><br>

<FONT color="#000000">        

<H3>Engine 3D de Siempre Quise Ser Un Elfo</h3>

<P ALIGN=justify>

<FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face=arial>



<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
<B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409814">Introducci&oacute;n.</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando empec&eacute; a estudiar el mundo de las tres dimensiones y todo lo que lo envuelve, me convenc&iacute; de que si ten&iacute;a que hacer algo, lo ten&iacute;a que internar hacer realmente bien. El nivel de los Engines era demasiado alto como para introducir un simple mostrador de pol&iacute;gonos con m&aacute;s o menos velocidad. Necesitaba crear algo que realmente rompiera un poco con todo lo que hab&iacute;a en ese momento y pudiera ofrecer algo nuevo a este mundo tan competitivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, despu&eacute;s de nueve meses de estudio, de aprender matem&aacute;ticas desde cero, de un gasto importante en libros y en tel&eacute;fono, creo que tengo un Engine que por lo menos rellena un hueco que hasta ahora estaba vac&iacute;o.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para entender bien el proceso que segu&iacute; para crear el Engine ( que a&uacute;n no tiene nombre), voy a explicar brevemente lo que hay hasta ahora, o lo que pienso que hay, puesto que quiz&aacute;s alguien haya visto alguna cosa que yo no haya podido observar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los Engines actuales se basan en partir el espacio de manera que f&aacute;cilmente el ordenador pueda eliminar un gran n&uacute;mero de pol&iacute;gonos que no son visibles por la c&aacute;mara. Esto que quiz&aacute;s parezca muy sencillo, es tremendamente dif&iacute;cil. Y no lo es porque no se sepan t&eacute;cnicas para hacerlo, que s&iacute; existen y est&aacute;n presentes en todos los modeladores 3D, sino que debe hacerse en tiempo real, es decir, a 30 im&aacute;genes por segundo como m&iacute;nimo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un Engine se diferencia de otro fundamentalmente en la forma que tiene de dividir el espacio. Hasta ahora, el mundo se creaba con estructuras sencillas, es decir &quot;paredes&quot; simples que ayudaban mucho al ordenador a la hora de hacer los c&aacute;lculos. Pero por desgracia esto implicaba objetos geom&eacute;tricamente sencillos y que no tuvieran una gran cantidad de pol&iacute;gonos. De hecho, si observamos los juegos que contienen estos Engines, veremos que la gran mayor&iacute;a de estructuras son simples y llanos planos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro Engine totalmente distinto es el que utiliza el juego Tomb Raider. Este Engine est&aacute; basado en cubos de manera que f&aacute;cilmente calcula si se ve o no se ve un cubo. Por desgracia tiene el mismo problema que el sistema anterior. ( ¡Atenci&oacute;n, no estoy seguro de c&oacute;mo funciona el Engine del Tomb, pero creo que es as&iacute;, pero quiz&aacute;s me equivoque!)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; que el final tenemos un grafista con unos conocimientos enormes sobre un programa de modelado al estilo 3DStudio Max o LightWave utilizando estructuras simples para crear los mundos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, pues yo part&iacute; desde aqu&iacute;. Tengo que crear un Engine que permita a los grafistas hacer lo que quieran.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y despu&eacute;s de nueve meses, tengo algo bastante visible, por lo menos lo m&aacute;s dif&iacute;cil ya est&aacute; hecho y funciona, que es la partici&oacute;n del espacio.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">C&oacute;mo funciona el Engine</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, en realidad el Engine no est&aacute; basado en pol&iacute;gonos, sino en objetos. Esto parece una tonter&iacute;a pero es muy importante. Imaginemos el siguiente caso:</P>
<P ALIGN="JUSTIFY"></P>
<center><IMG SRC="jpg/e3maura1.jpg" > </center>
<P ALIGN="JUSTIFY">Este castillo ha sido creado por un amigo mio muy metido en esto de los videojuegos y que ha creado ya verdaderas obras maestras.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, pues a lo que &iacute;bamos. Este castillo est&aacute; formado de objetos. Las torres son objetos, las murallas tambi&eacute;n. Pues si yo en alg&uacute;n momento veo un trozo de torre, lo m&aacute;s normal es que vea los trozos que me faltan. Entonces para qu&eacute; partir la torre en cientos de pol&iacute;gonos y comprobar si se ven, cuando la mayor parte de veces que se tiene que ver la veo enterita.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esto implica una gran ventaja: la torre puede ser un objeto muy complejo. Si veo alguna parte de la torre, s&eacute; que tengo que dibujar el objeto ( en realidad no se dibuja todo, se hacen muchos c&aacute;lculos previos para saber qu&eacute; es lo que se ve de un objeto. Para hacerte una idea, las tablas ocupan ahora mismo 9MB!)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, esto tambi&eacute;n implica un poco de responsabilidad para el grafista. Mira este ejemplo:</P>
<P ALIGN="JUSTIFY"></P>
<center><IMG SRC="gif/e3maura1.gif"></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aqu&iacute; ten un poco de imaginaci&oacute;n y piensa que los c&iacute;rculos azules son estatuas muy detalladas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si colocamos las estatuas a esta distancia, podremos tener una super-estatua por habitaci&oacute;n y nunca veremos las dos, con lo que el n&uacute;mero de im&aacute;genes por segundo aumenta. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero en el caso de la derecha, en alg&uacute;n momento podremos ver las dos estatuas, con lo que la velocidad del juegos se ver&iacute;a disminuida. Este caso no es que sea incorrecto, simplemente el grafista podr&iacute;a haber pensado que si la coloca como en el caso de la izquierda, no se dibujar&iacute;an nunca las dos, y as&iacute; se ganar&iacute;a mucho en velocidad. Pero repito que el segundo caso se admite perfectamente y el Engine lo tratar&aacute; de la forma que encuentre m&aacute;s conveniente.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409815">C&oacute;mo deber&iacute;an ser los objetos</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, los objetos pueden ser como quieras y pueden tener el n&uacute;mero de pol&iacute;gonos que hagan falta, pero no nos enga&ntilde;emos, a mayor n&uacute;mero de pol&iacute;gonos mayores c&aacute;lculos y m&aacute;s lentitud. De todas formas utilizando el truco de las habitaciones podr&iacute;amos soportar un n&uacute;mero muy elevado de pol&iacute;gonos sin perder velocidad, claro que al final todo depende de muchas cosas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero lo que no soportar&iacute;a, y no deseo en absoluto, es que se utilicen objetos planos. Por favor, ya que he tardado tanto en desarrollar el Engine y he dotado a los grafistas de la posibilidad de usar objetos org&aacute;nicos, utilizad este potencial. Aqu&iacute; os muestro un ejemplo de un objeto que podr&iacute;a funcionar perfectamente con el Engine:</P>
<center><IMG SRC="jpg/e3maura4.jpg" ></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este objeto NO est&aacute; optimizado, y se deber&iacute;an SIEMPRE eliminar los pol&iacute;gonos que no sirven para nada. Pero da una idea de lo que se deber&iacute;a hacer: objetos rugosos, org&aacute;nicos, con vida!.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora podr&iacute;amos formular una buena pregunta:</P>
<B><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P>¿Deber&iacute;a subdividirse este objeto en tres objetos distintos para optimizar el Engine?</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Bueno, depende. Si cuando veo esta habitaci&oacute;n desde cualquier lugar la veo siempre as&iacute;, mejor que sea un objeto. Piensa que este objeto tiene unas puertas muy enormes. Lo m&aacute;s probable es que si estoy fuera de la habitaci&oacute;n, vea tambi&eacute;n el suelo y la otra pared, por lo tanto es mejor que sea un solo objeto.</P>
<P ALIGN="JUSTIFY">Pero si cerramos una de esas puertas y la habitaci&oacute;n no se debe ver completamente, lo mejor es que dividamos el objeto en tres objetos. Siempre depende del tipo de juego que queramos hacer y d&oacute;nde queremos situar este objeto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra cosa muy importante a tener en cuenta es el tama&ntilde;o del objeto. Para que os hagais una idea, si nosotros dibujaramos en MAX un cubo de 1 unidad por 1 unidad y coloc&aacute;ramos la c&aacute;mara a una unidad de distancia, esto es lo que ver&iacute;amos:</P>
<center><IMG SRC="jpg/e3maura2.jpg" ></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No hagas caso de la sombra, son pruebas. Aqu&iacute; lo que importa es el tama&ntilde;o. De todas maneras s&eacute; que al principio los grafistas se emocionan y empiezan a hacer virguer&iacute;as que luego hay que retocar. Lo mejor es empezar con alguna cosa peque&ntilde;a, mand&aacute;rmela y yo la estudio y os explico el porqu&eacute; deber&iacute;a de hacerse de una manera o de otra.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409816">Texturas</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, en principio esta beta del Engine revisi&oacute;n 0.000000000000000001 no soporta transparencias, pero si alguien me manda algo con transparencias, mejor porque as&iacute; puedo programarlo.</P>
<P ALIGN="JUSTIFY">Las texturas tienen que ser BMP de 256x256 como m&aacute;ximo y tienen que ser cuadradas potencias de 2, es decir: 2,4,8,16,32,64,128,256 y el nº de colores ser&iacute;a muy conveniente que fuera de 256, aunque admite sin complejos 24 bits, pero la memoria despu&eacute;s se queja un poco!</P>
<P ALIGN="JUSTIFY">Si quieres hacer animaci&oacute;n, utiliza texturas del mismo tama&ntilde;o y n&uacute;meralas, por ejemplo: fuego1.bmp, fuego2.bmp fuego3.bmp y utiliza fuego.bmp (sin numerar) en el programa de modelado.</P>
<P ALIGN="JUSTIFY">No te emociones con los par&aacute;metros de los materiales porque por ahora no se soportan, pero si crees que deber&iacute;a soportar alguna caracter&iacute;stica comun&iacute;camelo e intentar&eacute; programarlo.</P>
<P ALIGN="JUSTIFY">Cuidado con el n&uacute;mero de texturas utilizado. Piensa que las tarjetas tienen como m&iacute;nimo 4 MB de RAM de v&iacute;deo, y si el juego va destinado a este rango de tarjetas, no podremos utilizar muchas texturas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409817">Luces y sombras</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, si sabes lo que son los Vertex Colors, perfecto, porque el programa los soporta. Si no es as&iacute;, mejor te lo explico cuando me mandes alguna escena con luces.</P>
<P ALIGN="JUSTIFY">En conjunto te dir&eacute; que el Engine soporta las luces y las sombras, por lo que deber&iacute;as colocar focos de luz para que la escena tenga m&aacute;s o menos dramatismo. Tambi&eacute;n activa las sombras, puesto que el Engine tambi&eacute;n las reconoce.</P>
<P ALIGN="JUSTIFY">Puedes utilizar luces de colores sin problemas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409818">F&iacute;sica</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, ya sab&eacute;is que un Engine si f&iacute;sica es como un arco iris sin azul!( qu&eacute; chor...!!) Ahora en serio. Este engine tiene todas las caracter&iacute;sticas id&oacute;neas para tener la f&iacute;sica m&aacute;s perfecta del mundo de los videojuegos. Ahora mismo la colisi&oacute;n es PERFECTA con cualquier objeto, sean torres especiales, donuts o cualquier cosa. Y no tarda mucho en calcularse, aunque posiblemente es un apartado que todav&iacute;a puede mejorarse much&iacute;simo. Imag&iacute;nate una esfera que cae rodando por una superficie inclinada. Alucinante, pero muy corriente hoy en d&iacute;a. Ahora imag&iacute;nate esa misma esfera rodando por un plano inclinado llenos de abolladuras. ¡Mucho m&aacute;s alucinante verdad! Pues esto es posible con este Engine. Pero a&uacute;n estoy estudiando la forma de implementarlo de una manera sencilla con la escena. As&iacute; que por ahora de f&iacute;sica no hay que preocuparse, es cosa m&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409819">Notas finales</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Engine es para los grafistas, as&iacute; que si ten&eacute;is alguna idea, dec&iacute;dmela, quiz&aacute;s pueda hacer realidad vuestros sue&ntilde;os.</P>
<P ALIGN="JUSTIFY">No soporta animaci&oacute;n todav&iacute;a pero lo soportar&aacute;.</P>
<P ALIGN="JUSTIFY">Si est&aacute;s utilizando el MAX, colapsa todos los objetos y as&iacute;gnales vertex colors.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"><A NAME="_Toc448409820">Quiero ver el Engine</A></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Yo tambi&eacute;n!! No, ahora en serio, lo vereis cuando tenga algo realmente impresionante, al estilo Quake III. As&iacute; que tambi&eacute;n tendr&eacute;is que aportar vuestro grano de arena, porque aunque ahora tengo una demo, no est&aacute; el objeto optimizado para el Engine, ni puede verse en todo su potencial.</P>
<P ALIGN="JUSTIFY">Yo soy el que m&aacute;s ganas tiene de que la gente vea el Engine y diga:¡lo quiero para mi juego!. Pero llevo muchos a&ntilde;os en esto y creo que es mejor impactar de golpe que no ir dando Betas y Betas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"><b>Qu&eacute; tengo que mandarte.</b></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, pues la escena en formato MAX 2.0 &oacute; 2.5 y las texturas en un mismo directorio. Piensa que para generar el mapa, el programa que recorta los objetos en pol&iacute;gonos y los divide en el espacio puede tardar SEMANAS en calcularlo todo. ( Hombre que cre&iacute;as, ¿que esto estaba chupado? Para que tu puedas dibujar lo que quieras en el MAX, YO tengo que currar mucho y ¡el ordenador much&iacute;simo m&aacute;s!).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; que al principio m&aacute;ndame poca cosa, unas tres habitaci&oacute;n o algo as&iacute;. Yo la estudiar&eacute; y te dir&eacute; si hay que hacer alg&uacute;n retoque o no para optimizar el Engine.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">M&aacute;ndame el mensaje a mi direcci&oacute;n y enseguida que pueda lo probar&eacute; y te dir&eacute; cosas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">¿Y Qui&eacute;n porras a hecho esto?</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pues Javier Maura. </P>
<P ALIGN="JUSTIFY">Mail : </FONT><A HREF="mailto:jmaura@mx3.redestb.es"><FONT FACE="Arial" SIZE=2>jmaura@mx3.redestb.es</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Web: </FONT><A HREF="http://personal.redestb.es/jmaura"><FONT FACE="Arial" SIZE=2>http://personal.redestb.es/jmaura</FONT></A></P>



<BR><BR>



<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>


<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>

<A HREF="dhispb.htm"><font FACE="ARIAL"><B>[Crónicas de una Creación]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>




<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



