<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Diablo.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Blizzard.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Ubi Soft.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Vídeoaventura.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 55%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">
<IMG src="jpg/diablo.jpg" align="left">
<P align="justify">
Hace poco adquir&iacute el juego Diablo de 
la compa&ntilde;&iacute;a
norteamericana Blizzard. Juego que seguro que
muchos de vosotros la conoceréis por
ser la creadora de la saga de juegos de
estrategia en tiempo real Warcraft.
        Pues bien, la compra fue llevada a
cabo despues de leer numerosos art&iacute;culos en
las &quot;revistas&quot; espa&ntilde;olas de videojuegos (las
que teneis en mente), en donde daban notas
fabulosas al, seg&uacute;n su criterio, 
&uacute;ltimo juego
de ROL de Blizzard. Esto, unido a que
Blizzard hab&iacute;a alcanzado a mi entender la
consagraci&oacute;n con su Warcraft II, hizo que me
fuera muy dif&iacute;cil el no comprar el juego,
y m&aacute;s teniendo en cuenta la sequ&iacute;a por la que
estamos atravesando los jugadores de rol en
el mundo del PC.
<br><br>        En primer lugar, al contrario de lo
que hice con el Warcraft II, decid&iacute; comprar
el producto en Espa&ntilde;a, es decir, probar con
la distribuidora en nuestro pa&iacute;s del juego,
UBI. Y la verdad tengo que decir que salvo el
tama&ntilde;o de la caja, que es PATÉTICO, el resto,
es decir, las instrucciones (no hay ning&uacute;n
tipo de regalo extra), est&aacute;n bastante bien
traducidas, incluso creo recordar que con
respecto a la versi&oacute;n Yanky conserva todas
las hojas. As&iacute; pues en lo referente a la
documentaci&oacute;n la podr&iacute;amos catalogar de
m&aacute;s que aceptable.
<BR>
<BR>

        Pero pasemos a lo importante, a
comentar este juego de &quot;ROL&quot;, ¿estais
preparados?.....
<BR>
<BR>
        Para empezar el DIABLO no es un
juego de ROL ni de lejos, es mÁs, se acerca
de una forma muy peligrosa al ARCADE puro y
duro, de forma que los dise&ntilde;adores de Blizzard, han tenido que incluir peque&ntilde;os
detalles (los que todos los jugadores ajenos
a los JDR -Juegos De Rol- de
ordenador tienen siempre en mente cuando
piensan en un juego de rol) para hacer
que te creas que a lo que est&aacute;s jugando
es ROL, vamos para enga&ntilde;arte. Por eso
todos aquellos jugadores de ROL de verdad (y
ahora mismo estoy pensando en aquellos que
probaron un Ultima de Richard Garriot, un Eye
Of The Beholder de Westwood, un Might &amp; Magic
de New World Computing, etc etc) al ver este
programa se preguntar&aacute;n, como yo, si hay una
forma m&aacute;s descarada de destrozar los g&eacute;neros,
y digo lo de destrozar porque Blizzard primero
y las revistas despues, te meten hasta por
los ojos que el Diablo es un juego de ROL.
<BR>
<BR>
<IMG SRC="gif/d_rogue.gif" align=right>
<p align=justify>
        Esta obra de Blizzard ha sido
pensada desde un principio como un producto
internet, para ser jugado de modo m&uacute;ltiple.
Es ah&iacute; donde gana, y yo reconozco 
que como juego multijugador est&aacute; muy bien. Al
ser como he dicho un juego ideado para
internet, el desarrollo del mismo ha de ser
r&aacute;pido, ha de tener las menores
complicaciones posibles, y en definitiva ha
de ofrecer cuanto antes al jugador, o mejor
dicho jugadores, ACCION (¿para que creeis que
sirve la creaci¢n de niveles nuevos en
distintas partidas?). Eso explica que esta
Uhmm....¿videoaventura? sea tan LINEAL y este
todo tan PREFIJADO, cuando lo que te esperas
es un ambiente rico, que te introduzca en la
trama, y que sientas curiosidad, m&aacute;s que por
ver lo que hay en el cofre que tienes
delante, por ir desarrollando tambi&eacute;n la
trama; en el que a la hora de interactuar con
los NPC, no tengas que pulsar al bot&oacute;n del
rat&oacute;n para pasar un texto que NO te INTERESA,
y que es la &uacute;nica forma de que te den algo,
cuando lo que de verdad interesa es descubrir
una personalidad en el NPC que te ayude de
una forma REAL a resolver tus problemas o a
empeorarlos, pero siempre seg&uacute;n las diversas
acciones que lleves TU a cabo. Por este
motivo todos los que os espereis encontrar un
ambiente parecido al Ultima VII, por poner un
ejemplo, pues nada, que ni de co&ntilde;a, tampoco
pido que el Diablo iguale al genio de los
dise&ntilde;adores pero vaya, tan solo hay que ver
el ambiente del pueblo....¡NO HAY &quot;VIDA&quot;!,
es todo tan SIMPLE que da ABURRIMIENTO.
<BR>
<BR>
        Hasta aqu&iacute; eso es todo el ambiente
que rodea una partida del Diablo, pero si
pasamos al desarrollo ACTIVO del mismo, deja
a&uacute;n m&aacute;s que desear, y pide a gritos que le
llamemos ARCADE (y que conste que lo que hago
no es una cr&iacute;tica al arcade, sino, una
cr&iacute;tica a todos aquellos que son capaces de
llamar a Diablo juego de Rol), ¿Que no?,
mirar, durante el desarrollo de una partida
tus acciones, TODAS tus acciones consisten en
matar, coger dinero y seguir avanzando.
Posteriormente podr&aacute;s vender alg&uacute;n objeto y
comprar otros, !Ah! por supuesto subes de
nivel y el sistema de asignaci&oacute;n de puntos es
tan &quot;inteligente&quot; que puedes convertir a tu
guerrero en el m&aacute;s experto de los magos y en
el m&aacute;s patetico de los guerreros (y
viceversa).....
<BR>
<BR>    

	    No hay puzzles tipo palancas, ni
llaves que encontrar, ni problemas l&oacute;gicos,
ni acertijos, bueeeno hay que encontrar una
SANTA cosa, a parte de eso el resto es matar
y matar, vamos que en lugar de rat&oacute;n parece
que tienes un Joystick.

        M&aacute;s de uno de vosotros me estar 
maldiciendo por tal art&iacute;culo, en el que no
digo nada bueno del juego, pues bien, el
Diablo si tiene cosas buenas, la m&uacute;sica es
genial al igual que los gr&aacute;ficos, que te
meten en el decorado de forma aplastante,
pero OJO una cosa es el DECORADO y otra
cosa es EL JUEGO. Las animaciones de los
personajes es de lo mejorcito que se puede
ver al igual que los enemigos del juego, que
son de una maravillosa riqueza.
<BR>
<BR>
        En el apartado de hechizos el juego
esta muy bien dotado, superando a alg&uacute;n
juego de ROL que ahora mismo tengo en la
cabeza, todo hay que decirlo.
<BR>
<BR>

        En definitiva el Diablo es un ARCADE
con disfraz de juego de ROL, muy bueno si lo
que quieres es pasartelo a lo grande jugando
en modo multijugador, pero MUY ABURRIDO y
DECEPCIONANTE si lo que buscas es un juego de
ROL. mi opini&oacute;n llamar al Diablo juego de
ROL es como decir que el DOOM es un gran
juego de Estrategia.....
<BR>
<BR>
        A&uacute;n es m&aacute;s y esto es una opini&oacute;n que
le&iacute; por internet y de la que estoy totalmente
deacuerdo, Diablo es una copia MALA del
cl&aacute;sico SHADOWLANDS de Domark. El Diablo II
lo mirar&eacute; con LUPA.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadeb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

