<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Dungeon Keeper.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> BullFrog.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Electronic Arts.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Estrategia 3D en tiempo real.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95. </b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 83%.</b></font>
<HR>

<BR>
<BR>

<img src="gif/portada.gif" align="left">
<P ALIGN=justify>
Hac&iacute;a mucho tiempo que andaba detr&aacute;s de este t&iacute;tulo de genial Peter Molenux, parte
porque era el t&iacute;tulo que m&aacute;s quebraderos de cabeza le hab&iacute;a producido y parte
porque se estaban generando, entorno a &eacute;l, gran cantidad de rumores que le pon&iacute;an
como uno de los t&iacute;tulo a tener en cuenta para el verano del 97. Ya hemos pasado
el verano del 97, y ya est&aacute; en mis manos, seguir y os desvelar&eacute; c&oacute;mo da de s&iacute;
este t&iacute;tulo
<BR>
<BR>
Pues s&iacute;, al bueno de Peter le ha costado muy caro sacar este t&iacute;tulo, ya que
los cont&iacute;nuos retrasos y cambios de dise&ntilde;o del producto, han hecho que el engine
3D original se convirtiera en algo obsoleto y se necesitara de algo totalmente 
nuevo. El juego mezcla todo lo que Peter Molyneux ha venido desarrollando hasta
la fecha, ya que sigue en la l&iacute;nea de sus t&iacute;tulos &quot;tipo Dios&quot;, en los que
el jugador asume el control total de la situaci&oacute;n, y cuando digo total, lo digo
en todo el sentido de la palabra, ya que en este juego incluso podremos meternos
en la piel de alg&uacute;n bichejo de los que controlamos globalmente.
<BR>
<BR>
Pero mejor que nada vayamos por partes. Lo primero que hare ser&aacute; situaros y
comentaros el argumento o las bases del producto. <br>Pues bien, en este juego,
deber&aacute;s de asumir el papel de &quot;amo del calabozo&quot;, el cual es el encargado de
proteger una cueva o mazmorra de los ¡heroes!, s&iacute;, en este juego, t&uacute; tomar&aacute;s el
papel de &quot;los malos&quot; y deber&aacute;s de ideartelas para quitarte de en medio a los
tradicionales h&eacute;roes de los juegos de rol, que vendr&aacute;n a apoderarse del tesoro
que tanto te ha costado robar. Para poder comprobar y entender lo que digo, nada 
mejor que ver la sensacional introducci&oacute;n (para m&iacute; una de las 5 mejores de
este a&ntilde;o).
<BR>
<BR>

¿Y c&oacute;mo se juega a esto?, pues es bien sencillo, sobre todo porque se ha
dispuesto de una ayuda estupenda (al estilo Theme Park), que constituye
un at&eacute;ntico tutorial para que te hagas de una forma progresiva con el juego.
Tu deber&aacute;s de controlar todos y cada uno de los aspectos que un buen &quot;amo
del calabozo&quot; ha de controlar, esto es, salas del tesoro, criaturas perversas,
camaras de torturas, salas de entrenamiento, la alimentaci&oacute;n de tus servidores,
etc, etc. 
<P ALIGN=justify>
En definitiva, debes de ir expandiendote por el escenario en el
que comienzas, mediante la creaci&oacute;n de c&aacute;maras y pasillos, pero sin olvidarte
de salas para que tus criaturas puedan descansar, ni de c&aacute;maras de entrenamiento
para que puedan entrenarse y as&iacute; ir subiendo niveles de experiencia (s&iacute;, hay
toques de rol). Todo esto ser&aacute; posible si se dispone de oro, ya que las criaturas
que se unan a t&uacute; causa no trabajar&aacute;n gratuitamente y adem&aacute;s la construcci&oacute;n de
nuevas s&aacute;las te costar&aacute; una considerable porci&oacute;n de tus riquezas.

<BR>
<BR>
Por tanto, el objetivo general es lograr hacer una mazmorra robusta en cada
uno de los escenarios en los que hay que jugar. Sin embargo, no todo va a ser
tan f&aacute;cil, ya que a parte de los heroes y dem&aacute;s &quot;nobles haza&ntilde;as&quot; que intentar&aacute;n
acabar contigo, tambi&eacute;n tendr&aacute;s que competir con otros amos del calabozo que
querran dominar, al igual que t&uacute;, la zona. Todo esto unido, a la posibilidad
de poner trampas, utilizar hechizos, existir toques de rol y poder jugar dentro
de unas de las criaturas de tu bando a modo &quot;doom&quot;, hacen de este producto
uno de los m&aacute;s originales de este a&ntilde;o.
<BR>
<BR>
Pero pasemos ya a lo que es la cr&iacute;tica del juego.<br>Personalmente
las escenas en las que existen combate no me acaban de gustar ya que
hay demasiado &quot;lio&quot; y es, en ocasiones, dif&iacute;cil el enterarse de como va la
pelea por culpa del sistema / engine utilizado (que es todo el rato en tiempo
real). De todas formas, esto s&oacute;lo ocurre cuando las batallas son grupos con
mucha cantidad de &quot;criaturas&quot;. 
<BR>
<BR>
Otro de los aspectos que no me llega a convencer es el de la gesti&oacute;n de
las trampas en el juego, ya que no dan los resultados que te esperas, me explico,
las trampas no son totalmente imprescindibles para poder realizar una buena
estrategia, y es una pena, porque esa idea se podr&iacute;a haber explotado much&iacute;simo
m&aacute;s.
<BR>
<BR>
Otra cr&iacute;tica se la voy a didicar al hecho que hace que no puedas contar con
tus criaturas para el siguiente nivel, cuando en muchas ocasiones, has estado
un mont&oacute;n de tiempo entren&aacute;ndolas para que puedan subir de nivel y sean m&aacute;s
efectivas en el combate.
<BR>
<BR>
<img src="jpg/dun1.jpg" align=left>
<P ALIGN=justify>
Por lo dem&aacute;s el juego es una maravilla, y un del&iacute;to el no tenerlo, ya que
supone un gran aliciente para el mercado de los juegos de estrategia en
tiempo real, que s&oacute;lo son cl&oacute;nicos y m&aacute;s cl&oacute;nicos de los C&Q y Warcraft. Los
gr&aacute;ficos y el engine son realmente notables, pero lo que destaca por encima
de todo es la m&uacute;sica, muy bien escogida, al igual que la traducci&oacute;n al castellano
que se nota que ha sido llevada de un modo profesional.
Los manuales y caja son de lujo, ya que tienen el tama&ntilde;o y las hojas que el t&iacute;tulo se merecen.

<BR>
<BR>
En l&iacute;neas generales, Dungeon Keeper, es un juego accesible para todos aquellos
que les guste la estrategia o no, para todos aquellos a los que les atraiga el
rol y para los que no le entiendan, es decir, es un juego que no deber&iacute;a de
faltar en nunguna programoteca. Quiz&aacute;s se le pueda recriminar que le falte
ese toque que lo convertir&iacute;a en un gran juego. Pero os vuelvo a 
repetir que es un juego muy original y altamente adictivo, que pone de
manifiesto la posici&oacute;n de privilegio, en cuanto originalidad, que reina en
las casas productoras Europeas. Si bien, todo ha sido gracias a las genialidades
de Peter Molyneux, que ha vuelto a dejar a la prensa especializada sorprendida,
al ser capaz de seguir sacando t&iacute;tulos totalmente originales. De todas formas
de aqu&iacute; en adelante ya no le veremos en Bullfrog, ya que ha decidido abandonar
la compa&ntilde;&iacute;a que fundara a finales de los 80 (y que tamb&iacute;en fuera adquirida
por la multinacional NorteAmericana EA), y crear otra mucho m&aacute;s reducida,
y ya veis los grandes nombres del soft, empiezan a dejar las compa&ntilde;&iacute;as multinacionales
para irse a lugares con grupos mucho m&aacute;s reducidos y &quot;controlables&quot;.
<BR>
<BR>
Antes de acabar con este art&iacute;culo os comentar&eacute; que el bueno de Peter Molyneux,
decidi&oacute; que el final del juego tuviese que ser en lucha contra el m&aacute;s heroico de
los h&eacute;roes, esto es, el Avatar que es el protagonista de la serie Ultima y su
rey Lord British, para ello se puso en contacto telef&oacute;nico con Richard Garriot
y este accedi&oacute; encantado....curiosidades del mundo del soft ;-).
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestrab.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

