<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>



<HR>

<BR>

<BR>



<BODY>

<P ALIGN=justify>

<center><img src="g_misc/act_10.jpg"></center>

<FONT color="#000000" size=2 face="arial">

<center><h3>Editorial de <br>Macedonia 10</h3></center>

<br>



</FONT><P><BR>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Si ya de por s&iacute; resulta dif&iacute;cil escribir un editorial en esta revista, en cuanto al esfuerzo que supone recordar y saber plasmar los diferentes contratiempos que se van sucediendo en cada edici&oacute;n, imaginad lo complicado que puede llegar a ser escribir la &uacute;ltima editorial. Suele ser com&uacute;n, en las despedidas, ponerse a recordar el tiempo transcurrido "desde la primera vez que..." y llegar a la conclusi&oacute;n de que "parece que fue ayer". Desde luego, algo de eso s&iacute; que hay, sin embargo, en mi caso, no s&eacute; por qu&eacute; motivo, esa sensaci&oacute;n se ve sustituida por otra que me dice que realmente s&iacute; que parece que ha pasado mucho tiempo. Es cierto, me resulta imposible ponerme a pensar en el momento en que recib&iacute; alg&uacute;n email de alguien que est&aacute; ahora en Macedonia, en el que hice el primer art&iacute;culo, en el que recib&iacute; la primera colaboraci&oacute;n, la primera cr&iacute;tica, en el que aprend&iacute; de alg&uacute;n error faltal, en el que me puse en contacto con alguna personalidad, en el que me tir&eacute; hasta las tantas de la madrugada probando y desechando dise&ntilde;os, corrigiendo art&iacute;culos, revisando emails, confeccionando documentos... Todos estos recuerdos est&aacute;n completamente llenos de an&eacute;cdotas, situaciones y dem&aacute;s complementos que hacen como si todo este tiempo realmente hubiera durado m&aacute;s de dos a&ntilde;os. Sinceramente, no me parece que fuera ayer el d&iacute;a en que sali&oacute; el primer Macedonia porque me es imposible separar todos los buenos momentos que le precedieron.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Supongo que toda esta sensaci&oacute;n se debe a que el "sacrificio" que tanto el equipo de Macedonia, como yo mismo, hemos realizado para conseguir que la revista saliera adelante ha sido muy intenso. Y me considero afortunado. Es cierto, y no voy a negarlo, el trabajo para sacar adelante Macedonia, al comienzo, cuando no hab&iacute;a absolutamente nadie metido, fue realmente demoledor e intenso y sin ning&uacute;n "sendero" claro. Sin embargo, ese y mil trabajos m&aacute;s con tal de vivir lo que he vivido en Macedonia. No s&eacute; explicar realmente las sensaciones que uno tiene cuando, despu&eacute;s de estar d&aacute;ndole a la tecla, poniendo el trabajo en el inmenso oc&eacute;ano que es Internet, lee que le llega un email de colaboraci&oacute;n, que el contador aumenta de 15 a 30 visitas o que alguna persona del mundillo, a la que t&uacute; admiras desde la infancia, te escribe y, encima, te felicita por el trabajo hecho en la revista. No, esas sensaciones no se pueden explicar. Pero tampoco se puede explicar el ambiente que ha reinado siempre en la lista interna de Macedonia, el compa&ntilde;erismo, el gran compromiso que han tenido las m&aacute;s de 70 personas que han colaborado, de una forma u otra, en la historia de la publicaci&oacute;n. Desde usuarios "de a pie" a invitados admirados por nosotros que han querido dedicar algo de su valioso tiempo para completar una entrevista o para hacer, simplemente, un art&iacute;culo. Gracias a todos, de verdad, porque, a d&iacute;a de hoy, veo todo esto como un espectador que se dice "¡mira!", cuando ve algo en la publicaci&oacute;n que le llama la atenci&oacute;n, pese a haber estado maquetando el art&iacute;culo el d&iacute;a anterior.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y con qu&eacute; me quedo de todo esto?. Pues me quedo con todo, desde luego, sin embargo hay algo que me va a quedar grabado a fuego; las personas con las que, de verdad, he estado trabajando "codo con codo" en cada n&uacute;mero. Con las que han estado en momentos estupendos y en momentos no tan buenos (que ha habido much&iacute;simos en la historia de la revista). De nuevo, me siento afortunado y privilegiado de haber tenido la oportunidad de coordinar a un equipo humano que supera, y con creces, mis propias capacidades. Por su humildad y su profesionalidad. Por ser constantes con la revista y, sobre todo, por no dejarla ahora que yo me marcho. Gracias colegas, desde luego, os juro que me va a costar acostumbrarme a no recibir ning&uacute;n email con el subjet ese que pone [macedonia].</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este es mi &uacute;ltimo n&uacute;mero. Recuerdo que poco antes de que surgiera la idea de publicar una versi&oacute;n OffLine yo ya hab&iacute;a tomado la decisi&oacute;n de estar un a&ntilde;o m&aacute;s &uacute;nicamente. Por eso, esta decisi&oacute;n no es en absoluto precipitada ni obedece tampoco a una causa especial. Yo quiero a Macedonia y quiero ver c&oacute;mo algo que creci&oacute; de la nada es capaz de evolucionar por s&iacute; mismo. Esta ida obedece m&aacute;s a un objetivo que me plantee hace tiempo; lograr que Macedonia fuera uno de las pocos fanzines que existieran por encima de su creador. Os puedo asegurar que publicaciones que lo hayan logrado se cuentan con los dedos de una mano. El n&uacute;mero 11 que se avecina, es el n&uacute;mero m&aacute;s importante de Macedonia en toda su historia. Es un volver a nacer y la prueba definitiva de que aquella revista reci&eacute;n nacida primero y adolescente despu&eacute;s, ha acabado por madurar completamente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta editorial es muy personal. Quiz&aacute;s no debiera haberla hecho as&iacute; pero no he podido resistirme. Gracias a las personas que han ayudado, de una forma u otra, a que Macedonia creciera. No creo que haya nadie que, habiendo participado en Macedonia, no se sienta orgulloso de la misma. A fin y al cabo, todos somos una porci&oacute;n de este c&oacute;ctel de frutas. Hasta siempre equipo y, sobre todo, gracias por seguir existiendo y haberme ense&ntilde;ado tantas cosas.</P></FONT>

<P ALIGN="RIGHT">
<B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1 FACE=ARIAL><b>11 de Julio de 1999.</b></font>

<BR><BR>
<BR><BR>

<hr width="65%" align="center">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Bueno, tambi&eacute;n me toca hablar a m&iacute; en esta editorial. Algunos lo sabr&eacute;is y otros no. Yo he sido el subdirector de esta gran familia durante una buena temporada. Bajo las alas de Fernando Rodr&iacute;guez he intentado pas&aacute;rmelo lo mejor que he podido con todos vosotros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora Fernando se nos va y yo tambi&eacute;n dejo el cargo por diferentes cuestiones. Falta de tiempo sin duda, esa es la primordial. No dejo la revista ni mucho menos. Seguir&eacute; aportando mis conocimientos como redactor en todas y cada una de las &aacute;reas que ya conocer&eacute;is.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Inici&eacute; mi trabajo en Macedonia desde muy lejos, desde Estados Unidos nada menos. Ahora, ubicado de nuevo en Barcelona, sigo d&iacute;a a d&iacute;a todos los acontecimientos y me parece sensacional que nada haya cambiado. Yo me he desplazado pero la red me ha confinado!!!...esta es la primera experiencia de teletrabajo en la que participo y los resultados pod&eacute;is valorarlos vosotros mismos. Hay mucha fruta y muy variada en esta Macedonia de todos!</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Espero que esta experiencia dure muchos a&ntilde;os y que al final podamos sacar las ediciones completas de la revista en 100 CD-ROM al menos!!...somos muchos y muy diferentes, de diversos lugares e incluso profesiones...pero la din&aacute;mica es buena y el trato inmejorable.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un abrazo desde aqu&iacute; a todos los lectores y en especial felicidades para todos aquellos que hayan podido resolver sus dudas y entregar sus proyectos gracias a los conocimientos plasmados en este medio.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro abrazo muy especial para Fernando, nuestro mentor, columna inamovible sobre la que todos nos hemos apoyado. Siempre resistente, paciente y organizada a m&aacute;s no poder. ¡Cu&iacute;date mucho jefazo!</P></FONT></BODY>

<P ALIGN="RIGHT">
<B><FONT FACE="Arial" SIZE=1>O</B></FONT><B><FONT FACE="Arial" SIZE=1>scar García</B> 
<br><font color="#CC0000" size=1 FACE=ARIAL><b>11 de Julio de 1999.</b></font>


<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>

<br>

<hr><br>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>



</HTML>



