<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center></center>
<FONT color="#000000" size=2 face="arial">
<center><img src="g_misc/edi1.gif"></center>
<center><h3>Editorial de <br>Macedonia 1</h3></center>
<br>
<p align="justify">
Bueno, pues s&iacute;, lo que empez&oacute; siendo una &quot;aventurilla&quot; de Rewin y Kapit, para saber qu&eacute; era eso de tener una p&aacute;gina WEB en la Red, se ha convertido en algo m&aacute;s o menos serio. Ya tenemos unas cuantas &quot;visitillas&quot; y, sobre todo, bastante m&aacute;s ilusi&oacute;n e ideas de las que esper&aacute;bamos &iacute;bamos a tener cuando empez&aacute;bamos &quot;a darle a la tecla&quot;.</P>
<P ALIGN="JUSTIFY">Si ya nos visitaste cuando a&uacute;n colg&aacute;bamos el cartelito de "Under Construction", podr&aacute;s comprobar que la "revista" ha engordado de forma considerable. Todos los apartados tienen algo que contar y a&uacute;n tenemos muchas m&aacute;s ideas que iremos poniendo. La verdad, no esper&aacute;bamos que fu&eacute;ramos a ocupar nunca los 2 megas que Geocities nos da pero, a d&iacute;a de hoy, ¡estamos rezando para que no se nos agoten demasiado pronto ;)!.</P>
<P ALIGN="JUSTIFY">Bueno, pasando a materia. Si no has estado aqu&iacute; &uacute;ltimamente o....acabas de naufragar ;), decirte que Macedonia Magazine, es una especie de revista en la que se dan cabida a multitud de temas relacionados con la inform&aacute;tica, ya sea en forma de opini&oacute;n, cursos, recuerdos de la &eacute;poca de los 8 bits, juegos, etc. Sin embargo, tambi&eacute;n tenemos un apartado dedicado a la m&uacute;sica, eso s&iacute;, a la que mejor conocemos los dos que hacemos la revista, esto es, hablamos de Queen (Rewin lo hace) y de la m&uacute;sica Folk (Kapit y algunos colegas).</P>
<P ALIGN="JUSTIFY">Otro aspecto importante es que hay unos cuantos cursos empezados, pues bien, creemos que carece de sentido seguir haci&eacute;ndolos o ampli&aacute;ndolos si no recibimos noticias de personas que est&eacute;n realmente interesados mediante alg&uacute;n mail, por ejemplo. As&iacute;, todos aquellos cursos empezados que no reciban una m&iacute;nima aprobaci&oacute;n se supondr&aacute; que no os han gustado y se cancelar&aacute;n a no ser que realmente consideremos que merece la pena seguir haci&eacute;ndolo (no os cre&aacute;is que dise&ntilde;ar algunos cursos de la revista y teclearlos despu&eacute;s, se hace en dos &quot;horinas&quot;...). <BR>
<BR>
Por otro lado, solicitamos colaboraciones, ya sean a modo de art&iacute;culos de opini&oacute;n o de aula, ya que creemos que todo quedar&iacute;a "mucho mejor" si no s&oacute;lo Rewin y Kapit hiciesen Macedonia. As&iacute; que ya sabes, si tienes algo que contar, p&aacute;sate por la secci&oacute;n de colaboraciones y cu&eacute;ntanos lo que te gustar&iacute;a hacer, nosotros te responderemos cuanto antes y te comentaremos qu&eacute; nos parece t&uacute; idea. </P>
<P ALIGN="JUSTIFY">Por cierto, si t&uacute; nos anuncias en t&uacute; p&aacute;gina, nosotros te pondremos en nuestra secci&oacute;n de links, de esta forma, conseguiremos que m&aacute;s gente pueda ver tanto el trabajo vuestro como el nuestro, vaya, que nos ayudamos m&uacute;tuamente ;), si bien, hay algunas p&aacute;ginas en la secci&oacute;n de Links, que sencillamente las ponemos porque merecen la pena aunque algunos autores no sepan que existimos :-(.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n deciros que aqu&iacute; no tenemos previsto seguir por n&uacute;meros la revista, ni estar ligados a una actualizaci&oacute;n cada mes o algo parecido. La revista ir&aacute; creciendo con el paso de los meses y punto, pero en ning&uacute;n caso tenemos previsto dotarla de numeraci&oacute;n o similares. Las actualizaciones se har&aacute;n cada mes o mes y medio y lo anunciaremos en los grupos de noticias y mandando mails a lo que nos escriban. </P>
<H4>Colaboraciones Externas </H4>
<P ALIGN="JUSTIFY">Bien, uhmmmm, no es que tengamos muchos colaboradores que digamos...¡ES MAS, NO HAY NADIE!, esperamos que os anim&eacute;is a escribirnos porque ser&iacute;a genial contar con vuestra ayuda. Y si no quer&eacute;is contar nada, hacer un peque&ntilde;&iacute;simo esfuerzo y mandarnos un mail dici&eacute;ndonos que hab&eacute;is visto la p&aacute;gina please ;).</P>
<P ALIGN="JUSTIFY">Pues bien, pues creemos que por ahora la editorial est&aacute; lo suficientemente "rellena" as&iacute; que sin m&aacute;s ¡a pinchar por ah&iacute; se ha dicho! y <B>¡gracias por leernos!</B> </P>
<P ALIGN="RIGHT"><font size=1><b>José Conde "Rewin" y Fernando Rodríguez "Kapit".
<br><font color="#CC0000">18 de Octubre de 1997.</font>
</b></P></FONT>

<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>

<hr><br>

</p>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

