<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/edi2.gif"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 2</h3></center>
<br>
<p align="justify">
Una segunda actualizaci&oacute;n, un redise&ntilde;o de la revista, art&iacute;culos revisados y otros (muchos) nuevos, gente que se apunta a colaborar, apoyo de otros fanzines del sector... los ex&aacute;menes de Febrero a la vuelta de la esquina ;). ¡Bufff!. Son muchas cosas ¿no os parece?. A nosotros s&iacute;, hasta tal punto que nos hemos visto desbordados de trabajo.</P>
<P ALIGN="JUSTIFY">Nos hemos impuesto un objetivo, el de hacer una revista para que nosotros podamos aprender de vosotros y vosotros pod&aacute;is hacer lo propio con nuestro trabajo. Y claro, las cosas se hacen bien o no se hacen. En nuestro caso, creemos que con esta segunda actualizaci&oacute;n de Macedonia, hemos hecho las cosas, sino bien, si mucho mejor que en el n&uacute;mero anterior. Hemos dado un "toque" m&aacute;s personal a la publicaci&oacute;n, la hemos dotado de personalidad propia, y lo mejor de todo es que, mientras hac&iacute;amos todo esto, hemos estados ansiosos de poder ofrecer el trabajo a todos vosotros, no s&oacute;lo para que disfrut&eacute;is leyendo los art&iacute;culos que m&aacute;s os gusten, sino para "atraeros" a que hag&aacute;is con nosotros la revista.</P>
<P ALIGN="JUSTIFY">S&iacute;, es cierto, hemos disfrutado haciendo cada uno de los art&iacute;culos de Macedonia, los hemos perfeccionado y alejado de caer en escritos mediocres y "poco entendibles", o por lo menos, eso es lo que hemos intentado a toda costa. Sin embargo, nuestras capacidades son finitas, muy finitas, y no podemos mantener esto solos. Una Macedonia es una mezcla estupenda de lo mejor de la fruta, si aplicamos esto a nuestra revista, una Macedonia Magazine, ser&iacute;a una mezcla estupenda de buenos art&iacute;culos hechos por ilusionados amantes de la inform&aacute;tica, en cualquiera de las facetas de esta.</P>
<P ALIGN="JUSTIFY">M&aacute;s arriba, pon&iacute;amos que el objetivo de crear algo como Macedonia era el de poder ampliar y sentar nuestros conocimientos, nuestra "culturilla" inform&aacute;tica y aprender de las dem&aacute;s personas y saber los puntos de vista de estas. Pues bien, eso es imposible sin la ayuda de todos, es por esto que, desde este segundo n&uacute;mero de Macedonia que tantas horas nos ha robado en su "elaboraci&oacute;n" final, os vamos a pedir vuestro apoyo, no s&oacute;lo en forma de visitas sino tambi&eacute;n en el de participaci&oacute;n con art&iacute;culos en la revista ya que, es muy gratificante ver el contador aumentando (aunque no sea mucho ;) ), pero a&uacute;n lo es m&aacute;s recibir el mail de alguien que te dice "Bueno, ¿cu&aacute;ndo os mando mi aportaci&oacute;n?".</P>
<P ALIGN="JUSTIFY">Antes de dejaros que "pulul&eacute;is" por las secciones de este nuevo n&uacute;mero de Macedonia, os tenemos que decir que no est&aacute; completo, es decir, a&uacute;n falta alg&uacute;n que otro art&iacute;culo que sale en este segundo n&uacute;mero y que s&iacute; pertenece a &eacute;l. Es posible que, para cuando est&eacute;s leyendo este texto, ya est&eacute;n incorporados todos y cada uno de los art&iacute;culos que componen este n&uacute;mero, de todas formas, esto deber&iacute;a estar solucionado el d&iacute;a 10 de Enero del 98 como m&aacute;ximo.<BR>
<BR>
Este problema, se deriva del hecho de no haber recibido a tiempo ciertos art&iacute;culos que esper&aacute;bamos, es por ello, que los iremos incorporando pero s&oacute;lo los que est&aacute;bamos esperando no los nuevos que nos envi&eacute;is ya que, esos, saldr&aacute;n en la actualizaci&oacute;n 3 de Macedonia. De todas formas, ya anunciaremos cuando la revista est&eacute; completamente actualizada.</P>
<P ALIGN="JUSTIFY">y, por supuesto, ¡Feliz año 1998! ;)</P>
<P ALIGN="RIGHT"><font size=1><b>José Conde "Rewin" y Fernando Rodríguez "Kapit"</b>
<br><font color="#CC0000"><b>3 de Enero de 1998.</b></font>

<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<br>
</p>
</p>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>


</HTML>

