<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/num3.gif"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 3</h3></center>
<br>
<p align="justify">
Parece que en esta ocasi&oacute;n, el "cuento de la lechera del inform&aacute;tico", no ha hecho acto de presencia en la redacci&oacute;n de Macedonia ya que volvemos, sin apenas hacer ruido, a dar m&aacute;s muestra de nuestro trabajo, realizado sin prisa pero sin pausa.</P>
<P ALIGN="JUSTIFY">Muchas cosas he aprendido yo en este tercer n&uacute;mero de la revista, desde que hay mucha m&aacute;s gente de la que yo cre&iacute;a dispuesta a ayudar a levantar nuevas iniciativas sin pedir NADA a cambio y que, pese a tener una posici&oacute;n realmente considerable en este "mundillo", a&uacute;n siguen disfrutando de &eacute;l como uno m&aacute;s dejando la prepotencia de que muchos "fantasmas" hacen gala, hasta la dificultad que entra&ntilde;a llevar un humilde fanzine como este adelante. Hay montones de cosas que hacer siempre, desde contestar a los mails de apoyo y de gente que quiere formar parte del proyecto a ir "llamado" a las p&aacute;ginas de grupos espa&ntilde;oles para presentarnos. Pero... una vez que miras para todo el trabajo que genera una cosa como esta y meditas un poco, llegas a la conclusi&oacute;n que la satisfacci&oacute;n personal que te produce el hacer algo as&iacute; merece y mucho la pena. ¡Que nos quiten lo "bailao"! 8-)</P>
<P ALIGN="JUSTIFY">Macedonia siempre ser&aacute; algo gratuito hecho por y para gente ilusionada y que, por encima de todo, adora el crear con su herramienta llamada ordenador.</P>
<P ALIGN="JUSTIFY">El resultado de todo este esfuerzo, como ya cit&eacute; anteriormente, es el de poder ver cada vez que inicias una sesi&oacute;n de Linux en la facultad, el mensajito que pone <I>"You have new mail"</I>. No se a vosotros pero a uno le encanta poder ir todos los d&iacute;as a la facultad y leer algo as&iacute;, es sencillamente estupendo.</P>
<P ALIGN="JUSTIFY">Desde mails de gente que se apunta a colaborar a mails de gente que nos felicita por la iniciativa pasando, como no, por personalidades del mundillo. ¿Os imagin&aacute;is lo que se siente una persona que sue&ntilde;a con dedicarse al desarrollo de juegos desde los 8 bits cuando en el subject lee que llega un mail, sin esperarlo, de un antiguo miembro de AD, Opera o, incluso, de P&eacute;ndulo Studios?, creo qu&eacute; ya me entend&eacute;is que os quiero decir.</P>
<P ALIGN="JUSTIFY">Pero no s&oacute;lo he aprendido las satisfacciones y el trabajo que produce llevar algo as&iacute;, tambi&eacute;n he aprendido muchas cosas de amigos como Rewin sin el cual NUNCA se hubiera podido iniciar una cosa llamada Macedonia. Te lo he puesto en los agradecimientos especiales de la revista y te lo vuelvo a repetir, gracias por tu sinceridad y por tus &aacute;nimos para no abandonar una "encerrona" llamada carrera de inform&aacute;tica :,-)</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de dejar esta especie de "pensamiento" generado durante el mes y medio de preparaci&oacute;n del n&uacute;mero 3 de Macedonia, voy a realizar un petici&oacute;n a todos los que est&aacute;is leyendo estas l&iacute;neas.</P>
<P ALIGN="JUSTIFY">Mi m&aacute;xima ilusi&oacute;n dentro de Macedonia ser&iacute;a la creaci&oacute;n de una secci&oacute;n dedicada, en exclusiva, a la programaci&oacute;n de juegos en la que se metieran aut&eacute;nticos art&iacute;culos sobre el tema y nada de cursos sobre aprendizajes de lenguajes pues, muchos de los cursillos de este tipo (salvo el CPV de JASM y BMP), pecan siempre de este defecto y se "escudan" en cursos que no deber&iacute;an. Por eso, me encantar&iacute;a crear una nueva secci&oacute;n dedicada a la programaci&oacute;n de juegos en la que todos pudi&eacute;ramos aprender a crear un entorno isom&eacute;trico, aprender las rutinas de colisi&oacute;n m&aacute;s importantes, los trucos de paleta m&aacute;s sorprendentes, la utilizaci&oacute;n de sprites m&aacute;s &oacute;ptima, la creaci&oacute;n de enemigos m&aacute;s inteligente, etc. Pero siempre con aplicaciones concretas en el mundo de la programaci&oacute;n de juegos. En f&iacute;n, la propuesta est&aacute; lanzada, ahora la responsabilidad recae sobre vosotros...</P>
<P ALIGN="JUSTIFY">En fin, a los redactores y colaboradores deciros que gracias por haber construido un equipo en el que TODOS somos IGUALES y, a los que est&aacute;is leyendo esto, gracias por leer ya que el tiempo que hemos invertido nosotros haciendo los art&iacute;culos se compensa con el que vosotros invert&iacute;s ley&eacute;ndolos. ¡Un abrazo y hasta cuando sea! </P>
</FONT><P ALIGN="RIGHT"><B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B>
<br><font color="#CC0000" size=1><b>21 de Febrero de 1998.</b></font>
</FONT><P><BR>



<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

