<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/act_4.gif"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 4</h3></center>
<br>
<p align="justify">
Quiz&aacute;s este nuevo n&uacute;mero de Macedonia sea el punto de inflexi&oacute;n del fanzine. Los motivos creo que est&aacute;n bien claros, hemos creado ya un equipo de redactores y colaboradores, m&aacute;s o menos estable, dispuestos a sacrificar algo de su tiempo libre para demostrar que a&uacute;n no est&aacute; todo dicho en internet, nos hemos hecho con los servicios de todo un se&ntilde;or grafista, hemos cambiado de un servidor que ofrec&iacute;a 3 megas a uno, Ciudad Futura, que nos da espacio ilimitado, hemos sido comentados en la revista "En l@ ReD" y, aunque parezca imposible, por tener tenemos hasta a una mujer en el equipo ;).</P>
<P ALIGN="JUSTIFY">Para seros sinceros, la perspectivas de Macedonia son optimistas. Hemos logrado lo m&aacute;s importante y m&aacute;s dif&iacute;cil: ser un aut&eacute;ntico equipo. No se si os lo imaginar&eacute;is, pero es muy curioso vivir este "clima" de mini trabajo que nos hemos fabricado. Uno disfruta mucho cuando lee las opiniones de otra persona del equipo, los consejos, las ideas... se nota que hay ilusi&oacute;n. Y si a todo esto a&ntilde;adimos los valiosos mails que nos llegan de vez en cuando pues, ¿qu&eacute; quer&eacute;is que os diga?, creo que va haber Macedonia para rato...</P>
<P ALIGN="JUSTIFY">Una de las cosas m&aacute;s curiosas y que m&aacute;s te dan que pensar es el hecho de no haber recibido, despu&eacute;s de haber publicado en n&uacute;mero 3, una negaci&oacute;n por parte de gente que realmente tiene cierto renombre y puede "donar" poco de su tiempo. Es gratificante, muy gratificante ver c&oacute;mo las personas con las que, hasta hac&iacute;a poco tiempo ni siquiera esperabas tener la oportunidad de enviar un mail para mostrarles tu admiraci&oacute;n, "gui&ntilde;an" el ojo a Macedonia y se ofrecen en un periquete a tus peticiones. Parece c&oacute;mo si "nos cuidaran" y eso es algo que agradecemos infinitamente ya que, probablemente, gracias a esos "mimos" el equipo de Macedonia tiene la seguridad que tiene en estos momentos.</P>
<P ALIGN="JUSTIFY">Y ¿qu&eacute; hay de nuevo?, pues un mont&oacute;n de cosas, tantas que, el sumario se convierte en un aut&eacute;ntico "recuento". Sin embargo, voy a citar en especial una secci&oacute;n nueva de Macedonia que pretende informar del proyecto m&aacute;s ambicioso con el que el equipo se enfrente. Si Dios quiere, dentro de no tantos n&uacute;meros, Macedonia cumplir&aacute; su primer aniversario. Para celebrarlo, hemos decidido crear una versi&oacute;n Off-Line del fanzine, esto es, que se pueda leer y consultar sin necesidad de estar conectado a Internet. Por el momento, poco m&aacute;s os puedo decir ya que pretendemos que sea una sorpresa. Contad, con que tendr&aacute; apartados in&eacute;ditos y ¿qui&eacute;n sabe?, hasta nuevo dise&ntilde;o... </P>
<P ALIGN="JUSTIFY">En fin, que os dejo ya con nuestro trabajo y, como cit&eacute; en el n&uacute;mero anterior, gracias por leernos y, sobre todo, enviarnos mails de apoyo ya que son nuestra principal "gasolina".</P>
<P ALIGN="JUSTIFY">Un fuerte abrazo en nombre de toda la Macedonia.</P>
</FONT><P ALIGN="RIGHT"><B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B>
<br><font color="#CC0000" size=1><b>9 de Abril de 1998.</b></font>

<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<br>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

