<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/act5.gif"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 5</h3></center>
<br>
<p align="justify">
</FONT><P><BR>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Muy probablemente el n&uacute;mero 5 de Macedonia, el que est&aacute;s leyendo en estos momentos, haya sido el m&aacute;s dif&iacute;cil de preparar de todos. Los motivos quiz&aacute;s puedan deberse a la responsabilidad que nosotros, como equipo que somos, nos hemos ganado ya. Macedonia ya no es una p&aacute;gina m&aacute;s, Macedonia se est&aacute; convirtiendo, con el paso del tiempo, en un fanzine en el que la gente se espera calidad creciente en cada nuevo n&uacute;mero, en el que cada vez tenemos que ir menos "a llamar a la puerta" de las p&aacute;ginas de internet, en el que, en definitiva, la gente se fija m&aacute;s y nos toma en serio. L&oacute;gicamente, es ahora y m&aacute;s que nunca, cuando Macedonia tiene que funcionar como un equipo y... ¡no os pod&eacute;is imaginar lo bien que lo hacemos :-D !.</P>
<P ALIGN="JUSTIFY">Otra de las dificultades que hemos encontrado en la realizaci&oacute;n de este n&uacute;mero ha sido la de "luchar" contra las malas fechas en las que nos encontramos, es decir, el final de curso est&aacute; ya delante de nuestras narices y mucho de nosotros, entre los que me incluyo, hemos tenido que realizar aut&eacute;nticos planes estrat&eacute;gicos para poder saber actuar en todos y cada uno de los frentes convertido en horarios un tanto... extra&ntilde;os. Sin embargo, pronto te das cuenta de que, dentro de Macedonia, siempre hay alguien que te "cubre", con lo que los posibles huecos dejados por miembros, a los que les ha sido imposible tener el n&uacute;mero de trabajos esperados, pasa casi inadvertido cuando alguien entra en nuestro sumario y se tiene que enfrentar, no sin antes tomar aire, con toda la avalancha de contenidos que somos capaces de arrojar en cada nueva edici&oacute;n. Es ese concepto de "cubrir" el que realmente hace que de Macedonia un equipo.</P>
<P ALIGN="JUSTIFY">Otra de las cosas que realmente llama la atenci&oacute;n es el ritmo con el que crece la secci&oacute;n de cr&eacute;ditos... si te pasas por ella ver&aacute;s que somos 20 personas, sin contar las que colaboran de forma "fugaz", las que tenemos puntualmente informaci&oacute;n en cada nuevo n&uacute;mero. Jeje, lo siento, pero es que si le comentas a alguien que en apenas 5 n&uacute;meros, un fanzine pasa de tener 2 miembros a 20 y que, adem&aacute;s hay otras 9 personas que han escrito algo en alguna ocasi&oacute;n para el fanzine y que personalidades del mundillo inform&aacute;tico no s&oacute;lo se han prestado a ser entrevistados sino que tambi&eacute;n han escrito algo pues... es imposible ocultar esa sonrisilla de satisfacci&oacute;n que tenemos aqu&iacute; de oreja a oreja. O lo dec&iacute;amos o explot&aacute;bamos ;).</P>
<P ALIGN="JUSTIFY">Tan s&oacute;lo esperar que esto siga igual y que la "movida" Macedonia no decaiga nunca. Que sea capaz de durar siempre, con nuevos directores, nuevo equipo... ofreciendo, en cada nuevo n&uacute;mero, ese encanto especial que creo que somos capaces de transmitir no s&oacute;lo la primera vez que alguien nos visita, sino la segunda, la tercera.... Estad atentos porque algo fuerte se mueve en el interior de Macedonia y ya sab&eacute;is, somos muy dados a meter muy poco ruido hasta que no tenemos todo listo, ahora bien, cuidado porque puede que, no tardando, demos la sorpresa y un merecido regalo a todos los que, adem&aacute;s de leernos, nos escrib&iacute;s dando &aacute;nimos. ¿Me estar&eacute; refiriendo a caso al tema de Macedonia  Off-Line?. Tal vez... ;)</P>
<P ALIGN="JUSTIFY">¡Feliz lectura, suerte con los ex&aacute;menes los que teng&aacute;is y nos vemos en el n&uacute;mero 6 ;) !</P>
</FONT><FONT FACE="Arial" SIZE=1><P align="right"><BR>
</FONT><B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1><b>3 de Junio de 1998.</b></font>



<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<br>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

