<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/act6.gif"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 6</h3></center>
<br>

</FONT><P><BR>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Seguro que, al observar la portada n&uacute;mero 6 del fanzine, os habr&eacute;is extra&ntilde;ado, es m&aacute;s, no creo que hay&aacute;is entendido absolutamente nada... La verdad es que el d&iacute;a que uno de los dos grafistas de Macedonia, Santiago Reinoso, me propuso la idea, me pareci&oacute; tan acertada y oportuna que quedamos en llevarla a cabo. </P>
<P ALIGN="JUSTIFY">Durante estos dos meses, de elaboraci&oacute;n de Macedonia, han ocurrido tantas y tantas cosas que, esta portada, es una fiel muestra de que, pese a todos los cambios internos ocurridos en Macedonia (que de hecho los hay y son muy importantes), los que integramos esta particular familia seguimos con los pies en la tierra y por nada del mundo vamos a cambiar nuestra situaci&oacute;n y ritmo de trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Durante estos dos meses hemos tenido que debatir diferentes aspectos de lo que iba a ser nuestro futuro. Un futuro que ahora mismo se torna presente pero que, hasta no hace tanto tiempo, era un presente incierto. Hemos aprendido muchas cosas y tambi&eacute;n nos hemos dado cuenta de otra tantas. Hemos tenido que bajar de la nube en la que est&aacute;bamos alojados para pensar qu&eacute; es lo que queremos que sea Macedonia y creedme que, cuando se mezclan los sue&ntilde;os o ambiciones con las realidades tan s&oacute;lo la unanimidad puede salvar tan compleja situaci&oacute;n. Nosotros hemos tenido suerte al gozar de tal unanimidad.  Pese a saber y, tener bien presente, el potencial que es Macedonia, preferimos seguir como hasta ahora. Como esa &quot;ni&ntilde;a bonita de Internet&quot; que, casi sin quererlo, se va adue&ntilde;ando de m&aacute;s y m&aacute;s fieles seguidores, que no hace ruido, no porque no sepa sino porque no quiere. Preferimos, en definitiva, seguir como hasta ahora,  creciendo de forma natural, sin acelerones, sin utop&iacute;as, todos a la vez ya que, s&oacute;lo as&iacute;, se construyen los pilares de algo que, ¿qui&eacute;n sabe?, ojal&aacute; llegue a ser capaz de prolongarse con nuevas personas, nuevos equipos, etc. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sin embargo, el saber estar que nos hemos demostrado los unos a los otros en estos dos meses no quita que debamos de saber, tambi&eacute;n, estructurarnos con el paso del tiempo. Est&aacute; claro que si Macedonia crece y se hace &quot;mayor&quot;, se tiene que hacer mayor en todos los aspectos. De poco vale un director sin nada que coordinar o un redactor sin nada en d&oacute;nde escribir. En este n&uacute;mero de Macedonia, si te pasas por los cr&eacute;ditos, ver&aacute;s una perfecta pir&aacute;mide de responsabilidades (que no de superioridades) destinada a encarrilar la buena marcha de la revista. Ahora es cuando empieza de verdad el &quot;duro camino&quot; de la estabilizaci&oacute;n. Como me dec&iacute;a, uno de los coordinadores del fanzine, Antonio Montesinos: &quot;<I>Macedonia va pasando la edad del pavo y est&aacute; empezando a convertirse en una "bollicao" adolescente bastante suculenta. Lo mejor vendr&aacute; cuando se llegue a la juventud madurita, donde la experiencia es lo que cuenta</I>&quot;. La verdad es que tiene toda la raz&oacute;n y los primeros visos de tal madurez se pueden ver en los citados cr&eacute;ditos. Ya no existe un director, unos redactores y unos cuantos colaboradores. Ahora est&aacute; todo mucho m&aacute;s coordinado en diferentes secciones, existe un subdirector, unos dise&ntilde;adores y grafistas, un administrador de nuestra propia lista de trabajo un responsable m&aacute;ximo del proyecto Macedonia Off-Line, responsables por cada una de las numerosas secciones con que cuenta la revista y, c&oacute;mo no, los redactores que contribuyen con sus excelentes art&iacute;culos a engordar a&uacute;n m&aacute;s Macedonia. Esto ya &quot;huele&quot; a otra cosa mucho m&aacute;s seria. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y no s&oacute;lo la opci&oacute;n de suscripci&oacute;n (que ten&eacute;is en la cabecera de esta misma editorial) denota ese importante cambio en la forma de trabajo sino el hecho de poseer ya las primeras muestras de nuestro visor para llevar a buen puerto el proyecto de Macedonia Off-Line. Macedonia sigue rodando y nuestra primera meta est&aacute; puesta en Octubre. Ser&aacute; nuestra primera gran carrera, una carrera que dura ya casi un a&ntilde;o y que ha resultado ser un excelente aprendizaje en todos los sentidos. Despu&eacute;s de nuestro primer aniversario volveremos a comenzar otra carrera y espero que nos sig&aacute;is como hasta ahora. Pero recordad, en Macedonia hay un &uacute;nico pelot&oacute;n, no existen los acelerones, todos vamos a la vez. Nos quedamos con el trabajo hecho antes que con el trabajo y recompensas imaginarias y sino que se lo digan a nuestra mascota que sue&ntilde;a con una buena macedonia antes que con cualquier otra cosa...</P>
</font>
<FONT FACE="Arial" SIZE=1><P align="right"><BR>
</FONT><B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1><b>1 de Agosto de 1998.</b></font>



<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<br>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

