<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<HR>
<BR>
<BR>

<BODY>
<P ALIGN=justify>
<center><img src="g_misc/act_7.jpg"></center>
<FONT color="#000000" size=2 face="arial">
<center><h3>Editorial de <br>Macedonia 7</h3></center>
<br>

</FONT><P><BR>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Jam&aacute;s pens&eacute; que escribir la editorial de este n&uacute;mero iba a ser tan complicado. Hay tanto sobre lo que hablar que se hace muy dif&iacute;cil escoger un tema en concreto para sintetizar todo este tiempo que se remonta, no s&oacute;lo al n&uacute;mero sexto, sino al n&uacute;mero uno.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Revisando las anteriores editoriales, al leer los objetivos que este equipo se hab&iacute;a marcado para tan especial n&uacute;mero, uno se da cuenta de que no hemos podido cumplir todos los que ten&iacute;amos en mente, sin embargo, aqu&iacute; estamos, m&aacute;s equipo que nunca. </P>
<P ALIGN="JUSTIFY">Y es que la edici&oacute;n que tienes delante de ti no s&oacute;lo es el fruto del trabajo de algo m&aacute;s de un a&ntilde;o. Es mucho m&aacute;s. Es el fruto de afrontar variados y complejos problemas que se han ido sucedi&eacute;ndo desde que nos tom&aacute;ramos esto en serio. El hecho de que cada uno de los miembros de la publicaci&oacute;n est&eacute; trabajando en alg&uacute;n punto de la geograf&iacute;a de la pen&iacute;nsula o de Sudam&eacute;rica hace que la comunicaci&oacute;n v&iacute;a Internet se convierta en el engranaje b&aacute;sico a la hora de hacer funcionar el motor del fanzine. Desde el mes de octubre hasta ahora, hemos tenido que escoger caminos alternativos para seguir trabajando, es decir, los retrasos no han sido &quot;gratuitos&quot;. Y ahora, despu&eacute;s de que el equipo ha tenido que cambiar &quot;el ritmo&quot; creo que, a nivel general, ha merecido la pena. Finalmente hemos sido capaces de lanzar el n&uacute;mero que ten&iacute;amos entre manos, de seguir funcionando pese a todo, de confiar siempre en que este bache lo &iacute;bamos a superar de, en definitiva, cumplir nuestro primer a&ntilde;o. El precio ha sido el de no poder tener listo el Off-Line o consumada la uni&oacute;n con Spanish Quest pero, repito, si no ha podido ser para este n&uacute;mero lo ser&aacute; para el siguiente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El n&uacute;mero 7 significa la consolidaci&oacute;n absoluta del fanzine. Al cumplir un a&ntilde;o Hemos dejado atr&aacute;s una &eacute;poca, hemos renovado las "formas" por completo, pronto tendremos un segundo &quot;pulm&oacute;n&quot; de nombre Spanish Quest y en el siguiente n&uacute;mero se har&aacute; realidad el proyecto Off-Line con el que llegaremos a toda esa legi&oacute;n de personas que a&uacute;n no nos conocen.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo el tiempo que llevo trabajando, codo con codo con el resto del equipo, para que Macedonia haya alcanzado un cierto prestigio entre los fanzines de habla hispana se lo dedico a todos mis compa&ntilde;eros, a los redactores, a los coordinadores, al administrador, a los grafistas, al WebMaster, al creador del Off-Line y al subdirector que ha jugado un papel fundamental para que el n&uacute;mero s&eacute;ptimo de Macedonia no se retrasase m&aacute;s de la cuenta. </P>
<P ALIGN="JUSTIFY">Nos vemos en el octavo. ¡Ah! Felices fiestas <:-).</P>
<FONT FACE="Arial" SIZE=1><P align="right"><BR>
</FONT><B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1><b>24 de Diciembre de 1998.</b></font>



<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>
<br>
<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

