<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>



<HR>

<BR>

<BR>



<BODY>

<P ALIGN=justify>

<center><img src="g_misc/act_8.jpg"></center>

<FONT color="#000000" size=2 face="arial">

<center><h3>Editorial de <br>Macedonia 8</h3></center>

<br>



</FONT><P><BR>
<FONT color="#000000" size=2 face="arial">
<P ALIGN="JUSTIFY">Si me preguntan cu&aacute;l es el n&uacute;mero m&aacute;s especial de todos los que hemos hecho, no sabr&iacute;a muy bien qu&eacute; contestar ya que todos guardan alg&uacute;n tipo de dificultad, an&eacute;cdota o situaci&oacute;n que les confiere un car&aacute;cter o personalidad individual. Sin embargo, este número que tienes delante de ti, re&uacute;ne la mayor cantidad de problemas, dificultades, carreras en la maquetaci&oacute;n y, curiosamente, satisfacciones.</P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Las dificultades y situaciones menos agradables, han venido por el hecho de tener que tomar decisiones que han afectado a la estructura interna y en las que hemos tenido que demostrarnos a nosotros mismos que la revista como grupo, como "entidad", es lo que verdaderamente nos une y, por eso, hemos de ponerla en el primer lugar a la hora de tomar decisiones. Os confieso, que esa ha sido la lecci&oacute;n m&aacute;s importante que he aprendido en la creaci&oacute;n de este número. El trabajar en equipo es algo maravilloso al comienzo porque todos tenemos grandes ilusiones y nos comprometemos con el trabajo duro sin dudar si quiera un instante. Sin embargo, cuando llega la hora de la verdad y hay que dar la talla en tus cargos respectivos, es cuando de verdad se mide la calidad y el buen funcionamiento del equipo en global. De poco vale tener un 80% del equipo funcionando "a toda m&aacute;quina" si un 20% va despacio, a disgusto, o sin motivaci&oacute;n alguna. Por muy grande y poderosa que sea la fuerza que imprima ese 80%, siempre sucumbir&aacute; a menos que se tomen las medidas m&aacute;s "severas".</P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Y &eacute;stas dificultades, no s&oacute;lo han ocurrido <I>durante </I>la elaboraci&oacute;n de este número, sino al final del mismo. Muchas veces me he preguntado si toda esta seriedad y "rigidez" que el equipo de direcci&oacute;n y coordinaci&oacute;n nos imprimimos ser&aacute; bueno. Es decir, Macedonia no tiene ning&uacute;n tipo de pretensi&oacute;n comercial, es algo verdaderamente altruista (¿veis alg&uacute;n anuncio por aqu&iacute;?) y sin embargo, llevamos un ritmo realmente endiablado. ¿Merece la pena?. ¿No ser&iacute;a m&aacute;s f&aacute;cil ir m&aacute;s relajados, hacer menos cosas, tirar la toalla cuando aparecen dificultades o refugiarse en el pensar para s&iacute; mismo <I>"¡bah!, qu&eacute; m&aacute;s da, si total no lo van a notar</I> <I>y, adem&aacute;s, tampoco generamos miles de visitas</I>"?. Personalmente aborrezco ese tipo de actitud a la hora de hacer las cosas. Creo que una de las metas que nos hemos impuesto siempre en este equipo, ha sido la de hacer todo lo mejor que hemos podido. Y, aunque este número y los venideros seguir&aacute;n teniendo multitud de imperfecciones, estad por seguros que habremos hecho todo lo posible por evitarlas porque habremos dado lo mejor de nosotros mismos.

<br><br>

De todas formas, todos los problemas surgidos han tenido un final feliz. Quizás, gracias a todos estos "malos rollos" pasajeros, nos hayamos conocido mejor.







</P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Pero este número tambi&eacute;n es un n&uacute;mero de grandes, grand&iacute;simas, satisfacciones para todos los que, <I>de verdad</I>, nos identificamos con &eacute;sta publicaci&oacute;n. Ya tenemos listo el Off Line. Eso significa mucho chicos. Detr&aacute;s del Off Line est&aacute;n condensadas ingentes cantidades de tiempo de programaci&oacute;n, dise&ntilde;o, maquetaci&oacute;n, arreglos y coordinaci&oacute;n. El Off Line es, simplemente, lo m&aacute;s importante que se ha hecho en Macedonia. La editorial del visor contiene un buen mont&oacute;n de ideas entorno a lo que es y ha sido, el desarrollo del mismo por eso, me remito a dicha editorial. ¡Os estamos esperando all&iacute; a todos! </P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Otra de las grandes novedades, es la incorporaci&oacute;n de Spanish Quest a Macedonia. Es una gozada ver la curiosa mezcla de personalidad que hay ahora mismo en la revista. Os invito a todos, desde ya, a que os deis un paseo por SQ. Realmente os pod&eacute;is perder navegando por todo lo que este fanzine hermano de Macedonia tiene que ofrecer.</P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Para terminar, decir que este número se ha realizado bajo una presi&oacute;n muy grande desde el punto de vista de las fechas (plagadas de ex&aacute;menes y / o trabajo) como de compromisos (tener el Off Line listo, aparici&oacute;n de SQ, de otras secciones nuevas y muy importantes como Teclados Fuera o Programaci&oacute;n de Juegos, etc). Hay errores y cosas que se pueden mejorar. Y como se pueden mejorar, iremos actualizando este número durante todo el mes de marzo hasta que nos quede en condiciones. Para saber qu&eacute; hemos actualizado, probablemente se habilite un enlace informativo.</P>


<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY">Y ahora s&iacute;. Que disfrut&eacute;is del MACEDONIA 8 y, sobre todo, que disfrut&eacute;is con &eacute;se primer Off Line que tantos disgustos como alegr&iacute;as nos ha dado. Y como "dir&iacute;a" uno de los nuevos Macedonios incorporados, Alejandro Santacreu, &lt;&lt;&lt; Un Abrazo&gt;&gt;&gt;. Quedamos aqu&iacute; para el 9, ¿vale?.</P>


</FONT>
<P ALIGN="RIGHT">
<B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1 FACE=ARIAL><b>27 de Febrero de 1999.</b></font>
</P>






<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>

<br>

<hr><br>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>



</HTML>



