<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>G</B></font><FONT color="#000000" size=7 face="arial"><B>alería de Editoriales</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>



<HR>

<BR>

<BR>



<BODY>

<P ALIGN=justify>

<center><img src="g_misc/act_9.jpg"></center>

<FONT color="#000000" size=2 face="arial">

<center><h3>Editorial de <br>Macedonia 9</h3></center>

<br>



</FONT><P><BR>
<FONT color="#000000" size=2 face="arial">
<P ALIGN="JUSTIFY">Pese a que a lo largo de todas las ediciones de Macedonia siempre hemos hecho referencia a importantes objetivos conseguidos, no ha sido hasta este n&uacute;mero cuando hemos logrado construir un equipo estable. En esta edici&oacute;n no ha hecho falta tener que estar pendiente de los miembros internos de la revista. Ni ha hecho falta, ni hubiera sido bueno el tener que andar detr&aacute;s de todos y cada uno de las personas "desperdigadas" de Macedonia. Puede que al echar un vistazo a las estad&iacute;sticas que publicamos en la secci&oacute;n de "Noticias Internas" y ver el descenso de m&aacute;s de un 10% del n&uacute;mero de art&iacute;culos respecto a la edici&oacute;n anterior, pueda parecer un paso atr&aacute;s, sin embargo, los art&iacute;culos del Macedonia 9 son art&iacute;culos "reales", es decir, una constante m&iacute;nima de lo que podemos ofrecer. Al fin cada una de las personas que se encarga de alguna tarea determinada en el equipo, no s&oacute;lo cumple a la perfecci&oacute;n su puesto, sino que elabora y ejecuta sus propias iniciativas. Y eso es lo mejor que nos pod&iacute;a pasar. La revista va cambiando poco a poco su personalidad. Se hace m&aacute;s variada y conforme a los gustos de la gente que integra el equipo, y la direcci&oacute;n se vuelve algo muy f&aacute;cil, una tarea casi inexistente. Ha costado m&aacute;s de un a&ntilde;o pero se ha logrado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y lo que m&aacute;s me ha chocado durante la elaboraci&oacute;n de este n&uacute;mero ha sido la realizaci&oacute;n de las ya mencionadas estad&iacute;sticas. El elaborarlas me ha obligado a regresar a los primeros n&uacute;meros de Macedonia, contemplar su dise&ntilde;o, su "esp&iacute;ritu", su personalidad... Ha sido realmente incre&iacute;ble la cantidad de defectos que he podido observar. La cantidad de cosas que antes no hab&iacute;a visto y que ahora, despu&eacute;s de todo este tiempo, saltan de forma alarmante a la vista. Pero lo que m&aacute;s me llama la atenci&oacute;n de todo es la gente que, desde aquel mes de Octubre de 1997, decidi&oacute; pasar a formar parte de Macedonia; un proyecto incierto y con ninguna garant&iacute;a de &eacute;xito. Hubiera sido imposible, inimaginable, llegar a donde hemos llegado sin una colaboraci&oacute;n como la que aqu&iacute; se ha dado. Creo que esta revista puede ser un buen ejemplo para demostrar que a&uacute;n es posible levantar grandes proyectos desde la nada pero con una fuerte colaboraci&oacute;n o compromiso entre las personas. ¿Qu&eacute; tiene Macedonia?, ¿voluntad, metas, seguridad, ilusión...?. No lo s&eacute;. Creo que mucho de todo en cada uno de los que formamos el equipo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y este n&uacute;mero sale justo en el mes que todas las revistas m&aacute;s importantes del sector espa&ntilde;ol y, en breve, del argentino y mexicano, comienzan a publicar el visor Off - Line. Simplemente, dar las gracias a la publicaciones que han decidido editar el Off Line. Llena de satisfacci&oacute;n ver a Macedonia en los Cd's de portada de las mismas. Ahora me vienen a la cabeza todos los inmensos problemas que pasamos justo despu&eacute;s del verano, la p&eacute;rdida de comunicaci&oacute;n entre los miembros, la elaboraci&oacute;n del Off Line, el cambio de dise&ntilde;o de la revista, la mala suerte que nos acompa&ntilde;o hasta que publicamos el n&uacute;mero 7. ¡Qu&eacute; pronto se olvidan los problemas!. Hubiera sido algo imperdonable tirar la toalla en esos momentos. Y tambi&eacute;n lo ser&iacute;a en el futuro que, a buen seguro, tambi&eacute;n tendr&aacute; sus dificultades. Al final, todos los problemas acaban super&aacute;ndose si hay compromiso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta edici&oacute;n tambi&eacute;n cuenta con nuevas e importantes incorporaciones. Para empezar, Manuel Lao, buen amigo de Oscar Garc&iacute;a, pasa a formar parte del equipo llevando la tarea de Webmaster. Su trabajo, se ver&aacute; justo despu&eacute;s del verano, m&aacute;s concretamente, en el mes de Septiembre, junto a la salida del n&uacute;mero 11 de la revista. Ya se est&aacute; trabajando en la creaci&oacute;n de un sistema de archivos coherente y de un dise&ntilde;o nuevo (si ten&eacute;is alguna idea interesante, coment&aacute;rnosla sin dudar) mucho m&aacute;s profesional que el actual y flexible. Por otro lado, y gracias a la insistencia de David Isla, uno de las personas m&aacute;s laureadas de la escena espa&ntilde;ola, Victor Vergara "Awesome", entra en el equipo Macedonia para realizar art&iacute;culos relacionados con el mundo de la composici&oacute;n musical. Eso sin contar la incorporaci&oacute;n de Ricardo Amil, un nuevo redactor que en este n&uacute;mero ya abre fuego con el primer cap&iacute;tulo de un curso sobre el lenguaje ensamblador. Bienvenidos a los tres.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, creo que ya est&aacute; todo dicho. El n&uacute;mero 9 es un n&uacute;mero de estabilizaci&oacute;n. Algo parecido a lo que ocurri&oacute; cuando se edit&oacute; el 6. Con el 9 se ha afianzado la segunda &eacute;poca de la revista y todos los proyectos que con ella comenzaron. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nos despedimos entonces hasta el n&uacute;mero 10, un n&uacute;mero que, desde lo personal, ser&aacute; muy importante. Hasta luego.</P></FONT></BODY>


</FONT>
<P ALIGN="RIGHT">
<B><FONT FACE="Arial" SIZE=1>F</B></FONT><B><FONT FACE="Arial" SIZE=1>ernando Rodr&iacute;guez</B> 
<br><font color="#CC0000" size=1 FACE=ARIAL><b>1 de Mayo de 1999.</b></font>
</P>






<center><table><td><a href="galeria.htm"><font face="arial" size=2>Volver a la galería</a></td></table></center>

<br>

<hr><br>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">Galería de Editoriales</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>



</HTML>



