<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:oscarg@salleurl.edu">Oscar García "Kokopus".</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">
"EL OCHO". De Katherine Neville
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>

Ni tan solo dud&eacute;is en leer este libro.....hacia ya tiempo que no aparec&iacute;a algo tan ins&oacute;lito y original como esto en el mercado literario. Y es que todos nos sabemos las historias de siempre, estamos un poco hartos de tanto esp&iacute;a y conspiraci&oacute;n, y de los dinosaurios ya no hablemos.....si todo el mundo ya se sabe hasta sus nombres cient&iacute;ficos en lat&iacute;n !!!!</P>
<I><P ALIGN="JUSTIFY">El Ocho</I> supone un notable cambio en cuanto a argumento se refiere as&iacute; como estilo narrativo. Es un libro de acci&oacute;n, suspense y, ¿por que no?, un poquillo de pimientilla apasionada. Pero no aburre ni recurre a las ya archi-conocidas argucias que muchos libros reutilizan continuamente. Es tremendamente original y para nada pesado o demasiado descriptivo. Todo lo contrario, ameno, divertido e impredecible....y eso es lo mejor....nadie se imagina que es lo que va a encontrarse en la pagina siguiente.....y esto si que vale su peso en oro en estos tiempos que corren de escasa o nula originalidad en todo cuanto se acontece.</P>
<P ALIGN="JUSTIFY">Dos &eacute;pocas totalmente diferentes separadas un par de siglos se narran de forma entrelazada. Est&aacute;n &iacute;ntimamente relacionadas como uno va comprendiendo seg&uacute;n avanza en la lectura del libro.....pero hasta el final no queda todo claro........8).</P>
<P ALIGN="JUSTIFY">Bueno bueno.....¿que de que va el libro?, pues bien se trata de la incansable b&uacute;squeda del ajedrez de Montglane por todo lo largo y ancho del mundo. ¿Y que es eso del ajedrez de no se que?, es que suspend&iacute; Historia ,¿sabes?. No no...tampoco es algo de dominio publico. De hecho la primera vez que o&iacute; hablar sobre el susodicho tablero fue en este libro y no creo que tenga porque ser real, aunque la excelente trama y representaci&oacute;n de todo lo que nos rodea lo sugiere.</P>
<P ALIGN="JUSTIFY">Siglo XVIII. Una abad&iacute;a...y un ajedrez, en Montglane, Francia. Situaci&oacute;n pol&iacute;tica peligrosa, la custodia del tablero peligra. <I>Soluci&oacute;n</I>: dispersar todas las piezas del fabuloso juego por toda la Tierra. <I>Raz&oacute;n</I>:&nbsp;seria peligroso que alguien las encontrara dado su poder absoluto... Unas novicias pertenecientes a la abad&iacute;a se encargaran de velar por las piezas del juego, de esconderlas e incluso de dar su vida y su fe por ellas...y es que el destino del mundo podr&iacute;a estar en sus manos...</P>
<P ALIGN="JUSTIFY">Paralelamente nos situamos en los a&ntilde;os setenta, la Inform&aacute;tica nace a pasos agigantados y nuestra protagonista recibe una curiosa oferta...un viaje a otro continente y una misi&oacute;n no demasiado detallada. No pasara mucho tiempo hasta que todos los acontecimientos se precipiten por si solos cogi&eacute;ndonos a todos por sorpresa !!</P>
<P ALIGN="JUSTIFY">Como reyes y reinas cientos de a&ntilde;os antes, ella intentara reunir todas las piezas para desvelar el misterio que ocultan.....y eso si que no se conoce hasta el final!!!!.....<I>.pista: ¿no se parece un ocho girado al s&iacute;mbolo del infinito?</I>.....que malo que soy.....venga venga a leer y a estrujaros la cabeza.....tampoco os pong&aacute;is enfermos pensando ya que mi pistilla no es demasiado concluyente...y es que no os quiero desvelar nada...¿o si?...jajajajajaja....;-).</P>
<P ALIGN="JUSTIFY">Visitareis un mont&oacute;n de pa&iacute;ses distintos: Francia, Inglaterra, Rusia, Africa, Am&eacute;rica...¿acaso falta alguno? y lo har&eacute;is de mano de nuestra protagonista actual y de la pareja de novicias. Conocer&eacute;is a un mont&oacute;n de personajes hist&oacute;ricos famosos, todos implicados en la b&uacute;squeda del ajedrez y es que como ver&eacute;is, por su custodia ser&aacute;n capaces de arriesgarlo todo... Pasiones, luchas, guerras, celos, muertes, besos, carreras contra reloj y piezas de ajedrez por doquier, ¿que mas se puede pedir?. Desde luego no me negareis que la cuesti&oacute;n se plantea original y diferente.</P>
<P ALIGN="JUSTIFY">Esta &eacute;pica y apasionada historia est&aacute; salpicada de hechos reales, pol&iacute;ticos y sociales, que configuran un ambiente de lectura sin igual. Vaya si es que incluso se puede aprender algo y todo !!!...de todas formas no vay&aacute;is a pensar que se trata de un pesado volumen de Historia Contempor&aacute;nea, nada mas lejos de la realidad. Se trata de "adornar" la trama con sucesos de la &eacute;poca, algunos mas y algunos menos reales.</P>
<P ALIGN="JUSTIFY">Leer&eacute;is sobre runas, magia, hechizos y males de ojo....a los fan&aacute;ticos de los RPG's les encantara todo esto y sabr&aacute;n de lo que hablo. De todas maneras no se trata de un libro de Rol tipo D&amp;D o algo as&iacute;....es una novela hecha y derecha como cualquier otra.</P>
<P ALIGN="JUSTIFY">Le&iacute; este libro hace algo mas de tres meses. Como muchas veces ocurre me lo recomend&oacute; un amigo. Y de verdad que no me arrepent&iacute; nunca, es mas, me lo "com&iacute;" literalmente desde la primera noche hasta la ultima. Soy lector asiduo y puedo deciros que me harto enseguida de trivialidades o lecturas repetitivas. Este no es el caso y si realmente disfrut&aacute;is leyendo y busc&aacute;is una novela que os mantenga en tensi&oacute;n y satisfechos ya la hab&eacute;is encontrado.</P>
<P ALIGN="JUSTIFY">Para mas informaci&oacute;n consulta el libro en la web </FONT><A HREF="http://www.amazon.com/exec/obidos/ASIN/0345366239/n/002-3757604-2964043" target="_new"><FONT FACE="Arial" SIZE=2>aqu&iacute;</FONT></A><FONT FACE="Arial" SIZE=2>.</P></FONT>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


