<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:gustavo_herrera@yahoo.com">Gustavo Herrera</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
La Monumental Computadora ENIAC a más de 50 años...
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
Eran los a&ntilde;os de la Segunda Guerra Mundial. En los m&aacute;s altos mandos del ej&eacute;rcito de los Estados Unidos, una carpeta celosamente resguardada conten&iacute;a informaci&oacute;n clasificada como de alta seguridad: El Proyecto PX. Y de ser un mero planteamiento escrito, pronto, la Universidad de Pennsylvania alojar&iacute;a en su Escuela de Ingenier&iacute;a El&eacute;ctrica lo que se conoci&oacute; como la Computadora ENIAC. Este hecho es hist&oacute;ricamente muy importante y simb&oacute;lico, dado que constituye uno de los cimientos m&aacute;s s&oacute;lidos donde descansa la moderna industria de la computaci&oacute;n. 
<P ALIGN="JUSTIFY">
M&aacute;s que cualquier otra m&aacute;quina de la &eacute;poca, la ENIAC demostr&oacute; su alta velocidad de procesamiento utilizando la m&aacute;s alta tecnolog&iacute;a de punta: los tubos de vac&iacute;o o bulbos. Se le bautiz&oacute; como ENIAC por sus siglas en ingl&eacute;s: &quot;Electronic Numerical Integrator and Computer&quot;. <br>

<table align="right">
<td><img src="jpg/eniac1.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Mauchly y Eckert</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Podemos decir que la ENIAC fue obra de dos importantes eruditos de la &eacute;poca: John W.Mauchly y Presper Eckert, el primero creador de la configuraci&oacute;n original del aparato y el segundo con el talento y la ingenier&iacute;a necesarios para construir la ENIAC.</P>


<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La ENIAC la concibi&oacute; su dise&ntilde;ador para desarrollarse como una calculadora num&eacute;rica de fines generales, especialmente aplicarse en meteorolog&iacute;a y c&aacute;lculos estad&iacute;sticos. Sin embargo, en los planes de los militares estaban otros objetivos. Evaluaron la utilidad de la m&aacute;quina en aplicaciones de bal&iacute;stica y por ello el Departamento de Artiller&iacute;a de E.U. financi&oacute; el Proyecto PX, que dio nacimiento a la ENIAC. El presupuesto asignado para tal fin fue de $500,000 d&oacute;lares.</P>

<center><table>
<td><img src="jpg/eniac2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Perspectiva de la ENIAC</center></b></td>
</table></center>
<FONT color="#000000" size=2 face=arial>


<P ALIGN="JUSTIFY">La ENIAC estaba dividida en 30 unidades aut&oacute;nomas, 20 de las cuales fueron llamadas &quot;acumuladores&quot;. Cada acumulador era esencialmente una m&aacute;quina sumadora de 10 d&iacute;gitos de alta velocidad que ten&iacute;a la posibilidad de salvar los resultados de sus c&aacute;lculos.</P>



<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La ENIAC era controlada por un panel de control de pulsos. Cada unidad de la computadora era capaz de publicar un pulso de control que iniciar&iacute;a el c&oacute;mputo en una o m&aacute;s de las otras unidades. Esto era el equivalente de un programa de computadora, solo que se realizaba manualmente atando alambres con alambres las diversas unidades de la m&aacute;quina de modo que realizaran las funciones requeridas en la secuencia deseada. Este procedimiento se muestra en la siguiente fotograf&iacute;a.<br>
Llama la atenci&oacute;n que sean dos damas quienes se encargan del proceso. Tal vez por su mente minuciosa.</P>

<center><table>
<td><img src="jpg/eniac3.jpg" ></td>
</table></center>
<FONT color="#000000" size=2 face=arial>



<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un programa t&iacute;pico sobre el ENIAC consist&iacute;a en asignar jerarqu&iacute;as a los alambres que interconectaban las varias unidades de la m&aacute;quina. Se emplearon bandejas especiales de cableado para facilitar la tarea, pero a&uacute;n as&iacute; la programaci&oacute;n de la ENIAC era un asunto dif&iacute;cil.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la siguiente imagen se muestran las unidades de entrada y salida de la ENIAC, en 1946. La pantalla del osciloscopio muestra las se&ntilde;ales el&eacute;ctricas transmitidas a todas las unidades de la ENIAC. </P>
<P ALIGN="JUSTIFY"></P>

<center><table>
<td><img src="jpg/eniac4.jpg" ></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN="JUSTIFY">

<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">La ENIAC era el aparato electr&oacute;nico m&aacute;s grande del mundo jam&aacute;s construido por el hombre. Su construcci&oacute;n requiri&oacute; de 17,468 bulbos. Ten&iacute;a la capacidad de realizar 5,000 sumas o restas y 300 multiplicaciones por segundo. Aunque suene impresionante es demasiado lento para los est&aacute;ndares de hoy, ya que los microprocesadores actuales realizan 100 millones de sumas o restas por segundo, pero para su tiempo la ENIAC era de 100 a 1,000 veces m&aacute;s r&aacute;pida que las calculadoras mec&aacute;nicas existentes. Adem&aacute;s la velocidad de la ENIAC demostr&oacute; que el computo electr&oacute;nico se podr&iacute;a aplicar a algunos de los requerimientos fundamentales de quienes la financiaron: el desarrollo de la bomba de hidr&oacute;geno. Esta prioridad de seguridad nacional fue un factor determinante para el nacimiento y desarrollo de lo que conocemos hoy como la industria de c&oacute;mputo moderna.</P>
<br>
<P ALIGN="JUSTIFY">
La existencia de la ENIAC fue hecha p&uacute;blica el 14 de febrero de 1946, d&iacute;a de San Valent&iacute;n, fecha celebrada en muchas partes del mundo como el d&iacute;a del amor y la amistad. En la foto una unidad de acumulador, pieza tatarabuela de la tecnolog&iacute;a plug-in.</P>
<center><table>
<td><img src="jpg/eniac5.jpg" ></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN="JUSTIFY">

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Agradezco especialmente a Nancy M. Shawcross, curadora de manuscritos de la Universidad de Pennsylvania, las facilidades otorgadas para la inclusi&oacute;n en este art&iacute;culo de las fotograf&iacute;as que aparecen propiedad del John W. Mauchly website, as&iacute; como la informaci&oacute;n proporcionada. </P>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

