<HTML>
<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Entrevista a <br>César Astudillo, Javier Fáfula, Ignacio Pérez y Javier Pérez.
</FONT>
</H3>
<p align="right"><font face=arial size=2 color="#cc0000"><b>2/3</b></font>
<hr>
<FONT color="#000000" size=2 face="arial" >        
<P ALIGN=JUSTIFY>
<table align="left">
<td><img src="jpg/equipoa.jpg"></td>
<tr>
<td width="300"><center><font face=arial size=1 color="#cc0000">Aquí tenéis al equipo más numeroso de Pyro, el de COMMANDOS. A la derecha del todo podéis ver a 
Ignacio Pérez. El "gigantón musculoso" de la izquierda, es el jefe del equipo. Es el, siempre presente, Gonzalo Suárez (Oye, Gonzo, por email
no tienes pinta de tener esos brazos 8-) ).</font></center></td>
</table>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Qu&eacute; fue antes, &quot;COMMANDOS&quot; o PYRO?, es decir, ¿&quot;COMMANDOS&quot; era una idea que ven&iacute;a de atr&aacute;s o fue &quot;simplemente&quot; el proyecto que sobrevivi&oacute; de entre los que ten&iacute;ais inicialmente pensados?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P</B></FONT><FONT FACE="Arial" SIZE=2>- PYRO fue antes que COMMANDOS. Fue el t&iacute;tulo que sobrevivi&oacute; de 3 que ten&iacute;amos pensados. Desde la primera idea del juego creo que qued&oacute; claro para todos que era la alternativa con m&aacute;s fuerza.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- De hecho Commandos surge en Noviembre, cuando PYRO ya estaba trabajando en otro juego.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Me supongo que, a partir de la incorporaci&oacute;n de Gonzo, otros ilustres del desarrollo nacional comenzar&iacute;an a ser "invitados" al proyecto. C&eacute;sar, F&aacute;, ¿en qu&eacute; momento de la existencia de PYRO entr&aacute;is vosotros "a escena"?, ¿de qu&eacute; parte del proyecto os encargasteis?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo entr&eacute; si no recuerdo mal en septiembre del 97 en esta santa casa, yo no intervengo en el proyecto de Commandos, sino que estoy en la elaboraci&oacute;n de otro proyecto.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo hacía algo más de un añoo que había abandonado la informática financiera para dedicarme al 
tema de la multimedia e Internet. A finales del 97, entré a colaborar en algunos temas 
periféricos de COMMANDOS, como los briefings de misiones o los materiales promocionales. 
Y finalmente, se me confio la dirección de un proyecto nuevo.
</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Para llevar proyectos de la talla de "COMMANDOS" est&aacute; claro que hay que establecer equipos bien definidos y coordinados, trabajar seg&uacute;n unas fechas u objetivos y mantener constantemente informado al "publisher" sobre la buena marcha de la producci&oacute;n, entre otras cosas. ¿C&oacute;mo es un d&iacute;a completo, en vuestros campos de responsabilidad, dentro de PYRO Studios?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo soy el encargado del buen funcionamiento empresarial de PYRO, as&iacute; como de las relaciones con los publishers, y este &uacute;ltimo cap&iacute;tulo es realmente una historia compleja, porque existen diferentes interlocutores para los diferentes pa&iacute;ses, y cada uno de ellos tiene requisitos diferentes acorde a los gustos de sus consumidores. Hay d&iacute;as que no hago otra cosa que hablar con ellos.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- En una empresa tan joven como PYRO Studios y de un crecimiento tan r&aacute;pido, no se puede hablar de una divisi&oacute;n estricta del personal. En el pasado hemos hecho todos de todo y es ahora cuando estamos pudiendo poner una mayor estructuraci&oacute;n. En mi caso mi trabajo esta dividido entre la labor de dise&ntilde;o de los juegos junto con los responsables de cada uno de los equipos y la direcci&oacute;n del marketing de PYRO Studios.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Mi d&iacute;a t&iacute;pico incluye un par de reuniones con responsables t&eacute;cnicos y art&iacute;sticos del proyecto para avanzar en el dise&ntilde;o de producci&oacute;n, contin&uacute;a con muchas llamadas y E-mails para buscar m&aacute;s gente o gestionar los recursos materiales del proyecto, y suele terminar con una larga reuni&oacute;n con Ignacio, Javier y nuestro asistente de dise&ntilde;o, para avanzar en temas de dise&ntilde;o de juego.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J.F.</B></FONT><FONT FACE="Arial" SIZE=2>- Resumiendo: Muchas reuniones y comerse mucho el coco.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>PYRO es el grupo de desarrollo m&aacute;s profesionalizado que existe en Espa&ntilde;a porque los que est&aacute;is de pilares de la casa fuisteis algunos de los pioneros en nuestro pa&iacute;s. Lo duro, supongo, ser&iacute;a llegar a la criba perfecta de programadores, grafistas o creativos con todos los conocimientos espec&iacute;ficos y que adem&aacute;s, fueran apasionados de los videojuegos. En esta industria, de poco vale saber mucho si no se siente lo que se est&aacute; haciendo como una nueva forma de expresar arte. ¿Fue muy complicado encontrar el equipo humano que ten&eacute;is ahora mismo o tuvisteis que ofrecer un periodo de adaptaci&oacute;n y formaci&oacute;n a los miembros seleccionados?, en otras palabras, ¿Hab&eacute;is tenido que dar la noticia de &quot;lo sentimos, no tienes los conocimientos que necesitamos&quot; muchas veces?</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J.F</B></FONT><FONT FACE="Arial" SIZE=2>- En el caso de mi equipo comenz&oacute; con una base en la que todos los miembros al menos hab&iacute;an publicado alg&uacute;n t&iacute;tulo... una pasada. M&aacute;s tarde alg&uacute;n elemento pr&oacute;ximo al mundo de las demos, y despu&eacute;s, gente interesada y con buena madera. De todas maneras se ha requerido esa adaptaci&oacute;n en el caso de los primeros, y adem&aacute;s ese aprendizaje en el caso de los segundos y terceros. He propuesto digitalizar el comienzo de la serie de TV &quot;Fama&quot; a la hora de entrevistar a alguien para el equipo. Lo &uacute;ltimo que preguntas es duro hacerlo, pero a veces hay que decirlo.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Ja, ja... &quot;<I>Ten&eacute;is muchos sue&ntilde;os. Busc&aacute;is la fama. Pero la fama cuesta. Y aqu&iacute; es donde vais a empezar a pagar. Con sudor</I>&quot;. De hecho, todav&iacute;a estamos buscando personas que no conozcan el miedo. Gonzo y Fa ten&iacute;an una &quot;cartera de contactos&quot; m&aacute;s fresca y m&aacute;s amplia que la m&iacute;a, as&iacute; que yo he tenido que buscarme la vida a base de anuncios en Internet, carteles en las Facultades y, m&aacute;s recientemente, anuncios en prensa. Es tremendamente dif&iacute;cil encontrar gente adecuada. Lo que escasea no son tanto los conocimientos (que si uno es despierto, puede adquirir r&aacute;pidamente) como esa cosa tan dif&iacute;cil de definir que llamamos &quot;talento&quot;, unida a la madurez imprescindible para dirigir ese talento a un objetivo de grupo, trabajando estructuradamente y en compa&ntilde;&iacute;a de otros. Por extra&ntilde;o que parezca, tambi&eacute;n es dif&iacute;cil encontrar aut&eacute;ntica vocaci&oacute;n por hacer videojuegos... el tipo de vocaci&oacute;n que no se arruga ante una oferta econ&oacute;mica m&aacute;s atractiva en empresas de otro sector 8-). S&iacute;, hemos dicho que no a much&iacute;sima gente, y alguno hay que nos ha dicho que no a nosotros. En cualquier caso, nos interesa mucho que se sepa que el equipo de PYRO no est&aacute; cerrado. Siempre estamos buscando gente con alg&uacute;n perfil determinado.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<table align="right">
<td><img src="jpg/equipob.jpg"></td>
<tr>
<td width="300"><center><font face=arial size=1 color="#cc0000">Este es el equipo que lidera Javier Fáfula (centro) y que se encuentra inmerso en uno de los
dos proyectos secretos de Pyro.</font></center></td>
</table>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Cu&aacute;ntas personas, entre programadores, grafistas, dise&ntilde;adores y m&uacute;sicos, posee ahora mismo PYRO Studios?. ¿C&oacute;mo es la organizaci&oacute;n exacta de la compa&ntilde;&iacute;a?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Ahora mismo trabajan 60 personas en PYRO Studios, divididos en 3 equipos completamente independientes, m&aacute;s un peque&ntilde;o equipo de 4 personas que da servicio a todos los equipos.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Las cifras que Javier da corresponden a la dimensi&oacute;n actual de la compa&ntilde;&iacute;a. El objetivo es llegar a las 80 personas de aqu&iacute; al verano.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.-  <I>De todos es sabido que las fechas de lanzamiento para el mundo del videojuego son siempre anecd&oacute;ticas pues la construcci&oacute;n de software de entretenimiento se ve retrasada por numeros&iacute;simos factores. De todos modos, el equipo PYRO fue capaz de llevar un ritmo de trabajo asombroso y de concluir "COMMANDOS" casi en las fechas inicialmente previstas. ¿Cu&aacute;nto tiempo se tard&oacute; en desarrollar el producto por completo?. ¿Contasteis con material ya trabajado antes de empezar la etapa dura de codificaci&oacute;n o todas las "tools" y el "engine" del juego entran dentro del periodo global de trabajo?. </P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- El tiempo de desarrollo de COMMANDOS fue de 18 meses, aunque por el ritmo de trabajo y la cantidad de horas extras se podr&iacute;a hablar de un tiempo real m&aacute;s cercano a los 24 meses.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>El secretismo con que fue llevado el "COMMANDOS" ha sido una de vuestras mejores bazas. Mientras todo el p&uacute;blico de Espa&ntilde;a estaba (y est&aacute;) expectante por el lanzamiento del "Blade" de Rebel Act Studios, de la noche a la ma&ntilde;ana empiezaron a aparecer los primeros rumores sobre una nueva compa&ntilde;&iacute;a llamada PYRO Studios junto a "screen-shots" de su primer juego, "COMMANDOS; Behind Enemy Lines&quot;, adem&aacute;s de caracter&iacute;sticas del producto ciertamente revolucionarias. La verdad es que, en menos de un mes, lograsteis acaparar toda la atenci&oacute;n de los usuarios espa&ntilde;oles (y extranjeros) y, si se me permite, olvidar que exist&iacute;a un juego llamado "Blade". ¿Por qu&eacute; no se dio a conocer el proyecto "COMMANDOS" antes?. ¿Qu&eacute; opin&aacute;is sobre la pol&iacute;tica llevada a cabo con el "Blade"?, ¿no cre&eacute;is que el globo de expectaci&oacute;n creado se est&aacute; deshinchando peligrosamente?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Desde el punto de vista de marketing, cuanta m&aacute;s atenci&oacute;n sea capaz de concentrar un juego, mejor. El convertirse en el centro de todas las miradas es muy bueno, aunque se puede volver un arma de doble filo: despu&eacute;s de anunciar maravillas tienes que, como dicen los americanos, &quot;to deliver&quot; porque si no el mercado empieza a pasar factura. </P>
<P ALIGN="JUSTIFY">Creo que nosotros acertamos de pleno en nuestro planteamiento de marketing y los resultados est&aacute;n ah&iacute;, y espero que el globo de &quot;Blade&quot; no se desinfle por los retrasos porque ser&iacute;a muy perjudicial para la industria espa&ntilde;ola del videojuego y para nuestra credibilidad en el mercado internacional.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- El planteamiento de marketing detr&aacute;s de Commandos respond&iacute;a a un plan organizado y establecido desde el mismo momento de la fundaci&oacute;n de PYRO Studios y que es producto de nuestra experiencia de 7 a&ntilde;os en el mercado de la distribuci&oacute;n internacional y en el campo del marketing de juegos. El planteamiento de marketing para un producto como COMMANDOS era muy arriesgado porque todo jugaba en nuestra contra siendo nuestro primer producto, adem&aacute;s espa&ntilde;ol, y con los precedentes de nuestro mercado. Eso nos obligaba a concentrar todos los esfuerzos para conseguir que el primer impacto fuera definitivo y no a diluirlos entre distintas acciones. Pensamos que era mejor para darnos a conocer y atraer la atenci&oacute;n el concentrar toda la p&oacute;lvora en una sola explosi&oacute;n en lugar de en distintas explosiones de menor intensidad.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><I><FONT FACE="Arial" SIZE=2>.- El &eacute;xito de PYRO con su primer t&iacute;tulo no se debe &uacute;nicamente al aspecto t&eacute;cnico o gr&aacute;fico, otro de los factores b&aacute;sicos para lograrlo, ha sido la inmejorable forma empresarial de llevar el producto siendo Javier e Ignacio, los principales protagonistas de tal hecho. ¿Result&oacute; muy complicado encontrar un "publisher" de la talla de EIDOS?. ¿Tuvisteis alguna otra oferta anterior o... posterior?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Fue dif&iacute;cil, pero mucho m&aacute;s f&aacute;cil de lo que le hubiera resultado a cualquier otro, porque este mercado es un mercado de futuro, de promesas, que se basa de una forma importante en la reputaci&oacute;n; y en este sentido nosotros disfrut&aacute;bamos de una enorme credibilidad internacional. En cuanto a las ofertas, s&iacute; tuvimos alguna, pero EIDOS era una opci&oacute;n casi inmejorable. Aunque hablando de ofertas, no creo que nadie se pueda imaginar las que tenemos ahora. Algunas de ellas son absolutamente escandalosas. Lo bueno de ellas es que PYRO Studios est&aacute; considerado como uno de los mejores desarrolladores del mundo, de la talla de Westwood o ID, y el futuro para nosotros no puede ser m&aacute;s brillante.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- El planteamiento de comercializaci&oacute;n de PYRO Studios estaba definido al igual que la pol&iacute;tica de marketing desde la fundaci&oacute;n de la empresa. Cuando COMMANDOS se comercializ&oacute; a nivel internacional el juego ya era una firme realidad, puesto que hab&iacute;a m&aacute;s de 55 millones de pesetas invertidos en el prototipo. Esto nos permiti&oacute; presentar el juego de una forma bastante s&oacute;lida. Tuvimos algunas ofertas adem&aacute;s de la de EIDOS, aunque fue esta compa&ntilde;&iacute;a la que demostr&oacute; un mayor inter&eacute;s desde el principio. Tambi&eacute;n tuvimos bastantes negativas de compa&ntilde;&iacute;as que rechazaron COMMANDOS por que no lo cre&iacute;an atractivo. Hoy en dia  todos los publishers del mundo quieren trabajar con nosotros.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Qu&eacute; fue lo que m&aacute;s llam&oacute; la atenci&oacute;n a EIDOS de "COMMANDOS"?, ¿los gr&aacute;ficos,? ¿el concepto?, ¿la sorpresa de encontrarse con una casa de desarrollo espa&ntilde;ola de tan alta calidad?... ¿todo?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Sinceramente, creo que tomaron el riesgo (siempre es un riesgo respaldar un producto sin terminar de un desarrollador nuevo) por qui&eacute;nes &eacute;ramos m&aacute;s que bas&aacute;ndose en otras cosas. S&iacute; les causaron buena impresi&oacute;n los gr&aacute;ficos y el &quot;feeling&quot; del producto, pero realmente lo trataron como un producto medio durante todo el proceso de creaci&oacute;n y lanzamiento, y al final les sorprendi&oacute; el &eacute;xito brutal que ha tenido.</P>
<P ALIGN="JUSTIFY">Evidentemente, nosotros les dijimos siempre que el producto era revolucionario y una maravilla, pero supongo que todos los desarrolladores dicen lo mismo...</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Lo que m&aacute;s sorprendi&oacute; a EIDOS inicialmente fue el aspecto gr&aacute;fico del juego, ya que el concepto no lo entendieron hasta una fase mucho mas avanzada del proyecto. De hecho siempre nos catalogaron como un RTS compar&aacute;ndonos con C&amp;C.</P>
<P ALIGN="JUSTIFY">El respaldo de Proeinsa fue muy importante para que apoyaran el proyecto porque eso les daba garant&iacute;as de un planteamiento empresarial y de producci&oacute;n serio.</P>
<P ALIGN="JUSTIFY"></P>
<center>
<table>
<td><img src="jpg/equipoc.jpg"></td>
<tr>
<td width="300"><center><font face=arial size=1 color="#cc0000">César Astudillo es el maestro de ceremonias del tercer y más reciente equipo de Pyro el cual, se encuentra
inmerso en la producción de otro título. <br>Tampoco César soltó prenda sobre el juego que dirige.</font></center></td>
</table></center>


</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿A qu&eacute; altura del proyecto se comenz&oacute; a buscar un &quot;publisher&quot;?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Cuando llev&aacute;bamos 55 millones invertidos. En tiempo, a los 10 meses.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Existe mucha presi&oacute;n por parte de los grandes &quot;publishers&quot;, una vez que se firma un contrato como el vuestro, o dan bastante flexibilidad a la hora de desarrollar el producto?. Os pregunto esto porque, seg&uacute;n tengo entendido, inicialmente no iba a existir una opci&oacute;n multijugador en "COMMANDOS" y parece que EIDOS &quot;recomend&oacute;&quot; que se incluyera.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Ocurre lo mismo que en el f&uacute;tbol. Cuando no eres nadie, tienes que obedecer y firmar lo que te dicten. Ahora, Ronaldo firma lo que quiere. Nuestro caso es el mismo: ahora tenemos total libertad para decidir como hacemos nuestros juegos, pero al principio las &quot;recomendaciones&quot; pesan much&iacute;iiisimo. </P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Existe un equilibrio. En el caso de COMMANDOS tuvimos mucha libertad, aunque esto se debi&oacute; fundamentalmente a la falta de inter&eacute;s de EIDOS, que consider&oacute; a COMMANDOS como un juego m&aacute;s. Esta libertad la tuvimos, por tanto, m&aacute;s por desatenci&oacute;n que por otra cosa. En el COMMANDOS original nuestra capacidad de negociaci&oacute;n sobre aquellos aspectos que Eidos quer&iacute;a cambiar era m&aacute;s limitada, aunque nunca cedimos en lo importante.</P>
<P ALIGN="JUSTIFY">De cara al futuro la situaci&oacute;n es justo la contraria. Nuestra capacidad de negociaci&oacute;n es alt&iacute;sima, pero la presi&oacute;n del publisher se ha multiplicado por diez en relaci&oacute;n directa a c&oacute;mo han crecido sus expectativas para futuros productos de PYRO.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>A lo largo de la historia muchos juegos han incorporado grandes ideas o conceptos que luego no han sido capaces de desarrollar de forma &oacute;ptima con el consiguiente resultado descafeinado o decepcionante. Esto no ha ocurrido con vuestro primer t&iacute;tulo porque todas y cada una de las misiones del juego son muy maduras. No estamos hablando s&oacute;lo de un juego que incorpora un concepto, el de la t&aacute;ctica en tiempo real, revolucionario. Estamos hablando de un producto que tiene un dise&ntilde;o y planteamiento soberbio. ¿Creasteis alg&uacute;n equipo destinado al dise&ntilde;o de los niveles o todo fue a base de tormentas de ideas en largas tardes de reuniones?. ¿Cu&aacute;nto tiempo os llev&oacute; idear y plasmar detalladamente todas y cada una de las misiones del juego &quot;en papel&quot;?.</I> </P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- En Commandos dedicamos muchisimas horas al dise&ntilde;o de los conceptos generales del juego. El dise&ntilde;o de las misiones comenz&oacute; a continuaci&oacute;n una vez que una parte importante de los conceptos generales estuvo asentada. Esta parte nos toc&oacute; fundamentalmente a Gonzo y a m&iacute; con el apoyo de Jorge Blanco sobre todo para los aspectos gr&aacute;ficos.</P>
<P ALIGN="JUSTIFY">Las misiones se dise&ntilde;aron en papel y despu&eacute;s se fueron incorporando al juego en la medida en la que el avance del desarrollo nos lo fue permitiendo. COMMANDOS debe probablemente tener un r&eacute;cord virtual en cuanto al n&uacute;mero de horas dedicadas al testeo de jugabilidad, y aunque es dif&iacute;cil de cuantificar se podr&iacute;a decir que hay unas trescientas horas de testeo en cada misi&oacute;n.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><I><FONT FACE="Arial" SIZE=2>.- ¿Cu&aacute;l fue la parte del desarrollo que m&aacute;s cost&oacute; terminar de depurar?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- El equilibrado final de las misiones es una de las tareas m&aacute;s delicadas y tediosas de todo el proceso.</P>
<P ALIGN="JUSTIFY"></P>

<HR WIDTH="200">
<center><table width="400">
<td align="left"><font size=2 face=arial><A HREF="epyro1.htm">Página Anterior (1/3)</a></font></td>
<td align="right"><font size=2 face=arial><A HREF="epyro3.htm">Página Siguiente (3/3)</a></font></td>
</table></center>
<HR WIDTH="400">
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
