<HTML>
<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Entrevista a <br>César Astudillo, Javier Fáfula, Ignacio Pérez y Javier Pérez.
</FONT>
</H3>
<p align="right"><font face=arial size=2 color="#cc0000"><b>1/3</b></font>
<hr>
<br>
<font face=arial size=2>
<p align="justify">
"De lujo". Esa es de la única manera que podemos calificar ésta entrevista. Para éste número 8 de Macedonia, hemos tenido el
placer de entrevistar a cuatro pilares de Pyro Studios. <b>Ignacio Pérez</b>, <b>Javier Pérez</b>, <b>César Astudillo</b> y <b>Javier Fáfula</b>. <br>
<BR>
Aunque la espera para obtener la entrevista ha sido larga, ha merecido la pena. Jamás habíamos realizado una entrevista tan
extensa y llena de matices como ésta. Desde aquí dar las gracias a éstas cuatro grandes personas. Primero por
prestarnos algo de su valioso tiempo (que por la espera, efectivamente es muy valioso ;-D ) y segundo por
hacerlo tan bien. Y digo tan bien, porque han realizado una gran labor a la hora de integrar la entrevista
dentro del contexto en la que ésta debía de encontrarse. Gracias especiales por ésto último a César Astudillo por ser ése
nexo tan importante entre Macedonia y Pyro. <BR><BR>
Antes de dejaros con ésta extensa entrevista, decir que falta un personaje que también forma parte del
cuadro directivo de Pyro Studios. Ese no es otro que Gonzalo Suárez. Gonzo, declino la oferta de aparecer en la 
entrevista pero, a cambio, nos ha regalado un estupendo fragmento de un libro que ha realizado sobre el
diseño de videojuegos que podéis encontrar en "Firmas Invitadas". Por otro lado, hace poco que en Stratos 
(<a href="www.stratos-ad.com" target="_new">www.stratos-ad.com</a>) se editó una expléndida entrevista a 
Gonzo que puede ser estupenda para completar ésta. Os la recomiendamos, por supuesto. <br><br>
Y bueno, ahora ya sí que os dejamos con la entrevista. Sentaros, relajaros, serviros, si podéis, un buen
refresco y comenzar a disfrutar con estas cuatro personalidades. ¡Ah!, para los despitados, la entrevista
está dividida en tres partes.

<br>
<hr>
<FONT color="#000000" size=2 face="arial" >        
<P ALIGN=JUSTIFY>

<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">Macedonia Magazine</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Antes de nada ser&iacute;a bueno indagar un poco en vuestros or&iacute;genes inform&aacute;ticos. Ah&iacute; va la primera e ineludible pregunta de Macedonia ¿c&oacute;mo y cu&aacute;ndo os introdujisteis en el mundo de la inform&aacute;tica por primera vez?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Javier P&eacute;rez </B></FONT><FONT FACE="Arial" SIZE=2>- M&aacute;s que en el mundo de la inform&aacute;tica, empec&eacute; a jugar con videojuegos cuando ten&iacute;a seis a&ntilde;os, junto con mi hermano Ignacio. La raz&oacute;n para este comienzo tan temprano fue PROEINSA, que en aquel tiempo fund&oacute; y gestionaba nuestro padre, y que tra&iacute;a los primeros juegos electr&oacute;nicos que hab&iacute;an pisado Espa&ntilde;a. Nosotros nos convertimos en el banco de pruebas de casi todos los juegos que se importaban. De ah&iacute; a la inform&aacute;tica fue casi evoluci&oacute;n natural, como una plataforma m&aacute;s de juego.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Javier F&aacute;fula </B></FONT><FONT FACE="Arial" SIZE=2>- Afici&oacute;n, cuando estaba en la Facultad, en el 85. Vi el &quot;Ant Attack&quot;, hice un engine parecido, y a partir de ah&iacute; sali&oacute; un juego...</P>
</FONT>
<B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C&eacute;sar Astudillo </B></FONT><FONT FACE="Arial" SIZE=2>- .El primer ordenador que me top&eacute; yo era un SHARP basado en Z80 que ten&iacute;a un ex cu&ntilde;ado. Parec&iacute;a un primo ileg&iacute;timo del Commodore PET. Me pas&eacute; toda la noche averiguando c&oacute;mo hacer m&uacute;sica en BASIC. Un par de a&ntilde;os m&aacute;s tarde, consegu&iacute;a que mis padres me compraran un  Spectrum 48K con la mentira al uso: asegurarles que me ayudar&iacute;a a hacer los deberes y mejorar&iacute;a mi rendimiento escolar... 8-)</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY">Ignacio P&eacute;rez</B></FONT><FONT FACE="Arial" SIZE=2>- Al contrario de mis compa&ntilde;eros, mis conocimientos de inform&aacute;tica son muy limitados. Lo m&iacute;o han sido siempre los juegos, tanto los de ordenador como los de tablero.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B>
<center>
<table>
<td width="400"><table CELLPADDING=0 CELLSPACING=0>
<td><img src="jpg/epyro1.jpg"></td>
<td><img src="jpg/epyro3.jpg"></td>
<td><img src="jpg/epyro2.jpg"></td>
<td><img src="jpg/epyro4.jpg"></td>
</table></td>
<tr>
<td ><center><font face=arial size=2>Aquí tenéis a nuestros entrevistados de Pyro Studios. De izquierda a derecha,
<font color="#cc0000"><b>César Astudillo</b></font> (Director de proyecto), <font color="#cc0000"><b>Javier Fáfula</b></font> (Director de Proyecto), <font color="#cc0000"><b>Ignacio Pérez</b></font> (Director general de PROEINSA y responsable de todos los proyectos de Pyro), <font color="#cc0000"> <b>Javier Pérez</b></font> (Director general y de relaciones de Pyro Studios)</font></center></td>
</table>
</center>


<FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Todos vosotros participasteis, de una u otra forma, en lo que fue el "imperio" de desarrollo de videojuegos en Espa&ntilde;a durante la &eacute;poca de los 8 bits. C&eacute;sar trabaj&oacute; como programador y m&uacute;sico freelance de Topo Soft, Javier F&aacute;fula ha pasado por casas tanto nacionales como extranjeras desarrollando un historial incre&iacute;ble y todo esto sin contar a Javier e Ignacio P&eacute;rez Dolset que han sido los responsables de llevar a PROEINSA. a ser una de las distribuidoras de mayor prestigio y solidez de Espa&ntilde;a. ¿Nos podr&iacute;ais comentar, con mayor profundidad, cu&aacute;les son vuestros antecedentes en el mundo del software de entretenimiento profesional antes de que existiera PYRO Studios?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Javier e Ignacio</B></FONT><FONT FACE="Arial" SIZE=2>-- Despu&eacute;s de toda una vida jugando, y una vez que terminamos nuestras respectivas carreras universitarias, decidimos integrarnos en PROEINSA dentro del departamento de software, que en aquel tiempo hab&iacute;a ca&iacute;do casi en el olvido dentro de la empresa por otros negocios m&aacute;s importantes en volumen. Creo que casi inconscientemente decidimos convertir nuestra afici&oacute;n en profesi&oacute;n y nos fijamos el reto de convertirnos en el l&iacute;der del mercado. Todo esto ocurr&iacute;a en el a&ntilde;o 92.</P>
<P ALIGN="JUSTIFY">Durante los siguientes cuatro a&ntilde;os nos dedicamos en cuerpo y alma a la distribuci&oacute;n, y a finales del a&ntilde;o 96, decidimos dar el siguiente paso: crear videojuegos, ¿por qu&eacute; no?. Y fundamos PYRO Studios.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Mi primer juego sali&oacute; en Espa&ntilde;a con el mismo sello de &quot;Sir Fred&quot;, fuera acab&oacute; con Hewson, el resto de las compa&ntilde;&iacute;as interesadas s&oacute;lo lo quer&iacute;an con derechos exclusivos. M&aacute;s tarde me hice cargo del equipo de Zafiro, &quot;Equipo A&quot; y alg&uacute;n otro; luego pas&eacute; a engrosar el equipo de Dinamic con el &quot;Michel Super Skills&quot;. Despu&eacute;s de la debacle de Dinamic, form&eacute; t&aacute;ndem con Gonzo en una compa&ntilde;&iacute;a propia de versionado a otras m&aacute;quinas. Elaboramos un juego de tenis (&quot;Arantxa Supertenis&quot;), pero despu&eacute;s de problemas con la compa&ntilde;&iacute;a que lo encarg&oacute;, acabamos con nuestra uni&oacute;n. Entonces me hice mercenario, alternando versiones a otras m&aacute;quinas (finalizar &quot;Budokan&quot; en Z80s, &quot;Street Fighter&quot;, &quot;SWIV&quot; entre otros) con algunos juegos para Topo como el &quot;Tour 91&quot;, &quot;Olimpiadas 92&quot; y &quot;Luigi &amp; Spaghetti&quot; y concursos de televisi&oacute;n (&quot;Zona de Juego&quot;). M&aacute;s tarde realic&eacute; versiones espa&ntilde;olas de juegos extranjeros casi con exclusividad para EA, y al resurgir Dinamic realic&eacute; los engines del PC-Futbol de la v2 a la v4, y el juego del PC-Basket de la v2 a la v4. Tras dos experiencias fallidas de realizar videojuegos originales con compa&ntilde;&iacute;as de publicidad, y un lapsus de realizaci&oacute;n de versiones (la &uacute;ltima fue &quot;The Last Express&quot;), me llam&oacute; Gonzo para que hablara con Javier P&eacute;rez y aunque yo cre&iacute; en un primer momento que me quer&iacute;an para hacer un engine de freelance, pues aqu&iacute; estoy.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Aparte de mi relaci&oacute;n con Topo, cuando empezaron los noventa dej&eacute; el mundo de los videojuegos y me met&iacute; en la inform&aacute;tica &quot;seria&quot;. No volver&iacute;a al sector hasta la fundaci&oacute;n de PYRO.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>En la actualidad, el mercado de los videojuegos ha crecido tanto que los m&eacute;todos de trabajo de los 8 y 16 bits han quedado totalmente obsoletos; la forma de planificar un proyecto ha cambiado de pies a cabeza al cobrar protagonismo la utilizaci&oacute;n de las m&aacute;s modernas tecnolog&iacute;as o la implantaci&oacute;n de una gran labor de equipo en detrimento de los desarrollos personalistas. ¿Cu&aacute;les son vuestras propias reflexiones sobre el cambio tan abismal que se ha producido en el mercado en estos &uacute;ltimos 15 a&ntilde;os?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P. </B></FONT><FONT FACE="Arial" SIZE=2>- Desde el punto de vista de la producci&oacute;n la evoluci&oacute;n ha sido impresionante. Hemos visto como el trabajo casi individualista ha ido pasando a 2,3,4 ...10, 12 personas, con un crecimiento igualmente exponencial de los tiempos de desarrollo, inversi&oacute;n, necesidad de marketing y relaciones p&uacute;blicas.... En definitiva, creo que el negocio del dormitorio se ha convertido en industria y se ha profesionalizado de forma profunda. Con ello, tambi&eacute;n han subido sustancialmente las barreras de entrada al negocio. Como ejemplo, en el 92 se pod&iacute;a hacer un videojuego por 10 millones de pesetas; cuando decidimos comenzar PYRO STUDIOS asignamos unos 80 millones por proyecto... pero nos equivocamos. COMMANDOS nos ha costado 150 millones, y los costos siguen subiendo (siempre entendiendo que hablamos de juegos con proyecci&oacute;n internacional).</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Como dice Javier, tanto los costos como l&oacute;gicamente el n&uacute;mero de personas necesarias para sacar adelante una producci&oacute;n de videojuegos ha crecido dram&aacute;ticamente en los &uacute;ltimos a&ntilde;os. Eso ha hecho que el control de equipos cada vez m&aacute;s grandes requiera un cambio de mentalidad respecto a la producci&oacute;n t&iacute;pica de los a&ntilde;os 80 con equipos muy peque&ntilde;os, incluso en muchos casos de juegos realizados por una sola persona. En cualquier caso, esta tendencia va a continuar en lo pr&oacute;ximos a&ntilde;os con equipos y presupuestos todav&iacute;a mayores que los actuales.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F</B></FONT><FONT FACE="Arial" SIZE=2>- Un juego &quot;triple A&quot; ya no se puede amortizar s&oacute;lo con la venta en Espa&ntilde;a, y encima para venderse en Espa&ntilde;a debe ser comparable en calidad a las grandes producciones extranjeras. Esto te lleva inevitablemente a hacer una gran producci&oacute;n, o sea, que no se puede ir con un peque&ntilde;o equipo. Adem&aacute;s hay que tener muy en cuenta un trabajo de marketing, promoci&oacute;n y planificaci&oacute;n, cosa que s&oacute;lo se puede hacer con una compa&ntilde;&iacute;a de entidad.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Y es que en el segmento de los juegos a 7000 pesetas s&oacute;lo se puede competir afrontando grandes inversiones. Ahora ya no bastan la ilusi&oacute;n y la capacidad, tambi&eacute;n hace falta encontrar un empresario dispuesto a arriesgar una buena suma para afrontar el desarrollo. O eso, o centrarse a los desarrollos peque&ntilde;os, claro, lo cual tambi&eacute;n tiene sus posibilidades.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Lo m&aacute;s curioso es que gran parte de lo que fue el grueso de cl&aacute;sicas del desarrollo nacional, esto es, Dinamic, Topo, Opera y Zigurat, abandon&oacute; el mundo del software l&uacute;dico definitivamente. S&oacute;lo hay que leer la entrevista que hicimos a tres grandes miembros de lo que fue Opera Soft  para darse cuenta de que muchas de las personas que jugaban un papel clave en los 8 bits ya no se sienten apasionadas, en absoluto, por este mercado. ¿Realmente se ha perdido un alto porcentaje de todo ese personal nacional que estaba antes en los videojuegos o, por el contrario, sigue habiendo muchos &quot;cl&aacute;sicos&quot; desarrolladores a&uacute;n en activo?. ¿Y, los que fuisteis miembros de alguna casa de la &eacute;poca de los 8 bits, pudisteis seguir ligados a los videojuegos despu&eacute;s de la desaparici&oacute;n de las mismas?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo creo que esta es una pregunta mucho m&aacute;s para Fa y C&eacute;sar, que pertenecen a esa generaci&oacute;n.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Es l&oacute;gico que se perdiera mucha gente de los cl&aacute;sicos. En estos &uacute;ltimos a&ntilde;os un juego no daba ni para pipas, bastantes de los juegos hechos por m&iacute; en estos a&ntilde;os han sido por amor al oficio, pero eran realmente ruinosos. Los &quot;cl&aacute;sicos&quot; en general cuando programaban lo hac&iacute;an por orgullo del trabajo bien hecho, pero hay que comer, y es evidente que daba m&aacute;s dinero hacer un software de misiles aire-tierra que un juego de nivel nacional sin casi publicidad en las revistas del sector; as&iacute; es que se han tenido que reconvertir en otras ramas de la inform&aacute;tica o puestos dentro del sector de entretenimiento, ... pero tienen mucho gusanillo.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Ten en cuenta, tambi&eacute;n, que la gran &quot;traves&iacute;a del desierto&quot; de la industria nacional en los &uacute;ltimos cinco a&ntilde;os ha sido una historia de promesas incumplidas. Mucha gente entr&oacute; en el autoenga&ntilde;o de que todav&iacute;a se pod&iacute;a hacer software de calidad internacional con cuatro duros y plazos irreales. Y eso acab&oacute; con la inocencia de muchos. Gente que en el pasado estuvo en la cima, est&aacute; ahora dedicada a temas fronterizos como la multimedia, o han sido absorbidos por la inform&aacute;tica de corbata. Yo creo que a la industria espa&ntilde;ola del videojuego le va a costar mucho recuperar la confianza de estos veteranos, si es que tal cosa es posible. Por cierto, creo que a Gonzo, que tiene todav&iacute;a mucha relaci&oacute;n con varios de estos &quot;gigantes&quot;, no le importar&iacute;a devolver a m&aacute;s de uno a la arena...</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<table align="left" width="300">
<td><img src="jpg/epyro5.jpg"></td>
<tr>
<td ><center><font face=arial color="#cc0000" size=1>¿Cuántas cosas se han dicho ya de COMMANDOS?. Muchas, muchísimas. 
Personalmente, considero más importante lo que ha significado éste juego para el software español, que para la propia
historia y evolución del videojuego.</font></center></td>
</table>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Y ahora los que os hab&eacute;is reencontrado con el desarrollo de videojuegos despu&eacute;s de esa larga pausa que se inici&oacute; a principios de los 90, ¿os ha costado mucho &quot;desentumecer&quot; toda la experiencia pionera que desarrollasteis con los 8 bits o hab&eacute;is vuelto a coger el ritmo y el &quot;chip&quot; de trabajo de anta&ntilde;o sin demasiados problemas?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F</B></FONT><FONT FACE="Arial" SIZE=2>- Bueno, yo siempre me propuse hacer al menos un juego al a&ntilde;o, y nunca he dejado de hacerlo. Adem&aacute;s como adaptador de programas, casi siempre mastod&oacute;nticos de EA, se es perfectamente consciente que no es un trabajo como de hacer un juego de Spectrum, sino que hace falta mucha m&aacute;s preparaci&oacute;n previa antes de tocar el ordenador, pero sin olvidar el aspecto que es el meramente jugable, cosa que muchas veces suelen parecer olvidar algunas producciones extranjeras. Esto consiste en hacer juegos, no s&oacute;lo programas.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Claro, es que Fa no dej&oacute; nunca de trabajar en esto. T&eacute;cnicamente, lo que se dice t&eacute;cnicamente, a m&iacute; mi experiencia de los 8 bits me vale para poco. S&oacute;lo puedo aprovechar el sedimento de madurez que me haya podido quedar. En el plano tecnol&oacute;gico te quedan algunas filosof&iacute;as, pero la mayor&iacute;a de mis antiguos conocimientos t&eacute;cnicos concretos s&oacute;lo me sirven para contar batallitas.</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Har&aacute; cerca de un a&ntilde;o cuando el p&uacute;blico espa&ntilde;ol comenz&oacute; a tener constancia de los primeros rumores sobre la existencia de una nueva compa&ntilde;&iacute;a de desarrollo llamada PYRO Studios. Javier, Ignacio, ¿qu&eacute; fue lo que impulsa a PROEINSA a crear una divisi&oacute;n dedicada al desarrollo de juegos "triple A" cuando el mercado internacional estaba ya colmado de multinacionales y en Espa&ntilde;a escaseaba, en principio, el personal humano preparado para acometer un proyecto de tal &iacute;ndole?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Creo que b&aacute;sicamente reto personal e intentar triunfar donde muchos otros hab&iacute;an fracasado. Siempre me hab&iacute;a extra&ntilde;ado que con la calidad de los t&eacute;cnicos y profesionales que hab&iacute;a en Espa&ntilde;a no se hubiera conseguido consolidar una realidad de producci&oacute;n estable y con proyecci&oacute;n. </P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P</B></FONT><FONT FACE="Arial" SIZE=2>- El factor reto s&iacute; que fue importante. PROEINSA ya hab&iacute;a conseguido consolidarse como una de las distribuidoras de juegos m&aacute;s importantes del pa&iacute;s y ahora se trataba de demostrar si pod&iacute;amos hacer lo mismo en la producci&oacute;n, pero esta vez teniendo que competir no con compa&ntilde;&iacute;as locales sino con los m&aacute;s importantes desarrolladores europeos. Adem&aacute;s era una situaci&oacute;n triste ver el talento de producci&oacute;n desaprovechado que hab&iacute;a en este pa&iacute;s por falta de iniciativa empresarial. </P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- De todas formas no hay que tener ning&uacute;n complejo de individualidades respecto a fuera (¡ten&iacute;ais que ver algunos fuentes de juegos de fuera!), adem&aacute;s ya hay un n&uacute;mero no s&oacute;lo anecd&oacute;tico de espa&ntilde;oles trabajando en compa&ntilde;&iacute;as extranjeras.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Cu&aacute;l fue el momento exacto en que nace PYRO Studios como un proyecto a corto plazo, es decir, en qu&eacute; fecha se comienza a "mover todo"?.</P>
</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Septiembre de 1996, pero la idea se llevaba alg&uacute;n tiempo cociendo...</P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">I. P</B></FONT><FONT FACE="Arial" SIZE=2>- .Aunque nunca con una vocaci&oacute;n a corto plazo, sino con la idea de convertirse en una productora de juegos.</P>

<HR WIDTH="200">
<center><table width="400">
<td><font size=2 face=arial><A HREF="epyro2.htm"><center>Página Siguiente (2/3)</center></a></font></td>
</table></center>
<HR WIDTH="400">
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
