<HTML>

<BODY BGCOLOR="#FFFFFF">







<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>





<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>

<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>

</b></FONT>

<br><br>



<BR><BR><BR><BR><BR>



<H3>

<FONT color="#000000" face="arial">        

Entrevista a <br>César Astudillo, Javier Fáfula, Ignacio Pérez y Javier Pérez.

</FONT>

</H3>

<p align="right"><font face=arial size=2 color="#cc0000"><b>3/3</b></font>

<hr>

<FONT color="#000000" size=2 face="arial" >        

<P ALIGN=JUSTIFY>



<table align="left">

<td><img src="jpg/pyrowork.jpg"></td>

<tr>

<td width="300"><center><font face=arial size=1 color="#cc0000">Aquí tenéis al equipo de César (sentado encima del cubo de mando 8-)) en pleno trabajo. Seguro que se trata de una de las reuniones de por la mañana antes de comenzar

a ponerse a trabajar. En fin chicos, qué envida... </font></center></td>

</table>

<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>En la actualidad, Gonzo est&aacute; dirigiendo el equipo encargado de realizar el "Mission Pack" de "COMMANDOS" adem&aacute;s de lo que ser&aacute;, en un futuro, la segunda parte del mismo (supongo que Ignacio tambi&eacute;n estar&aacute; muy metido en el dise&ntilde;o de esta segunda parte). Adem&aacute;s, F&aacute; y C&eacute;sar se est&aacute;n encargando de dirigir sendos proyectos nuevos (y secretos). ¿Qu&eacute; nos pod&eacute;is (de lo que est&eacute; permitido) contar sobre lo que se a vecina de la mano de PYRO?.</P>

</FONT><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

</I><B><P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Ejem, pues ver&aacute;s...</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Que ser&aacute;n revolucionarios. Nada m&aacute;s. Pronto empezaremos a suministrar informaci&oacute;n sobre ellos.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Estamos trabajando en dos nuevos proyectos con la misma dedicaci&oacute;n y con las mismas exigencias de calidad que en COMMANDOS. Evidentemente nadie puede garantizar el &eacute;xito, pero lo que si podemos garantizar es el buen hacer que estamos poniendo detr&aacute;s de estos nuevos t&iacute;tulos. Por lo dem&aacute;s habr&aacute; que esperar a la presentaci&oacute;n oficial de los mismos para que podamos dar m&aacute;s detalles.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Dicen que uno es esclavo de sus palabras y due&ntilde;o de sus silencios... 8-) Contar las cosas s&oacute;lo cuando llega el momento es algo que no s&oacute;lo te evita la fuga de ideas, sino que tambi&eacute;n te garantiza, durante la fase inicial del proyecto, la libertad creativa de experimentar, cambiar de idea y meterte en los callejones sin salida que te d&eacute; la gana y sin rendir cuentas a nadie. Es un poco pronto para crear expectativas concretas.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>En las notas de prensa que est&aacute;is enviando a las revistas y fanzines anunci&aacute;is el hecho de estar trabajando ya para la consola PlayStation y en vuestra Web (www.pyrostudios.com) tambi&eacute;n cit&aacute;is a la Dream Cast como plataforma futura a abordar. ¿Es reciente la decisi&oacute;n de desarrollar para consola o es una idea que ya ten&iacute;ais desde que comenzasteis con &quot;COMMANDOS&quot;?. ¿C&oacute;mo os est&aacute; resultado el trabajo en estas plataformas?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- La decisi&oacute;n es reciente, la segunda pregunta creo que ser&iacute;a Gonzo el m&aacute;s indicado para contestar.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Aunque lo decidi&eacute;ramos hace poco, era algo que ten&iacute;amos in mente desde el principio. El &eacute;xito de COMMANDOS ha adelantado esta decisi&oacute;n.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><I><FONT FACE="Arial" SIZE=2>.-¿PYRO es una casa que se va a centrar en alg&uacute;n g&eacute;nero espec&iacute;fico, que se va a ce&ntilde;ir a las modas que imperen en el mercado o que va a trabajar en todos aquellos g&eacute;neros en los que sea capaz de asestar un buen golpe a las bases del mismo?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Uf, vaya pregunta. No s&eacute;, probablemente haremos los juegos que nos gusten en cada momento. Pueden ser de cualquier g&eacute;nero. La verdad es que jugamos a todos ellos.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- En PYRO Studios no existe ninguna limitaci&oacute;n en ese sentido. Cuando tengamos una buena idea la pondremos en pr&aacute;ctica. El g&eacute;nero es lo de menos, lo fundamental ser&aacute; si el concepto es o no v&aacute;lido.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- La idea, tal como yo la veo, es intentar refrescar la diversidad de opciones del mercado en general, que hasta hace poco parec&iacute;an limitarse a Tomb Raider y clones, Quake y clones y Command &amp; Conquer y clones.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Es que lo que somos es gente vocacional. Creemos en hacer el juego que nos gustar&iacute;a como jugadores. Mira, los g&eacute;neros son una convenci&oacute;n imaginaria. Nosotros plantamos la tienda donde nos apetece acampar, y si alguien viene y dice que hemos acampado entre el terreno de Fulano y el de Mengano, pues bueno, eso es trabajo para los &quot;etiquetadores profesionales&quot;...</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Desde el punto de vista personal, ¿Cu&aacute;les son vuestros g&eacute;neros preferidos?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.r</B></FONT><FONT FACE="Arial" SIZE=2>- Hoy por hoy, estrategia, sin duda.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Estrategia, wargames y rol, aunque sin hacer ascos a ning&uacute;n g&eacute;nero.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- De todo un poco, no te sabr&iacute;a decir...</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Simuladores de naves, &quot;shooters&quot; multijugador como Quake o Half Life y, &uacute;ltimamente, todo lo de Miyamoto... aunque todo ello un poco de lejos, porque tanto pensar d&iacute;a y noche en mi proyecto me incapacita para jugar de otra forma que no sea en plan cr&iacute;tico, machacando los errores del autor y pensando c&oacute;mo lo har&iacute;as t&uacute; mejor... ¡Agotador, macho! 8-)</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Bajo mi opini&oacute;n, lo m&aacute;s importante de todo este resurgir del soft patrio lo constituye el hecho de que muchos de los que aspir&aacute;bamos, desde los 8 bits, a entrar en alguna casa de desarrollo de videojuegos, formar un grupo serio o a poder trabajar en algo relacionado con este apasionante mundo, hemos podido volver a recuperar la esperanza. Sin embargo, una cosa est&aacute; clara, ahora el camino es infinitamente m&aacute;s empinado que antes porque los conocimientos que se requieren son muy elevados. Ahora uno por s&iacute; s&oacute;lo no va a ning&uacute;n lado. ¿Qu&eacute; opin&aacute;is vosotros sobre la situaci&oacute;n actual para la formaci&oacute;n de futuros valores en la industria del entretenimiento nacional?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- La formaci&oacute;n de profesionales es una cosa, y la de centros de desarrollo es otra. Mi recomendaci&oacute;n a todo aquel que quiera entrar en la industria es que se forme t&eacute;cnica y conceptualmente con expertos  </P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- La situaci&oacute;n actual es muy dif&iacute;cil ya que en cualquiera de los campos del desarrollo: programaci&oacute;n, dise&ntilde;o, gr&aacute;ficos,... es esencial contar con una muy buena formaci&oacute;n previa.  Aun as&iacute; y reconociendo las dificultades actuales, la situaci&oacute;n es mejor que la del pasado y esperamos que peor que la que est&aacute; por venir para la gente que quiera hacer videojuegos. Ahora por lo menos existe la esperanza de un futuro profesional.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Bueno, evidentemente hay que tener una base s&oacute;lida y/o capacidades innatas, pero sobre todo hay que ser muy constante y responsable con el trabajo, sin eso no es posible en ninguna rama ser un buen profesional; y sobre todo tiene que haber un sector consolidado, que eso es lo que intentamos.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Aqu&iacute; hay sitio para todo el que tenga la formaci&oacute;n b&aacute;sica necesaria y una cierta capacidad innata. La formaci&oacute;n m&aacute;s espec&iacute;fica vendr&aacute; con el propio trabajo. ¿Y c&oacute;mo se demuestra que se tiene esa capacidad innata? Pues haciendo cosillas, no importa si son peque&ntilde;as o si las hace uno solo. Por eso sitios como Stratos funcionan tan bien como cantera. </P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Lo que est&aacute; claro es que el s&iacute;ndrome de la &quot;titulitis&quot; en Espa&ntilde;a es algo que est&aacute;, desgraciadamente, muy extendido. Estando como est&aacute;n las cosas, qu&eacute; puede o debe hacer, por ejemplo, un &quot;chaval&quot; que a los 18 a&ntilde;os est&aacute; convencido que tiene que entrar alg&uacute;n d&iacute;a a trabajar en esta industria, ¿comenzar una carrera de inform&aacute;tica (que dudosamente le llevar&aacute; a alg&uacute;n sitio)?, ¿convertirse en autodidacta?... ¿qu&eacute; hacer?, ¿c&oacute;mo puede comenzar a abrirse campo en esta jungla que es el desarrollo de videojuegos?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Desde mi punto de vista lo primero que tendr&aacute; que decidir es a qu&eacute; aspecto del videojuego quiere dedicarse, pues los pasos a seguir son distintos de la faceta a la que se quiera dedicar.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J .F</B></FONT><FONT FACE="Arial" SIZE=2>- Una buena base acad&eacute;mica es muy aconsejable, la t&eacute;cnica y el realismo en el videojuego, ya ha adquirido una gran potencia, y los conocimientos matem&aacute;ticos y en algunas ocasiones f&iacute;sicos son muy convenientes en el caso de los programadores. Pero no hay que olvidarse que no recuerdo que exista ninguna &quot;ETS de Ingenieros en Videojuegos&quot;, as&iacute; que tambi&eacute;n se ha de tener un gran componente autodidacta. Cada caso es &uacute;nico. No sabr&iacute;a  a ciencia cierta aconsejar a un chaval sobre el m&eacute;todo ideal.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff">

<P>C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Por bestia que parezca, hay ciertas cosas que se pueden hacer incluso antes de los 18 a&ntilde;os. Aqu&iacute; tenemos gente de 17 e incluso 16, que llevan curr&aacute;ndoselo desde que hicieron la primera comuni&oacute;n. En cuanto a lo que se puede hacer, y como esto es la Web, me remito a un excelente art&iacute;culo de Ernest Adams en la revista Gamasutra: &quot;How to Get Started in the Game Industry&quot; (http://www.gamasutra.com/features/game_design/19981211/get_started1.htm)</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>

<center>

<table>

<td width="400"><table CELLPADDING=0 CELLSPACING=0>

<td><img src="jpg/pwork1.jpg"></td>

<td><img src="jpg/pwork2.jpg"></td>

<td><img src="jpg/pwork3.jpg"></td>

</table></td>

<tr>

<td align="center"><center><font face=arial size=1 color="#cc0000">Aquí van unos cuantas pantallas de lo que podrá verse en el título que está desarrollando el equipo de Javier Fáfula. Este proyecto, lleva

por ahora el título de "Cimmeria".</font></center></td>

</table>

</center>



<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Cu&aacute;l es el perfil actual de un desarrollador de PYRO en los campos de programaci&oacute;n y dise&ntilde;o gr&aacute;fico?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J.F</B></FONT><FONT FACE="Arial" SIZE=2>- La pera! Son la pera!</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Y que lo digas... En el aspecto de programaci&oacute;n, aunque no consideramos el haber estudiado inform&aacute;tica como un factor excluyente, lo cierto es que cada vez m&aacute;s de nuestros programadores han recibido formaci&oacute;n inform&aacute;tica reglada. Aparte de eso, nuestros programadores se pueden caracterizar como gente muy resolutiva, muy aut&oacute;noma, capaces de moverse por s&iacute; mismos buscando documentaci&oacute;n y soluciones para cualquier problema, e inform&aacute;ndose adecuadamente del &quot;estado del arte&quot; del campo del problema antes de hacer nada, para no ponerse a inventar la rueda. En el aspecto gr&aacute;fico, cada vez m&aacute;s tenemos gente muy cr&iacute;tica, conocedora de los medios, con conocimientos de t&eacute;cnica cinematogr&aacute;fica, animaci&oacute;n, y abiertos a lo que se lleva en otras &aacute;reas del entretenimiento que no son los videojuegos, como por ejemplo el cine o el c&oacute;mic.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>La aparici&oacute;n de Windows 95 como plataforma de desarrollo supuso un punto de ruptura para muchos de los que hab&iacute;amos estado trabajando largo tiempo en DOS. Con la llegada de las DirectX parece que las cosas han estado suaviz&aacute;ndose y vuelve a existir gente preparada para &quot;volcar&quot; todos sus conocimientos adquiridos en DOS a este entorno, sin embargo, la demanda de t&iacute;tulos que necesitan de amplios conocimientos de 3D est&aacute; volviendo a trazar una l&iacute;nea divisoria entre desarrolladores futuros. ¿Cre&eacute;is que hay que saltar ya a las 3D y olvidarse definitivamente de juegos 2D?, es decir, ¿sois partidarios de que el que quiera llegar a alg&uacute;n sitio en esta industria no le va a quedar m&aacute;s remedio que enfrentarse a la geometr&iacute;a y trigonometr&iacute;a? y, en tal caso, ¿Direct3D, OpenGL, Glide...?</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">Javier e Ignacio</B></FONT><FONT FACE="Arial" SIZE=2>-- Fa y C&eacute;sar son las personas para contestar a esto, pero s&oacute;lo un apunte: la tecnolog&iacute;a debe estar al servicio del juego, y no al rev&eacute;s.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.-</B></FONT><FONT FACE="Arial" SIZE=2> No creo que nunca se pueda decir que el 2D ha muerto, ya que peri&oacute;dicamente salen algunas maravillas en 2D, pero es evidente que un desarrollador completo ha de tener unos conocimientos matem&aacute;ticos s&oacute;lidos.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Eso de por qu&eacute; se &quot;desprecia&quot; el 2D habr&iacute;a que pregunt&aacute;rselo a los que compran juegos, no a los que los hacemos. Si ahora se dice que apenas hay sitio para las 2D es porque muchos compradores de juegos y muchos periodistas parecen considerarlas una antigualla. Esto es completamente injustificado, pero nosotros no tenemos la culpa: de algo hay que comer. Por el momento, parece que el 3D ha llegado para quedarse, aunque como Gonzo demostrar&aacute; con Commandos 2, el 3D tiene muchos caminos no transitados que llevan a parajes maravillosos... (¿he sido lo bastante enigm&aacute;tico?). En cuanto a los APIs, en nuestro equipo consideramos Glide como el ideal para empezar por lo r&aacute;pido que se pueden obtener resultados. Luego, para sobrevivir necesitas tambi&eacute;n Direct3D. Es necesario abrir en tu programa territorios de independencia del API lo m&aacute;s amplios posible, y luego implementar un m&oacute;dulo dependiente del API que sea tan peque&ntilde;o como sea posible.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Otros de los aspectos que tambi&eacute;n est&aacute;n dando mucho &quot;dolor de cabeza&quot; &uacute;ltimamente es el hecho de decantarse por la metodolog&iacute;a a emplear a la hora de desarrollar juegos bajo Win32. Est&aacute; claro que el camino serio es el C o el C++, utilizando el entorno de desarrollo Visual C++. Lo que no est&aacute; tan claro es el tema de la utilizaci&oacute;n de la API directamente o el trabajo bajo la librer&iacute;a de clases MFC. ¿Qu&eacute; recomend&aacute;is vosotros?, ¿trabajar directamente con el API de Windows utilizando el C de toda la vida, o aprovecharse de la programaci&oacute;n orientada a objetos con el C++ y las MFC como punto de apoyo (al fin y al cabo, de lo que se trata es de trabajar en equipo r&aacute;pida y eficientemente, y en eso consiste la POO)?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- No me imagino ahora mismo otro m&eacute;todo de trabajo en programaci&oacute;n que no sea C++. El tema del uso de MFC´s s&oacute;lo lo veo dentro del desarrollo de las utilidades del proyecto.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Sin duda, hay que usar la POO que ofrece C++, pero de verdad: empezando al nivel del dise&ntilde;o del software. En cuanto a c&oacute;mo acceder al API del Windows, tampoco a m&iacute; me cae simp&aacute;tica la idea de usar las MFC en el runtime de un juego, pero desde luego s&iacute; en las herramientas. Y piensa que en un juego grande, alrededor del cincuenta por ciento del c&oacute;digo es c&oacute;digo de herramientas. Asi que las MFC s&iacute; que tienen su sitio en nuestro corazoncito.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Espa&ntilde;a cuenta con muchos y variados grupos de desarrolladores independientes, ¿cre&eacute;is que sucumbir&aacute;n tarde o temprano a la gran &quot;vor&aacute;gine&quot; comercial que impera en el desarrollo de videojuegos o, por el contrario, siempre habr&aacute; un mercado interno para ellos?.</P>

</I><P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Siempre existir&aacute; un mercado para ellos, pero la distancia entre ese mercado secundario y el mercado internacional, o el de los primeros t&iacute;tulos, es cada d&iacute;a mayor. Y el paso de uno a otro requiere unas condiciones econ&oacute;micas y empresariales (dando por supuesto que la parte t&eacute;cnica es v&aacute;lida) que lo va a hacer muy, muy dif&iacute;cil.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- El mundo del videojuego ser&aacute; igual que por ejemplo el del cine. As&iacute; siempre habr&aacute; sitio para proyectos de menor envergadura, como ser&iacute;a el caso de las producciones para TV o para consumo local, y que ser&aacute;n buenos lugares de formaci&oacute;n para proyectos de m&aacute;s entidad.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Para m&iacute; que con la Internet, eso del mercado interno est&aacute; dejando de tener sentido. Yo creo que la salida para los peque&ntilde;os desarrollos es hacer juegos de nicho, m&aacute;s orientados a un peque&ntilde;o grupo social o de gustos dentro de los jugadores de todo el mundo que a un peque&ntilde;o mercado geogr&aacute;fico como es el espa&ntilde;ol (aprendamos del caso &quot;Deer Hunter&quot;). A m&iacute; me parece muy interesante la idea de centrarse en desarrollos peque&ntilde;os, de nicho pero internacionales, y luego usar la Internet como medio de distribuci&oacute;n y el &quot;shareware&quot; como v&iacute;a de ingresos. Se necesita muy poca infraestructura para hacer esto, y hay gente por ah&iacute; que se est&aacute; forrando. Aunque no es un videojuego, ¿hab&eacute;is pensado en lo que se est&aacute; llevando el que hizo el WinAMP? En cualquier caso, estoy muy de acuerdo con Antonio Arteaga, el fundador de Stratos, cuando dice que hay que dejar de hacer juegos de boina y tortilla de patatas, y pensar internacionalmente. Tambi&eacute;n cuando se trabaja en un proyecto de peque&ntilde;o tama&ntilde;o.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>En la entrevista realizada a P&eacute;ndulo Studios, Ram&oacute;n Hern&aacute;ez opinaba que en Espa&ntilde;a nunca ha existido una industria de desarrollo de videojuego como tal. Realmente, raz&oacute;n no le falta sin embargo, en un plazo de dos a&ntilde;os m&aacute;ximos coincido en las predicciones que nos hac&iacute;a el autor del DIV Games Studio, Daniel Navarro, que situaba el potencial de desarrollo de videojuegos global de nuestro pa&iacute;s a la altura de pa&iacute;ses como Francia ¿Cu&aacute;l es vuestra opini&oacute;n al respecto?, ¿tenemos en Espa&ntilde;a esa industria del videojuego que tanto citamos o a&uacute;n es necesaria una mayor madurez en el mercado (o de ciertos sectores del mercado)?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Estoy de acuerdo en que no existe industria. De hecho, el &uacute;nico desarrollador con consideraci&oacute;n internacional somos nosotros. Pero si existe potencial, aunque no me atrever&iacute;a a comparar su tama&ntilde;o, creo que lo tendremos que ir demostrando a cada paso. Nosotros ya hemos dado el primer paso, ahora hace falta que otras iniciativas tambi&eacute;n triunfen, eso podr&iacute;a significar el comienzo de la industria y de la aparici&oacute;n de capital humano y econ&oacute;mico como para conseguir cierta proyecci&oacute;n.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo creo que el mercado espa&ntilde;ol todav&iacute;a est&aacute; muy lejos de alcanzar el nivel de Francia, nivel que desde mi punto de vista no alcanzaremos de forma global hasta dentro de por lo menos 5 a&ntilde;os. Todav&iacute;a hace falta mucha madurez desde el punto de vista tanto empresarial como de desarrollo. Al contrario de lo que opina Ram&oacute;n Hern&aacute;ez, yo creo que en Espa&ntilde;a existi&oacute; una industria en los 80 que posteriormente desapareci&oacute; ya que no fue capaz de adaptarse a los cambios necesarios para competir en los 90. Creo que en los pr&oacute;ximos a&ntilde;os veremos surgir distintas iniciativas de producci&oacute;n y desarrollo buscando reproducir el &eacute;xito de Commandos, pero que en general necesitar&aacute;n madurar porque carecer&aacute;n de una base suficiente.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J .F</B></FONT><FONT FACE="Arial" SIZE=2>- Hombre, en la &eacute;poca dorada de Opera y Dinamic, se pod&iacute;a hablar de industria. Ahora es un momento en el que se debe consolidar un mercado de producci&oacute;n, pero ha de hacerse con una proyecci&oacute;n exterior. Si es s&oacute;lo interior y no por parte de todos los integrantes del sector, volveremos al comienzo de los 90.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- No entiendo por qu&eacute; vinculas el tener una industria o no a la madurez del mercado. Si te refieres a que los que compran juegos tengan prejuicios contra el software espa&ntilde;ol, no estoy de acuerdo. Creo que cuando se hace algo realmente bueno nadie se fija en su procedencia. Quienes s&iacute; tienen que cambiar el chip son los empresarios que se plantean abrir un negocio de desarrollo de videojuegos de los que se venden a siete mil pesetas y creen que con una inversi&oacute;n de dos millones de pesetas y mucha ilusi&oacute;n ya lo tienen todo hecho. Esos s&iacute; que tienen que madurar.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Cu&aacute;l es vuestro juego preferido de todos los tiempos, el proyecto en el que os hubiera gustado estar involucrados?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Civilizaci&oacute;n II. Creo que es una aut&eacute;ntica obra maestra.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Civilizaci&oacute;n ser&iacute;a el primero pero despu&eacute;s vendr&iacute;an otros como las series de Ultima y Final Fantasy, el Pitfall de Atari 2600, Wolfenstein 3D, Doom, etc...</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- No s&eacute; que contestar. Hay tantos juegos geniales a lo largo de la historia que un d&iacute;a se piensa en uno hasta que recuerdas otro.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Me hubiera gustado estar al lado de Shigeru Miyamoto en cualquiera de sus proyectos. Y, ya puestos a pedir, en &quot;Legend of Zelda&quot;. Habr&iacute;a procurado que se me pegara algo de la capacidad de Miyamoto para hacer que al jugador se le despierte el ni&ntilde;o que lleva dentro.</P>

<P ALIGN="JUSTIFY"></P>

</FONT>

<center>

<table>

<td width="400"><table CELLPADDING=0 CELLSPACING=0 >

<td ><img src="jpg/pwork4.jpg"></td>

<td valign="bottom"><img src="jpg/pwork5.jpg"></td>

</table></td>

<tr>

<td width="400"><center><font face=arial size=1 color="#cc0000">Y para terminar con todas éstas estupendas capturas que nos han regalado en Pyro, éstas que pertenecen al proyecto

que lleva César Astudillo. Uhmmm, esto me huele a aventura...</font></center></td>

</table>

</center>



<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Y la casa o desarrollador por el que sint&aacute;is una admiraci&oacute;n especial?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Creo que como desarrollador en t&eacute;rminos globales es Lucas Arts el ejemplo a seguir. La calidad de sus productos, su seriedad y sus planteamientos de Marketing les han hecho ganarse un respeto enorme en la industria. </P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Lucas Arts, Peter Molineaux, Geoff Crammond, Sid Meier, y &uacute;ltimamente los grandes equipos japoneses.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- ¿PYRO no vale? 8-) Pues admiro a muchos. Vamos a ver: Del pasado remoto, a Vortex y a su genial creador de juegos Costa Panayi. Del pasado reciente, al Lucas de Monkey Island II. Y del presente, a esos monstruos alien&iacute;genas de id... Y a todos los grandes y peque&ntilde;os h&eacute;roes que terminan un juego sin morir en el intento.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">Fa</B></FONT><FONT FACE="Arial" SIZE=2>- Bueno, yo te contestar&iacute;a algo parecido a la pregunta anterior.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>¿Cu&aacute;l ha sido el &uacute;ltimo t&iacute;tulo con el que hab&eacute;is estado jugando?.</P>

</I></FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Half Life, es muy bueno.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Half Life, Baldur´s Gate, European Air War, etc...</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Me temo que s&oacute;lo puedo hablar de los que veo que salen nuevos, jugar por jugar, con el &quot;Need For Speed III&quot;, mis &quot;pertus&quot; al Quake, ¡c&oacute;mo no!</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Yo tambi&eacute;n me he dejado llevar por la fiebre Half Life. En modo monojugador, y en ocasiones, es realmente el Quake al que yo siempre hab&iacute;a querido jugar.</P>

<P ALIGN="JUSTIFY"></P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM</B></FONT><FONT FACE="Arial" SIZE=2>.- <I>Much&iacute;simas gracias por concedernos esta larga entrevista. Ha sido todo un honor. Espero que haya servido, sobre todo, para animar a todos los &quot;colegas&quot; que deseen introducirse en esta industria del entretenimiento a seguir adelante mediante el trabajo duro porque si uno se toma en serio lo que hace y pone todo su empe&ntilde;o, lo dem&aacute;s viene &quot;s&oacute;lo&quot;.</P>

<P ALIGN="JUSTIFY">Lo dicho, un placer aprender de vosotros. Si quer&eacute;is dejar algunas &uacute;ltimas palabras para los lectores de Macedonia, el &quot;micr&oacute;fono&quot; es todo vuestro. Un gran abrazo.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#0000ff"><P ALIGN="JUSTIFY"></P>

</I><P ALIGN="JUSTIFY">J. P.</B></FONT><FONT FACE="Arial" SIZE=2>- Gracias por todo, y para terminar s&iacute; me gustar&iacute;a decirles a todos aquellos que sue&ntilde;en con los juegos que no se desanimen y que tengan ilusi&oacute;n. Triunfar es posible viniendo de la nada, eso si, requiere mucha dedicaci&oacute;n, mas trabajo y constancia a montones.</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">I. P.</B></FONT><FONT FACE="Arial" SIZE=2>- En la industria de los videojuegos hay sitio para futuros profesionales. Eso s&iacute;, para llegar hace falta dedicaci&oacute;n, entusiasmo, pasi&oacute;n, y paciencia. Que la gente se olvide del &eacute;xito inmediato. &Eacute;ste s&oacute;lo llega despu&eacute;s de grandes dosis de esfuerzo e incluso de decepciones y fracasos. Por eso la vocaci&oacute;n es el &uacute;nico compa&ntilde;ero de viaje que garantiza el &eacute;xito. </P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">J. F.</B></FONT><FONT FACE="Arial" SIZE=2>- Bueno supongo que los dem&aacute;s ya dir&aacute;n casi todo lo que yo quer&iacute;a decir, as&iacute; que: Saludos a los colegas, a mi Mam&aacute; que me estar&aacute; viendo. ¡Agust&iacute;n, a ver si llamas!</P>

</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff00ff"><P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">C. A.</B></FONT><FONT FACE="Arial" SIZE=2>- Un abrazo, Fernando, y no me quiero quedar sin repetir que siempre estamos buscando gente, y que todo aqu&eacute;l que quiera trabajar en un equipo donde se unen la profesionalidad y la ilusi&oacute;n, se mire nuestras ofertas de trabajo: (<a href="http://www.pyrostudios.com/trabajo.htm" target="_new">http://www.pyrostudios.com/trabajo.htm</a>)</P></FONT>

<P ALIGN="JUSTIFY"></P>



<HR WIDTH="200">

<center><table width="400">

<td><font size=2 face=arial><A HREF="epyro2.htm"><center>Página Anterior (2/3)</center></a></font></td>

<td align="right"><font size=2 face=arial></font></td>

</table></center>

<HR WIDTH="400">

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>

<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>



<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>

