<HTML>
<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Entrevista a José Vicente Pons
</FONT>
</H3>


<p align=justify>

<FONT color="#000000" size=2 face="arial" >        
<P ALIGN=JUSTIFY>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Tal y como suced&iacute;a el mes pasado, volvemos a entrevistar a uno de los grupos de desarrollo independientes de mayor proyecci&oacute;n dentro de Espa&ntilde;a; <B>Exelweiss</B>.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Jos&eacute; Vicente Pons</B>, es el jefe de desarrollo de este grupo valenciano. En esta entrevista veréis que queda patente la tenacidad y la ilusi&oacute;n de este veterano del soft patrio que, ya desde principios de los a&ntilde;os 80, comenz&oacute; a introducirse en el "mundillo". Su paso por casas tan importantes como Opera y su continuo af&aacute;n por conseguir, a trav&eacute;s de sus numerosos proyectos, que el software de entretenimiento, en Espa&ntilde;a, no se estancara, son hechos dignos de admirar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero esta entrevista pretende, sobre todo, demostrar que existe una prometedora presencia del desarrollo independiente en nuestro pa&iacute;s y que debemos de cuidar de ella. Estos grupos ser&aacute;n, a corto plazo, los que decidan si el florecimiento del software de entretenimiento español es algo particular o un hecho generalizado. Ellos tienen la responsabilidad de lograr hacerse un hueco y nosotros la de que apoyarles incondicionalmente.</P>
<P ALIGN="JUSTIFY"></P>
<P>Muchas gracias, José, por tu presencia a lo largo de toda la historia de Macedonia.</P>
</FONT><hr>

<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">Macedonia Magazine</B></FONT><FONT FACE="Arial" SIZE=2>.- Aunque parezca mentira, el software independiente comienza a recuperar el peso de anta&ntilde;o. Sin embargo, la calidad de estos productos no es casual. Quiz&aacute;s, las creaciones independientes con m&aacute;s posibilidades siguen siendo aquellas que est&aacute;n arropadas por veteranos desarrolladores como t&uacute;. ¿Nos podr&iacute;as hablar de tus or&iacute;genes en el mundo inform&aacute;tico y de lo que fue tu posterior contacto con todo lo que es la creaci&oacute;n de videojuegos?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">Jos&eacute; Vicente Pons</B>. – </FONT><FONT FACE="Arial" SIZE=2>Desde que mi memoria llega a recordar, siempre me ha llamado el mundo inform&aacute;tico. En los tiempos en que los Mainframes dominaban el mundo, cerca del jur&aacute;sico, ya hice mis pinitos en la inform&aacute;tica con un curso de RPG II para los S/400. M&aacute;s tarde adquir&iacute; una Ti-57 programable con 57 estados de memoria (¡una pasada!), e intente encontrar la piedra filosofal convirtiendo el plomo en oro. Quer&iacute;a encontrar una formula matem&aacute;tica que se pudieran conseguir los ¡14! con un peque&ntilde;o desembolso. Por aquel entonces, sali&oacute; un anuncio de una maquina con 1K de RAM que se pod&iacute;a programar. Por supuesto, me enamor&eacute; de ella, y como estaban cerca los Reyes; les escrib&iacute; para que tuvieran la deferencia de dej&aacute;rmela. Llego el 6 de enero y no pude dormir ;). Como en mis a&ntilde;os mozos; me levant&eacute; temprano y en el comedor, entre todos los paquetes envueltos; hab&iacute;a uno que sobresal&iacute;a; ¡mi maquina!. Nervioso empec&eacute; a destapar el paquete y ¡oh! ¡¿Qu&eacute; es esto?!. Un Spectrum a color con 16k de RAM. ¿Pero, exist&iacute;a tal pedazo de maquina?. No lo pude resistir. Cog&iacute; los cables los enganche al TV y pronto sali&oacute; la pantalla de bienvenida. Empec&eacute; a pulsar teclas como un loco y horror, la l&iacute;nea central del teclado no funcionaba. Fue el d&iacute;a mas largo esperando para ir al almac&eacute;n a que me lo cambiaran. All&iacute; me ocurri&oacute; una an&eacute;cdota curiosa. Al preguntar al dependiente que si tendr&iacute;a bastante con mis 16k me contesto que no me los terminar&iacute;a en la vida (que visi&oacute;n de futuro ten&iacute;a aquel hombre). Una semana mas tarde ya estaba ampliando a 48k.</P>
<P ALIGN="JUSTIFY"></P>
<center>
<img src="jpg/exel01.jpg">
</center>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY"><b>MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Corr&iacute;a la segunda mitad de la d&eacute;cada los 80 y el panorama de producci&oacute;n espa&ntilde;ol era realmente potente. Tanto desde el punto de vista de casas editoras como desde el punto de vista de grupos independientes y freelances. Jos&eacute;, com&eacute;ntanos tu paso por la &eacute;poca de los 8 bits desde el comienzo hasta la creaci&oacute;n de Comix.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Comix. Fue la &uacute;ltima &eacute;poca de desarrollo espa&ntilde;ol de 8 bits. Primero estuve haciendo software barato; aquellos tan famosos SPE (software de programadores espa&ntilde;oles). Luego estuve en Opera. M&aacute;s tarde a punto de unirme con AD. Por &uacute;ltimo, fund&eacute; Comix. All&iacute; se hicieron las &uacute;ltimas muestras del software espa&ntilde;ol, en aquellos tiempos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT>
<table width="150" align="right"> 
<td><img src="gif/exel06.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Portada de "La Fuga"</center></font></td> 
</table> 
<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> En la entrevista a Pyro Studios, C&eacute;sar Astudillo nos comentaba que los obst&aacute;culos para entrar ahora en la industria no son tan complicados como, a primera vista, pudieran parecer. El hecho de que exista Internet como plataforma de colaboraci&oacute;n e intercambio de informaci&oacute;n, propicia que cada vez m&aacute;s personas tengan un punto claro de partida. ¿C&oacute;mo se las ingeniaba un desarrollador de la &eacute;poca de los 8 bits, para poder ir aprendiendo las t&eacute;cnicas de creaci&oacute;n de videojuegos?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>En eso Cesar tiene toda la raz&oacute;n. Nosotros ten&iacute;amos muchas dificultades para obtener informaci&oacute;n. Menos mal que Micro Hobby primero, y despu&eacute;s algunas otras; paliaron en parte este grave problema de documentaci&oacute;n. Hab&iacute;a m&aacute;s paginas dedicadas a la programaci&oacute;n en aquella &eacute;poca, que en todas las revistas actuales. Si bien, aunque con Internet ha mejorado un poco esto, el problema sigue ah&iacute; pues no todo el mundo tiene Internet, y por supuesto, no todos tienen un buen nivel de ingl&eacute;s. Hay que tener en cuenta que los futuros programadores son muy j&oacute;venes y la informaci&oacute;n tampoco es tanta. A todo esto, hay que considerar que el 99% de los libros son manuales de referencia a programas y no de programaci&oacute;n en s&iacute;, siendo imposible hallar libros, en castellano, sobre el desarrollo exclusivo de videojuegos</FONT><FONT FACE="Arial" SIZE=2 COLOR="#800080">.</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿Eres capaz, a d&iacute;a de hoy, de trazar alg&uacute;n tipo de paralelismo entre los a&ntilde;os 80 y los actuales?, es decir, ¿crees que puede haber algo que conserven en com&uacute;n, desde el punto de vista del desarrollo, los a&ntilde;os 1989 y 1999?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT>

<table width="300" align="left"> 
<td><img src="jpg/exel02.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Aquí tenéis el "Sleep Walker", un título que promete calidad y, sobre todo, originalidad.</center></font></td> 
</table> 
<B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Creo que es bastante dif&iacute;cil establecer alg&uacute;n tipo de paralelismo entre las dos d&eacute;cadas. Quiz&aacute;s, el &uacute;nico factor com&uacute;n sea el de la ilusi&oacute;n, que siempre ha existido entre los desarrolladores de videojuegos. Ahora los grupos tienen que poseer especialistas en todos los campos, cosa que antes no suced&iacute;a. Facetas como el grafismo o la m&uacute;sica, han sido relanzadas e incluso, en algunos proyectos; eclipsan el apartado de programaci&oacute;n. Solo los dise&ntilde;adores est&aacute;n por encima de todos. Los dem&aacute;s campos se han equiparado.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Tras el ocaso de la producci&oacute;n espa&ntilde;ola, supongo que los que m&aacute;s golpes recibisteis fuisteis vosotros, es decir, los que pertenec&iacute;ais a alg&uacute;n grupo de desarrollo independiente. Una vez me coment&oacute; Jos&eacute; Ram&oacute;n Palacios, miembro de la desaparecida Gamesoft (Comando Quatro) que la cancelaci&oacute;n de pagos les pill&oacute; justo cuando iban a mandar su segunda remesa de juegos, de tal forma que el varapalo que sufrieron sesg&oacute; sus posibilidades de continuidad. Algo parecido ocurri&oacute; con el grupo Aventuras AD. ¿C&oacute;mo recuerdas esa etapa dentro de Comix.?</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> S&iacute;, Comix no iba a ser menos. Adem&aacute;s de perder algunos pagos, lo que mas me doli&oacute; fue que el &uacute;ltimo juego, &quot;Golden Basket&quot;, era retenido en los almacenes debido a que hab&iacute;a otro titulo de UK sobre mismo tema. A&uacute;n as&iacute;, este titulo vendi&oacute; bastantes copias. Pero todo dio a entender que el software estaba K.O.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2>¿Cu&aacute;l es el momento de mayor satisfacci&oacute;n que recuerdas?, ¿la creaci&oacute;n de Comix?; ¿la publicaci&oacute;n de vuestro primer juego?, ¿la elecci&oacute;n de Ulises como uno de los juegos seleccionados para el torneo Europeo de &quot;jugones&quot;?...</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>En Comix fue el ver que nos val&iacute;amos por nuestros propios medios. Pero el momento de mas satisfacci&oacute;n se dio en Opera, que se fue a juntar con el hecho de que, mi primer juego, &quot;Ulises&quot;, era publicado con una gran acogida y, adem&aacute;s, elegido para el torneo de jugones. Te da una gran satisfacci&oacute;n ver que t&uacute; trabajo es reconocido y es publicado en las portadas de todas las revistas del sector.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Supongo que la dedicaci&oacute;n total y absoluta a la creaci&oacute;n de videojuegos, al comenzar 1990/91, no pudo sostenerse. Despu&eacute;s s&iacute; se pudo, al menos, intentar trabajar con alguna garant&iacute;a de &eacute;xito. ¿C&oacute;mo fue tu caso en concreto Jos&eacute;?, es decir, ¿en qu&eacute; momento vuelves a tomar la iniciativa y creas un grupo independiente de nombre Exelweiss.?</P>
<P ALIGN="JUSTIFY"></P>
</FONT>
<center><table width="225"> 
<td><img src="jpg/exel03.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>"Oxide", un shoot'em up, fue el primer juego editado por Exelweiss.</center></font></td> 
</table> </center>

<B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Nunca se sabr&aacute; si hicimos bien en dejarlo o desviar los esfuerzos hacia otros temas de programaci&oacute;n (sin olvidar el de los videojuegos). Siempre lo he pensado. Era una l&aacute;stima ver deshacerse a Opera con el gran conjunto de desarrolladores que ten&iacute;a;. incluso desarrolladores de gesti&oacute;n. Siempre me he preguntado lo que hubiera pasado si hubi&eacute;ramos seguido buscando salida por otros campos como, por ejemplo, UK o USA, amold&aacute;ndonos a las nuevas m&aacute;quinas que entraban... La verdad es que nadie lo intent&oacute;. M&aacute;s tarde, cuando las aguas volvieron a su cauce, algunos lo hemos intentado otra vez. De ah&iacute; el florecimiento actual que espero contin&uacute;e.</P>
</FONT><FONT SIZE=2><P>&#9;</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.- </B></FONT><FONT FACE="Arial" SIZE=2>Bajo el sello Exelweiss ya llev&aacute;is publicados unos cuantos trabajos. Algunos han sido distribuidos en revistas y otros, de car&aacute;cter m&aacute;s ambicioso, esperan su salida de forma inminente. ¿Qu&eacute; nos puedes contar de todo lo que ha sido, hasta ahora, la &quot;aventura Exelweiss&quot;?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Si el conseguir reunir un grupo de personas con la condici&oacute;n de no cobrar un duro, durante todo el tiempo que dure el proyecto es dif&iacute;cil, m&aacute;s lo es el encontrar una distribuidora seria que quiera publicar tus trabajos. No es dif&iacute;cil (dentro de un orden) el encontrar una publicaci&oacute;n en revista. Aunque estas exigen una calidad alt&iacute;sima para lo poco que valoran o pueden valorar econ&oacute;micamente. Pero claro, esto no cubre los gastos de todo el tiempo empleado y tienes que buscar otros caminos, casi siempre fuera de Espa&ntilde;a. Las conversaciones se hacen largu&iacute;simas (en ello estamos nosotros ahora). Supongo que una vez puesta la primera piedra, todo ser&aacute; mucho mas f&aacute;cil.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Aunque citamos continuamente la existencia de multitud de grupos independientes en Espa&ntilde;a, nos olvidamos de puntualizar varios aspectos. Primero, que muy pocos son los que pueden dedicar de forma total al tema y, por lo tanto, contar con garant&iacute;as de &eacute;xito de cara a la publicaci&oacute;n. Y segundo, que pocos cuentan con una experiencia real (haber publicado t&iacute;tulos antes) que avalen todo el trabajo que est&eacute;n invirtiendo. Realmente, casos que re&uacute;nan las condiciones anteriores se cuentan con los dedos de una mano. ¿Cu&aacute;l es, Jos&eacute;, el camino que ha de seguir un grupo de cuatro o cinco personas con conocimientos y dispuestos a arriesgar un a&ntilde;o de trabajo y dinero para poder aspirar a vivir de la creaci&oacute;n de software de entretenimiento?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Lo ideal, seria el encontrar el caballo blanco; encontrar una publicadora que se arriesgara y creyera en nuestro trabajo. Pero ¿cu&aacute;l es nuestro trabajo si aun no hemos hecho ninguno?. Luego, ¿qu&eacute; publicador se arriesga en creer en el proyecto de un grupo que no ha hecho nada hasta el momento? Y, a su vez, ¿qu&eacute; grupo puede arriesgarse a realizar algo que ha de poseer mucha calidad, tiempo, trabajo y gastos?. Vamos, la pescadilla que se muerde la cola. </P>
<P ALIGN="JUSTIFY">Ya hemos visto la &quot;deserci&oacute;n&quot; que ha habido en los grupos actuales donde sus m&aacute;s preciados valores, se han marchado para ingresar en las dos grandes compa&ntilde;&iacute;as actuales: Pyro y Dinamic. En cambio, no hay ninguna ayuda para poder seguir fomentando nuevos valores de cantera. De lo cu&aacute;l se deduce la continua creaci&oacute;n de peque&ntilde;os grupos de desarrollo, el abandono de proyectos, el hacer algo s&oacute;lo por hobby o, c&oacute;mo no, el aprender algo para poder llegar alg&uacute;n d&iacute;a a formar parte de estas desarrolladoras. Sin embargo, todo esto acaba con la p&eacute;rdida de la ilusi&oacute;n por lograr alg&uacute;n d&iacute;a algo grande. Y si se mata la ilusi&oacute;n.......</P>
</FONT><FONT SIZE=2><P>&#9;</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Y, desde el punto de vista personal, ¿qu&eacute; te parece la idea de una virtual de fusi&oacute;n entre los grupos independientes m&aacute;s importantes de Espa&ntilde;a (realmente, los grupos destacados de Stratos) con el fin de crear una plataforma nueva de cara a la producci&oacute;n triple A?. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Muy complicada. El car&aacute;cter espa&ntilde;ol es muy independiente y dif&iacute;cilmente se encuadrar&iacute;a (de verdad) en un proyecto multitudinario (sin cobrar). La idea es: &quot;si no me pagan, hago lo que yo quiero y no me impone nadie nada&quot;. Si ya es dif&iacute;cil controlar a integrantes del grupo de la misma ciudad, no veas de diferentes.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><table width="200" align="left"> 
<td><img src="jpg/exel04.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>"Empire Wars" es uno de los productos en los que Exelweiss tiene despositadas grandes esperanzas.</center></font></td> 
</table> 
<B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Uno de los puntos m&aacute;s interesantes de la entrevista realizada por Jos&eacute; Antonio Albero &quot;PTS&quot;, a Nacho Garc&iacute;a de Mixt Dimensi&oacute;n (n&uacute;mero 8 de Macedonia), es el referente al teletrabajo. Nacho Garc&iacute;a, se consideraba un firme defensor del mismo. La verdad es que el equipo mismo de Macedonia funciona gracias al teletrabajo sin embargo, a medida que las tareas aumentan de complejidad, el margen de error del teletrabajo lo hace de forma exponencial. ¿Cu&aacute;l es t&uacute; opini&oacute;n al respecto?. ¿No crees que como primer paso es una plataforma ideal pero que, una vez que se requiere trabajo m&aacute;s duro y una total integraci&oacute;n del equipo, puede no resultar seguro?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> Siempre volvemos a lo mismo. Si &eacute;ste es de un trabajo pagado, puede funcionar. Pero si no, es muy complicado. Ah&iacute; tienes la cantidad de trabajo que hay ahora de desarrolladores en Espa&ntilde;a: Dinamic, Pyro, Ubi, Bit Manager, Rebel act, etc... y todas quieren trabajo &quot;in situ &quot;. O sea, que se habla del teletrabajo pero para los dem&aacute;s.</P>
</FONT><FONT SIZE=2><P>&#9;</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿Qu&eacute; piensas acerca de crear una especie de &quot;party&quot;, al estilo de la Euskal, pero restringida a los creadores independientes de videojuegos en Espa&ntilde;a?. En otras palabras, ¿Crees que ya es hora de que alguna entidad se atreva a llevar la organizaci&oacute;n de un &quot;Millia espa&ntilde;ol&quot;?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> Que ya se tarda en hacer. A&uacute;n recuerdo que Hobby Press hac&iacute;a una cosa parecida y daba una especie de oscars (joystics) y nos lo pas&aacute;bamos muy bien. Adem&aacute;s, por un d&iacute;a, nos reun&iacute;amos todos. Pero ¿qui&eacute;n podr&iacute;a hacer esto?. Solo se me ocurre el mismo de antes..</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> En la actualidad, las 3D han sido impuestas en cualquier juego que aspire a tener car&aacute;cter comercial (entendiendo por comercial, aquel que va avalado de una fuerte campa&ntilde;a publicitaria, no de una necesaria calidad). ¿Cu&aacute;l es tu opini&oacute;n personal sobre todo el ambiente reinante entorno al tema?. ¿Crees que se ha atacado de forma excesiva a las 3D o que ha sido una imposici&oacute;n al desarrollador un poco injusta?... ¿Qui&eacute;n ganar&aacute; al final la batalla, el dise&ntilde;o de juegos y la justificaci&oacute;n tecnol&oacute;gica o la locura comercial?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> Yo creo que ha sido una imposici&oacute;n al desarrollador. Es como la moda y cuando los dise&ntilde;adores de la misma se escudan en que es lo que pide la gente. Esto es una falacia, pues la gente compra lo que hay en las tiendas y son ellos los que marcan la moda. As&iacute;, en los videojuegos ha pasado lo mismo. Lo que han marcado los dise&ntilde;adores de las grandes desarrolladoras es lo que hay y los publicadores se han empecinado en esto sin mirar si un producto es, o no, jugable. S&oacute;lo buscan 3D, 3D y 3D. Tan s&oacute;lo las publicadoras independientes sacan alg&uacute;n producto que no lo es (al ser ellos los que se lo guisan y se lo comen, hacen lo que les apetece). Un equipo que este supeditado a encontrar publicador, no tiene mas narices que ajustarse a los varemos establecidos por la moda actual. Toda la palabrer&iacute;a sobre la poca imaginaci&oacute;n y originalidad en los videojuegos es siempre de puertas afuera.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.- </B></FONT><FONT FACE="Arial" SIZE=2>¿Qui&eacute;nes son las personas que integran Exelweiss y cu&aacute;les sus puestos respectivos?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> El grupo base de Exelweiss est&aacute; formado por:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY">
<LI>Programaci&oacute;n: <B>Jos&eacute; Vicente Sala</B> y <B>Carles Pons</B></LI>
<LI>Gr&aacute;ficos: <B>Daniel Garc&iacute;a</B>, <B>Roberto Menc&iacute;a</B>, <B>Jordi Pastor</B>, y <b>Victor Vergara</b></LI>
<LI>M&uacute;sica: <B>V&iacute;ctor Vergara</B></LI>
<LI>Web: <B>Jos&eacute; A. Mart&iacute;nez</B></LI>
</UL>

<P ALIGN="JUSTIFY">Un servidor se encarga de coordinar a todo el equipo y de llevar la programaci&oacute;n central de los desarrollos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿Ten&eacute;is a freelances &quot;revoloteando&quot; por el grupo o, por el contrario, todo el trabajo est&aacute; realizado por las personas que forman el equipo interno?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.</B></FONT><FONT FACE="Arial" SIZE=2>- He intentado alguna vez tener alg&uacute;n freelancer pero nunca ha resultado. El m&iacute;nimo control que puedes ejercer sobre &eacute;l y la falta de motivaci&oacute;n al pasar las jornadas, dirige todo a una poca o nula cooperaci&oacute;n desembocando, m&aacute;s tarde, en ruptura total. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿Qu&eacute; nos puedes contar de los t&iacute;tulos que est&aacute;n por venir de Exelweiss?. ¿Cu&aacute;ndo podr&aacute;n estar disponibles para el p&uacute;blico? y ¿cu&aacute;l es el t&iacute;tulo con el que esper&aacute;is obtener m&aacute;s &eacute;xito?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.—</B></FONT><FONT FACE="Arial" SIZE=2>De los que tenemos ya terminados, es un goteo de peque&ntilde;as distribuciones. De los que est&aacute;n a punto, s&iacute; que esperamos obtener unos beneficios aceptables y. en los pr&oacute;ximos por lo menos llegar a un nivel estable de comodidad financiera que nos permita no pasar agobios a la hora de planificar el desarrollo y dise&ntilde;o de los siguientes</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Supongo que Stratos volver&aacute; a llevar el tema de la distribuci&oacute;n, ¿verdad?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.</B></FONT><FONT FACE="Arial" SIZE=2>- Mientras contin&uacute;e en la l&iacute;nea ascendente que parece que se ha marcado, no veo ning&uacute;n problema en ello.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿En Exelweiss sois partidarios de la pol&iacute;tica que consiste en realizar varios t&iacute;tulos por temporada o, por el contrario, cre&eacute;is que es preferible arriesgarse al &quot;todo o nada&quot; con una &uacute;nica producci&oacute;n?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.- </B></FONT><FONT FACE="Arial" SIZE=2>Es muy complicado desarrollar m&aacute;s de un titulo por temporada, a no ser que &eacute;ste se piense como producto de &quot;serie baja&quot;. De todas formas, el ahorro de tiempo de desarrollo no compensa a la calidad final del mismo. Un proyecto de calidad &quot;C&quot; lleva casi el mismo tiempo de desarrollo de uno de calidad &quot;A&quot;. Las Calidades &quot;AAA&quot; son un mundo aparte. Si es &quot;A&quot;, s&iacute; que vale la pena volcar todos los recursos a un solo titulo. Estamos hablando de un grupo, no de una publicadora con cantidad de desarrolladores trabajando para ella.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Para que nos hagamos una idea Jos&eacute;. ¿Cu&aacute;nto tiempo ven&iacute;s a invertir en Exelweiss en el proceso de dise&ntilde;o de vuestros juegos?, m&aacute;s a&uacute;n, ¿c&oacute;mo es vuestro particular proceso de creaci&oacute;n de un juego?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT>
<center><table width="300"> 
<td><img src="jpg/exel05.jpg"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Ilustración perteneciente a lo que será el próximo proyecto de Exelweiss, "Escudo". Un título que tiene muy buena pinta.</center></font></td> 
</table> </center>

<B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> En el dise&ntilde;o siempre se tarda menos de lo que se debiera, pues cada d&iacute;a de dise&ntilde;o, ahorra una semana, o m&aacute;s, de codificaci&oacute;n y grafismo. De momento, tardamos unos 15 d&iacute;as en preparar algo tangible, luego de las 3 &oacute; 4 reuniones para recoger lo que, en UK, llaman tormenta de ideas. Despu&eacute;s de la selecci&oacute;n de ideas, el dise&ntilde;ador se pasa una semana esbozando el dise&ntilde;o a grandes rasgos. Con esto definido, y junto con el dise&ntilde;ador gr&aacute;fico, se finaliza el conjunto de gr&aacute;ficos y el dise&ntilde;o del producto que podr&iacute;a llevar el proyecto final. Por supuesto, no llegamos a los story-boards ni a dise&ntilde;os iniciales. Ser&iacute;a muy costoso para nosotros, de momento (el poder hacerlo, ser&iacute;a lo ideal). Esto se reparte a los directores de proyecto que son los que distribuyen el trabajo para los coders y los grafistas.</P>
</FONT><FONT SIZE=2>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Y, actualmente, ¿a qu&eacute; juego est&aacute;s &quot;enganchado&quot; entre codificaci&oacute;n y codificaci&oacute;n?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> No soy de los jugones empedernidos, pero hago mis pinitos. Actualmente llevo dos productos a retortero, uno es &quot;Comandos&quot; y el otro &quot;Ages of Empires&quot;. Estoy esperando las segundas partes de los dos, pues prometen ser una pasada. Tambi&eacute;n me gusta &quot;Caesar III&quot;. Los juegos 3D tipo &quot;Quake&quot; y dem&aacute;s los veo bien para jugar en red con amigos y tal sin embargo, las horas que te hace pasar &quot;Comandos&quot; para encontrar una t&aacute;ctica buena que te haga pasar la fase, no te lo dan los dem&aacute;s. De hecho, los 3D en primera persona no pasan de ser un plataformas de los antiguos 8bits remodelados y un mata - mata con t&eacute;cnica 3D.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> ¿Cu&aacute;l es la compa&ntilde;&iacute;a y desarrollador por el que sientes una especial admiraci&oacute;n?. ¿En qu&eacute; proyecto te hubiera encantado participar?.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> BLIZZARD. Me gustar&iacute;a participar en Warcraft III si alg&uacute;n d&iacute;a se llevara a cabo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.- </B></FONT><FONT FACE="Arial" SIZE=2>¿Cu&aacute;l es t&uacute; juego preferido de todos los tiempos?</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.-</B></FONT><FONT FACE="Arial" SIZE=2> Aunque suene un poco a patriota, &quot;La Abad&iacute;a&quot; es el juego que innov&oacute; y no fue reconocido como mundialmente se merec&iacute;a. Los juegos de Ultimate tambi&eacute;n me dejaron huella. Pero el que m&aacute;s me marc&oacute; fue &quot;Ant Attack&quot; con sus gr&aacute;ficos construidos en tiempo real en isom&eacute;trica y con cuatro vistas. Los gr&aacute;ficos no eran muy buenos, pero la t&eacute;cnica para aquella &eacute;poca era bestial. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#008000"><P ALIGN="JUSTIFY">MM.-</B></FONT><FONT FACE="Arial" SIZE=2> Pues, hasta aqu&iacute;, nada m&aacute;s Jos&eacute;. Simplemente darte las gracias no s&oacute;lo por esta entrevista, sino por el largo tiempo (realmente desde el principio) que llevas en contacto con Macedonia. Esperamos que los juegos que van a salir bajo el sello Exelweiss vendan un mont&oacute;n por su originalidad y calidad. </P>
<P ALIGN="JUSTIFY">Si quieres dejar algunas palabras para los lectores del fanzine y para los propios aspirantes a desarrollador, tienes el espacio que quieras. Un abrazo Jos&eacute;.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#800080"><P ALIGN="JUSTIFY">J.V.P.</B></FONT><FONT FACE="Arial" SIZE=2>- Pues seguid visitando Macedonia, la mejor revista electr&oacute;nica que conozco. Y para los futuros desarrolladores que no desesperen, que todo lo que se aprende vale y que cuando m&aacute;s te cueste conseguirlo, m&aacute;s satisfacci&oacute;n tendr&aacute;s cuando se realice. Un abrazo a todos.</P></FONT>

<center>
<Font face=arial size=2 color="#cc0000">
Podéis saber más sobre futuros proyectos e historia de Exelweiss en su dirección Web:
<A HREF="http://www.exelweiss.ivinf.com" target="_new"><b>www.exelweiss.ivinf.com</b></A>
</font>
</center>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
