<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Fallout.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Interplay.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Rol.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano. Voces en inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 86%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">
<img src="jpg/pfall.jpg" align=left>
<P ALIGN=justify>
Al fin ha llegado a Espa&ntilde;a el &quot;Mes&iacute;as&quot; de los juegos de rol por ordenador, se llama <B>Fallout</B> y, no se si por el tiempo que llevo esperando un juego de similar corte o por qu&eacute; otro motivo, me ha parecido soberbio. El Fallout, desde luego, no es el mejor juego de rol de la historia. Tiene fallos o, m&aacute;s bien, situaciones o detalles que le restan algunos puntos en la &quot;temida&quot; valoraci&oacute;n final. De todos modos, como ver&eacute;is a continuaci&oacute;n, el planteamiento general de este juego se acercan m&aacute;s al sobresaliente que al notable.</P>
<P ALIGN="JUSTIFY"></P>
<h4>El &quot;Mes&iacute;as&quot; de los juegos de rol.</h4>
<P ALIGN="JUSTIFY">S&iacute;, es cierto. El &uacute;ltimo gran juego de rol que se lanz&oacute; fue el <B>Ultima VII, The Black Gate</B> (o La Puerta Negra, para los profanos) y de eso ya ha pasado mucho (much&iacute;simo) tiempo. Desde luego que han salido m&aacute;s juegos pertenecientes a este complejo g&eacute;nero pero, qu&eacute; quer&eacute;is, su naturaleza era tan pat&eacute;tica (salvo honrosas excepciones) que te ten&iacute;an que pagar para que no dijeras que el g&eacute;nero de los juegos de rol se encontraban estancado y sin rumbo fijo, es decir, agonizando. Estas pasadas navidades, al menos, hemos visto juegos que portaban sin verg&uuml;enza la a&ntilde;orada pegatina que les distingu&iacute;a como RPGs. Ah&iacute; tenemos al <B>Lands of Lore II, Guardians of Destiny</B>. Un juego que ha decepcionado mucho a los que hemos esperado tanto la continuaci&oacute;n de la joya de <B>Westwood</B>. Tambi&eacute;n, y con parad&oacute;jica suerte (ya que el juego debi&oacute; de haberse editado hace mucho m&aacute;s tiempo), hemos podido alargar nuestra sobremesa rolera con el excelente y puro t&iacute;tulo: &quot;<B>La Sombra Sobre Riva</B>&quot;. Un juego realmente selecto y delicioso para el que sabe apreciarlo y jugarlo. Pasando, l&oacute;gicamente, por el m&aacute;s recientito <B>Might and Magic VI, The Mandate of Heaven</B> del cual deber&iacute;an de sobrar los comentarios.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hac&iacute;a meses que se ven&iacute;a hablando de la llegada del Fallout a Espa&ntilde;a. Este juego llevaba circulando un tiempo m&aacute;s que considerable fuera de nuestras fronteras y, realmente, se me hace incomprensible la tardanza en la adaptaci&oacute;n por parte de nuestros distribuidores (que por lo dem&aacute;s, han hecho un excelente trabajo una vez que el juego ha visto las estanter&iacute;as de las tiendas). El Fallout es un juego que ofrece un concepto, el de la &quot;no linealidad&quot;, tan desarrollado que es, precisamente en este punto, en d&oacute;nde puede desbordar a cualquier juego de rol que se le ponga por delante. Es parad&oacute;jico que un aspecto tan fundamental para los juegos de rol como el de la libertad (libertad bien dise&ntilde;ada, por supuesto) haya tardado tanto en alcanzar una situaci&oacute;n aceptable (m&aacute;s que nada, para evitar los dedos acusadores de los jugadores de rol de mesa). El &uacute;nico juego que se le pueda asemejar (con un estilo bien distinto, todo hay que decirlo) es el Daggerfall, que tambi&eacute;n cuenta de un universo vivo (el Might and Magic VI tambi&eacute;n promete eso pero a&uacute;n no he tenido el gusto de probarlo –y como no hagan una demo temo que no lo tendr&eacute; nunca... :-( -) poco lineal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro de los aspectos que hay que destacar es el referente al sistema de generaci&oacute;n de personajes. Aspecto que ya da avisos de lo que nos podemos encontrar. Hay multitud de posibilidades para definir y decidir acerca de la personalidad con la que vamos a jugar la partida (¡y creedme que S&Iacute; afectan –aunque hay alg&uacute;n que otro pero- al desarrollo del juego!) pese a todo, no supera al cl&aacute;sico <B>Megatraveller</B> pero s&iacute; que se encuentra a medio camino entre sencillez y robustez cosa que, en el ambiente tan sumamente saturado en que vivimos, se antoja como esencial. Una vez que nos encontremos a gusto con el personaje elegido (os auguro una vuelta por la creaci&oacute;n de personajes cuando empec&eacute;is a jugar en serio...), pasaremos al desarrollo. </P>
<P ALIGN="JUSTIFY"></P>
<h4>El juego en s&iacute;</h4>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Nuestra misi&oacute;n es encontrar un chip que permite el funcionamiento de un complejo sistema para el mantenimiento del agua. Este agua mantiene viva, l&oacute;gicamente, a la colonia del Vault (una especie de mega – bunker subterr&aacute;neo) al que nosotros pertenecemos, el n&uacute;mero 13 (Uhmmm, este n&uacute;mero....). </P>
<TABLE align="right"><td>
<center><img src="jpg/pfall1.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="right"><b>En el Fallout tú decides cómo resolver <br>la aventura: por la fuerza
o por el diálogo.
</b>
<b>
</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY">Como tel&oacute;n de fondo tenemos la t&iacute;pica ambientaci&oacute;n postnuclear; ciudades destruidas por la tercera guerra mundial (d&oacute;nde he leido esto antes...), mutaciones, restos de lo  que era antes la civilizaci&oacute;n humana y una gran cantidad de desierto por recorrer. El argumento en s&iacute;, no deja de ser ni malo ni bueno. Se han visto cosas bastante mejores que esta pero, en lo que realmente este juego da la campanada, es en el desarrollo, en el gui&oacute;n y en la ambientaci&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Referente a lo primero, el desarrollo, luce, como cit&eacute; m&aacute;s atr&aacute;s, el mejor concepto de &quot;no linealidad&quot; visto en un juego de estas caracter&iacute;sticas. Nos encontramos en una carrera de d&iacute;as (5 meses) por encontrar el &quot;dichoso&quot; chip y para nuestra misi&oacute;n debemos de elegir el camino que mejor se adapte al &quot;humor&quot; que tengamos el d&iacute;a de la partida, es decir, si quieres abrirte paso a &quot;mamporros&quot;, adelante, si quieres utilizar tus dotes diplom&aacute;ticas, adelante, si quieres dedicarte a ser el benefactor de alg&uacute;n pobre NPC que necesita ayuda, adelante, si quieres.... ....¡adelante!.... </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El concepto utilizado para llevar a cabo esta fenomenal &quot;no linealidad&quot; se basa en los conocidos &quot;mini- quest&quot; y en el propio hecho de ir contra reloj para concluir la aventura. Los &quot;mini – quest&quot; sirven para alargar la partida de una forma muy inteligente. Pese a que Fallout no es el primero en usar, masivamente, este tipo de recurso (el Ultima VII, tambi&eacute;n dio buena cuenta de ello) s&iacute; que lo lleva, si no a la m&aacute;xima expresi&oacute;n s&iacute; con algo m&aacute;s de coherencia que otros t&iacute;tulos. Se nos plantean multitud de situaciones que desarrollar que enriquecen enormemente el argumento del juego y ayudan al jugador a poner &quot;a punto&quot; la personalidad con la que quiere jugar al juego. Podemos ayudar a las personas, enga&ntilde;arlas o matarlas. Tenemos una gran cantidad de mini-quest que desarrollar durante el transcurso de la aventura. Esta caracter&iacute;stica, que no se hace esencial para concluir el programa, consiguen meter y situar al jugador en el universo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quiz&aacute;s, resulte un poco denso todo el desarrollo para gente poco acostumbrada a leer desde pantalla. Yo mismo, que llevo jugando un buen n&uacute;mero de a&ntilde;os a este tipo de juegos, me he encontrado cansado de leer tanto de mi monitor y m&aacute;s cuando las letras son peque&ntilde;as y fluorescentes. Se deber&iacute;a haber pensado en conversaciones narradas siempre y no s&oacute;lo para algunas cut – scenes moderadamente importantes (aunque, dada la gran cantidad de situaciones y NPCs del Fallout, hubiera sido necesario otro CD, como m&iacute;nimo, para las dichas voces).</P>
<P ALIGN="JUSTIFY"></P>
<TABLE align="left"><td>
<center><img src="jpg/pfall2.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="left"><b>En el Fallout tenemos un estupendo ambiente<br> postnuclear recreado
a través de unos escenarios<br> isométricos sobresalientes.</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY">Una de las cosas que no me han hecho excesiva gracia es ver NPCs id&eacute;nticos en cuanto a forma. Sin ir m&aacute;s lejos, durante los primeros comienzos de juego, puedes contratar o reclutar a un NPC para que te siga en tu misi&oacute;n y as&iacute; &quot;aliviar&quot; las numerosas luchas. Dicho NPCs, tiene una forma que lo distingue claramente de ti o de otros con los que te encuentras durante esos primeros momentos de la aventura pero, de repente, al llegar a una ciudad y comenzar a desarrollar un mini-quest, descubres a otro NPC que tiene id&eacute;ntica forma que Ian (el NPC que reclutas). Estas cosas son absurdas. Cierto es que hacer tropecientos mil NPCs tampoco es plan pero, digo yo que, escoger a los m&aacute;s importantes y darles una forma &uacute;nica hubiese sido lo m&aacute;s acertado. En estos casos, la ambientaci&oacute;n empieza a flojear seriamente.... Son peque&ntilde;os detalles pero, para desgracia de Interplay, son los que quedan al instante que salen a flote.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego apuesta por una perspectiva isom&eacute;trica muy acertada. Este tipo de perspectiva es la que, personalmente, m&aacute;s agradezco para el g&eacute;nero de los RPGs. Tienes una amplia visi&oacute;n y, lo que es m&aacute;s importante, puedes ver al personaje. Adem&aacute;s, el jugador dispone de un sencillo interfaz al cu&aacute;l es muy f&aacute;cil cogerle &quot;el truquillo&quot;, esto es, no hace falta pasarse dos d&iacute;as para saber qu&eacute; hace y qu&eacute; no hace esta o aquella cosa. De todos modos, est&aacute;is avisados, esto no quiere decir que el juego sea sencillo. El interfaz s&oacute;lo oculta el verdadero potencial del producto pues si vais a jugar al Fallout en serio, no quedar&aacute; m&aacute;s remedio que estudiar detenidamente las tablas estad&iacute;sticas del personaje, los objetos, etc.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El combate es por turnos. He escuchado a gente que se quejan de este hecho. Su parte de raz&oacute;n tienen, el combate en tiempo real bien hecho y que se apoye, realmente, en las caracter&iacute;sticas de nuestro jugador, se hace muy apetecible. Sin embargo, huyendo del peligro de caer en uno u otro bando de opiniones, me voy a mantener imparcial. Creo que el combate por turnos que luce el juego est&aacute; muy bien desarrollado. Tambi&eacute;n hubiera sido interesante ofertar una posibilidad en tiempo real (que acercar&iacute;a a m&aacute;s gente el juego). Veremos qu&eacute; es lo que hacen en la segunda parte</P>
<P ALIGN="JUSTIFY"></P>
<h4>¿Pero es bueno?</h4>
<P ALIGN="JUSTIFY">El Fallout es un juego excelente. Le falta ese algo que no sabes qu&eacute; es pero que le falta. Quiz&aacute;s, por este hecho, no logra absorberte como esperabas despu&eacute;s de estar m&aacute;s de 30 minutos jugando. Desde luego, est&aacute; &quot;vestido&quot; de todas las caracter&iacute;sticas para convertirlo (de hecho, ya lo es) en un cl&aacute;sico de los juegos de rol modernos. El motor isom&eacute;trico del Fallout, sin ser el mejor, cumple m&aacute;s que de sobra, el interfaz es de lo mejorcito que se ha visto, los gr&aacute;ficos son preciosistas, el argumento no es excesivamente complejo pero el desarrollo final s&iacute; que lo es (y eso es, al fin y al cabo, lo m&aacute;s importante) por la fant&aacute;stica forma de gestionar las peque&ntilde;as historias que se ofrecen, etc. </P>
<P ALIGN="JUSTIFY"></P>
<TABLE align="left"><td>
<center><img src="jpg/pfall3.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="left"><b>Debemos de recuperar un chip que permita<br> la supervivencia de
nuestra colonia. <br>Sólo tenemos de 5 escasos meses.
</b>
<b>
</b></p>
</td>
</table>
<P ALIGN="JUSTIFY">El peor enemigo de la &quot;no linealidad&quot; que ofrece este juego es que mucha gente se lo concluir&aacute; sin haber conocido y asimilado todo el universo en el que se desarrolla Fallout. ¿Esto es malo?. No, no es malo, pero le impide mostrar todo su potencial. De todas formas, ese es el precio que un desarrollador tiene que pagar por ofrecer algo con libertad para el jugador. Este puede tomar las decisiones que quiera por lo que hay cosas, bastantes cosas, que nunca llegar&aacute; a ver el jugador. Como he dicho, esto depende de lo que quiera hacer el desarrollador, es decir, si quiere un producto m&aacute;s cercano a la novela o al juego en s&iacute;.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Conclusiones finales.</h4>
<P ALIGN="JUSTIFY">El Fallout 2 ya est&aacute; en camino y eso son muy buenas noticias. Si un juego de rol con una dosis tan alta de pureza puede tener &eacute;xito en estos tiempos que corren, podemos asegurar que el g&eacute;nero no est&aacute;, ni mucho menos, muerto. Si eres un seguidor del g&eacute;nero desde los memorables tiempos del Dungeon Master, o m&aacute;s atr&aacute;s, hazte con este producto. El Fallout es la verdadera evoluci&oacute;n entre el rol antiguo y el moderno. Tiene historia, complejidad argumental, bastante dosis de sentido com&uacute;n en el desarrollo, posee reglas esenciales para cualquier puritano, lleva un embalaje en condiciones y, adem&aacute;s, est&aacute; moderadamente bien traducido al castellano (salvo voces). Le falta algo, s&iacute;, pero ya no se si al que le falta es a m&iacute; o al juego... hace tanto tiempo que no pod&iacute;amos comentar un juego de rol de verdad que probablemente sea eso... </P>
<P ALIGN="JUSTIFY">¿Lo digo?. Lo digo, imprescindible para cualquier colecci&oacute;n de rol que se precie ;-)</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

