<HTML>

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<HR>

<br>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>





<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>



<A HREF="mailto:carlos@macom.es">José Carlos García "Carlitox".</A><br>
<FONT color="#009933" size=2 face="arial">Webmaster y segundo coordinador de StRAtOS.</font>

</b></FONT>



<BR><BR><BR><BR><BR>



<H3>

<FONT color="#000000" face="arial">        
Detrás de la web.
</FONT>

</H3>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">Navegando por Internet, visitamos una web detr&aacute;s de otra. Unas veces nos detenemos a mirar m&aacute;s en profundidad, otras ni siquiera esperamos a que se cargue ni un gr&aacute;fico... y rara vez nos paramos a pensar el motivo de que esa web est&eacute; en la red, qu&eacute; personas hay detr&aacute;s de ella o cu&aacute;nto trabajo pueda representar para los que la mantienen.</P>
<P ALIGN="JUSTIFY">En lo que a m&iacute; respecta, y pese a que habr&eacute; dise&ntilde;ado m&aacute;s de medio centenar de webs, quiero hablar de la web de StRAtOS (</FONT><A HREF="http://www.stratos-ad.com/"><FONT FACE="Arial" SIZE=2>http://www.stratos-ad.com</FONT></A><FONT FACE="Arial" SIZE=2>) porque es la que he creado con m&aacute;s cari&ntilde;o y a la que dedico mi tiempo por lo que aporta a los dem&aacute;s y lo que representa.</P>
<P ALIGN="JUSTIFY">Esta web ha sido sin duda la herramienta que m&aacute;s ha ayudado a la asociaci&oacute;n en su crecimiento, porque ha servido como v&iacute;nculo de uni&oacute;n de todos los miembros y lugar de referencia para nuestras actividades.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Qu&eacute; supone la creaci&oacute;n y mantenimiento de una web de estas caracter&iacute;sticas?</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Paso 1. Dise&ntilde;o inicial.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A la hora de plantearnos c&oacute;mo va a ser nuestra web, debemos tener en cuenta primordialmente el contenido que va a incorporar, que dicho contenido debe ser accesible de forma muy sencilla por el usuario, y que debe estar estructurado adecuadamente para permitir una posible expansi&oacute;n en el futuro.</P>
<P ALIGN="JUSTIFY">Pero no basta con pensar en un dise&ntilde;o muy atractivo, lleno de gr&aacute;ficos, porque tambi&eacute;n debe contemplarse que la carga de las p&aacute;ginas no debe hacerse interminable (que el visitante no abandone la p&aacute;gina a los 5 minutos sin haber visto m&aacute;s que una pantalla en blanco y un par de l&iacute;neas de un jpeg). El visitante que no entra directamente a donde quiere y de forma aceptable, seguramente no volver&aacute; jam&aacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Paso 2. Creaci&oacute;n de la p&aacute;gina.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El aut&eacute;ntico creador no se limita a recopilar iconos y gifs animados por Internet y a colocarlos de manera m&aacute;s o menos ordenada en su p&aacute;gina. Esto no debe ser as&iacute; porque no queremos que nuestra p&aacute;gina sea pr&aacute;cticamente igual a otras miles ya existentes, y porque debemos dotarla de una personalidad propia.</P>
<P ALIGN="JUSTIFY">Podemos optar indiferentemente por un fondo negro, blanco, con mucho colorido... y por un estilo de dibujos o iconograf&iacute;a a nuestro gusto. Pero lo que es una regla inquebrantable es que todas nuestras secciones deben guardar coherencia entre s&iacute;, tanto est&eacute;ticamente como en su estructura b&aacute;sica.</P>
<P ALIGN="JUSTIFY">Un usuario debe reconocer en todo momento d&oacute;nde se encuentra y tener opci&oacute;n a moverse por otras secciones sin tener que explorar toda la web. Y, sobre todo, que no tenga la sensaci&oacute;n de haberse trasladado a otra web mediante un enlace, sino que tenga conciencia clara de que sigue en nuestras p&aacute;ginas.</P>
<P ALIGN="JUSTIFY">Esta regla permite algunas licencias, como por ejemplo en el caso de StRActOS, que al tratarse de una especie de revista hemos querido dotarla de una personalidad distinta al resto.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Paso 3. Comprobaci&oacute;n de la Web.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En caso de webs peque&ntilde;as nosotros mismos podemos testearlas y comprobar que todo funciona. Sin embargo, cuando se trata de webs grandes, con multitud de enlaces y gran cantidad de peque&ntilde;as secciones, siempre hay cosas que se nos escapar&aacute;n seguro. Hay que dejar abierta la posibilidad de que los visitantes nos puedan hacer llegar en cualquier momento las posibles deficiencias que, en el uso diario, puedan encontrar en nuestra web.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Paso 4. Mantenimiento.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que no es una paso, sino un proceso que se alargar&aacute; durante toda la vida de la web.</P>
<P ALIGN="JUSTIFY">Dentro de este trabajo, que puede realizarse de forma m&aacute;s o menos peri&oacute;dica, seg&uacute;n las posibilidades de cada uno (varias veces al d&iacute;a, diariamente, semanalmente...) se engloban muchas tareas:</P>

<UL>
<li><P ALIGN="JUSTIFY">Comprobaci&oacute;n –de vez en cuando - de enlaces  existentes  e inclusi&oacute;n de algunos nuevos</LI>
<li><P ALIGN="JUSTIFY">Inclusi&oacute;n de nuevas secciones, seg&uacute;n las necesidades del contenido o del objetivo de la p&aacute;gina</LI>
<li><P ALIGN="JUSTIFY">Remodelaci&oacute;n de aquellas secciones que por excesivo tama&ntilde;o requieran subdivisi&oacute;n</LI>
<li><P ALIGN="JUSTIFY">Y un largo etc&eacute;tera, tan dif&iacute;cil de prever como cantidad de p&aacute;ginas web se abren cada d&iacute;a en la red</LI></ul>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el caso de StRAtOS, cuyo mantenimiento es diario, tenemos varias tareas que atender:</P>

<UL>
<li><P ALIGN="JUSTIFY">Noticias internas, relacionadas con la asociaci&oacute;n, y que requieren actualizaci&oacute;n seg&uacute;n se producen</LI>
<li><P ALIGN="JUSTIFY">Noticias externas, que suponen un trabajo diario de b&uacute;squeda, contacto con medios de comunicaci&oacute;n y empresas del sector, y traducci&oacute;n de las mismas (porque la pr&aacute;ctica totalidad est&aacute;n en ingl&eacute;s o franc&eacute;s)</LI>
<li><P ALIGN="JUSTIFY">Mantenimiento m&iacute;nimo de los foros, para que no excedan de un tama&ntilde;o determinado</LI>
<li><P ALIGN="JUSTIFY">Ofertas de trabajo, tanto las que nos llegan directamente como las que conseguimos tras el contacto con las distintas empresas</LI>
<li><P ALIGN="JUSTIFY">Y actualizaci&oacute;n de algunas secciones como StRActOS, Ultimas Capturas, Proyectos, Juegos Publicados... que dependen de contenidos que llegan  espor&aacute;dicamente (excepto cuando nosotros mismos nos encargamos de escribir alg&uacute;n art&iacute;culo o realizar alguna entrevista)</LI></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por otra parte, todo dise&ntilde;ador de webs debe tener claro que es muy conveniente realizar un cambio de dise&ntilde;o cada cierto tiempo (sobre todo en la home o p&aacute;gina principal) para evitar la monoton&iacute;a y de paso adaptarnos mejor a las nuevas secciones que hayan podido incorporarse y ahora est&eacute;n m&aacute;s o menos puestas a cap&oacute;n. Si la web es demasiado grande como para afrontarlo en un solo paso, podremos ir cambiando una a una las secciones, pero de forma progresiva y nunca radical, para que no &quot;cante&quot; demasiado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En resumen, un trabajo enorme, pocas veces valorado, que muchas veces cansa hasta el l&iacute;mite de pensar en dejarlo, pero que bien llevado a cabo supone la satisfacci&oacute;n personal y en cierto modo la creaci&oacute;n de una peque&ntilde;a obra de arte propia.</P>




<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>

<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>



<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>



</HTML>

