<HTML>

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<HR>

<br>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>





<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>

<A HREF="mailto:">César Valencia.</A><br>

<FONT color="#009933" size=2 face="arial">Director de proyecto en Dinamic Multimedia.</font>

</b></FONT>



<BR><BR><BR><BR><BR>



<H3>

<FONT color="#000000" face="arial">        
Saber elegir el hueco adecuado
</FONT>

</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Teor&iacute;as del negocio o industria aparte, una cosa que &uacute;ltimamente me ha sorprendido o que, al menos, me ha hecho reflexionar sobre algo que ya sab&iacute;a, es la falta de conocimientos acerca del tipo de mercado al que va dirigido un producto, en este caso un videojuego, por parte de un equipo de desarrollo, y c&oacute;mo no, todos los matices que de esta situaci&oacute;n se pueden derivar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En Espa&ntilde;a existe actualmente una gran cantidad de peque&ntilde;os grupos free-lance compuestos de personas que no superan los 23 o 24 a&ntilde;os. Todos ellos ponen una gran ilusi&oacute;n en cada uno de los proyectos que comienzan, aunque la mayor&iacute;a se ven frustrados y pasan al caj&oacute;n de los recuerdos. Todas estas personas deben de aprender algo b&aacute;sico, y es que el mejor equipo de desarrollo, el mejor programador o el mejor artista gr&aacute;fico, no es el que realiza su trabajo con una diligencia absoluta y una calidad o rapidez envidiables, sino que el mejor es el que sabe en todo momento &quot;<B>para qu&eacute;</B>&quot;, &quot;<B>por qu&eacute;</B>&quot; y &quot;<B>el qu&eacute;</B>&quot; est&aacute; haciendo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un grupo de desarrollo tiene que formarse necesariamente en el aspecto comercial del mismo, estudiando otros productos similares y el &eacute;xito que pueden haber tenido, examinando a qu&eacute; tipo de mercado va dirigido, y sobre todo, no olvidando c&oacute;mo puede venderse ese producto y bajo qu&eacute; reclamos de marketing.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un videojuego, antes que gustar al usuario final o comprador, tiene que convencer a la editora que va a publicar el t&iacute;tulo, y esto es algo que en un 99% de los casos va ligado a una opini&oacute;n comercial y meramente &quot;marketiniana&quot;. Algo que no convenza a estos departamentos es algo que no se publicar&aacute;, o si se hace, se har&aacute; sin grandes pretensiones para utilizar el producto de fondo de cat&aacute;logo, hecho que no suele agradar mucho a un equipo de personas que han estado trabajando duro y con ilusi&oacute;n durante varios meses.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Llevando a&ntilde;os en este sector, no deja de sorprenderme a&uacute;n la falta de conocimiento y preocupaci&oacute;n por parte de los desarrolladores &quot;de pura zepa&quot; de no plantear los videojuegos como un producto que se va a someter a una explotaci&oacute;n comercial. No es mejor el juego que pinta m&aacute;s pol&iacute;gonos, ni el que proyecta sombras en tiempo real sobre planos irregulares No, el mejor producto es el que mejor se vende, da igual el engine o los gr&aacute;ficos. Todo eso da igual. Pues no es m&aacute;s que el aceite y el vinagre de esta ensalada. Lo que realmente importa es el concepto del juego y el objetivo con el que se ha dise&ntilde;ado, eso es lo que realmente hace que el producto triunfe.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es una pena ver como una gran cantidad de proyectos son rechazados en diferentes compa&ntilde;&iacute;as &uacute;nicamente porque no cuadran con el sector de mercado al que van dirigidos, son poco originales, est&aacute;n poco pulidos o simplemente sus creadores se niegan a hacer cambios pensando que tienen el dogma en la palabra.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el caso de &quot;Commandos&quot;, por poner un ejemplo por todos conocido, no han sido los gr&aacute;ficos el elemento que lo ha hecho triunfar, ni el sonido, ni el dise&ntilde;o del interface, ni tampoco la mec&aacute;nica de juego. Por encima de todo eso ha existido una perfecta selecci&oacute;n del hueco de mercado que iba a ocupar y para el que estaba siendo concebido. Eso es lo que ha hecho de &quot;Commandos&quot; un producto diferente. Por supuesto, la calidad de los elementos antes mencionados ha ayudado de forma definitiva.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;PC F&uacute;tbol&quot; es otro de los casos que podr&iacute;amos poner como ejemplo de un desarrollo inteligente. En un primer momento y hasta asentarse como s&uacute;per-ventas, no se ha ido a competir con otros productos de similares caracter&iacute;sticas, sino que el punto fuerte de este t&iacute;tulo ha sido el &quot;manager&quot;, aspecto del que adolec&iacute;an la mayor&iacute;a de los juegos de tem&aacute;tica similar. Esto ha marcado una diferencia y pauta muy importante.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De todo lo dicho anteriormente concluyo que para que todos los grupos de desarrollo que se mueven actualmente lleguen alg&uacute;n d&iacute;a a buen puerto con alguno de sus t&iacute;tulos, es indispensable y requisito necesario el hecho de que se fijen, estudien y examinen con que t&iacute;tulos van a competir, y lo que realmente evolucionen sea el concepto, que es lo que va a diferenciar a un t&iacute;tulo de otro y lo va a te&ntilde;ir de carisma y personalidad. Que vean c&oacute;mo vender&iacute;an su producto, que apliquen la l&oacute;gica a sus conclusiones, y sobre todo, que imaginen que van a invertir cincuenta millones de pesetas en su lanzamiento. Una vez hecho esto, que vuelvan a enfocar la idea hasta que, tras repetir las preguntas anteriores, logren estar convencidos de jugarse esa cantidad de dinero en editar su t&iacute;tulo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No hay por qu&eacute; plantearse hacer el videojuego mas innovador y tecnol&oacute;gico, m&oacute;s bonito o m&aacute;s divertido. Simplemente hay que saber elegir el hueco adecuado para el tipo de producto que se quiere desarrollar. Y recordad siempre que el mejor producto es el producto acabado y en caja (o blister)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡Saludos y &aacute;nimo, que seguro que lo consegu&iacute;s!</P></FONT></BODY>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>

<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>



<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>



</HTML>

