<HTML>
<HEAD>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:martuchi5@yahoo.es">Marta Mañanes.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
¿Dónde están las féminas?
</FONT>
</H3>


<font size=2 face=arial>


<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Por fin se cumple un a&ntilde;o de vida de nuestra revista Macedonia, encargada de incrementar nuestros conocimientos en diversos aspectos dentro del campo inform&aacute;tico. Macedonia naci&oacute; por iniciativa de dos personas y sobre todo con el apoyo de uno de sus creadores, Fernando Rodr&iacute;guez, quien se ha visto abrumado y sorprendido ante la asombrosa respuesta de sus lectores en lo que se refiere al proyecto Maced&oacute;nico. Cada d&iacute;a se han ido recibiendo emails de apoyo, de cr&iacute;tica - s&iacute;, aceptamos todas las cr&iacute;ticas constructivas que contribuyan a mejorar nuestra revista - y de petici&oacute;n para formar parte de nuestro extenso equipo. Macedonia sobrevive sobre todo gracias a estos &uacute;ltimos emails que han hecho que siga para adelante con n&uacute;meros que cada vez ponen el list&oacute;n m&aacute;s alto.</P>
<P ALIGN="JUSTIFY">Y, sin embargo, pese a que el list&oacute;n sea cada vez m&aacute;s dif&iacute;cil de superar continuamos recibiendo un mont&oacute;n de buenas ideas, surgidas de diferentes cabezas pensantes que un buen d&iacute;a decidieron colaborar como miembros de peso indiscutible en la publicaci&oacute;n o como miembros casuales, aportando art&iacute;culos, reportajes, cursos y as&iacute; un largo etc&eacute;tera. Macedonia es una revista compleja porque vosotros hab&eacute;is permitido que as&iacute; fuera. No nos podemos quejar.</P>
<P ALIGN="JUSTIFY">He sido una observadora de primera fila de este proyecto desde que surgi&oacute; la idea de crearse hasta ahora que se ha convertido en una revista de gran calidad, con una plantilla incre&iacute;ble y muy participativa en todo lo que respecta a problemas, ideas y planes de futuro. Incluso se ha llegado a plantear el tema de un encuentro en alguna ciudad del pa&iacute;s para poder vernos todos los macedonios las caras, en vivo y en directo. No obstante, debo recalcar algo que me ha chocado y sorprendido y que sigue sin agradarme. Desde que este proyecto se creo no he visto ninguna colaboradora femenina, ninguna chica se ha decidido a participar en esta revista, exceptu&aacute;ndome a mi, por supuesto.</P>
<P ALIGN="JUSTIFY">Desde que nos dejan hacerlo y se nos escucha algo m&aacute;s, nos hemos quejado de que en ciertas materias no se nos tiene en cuenta a las mujeres porque o bien o nos consideran lo suficientemente buenas para ese trabajo o porque se supone que somos el sexo d&eacute;bil. Sin embargo ninguna chica o mujer se ha decidido a unirse a nuestro equipo y todav&iacute;a no acabo de entender si es porque no quieren, no se atreven o no se sienten capacitadas para ello.</P>
<P ALIGN="JUSTIFY">No creo que nadie que sepa lo suficiente de inform&aacute;tica o que por lo menos quiera dejar patente una idea o pensamiento sobre un tema en concreto, no quiera participar en un medio tan abierto como Macedonia. En Macedonia no se exigen curr&iacute;culums para escribir un art&iacute;culo - claro ejemplo el m&iacute;o, que s&eacute; m&aacute;s bien poco - ni se exige una edad m&iacute;nima para participar. S&oacute;lo se piden ganas y algo de tiempo para no dejar vac&iacute;o ning&uacute;n n&uacute;mero de Macedonia y poder cumplir as&iacute; con su cita puntualmente.</P>
<P ALIGN="JUSTIFY">Tampoco creo que las mujeres no se atrevan a escribir un art&iacute;culo. Una vez un gran amigo m&iacute;o me dijo que siempre va a existir alguien por encima de ti en lo que a conocimientos se refiere y que realizar cualquier actividad por "amor al arte" merece ser respetada por cualquiera que la lea, independientemente de calidad final que se haya podido conseguir. Lo importante es el por qu&eacute; se hace. Y lo admit&iacute;. Las chicas que est&eacute;n dudando en colaborar y que no se atrevan bien porque temen hacerlo mal o bien porque ven que quiz&aacute;s las mujeres no son bien recibidas en Macedonia ya que s&oacute;lo hay una en todo el equipo - ya veis, esto es como un c&iacute;rculo vicioso, vosotras no os anim&aacute;is porque no veis a m&aacute;s chicas en el equipo y en Macedonia no hay chicas porque ninguna se atreve -, pues que se quiten la duda de la cabeza. Simplemente deben de mandar un email y esperar respuesta. Despu&eacute;s de enviar el art&iacute;culo s&oacute;lo tendr&aacute;n que esperar cu&aacute;ndo se podr&aacute; leer en Macedonia si es que es un art&iacute;culo que merece la pena. Nunca sabr&eacute;is si vuestro trabajo merece la pena si no lo envi&aacute;is y nosotros nunca sabremos si merece la pena si no los envi&aacute;is.</P>
<P ALIGN="JUSTIFY">En cuanto a lo de que no se sientan capacitadas, pues permitirme que no me lo crea de nuevo. A primera vista estoy segura de que las aulas de inform&aacute;tica de las facultades est&aacute;n mucho m&aacute;s llenas de chicos que de chicas; es cierto que hay m&aacute;s estudiantes chicos de inform&aacute;tica que no chicas, y sin embargo dudo que no las haya. Vamos, alguna autodidacta y alguna loca por la inform&aacute;tica tiene que existir y que adem&aacute;s se regocije leyendo Macedonia cada cierto tiempo. S&eacute; que hay una chica concretamente que una vez escribi&oacute; un email de felicitaci&oacute;n a nuestro "dire", pero que sali&oacute; espantada cuando se le ocurri&oacute; a Fernando el preguntarle si querr&iacute;a participar en nuestra revista. Donde quiera que est&eacute;s, vuelve, aunque s&oacute;lo sea por hacerme compa&ntilde;&iacute;a ;-).</P>
<P ALIGN="JUSTIFY">Pero basta ya de suposiciones y vayamos al grano, quiero saber de primera mano qu&eacute; es lo que a vosotras os impide participar, qu&eacute; es lo que os retiene. Si es preciso har&eacute; de mediadora. ¿En serio que no os gustar&iacute;a poner un poco m&aacute;s de az&uacute;car a esta rica Macedonia llena de fruta fresca que os ofrecemos cada dos meses?. No quiero sacarina, s&oacute;lo pido az&uacute;car femenina porque Macedonia est&aacute; falta de ella. Si todos somos glotones de Macedonia, ¿por qu&eacute; no participar todos en su elaboraci&oacute;n?. Unos pondr&aacute;n el alm&iacute;bar, otros la fruta fresca y nosotras el az&uacute;car. ¿Qu&eacute; tal?. Entonces s&iacute; que estar&aacute; Macedonia para chuparse los dedos;-).</P></FONT></BODY>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
