<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:">Gonzalo Suárez.</A><br>
<FONT color="#009933" size=2 face="arial">Director de desarrollo de PYRO Studios<br> Máximo responsable de "COMMANDOS".</font>
</b></FONT>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Directrices particulares para concretar diseños de videojuegos.
</FONT>
</H3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Este texto est&aacute; expuesto sin ánimo de desarrollar un m&eacute;todo del dise&ntilde;o de videojuegos global, sino unas directrices particulares que pueden servir para concretar situaciones habituales en el dise&ntilde;o.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de plantearse "nada" del video-juego, habr&iacute;a que preguntarse. ¿A qué quiero jugar cuando juegue con el videojuego?. Aún pareciendo obvia, esta pregunta encierra el 90% de las problem&aacute;ticas posteriores. Como dato curioso, esta pregunta es contestada, muchas veces, con una rapidez si bien envidiable no menos inquietante, con el siguiente texto "<I>Es Mata-mata con estrategia y aventura en 3d con 30.000 poligonos</I>". Preguntar "¿A qu&eacute; se juega?" y contestar con un "Es tal o tal cosa" ya es extra&ntilde;o pero mentar el numero de pol&iacute;gonos ya es kafkiano.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pretender que la contestaci&oacute;n sobreviva al final del proyecto es un lujo que solo desde la experiencia se puede salvar, pero aprovecharse de esta incertidumbre para "indefinir" una definici&oacute;n y hacerla as&iacute; mas "abierta" y "sugerente" es suicida.</P>
<P ALIGN="JUSTIFY">As&iacute; por ejemplo. el "Quake II" y "Half Life" aparentemente podr&iacute;a decirse que son de igual naturaleza sin embargo, la importancia de <I>desde donde</I>, <I>c&oacute;mo</I> y <I>cu&aacute;ndo</I> disparas del HL contrasta con la trepidante necesidad de punter&iacute;a de blancos m&oacute;viles del Q2 y su potente sensaci&oacute;n de arma en el juego (lo que hace, por ejemplo, que en red se jueguen de forma distinta).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el desarrollo de un video-juego, uno se encuentra con dilemas a la hora de tener que sacrificar "tal o tal opci&oacute;n" frente otra que aparentemente le hacia ilusi&oacute;n que estuviese. Sin ser absolutamente resolutivo planteo el siguiente m&eacute;todo de prioridades (seg&uacute;n mi experiencia). Dicho de otra manera. Todos queremos el coche m&aacute;s bonito con motor mas potente mas barato y menos consumo, pero el &oacute;rden en que coloquemos esta afirmaci&oacute;n nos llevara desde maravilloso B.M.W. hasta Muscle car pasando por un utilitario.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aqu&iacute; va un orden.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El juego.</B> </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los elementos fundamentales que componen la l&oacute;gica de juego son sagrados frente a cualquier otro elemento.</P>
<P ALIGN="JUSTIFY"></P>


<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta l&oacute;gica de juego dict&oacute; con buen criterio que el "Age of Empire" subyugase sus gr&aacute;ficos a un mundo mallado en cuadricula o dicho de otra manera, para entendernos, todo ente de juego ocupa una o varias casillas pero nunca las comparte con otro. Ni en su movimiento existe la posibilidad de coexistir entre dos casillas luego los gr&aacute;ficos, mal que a veces pese, deben cumplir las mismas normas (con m&aacute;s o menos disimulo).Y a pesar del aparente gran sacrificio gr&aacute;fico tenemos un gran juego que sin tal sacrificio dudosamente hubiese logrado serlo.</P>
<center>
<img src="jpg/fgonzo2.jpg">
</center>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro ejemplo tenemos otro compromiso de l&oacute;gica muy distinto en Comandos. Su mundo de l&oacute;gica era sectorizado, lo que implicaba que todo ente existe en el mundo en 3 coordenadas y volumen movi&eacute;ndose, as&iacute;,  en una realidad de juego continua. Siendo simplistas podr&iacute;amos decir que son puntos en el espacio 3d infinitamente peque&ntilde;os. Esto revierte directamente en una vistosidad de los gr&aacute;ficos ubicados en irregulares formas, sin quitar m&eacute;rito a los grandes grafistas que los hicieron posibles.</P>
<center>
<img src="jpg/fgonzo1.jpg">
</center>

<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Interface L&oacute;gico.</B> </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La comunicaci&oacute;n de elementos de l&oacute;gica, tanto <B>m&aacute;quina -&gt;usuario </B>como <B>usuario -&gt;maquina,</B> es el segundo elemento m&aacute;s importante.(un ejemplo muy claro podr&iacute;a ser el <I>cursor mundo</I>) Es decir, todo lo que existe.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo lo que juega, expl&iacute;cita o impl&iacute;citamente, tiene que ser comunicado al jugador de la forma <B>m&aacute;s</B> <B>eficaz</B> y todo aquello que el usuario desea comunicar (hacer), en el juego, debe ser facilitado mas all&aacute; de la intuici&oacute;n. En otras palabras:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<B><P ALIGN="JUSTIFY"><LI>Si algo no es perceptible por el jugador m&aacute;s vale que no exista.</LI></P>
<P ALIGN="JUSTIFY"><LI>Si algo no es factible para el jugador, m&aacute;s vale que no le apetezca hacerlo</B> (o t&uacute; provocarle que no le apetezca).</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;</P>
<B><P ALIGN="JUSTIFY">Sensaci&oacute;n y enajenaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">A pesar de ser el punto mas valorado por el jugador, en desarrollo, no debe emerger mas all&aacute; del tercer puesto. De lo contrario, conseguir&aacute;s 5 minutos de sensaciones y horas de desorientaci&oacute;n. Un caso muy com&uacute;n es haber desarrollado un engine con tal o cual  posibilidad y ante la dolorosa posibilidad, de que no se note, se le hace participe del juego sin que pinte nada.</P>
<P ALIGN="JUSTIFY">Recuerdo varios casos (algunos nunca se terminaron) en que el programador estaba tan orgulloso de la f&iacute;sica tan &quot;real&quot; puesta en el engine que todo rotaba colisionaba como en la vida real. El resultado era que el juego era inmanejable y salvo los cinco primeros minutos de curiosidad jugando con los objetos, el resto era una pesadilla. O imaginemos un juego de ajedrez en 3D primera persona, con los peones cada uno con caras distintas y batallando en un hermoso valle, donde apenas se distinguiese las casillas, con animaciones sorprendentes. Todo maravilloso. <B>Sensaci&oacute;n 10, enajenaci&oacute;n 10</B>. Y ahora a ver qui&eacute;n es valiente que le dise&ntilde;a un interface a semejante monstruosidad. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Features</B> </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Features de tecnolog&iacute;a, para mayor gloria de producto en el marketing. (por ejemplo, manejar 40000 pol&iacute;gonos en tiempo real). Indudablemente, &eacute;ste debe ser el esclavo de esclavos. El &uacute;ltimo en dictar criterio en un videojuego. En toda mi experiencia en el desarrollo de videojuegos nunca vi un juego hecho a base de features sin embargo, son moneda com&uacute;n de intercambio cuando se habla de un videojuego.</P>
<P ALIGN="JUSTIFY">Es una realidad desorientadora encontrarte, en un documento de definici&oacute;n de juego, p&aacute;ginas enteras con afirmaciones pseudocient&iacute;ficas y nada de juego. Y digo pseudocientif&iacute;cas porque, a pesar de la promesa de exactitud, son altamente indefinidas (¿qu&eacute; significa &quot;mover&quot; 40.000 pol&iacute;gonos?, ¿motion capture?, ¿Inteligencia Artificial?). Aunque la costumbre nos hace creer que sabemos de qu&eacute; hablamos, la realidad es muy otra. Recuerdo cuando present&aacute;bamos un prototipo de tecnolog&iacute;a hecho por Javier (Javier Ar&eacute;valo) que conten&iacute;a gran parte de las features 3D del momento Flares, iluminaciones de colores, mipmapping....etc y la gente ingenuamente dec&iacute;a &quot;¡Ah qu&eacute; bien! <I>s&oacute;lo</I> os queda hacer el juego&quot;, s&oacute;lo..., s&oacute;lo... ¡casi nada!. S&oacute;lo el "jueguecito". Es maravilloso embellecer un juego con features como lo es embellecer un coche con una carrocer&iacute;a pero, si no hay coche, la carrocer&iacute;a poco podr&aacute; hacer.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hoy por hoy, el trabajo de dise&ntilde;o de un videojuego est&aacute; bastante distanciado de la programaci&oacute;n. Otra cosa es que te atraigan ambos campos. En un paso posterior al dise&ntilde;o y especificaciones de juego viene el dise&ntilde;o de c&oacute;digo. En este punto s&iacute; es interesante saber qu&eacute; utilidades se van a usar como m&aacute;s apropiadas. En el apartado de lenguaje de programaci&oacute;n est&aacute; claro que el &quot;C&quot; es el rey, aunque s&oacute;lo sea por aquellos que, como yo en mis tiempos, han tenido que programar casi todo en ensamblador. Y en mi caso particular tengo una clara preferencia por el C++ (como opci&oacute;n desarrollada del &quot;C&quot;). Pero me gusta aclarar que el lenguaje de programaci&oacute;n condiciona menos de lo que puede aparentar (Lo digo desde haber programado en casi todos los ensambladores y lenguajes m&aacute;s conocidos). En resumen, todas las opciones de programaci&oacute;n son buenas si est&aacute;n ajustadas a una necesidad y ninguna es m&aacute;gicamente salvadora.</P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
