<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:caad@arrakis.es">Juanjo Muñoz.</A><br>
<FONT color="#009933" size=2 face="arial">Director del CAAD</font>
</b></FONT>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Siempre va a pasar algo
</FONT>
</H3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Hac&iacute;a bastante tiempo que Fernando me hab&iacute;a pedido que escribiese unas palabras para Macedonia. Yo se lo promet&iacute; en varias ocasiones, y en todas ellas no pude hacerlo. Por fin hoy voy a remediar eso, y de paso contar algo que me temo resulta com&uacute;n para los responsables de una publicaci&oacute;n 'amateur'.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para quien no me conozca, he aqu&iacute; una breve presentaci&oacute;n: Mi nombre es Juanjo Mu&ntilde;oz, antiguo miembro de Aventuras AD, compa&ntilde;&iacute;a espa&ntilde;ola que hace unos 9 a&ntilde;os se dedicaba a la programaci&oacute;n de aventuras conversacionales. Paralelamente a ello, cre&eacute; un club de aficionados a ese tipo de juegos, el CAAD, que acaba de cumplir 10 a&ntilde;os de existencia.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Dirigir una publicaci&oacute;n de este tipo, mantenida exclusivamente por las cuotas de sus suscriptores, te hace darte cuenta de muchas cosas. Evidentemente, no puedes vivir de ello, puesto que lo normal es que ni siquiera cubras gastos. Tampoco puedes realizarla t&uacute; solo, pues a la inevitable monoton&iacute;a se a&ntilde;ade la imposibilidad de dedicarle todo tu tiempo a una afici&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por consiguiente te ves en la obligaci&oacute;n, aunque muchas veces es un placer, de recurrir a la ayuda de otras personas que comparten tu afici&oacute;n. Las cosas en un principio suelen ser ideales, pero pronto empiezan a surgir problemas, sobre todo retrasos y desapariciones de colaboradores, que empiezan a afectar la periodicidad de tu publicaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el CAAD hemos arrastrado siempre este problema, sobre todo a la hora de la maquetaci&oacute;n. Ese problema se hace extensible a las publicaciones en web, y he ido viendo como Fernando se desesperaba por problemas de este tipo. Comprendo perfectamente c&oacute;mo se siente, pero con los a&ntilde;os he ido alcanzado una nueva perspectiva y un sentimiento de 'inevitabilidad', que se puede resumir en un axioma murphyano : 'Siempre va a pasar algo'.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por muy claro que lo tengas todo, por milimetrados que tengas todos los pasos a seguir, por muy a fondo que estudies cada caso, siempre va a fallar algo, o surgir&aacute; un problema imprevisto, o algo que cre&iacute;as solucionado volver&aacute; a estropearse. Es un hecho.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Por qu&eacute; las publicaciones comerciales no tienen estos problemas? Simplemente porque ellas disponen del mejor sistema "solucionador" de problemas, que pueden emplear a discreci&oacute;n y que obra milagros. Por supuesto, hablamos del dinero.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esto no quiere decir que la calidad s&oacute;lo est&eacute; en ellas, en absoluto. Muy a menudo, publicaciones sin &aacute;nimo de lucro son m&aacute;s profundas y concretas que las comerciales, precisamente por su independencia monetaria, y s&eacute; lo que digo porque he escrito en revistas donde siempre hab&iacute;a que inclinarse del lado del que pagaba la publicidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Concluyo ya, pues me temo que el pesimismo debe estar invadiendo esp&iacute;ritus... simplemente dir&eacute; que no hay que desfallecer. Nunca. Si la ayuda no viene por un lado, vendr&aacute; por otro. A mi no me importa esperar seis meses para leer un buen y completo Macedonia. Esta publicaci&oacute;n me ha sorprendido gratamente n&uacute;mero tras n&uacute;mero, y los problemas que pueda arrastrar no deben hacer m&aacute;s que ser un est&iacute;mulo para que animemos a su direcci&oacute;n, que tan bien lo ha hecho hasta ahora.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; que... tranquilos, que no hab&eacute;is hecho m&aacute;s que empezar. ¡&Aacute;nimo!</P></FONT>
<FONT color="#000000" size=2 face="arial" >        


<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
