<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:Mr.web@cnn.com">Marcelino Cortina "Mr. Web".</A><br>
<FONT color="#009933" size=2 face="arial">Responsable de la sección<br>
"Pregúntele a Mr.Web" en la CNN.</font>
</b></FONT>

<BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
La Historia de Mr. Web<BR>
(o c&oacute;mo la CNN se preocupa del Internauta que habla espa&ntilde;ol)
</FONT>
</H3>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">He de reconocer que pululo por Internet solamente desde 1996. Seg&uacute;n c&oacute;mo se mire esto es poco, es bastante o es mucho. Es poco, porque tres a&ntilde;itos no son demasiados, seg&uacute;n nuestra concepci&oacute;n del tiempo habitual. Es bastante si hacemos uso de la regla que circula por ah&iacute; relativa a los "web years"; seg&uacute;n esto, un a&ntilde;o en la web equivale a s&oacute;lo tres meses de nuestro tiempo est&aacute;ndar. As&iacute; pues, mi experiencia en Internet es de 12 "a&ntilde;os web". Bastante, ¿no? Y es mucho si se piensa que estoy en Espa&ntilde;a, m&aacute;s concretamente en Oviedo, y que en enero de 1996, el n&uacute;mero de internautas habituales espa&ntilde;oles era solamente de 20.000 (1.000.000 a finales de 1997 y m&aacute;s de tres millones ahora mismo). Parece que &eacute;ramos pocos.</P>
<P ALIGN="JUSTIFY">En fin. Despu&eacute;s de algunos pinitos en los primeros 90 usando CompuServe (tiempos aquellos, oye, cuando entr&aacute;bamos desde Vetusta pagando llamada interprovincial a los nodos de Madrid o de Barcelona), la popularizaci&oacute;n de la web provoc&oacute; que este medio fuese el preferido para buscar informaci&oacute;n. &Eacute;ste era el uso que yo le daba a CompuServe: compa&ntilde;eros de las empresas en las que fui trabajando (todas inform&aacute;ticas, en Madrid, Bilbao y Oviedo) necesitaban no s&eacute; qu&eacute; driver o no s&eacute; qu&eacute; informaci&oacute;n sobre determinada cuesti&oacute;n y all&iacute; estaba yo tratando de encontrarlo en la &uacute;nica red interesante a la que pod&iacute;amos acceder. Y &eacute;ste fue, posteriormente, el uso mayoritario que le fui dando a Internet.</P>
<P ALIGN="JUSTIFY">La verdad es que poco a poco me fui convenciendo de que a los millones de internautas que hablaban espa&ntilde;ol les costaba encontrar la informaci&oacute;n que buscaban. Quiz&aacute;s la falta de pr&aacute;ctica. Quiz&aacute;s lo novedoso del medio. Quiz&aacute;s la hiperabundancia de sitios en ingl&eacute;s. Quiz&aacute;s... No s&eacute;, pero el caso es que en mis encuestas particulares (nada fiables estad&iacute;sticamente, pero es que la estad&iacute;stica en s&iacute; ya no es nada fiable: la m&aacute;s inexacta de las Ciencias Exactas, por cierto) la pe&ntilde;a mayoritariamente se frustraba con tanto bombo de la "world wide web" y con tanto no encontrar absolutamente nada de lo que buscaban.</P>
<P ALIGN="JUSTIFY">En definitiva, se impon&iacute;a ayudar, ¿no? Un poco de altruismo en la vida bien est&aacute;, ¿no? Bueno, no s&eacute;. Pero el caso es que se me ocurri&oacute; que alg&uacute;n gran medio electr&oacute;nico de los presentes en 1998 en la red podr&iacute;a ser &uacute;til al internauta espa&ntilde;ol/hispano. Hab&iacute;a muchos con este perfil (espa&ntilde;ol/hispano, gran medio, en la red) y de todos ellos, ¿por qu&eacute; no elegir a la m&aacute;s poderosa empresa del sector informativo del mundo?, ¿por qu&eacute; no elegir a una de las webs m&aacute;s laureadas?, ¿por qu&eacute; no elegir a una de las m&aacute;s lejanas a Oviedo? Se pod&iacute;a, ¿no? Y se pudo. La eleg&iacute;: Cable News Network. La CNN. La del t&iacute;o en Bagdad retransmiti&eacute;ndonos la Tormenta del Desierto. La del que se cas&oacute; con la Jane Fonda. Pues esa. Pues s&iacute;. En cuanto obviaran mi sugerencia y me mandasen a paseo, tiempo habr&iacute;a de propon&eacute;rselo a <A HREF="http://www.geocities.com/CapeCanaveral/6107/manolin.html" TARGET="_NEW">http://www.geocities.com/CapeCanaveral/6107/manolin.html</A> "La Voz de las Batuecas, Edici&oacute;n Electr&oacute;nica" (tranquilos, me lo acabo de inventar).</P>
<P ALIGN="JUSTIFY">Pero resulta que la cosa les cay&oacute; en gracia, t&uacute;. Y les pareci&oacute; que podr&iacute;a tener sentido. Mi propuesta era sencilla: Puede crearse una peque&ntilde;ita secci&oacute;n en la web de CNN en Espa&ntilde;ol, en la cual se le d&eacute; al usuario que entre al sitio la posibilidad de ayudarle, de forma gratuita, a buscar aquello que no encuentra en Internet. Lo que sea. Desenterremos aquellos sitios web que la gente pone y pone en la red, dedicados a los temas m&aacute;s insospechados, y hag&aacute;moslos accesibles para el que no es capaz de dar con ellos.</P>
<P ALIGN="JUSTIFY">CNN es un sitio muy serio y ciertamente profesional. No se arriesgaron porque s&iacute;. Me pusieron a prueba. "Oiga, ¿hay p&aacute;ginas en la web que hablen sobre los triglic&eacute;ridos?" Y las hab&iacute;a, s&iacute;. Unas cincuenta les propuse. Casi todas en espa&ntilde;ol. Estoy hablando de la primavera de 1998. La prueba hab&iacute;a resultado satisfactoria, pero hab&iacute;a que cerciorarse m&aacute;s. "La historia de los Mundiales de f&uacute;tbol". La gente preguntar&iacute;a lo que fuese a CNN (¡lo que fuese!) sobre los Mundiales. Y las respuestas se localizar&iacute;an exclusivamente por Internet. Fue un mes y medio de prueba (desde el 1 de julio de 1998 hasta la mitad de agosto). Una vez m&aacute;s, la prueba sali&oacute; bien. Se contestaron todas las preguntas (una centena, creo recordar). Algunas tan curiosas como qui&eacute;n marc&oacute; el gol 1500 de la historia de los Mundiales. O por qu&eacute; en el Mundial de Francia hab&iacute;an sancionado a un &aacute;rbitro africano (ya no recuerdo el nombre), el &uacute;nico &aacute;rbitro sancionado por la FIFA. Y todas tuvieron respuesta...</P>
<P ALIGN="JUSTIFY">Ah, s&iacute;, tranquilos. El del gol n&uacute;mero 1500 fue el argentino Caniggia en el mundial de USA 1994. No hab&iacute;a ning&uacute;n sitio web que trajese este dato, pero s&iacute; estaban en la web todos los goles de todos los Mundiales desde el primero en Uruguay en 1930. No hab&iacute;a m&aacute;s que sumar. </P>
<P ALIGN="JUSTIFY">Ah, y el &aacute;rbitro (esto me cost&oacute; un poquito, la suerte influye, por supuesto) fue sancionado por conceder una entrevista a un diario italiano. Encontr&eacute; la entrevista, de casualidad y en italiano en la web del peri&oacute;dico. Luego vi que en el reglamento de la FIFA para el Mundial (que estaba en la web de la FIFA) estaba prohibido ofrecer entrevistas durante el mismo. ¿Qu&eacute; cosas, no?</P>
<P ALIGN="JUSTIFY">Volviendo a la historia, el tema estaba definitivamente chequeado y la direcci&oacute;n de CNN dio el OK a la secci&oacute;n para comenzar el primero de octubre de 1998. Ellos decidieron el nombre: "Preg&uacute;ntele a Mr. Web". Me hab&iacute;an convertido en Mr. Web. En fin, tendr&iacute;a que acostumbrarme al nombrecito.</P>
<P ALIGN="JUSTIFY"><A HREF="http://www.cnnenespanol.com/mrweb/index.html" TARGET="_NEW">http://www.cnnenespanol.com/mrweb/index.html</A></P>
<P ALIGN="JUSTIFY">&Eacute;ste es el sitio. Y lo pusieron en portada, con icono de tama&ntilde;o medio en el banner superior y todo. Y la cosa empez&oacute; a crecer. La afluencia de preguntas fue creciendo con bastante ritmo, hasta el extremo que hace alg&uacute;n tiempo (meses) que ya no hay icono, sino solamente una referencia en la columna izquierda de la p&aacute;gina de portada (<A HREF="http://www.cnnenespanol.com/" TARGET="_NEW">http://www.cnnenespanol.com</A>) y la secci&oacute;n contin&uacute;a siendo de las m&aacute;s visitadas (si no la m&aacute;s, voy a ser arrogante). En la redacci&oacute;n de CNN en Atlanta (USA) hablan del "boom de Mr. Web".</P>
<P ALIGN="JUSTIFY">En todos estos meses ha habido de todo. Las preguntas formuladas se acercan peligrosamente a las 2000 y, aunque ha habido que hacer esfuerzos extraordinarios en determinados momentos, actualmente se ha estabilizado la capacidad de respuesta en unas 200 mensuales. Todas, sin excepci&oacute;n, y esto me gusta decirlo, han sido respondidas. No ha habido ni una sola pregunta que no haya tenido cumplida respuesta. Y los mensajes de agradecimiento, de felicitaci&oacute;n, de anonadamiento (¡toma ya con la palabreja!) por la utilidad de las respuestas llegan abundantemente.</P>
<P ALIGN="JUSTIFY">Algunos ejemplos majetes. De las primeras preguntas recibidas, cuando Mr. Web, o sea, un servidor, era un novatillo con la secci&oacute;n fue:</P><DIR>
<DIR>
<I><P>-----Original Message-----<BR>
From: Juancarlos Cevallos </P>
<P>Sent: viernes 2 de octubre de 1998 1:26<BR>
To: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I> &lt;</I><A HREF="mailto:mr.web@cnn.com"><I>mailto:mr.web@cnn.com</I></A><I>&gt; <BR>
Subject: El Guagua Pichincha<BR>
<BR>
¿Me pudiera dar m&aacute;s informaci&oacute;n acerca de la posible erupci&oacute;n del volc&aacute;n<BR>
Pichincha en Ecuador? Si erupciona, sabemos que la lava no puede llegar a<BR>
Quito, pero ¿qu&eacute; intensidad tendr&iacute;an los temblores? Gracias<BR>
Juan Carlos Cevallos<BR>
<BR>
<B>Respuesta de Mr. Web:<BR>
</B><BR>
Juan Carlos,<BR>
<BR>
En la misma l&iacute;nea que hemos respondido a otros usuarios, no es nuestra misi&oacute;n contestar preguntas t&eacute;cnicas. No somos expertos en todos los temas. <BR>
<BR>
En lo que s&iacute; somos expertos es en localizar sitios web en espa&ntilde;ol (y en otros idiomas, por supuesto) sobre cualquier tema. Esto no responde a su pregunta, pero pude mirar en estos sitios que le recomendamos:<BR>
<BR>
Informaci&oacute;n bastante detallada sobre el Pichincha y los efectos de una posible erupci&oacute;n:<BR>
</I><A HREF="http://www.elcomercio.com/elcomercio/html/Volcanes/pichincha.html" TARGET="_NEW"><I>http://www.elcomercio.com/elcomercio/html/Volcanes/pichincha.html</I></A><I><BR>
<BR>
El sitio de Versus ofrecer&aacute; informaci&oacute;n sobre los volcanes del Ecuador en un futuro:<BR>
</I><A HREF="http://www4.versus.com.ec/html/ecuador.html" TARGET="_NEW"><I>http://www4.versus.com.ec/html/ecuador.html</I></A><I><BR>
<BR>
Tiene m&aacute;s detalles en Bac&aacute;n, con unas excelentes p&aacute;ginas especiales<BR>
dedicadas al tema.<BR>
</I><A HREF="http://www.bacan.com/Volcan/index.htm" TARGET="_NEW"><I>http://www.bacan.com/Volcan/index.htm</I></A><I><BR>
<BR>
Y tiene detalles adicionales sobre el Guagua Pichincha en la gran p&aacute;gina de<BR>
la red sobre desastres naturales.<BR>
</I><A HREF="http://www.disaster.info.desastres.net/PED-Ecuador/desastre/pichincha.html" TARGET="_NEW"><I>http://www.disaster.info.desastres.net/PED-Ecuador/desastre/pichincha.html</I></A></P>
<I><P>Saludos cordiales,<BR>
<BR>
Mr. Web</P>
</I></DIR>
</DIR>

<P ALIGN="JUSTIFY">La gracia de esta pregunta es que sorprendi&oacute; mucho que un usuario preguntara sobre algo muy cercano a su casa, y adem&aacute;s con un componente de riesgo evidente, a alguien como Mr. Web, que hasta ese entonces no ten&iacute;a ni idea de la existencia del Pichincha, y que adem&aacute;s se encontraba a miles de kil&oacute;metros de Quito.</P>
<P ALIGN="JUSTIFY">M&aacute;s interesante result&oacute; a&uacute;n que la web proporcionara informaci&oacute;n muy precisa sobre las inquietudes del preguntante.</P>
<P ALIGN="JUSTIFY">Hubo muchas preguntas curiosas. Las declaraciones de Monica Lewinski.</P><DIR>
<DIR>

<I><P>-----Original Message-----<BR>
From: Jos&eacute; Luis (M&eacute;xico)</P>
<P>Sent: viernes 2 de octubre de 1998 1:13<BR>
To: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I> &lt;</I><A HREF="mailto:mr.web@cnn.com"><I>mailto:mr.web@cnn.com</I></A><I>&gt; <BR>
Subject: Lewinsky<BR>
<BR>
&lt;&lt;Card for ah...yo&gt;&gt; Puede decirme en qu&eacute; parte del web encuentro las<BR>
declaraciones de M&oacute;nica Lewinsky y donde las de Clinton en espa&ntilde;ol?<BR>
Gracias<BR>
<BR>
Respuesta de Mr. Web:<BR>
<BR>
Una opci&oacute;n pueden ser las p&aacute;ginas del peri&oacute;dico espa&ntilde;ol El Pa&iacute;s, donde se recoge un extracto bastante interesante:<BR>
</I><A HREF="http://www.elpais.es/p/d/temas/clinton/portada.htm" TARGET="_NEW"><I>http://www.elpais.es/p/d/temas/clinton/portada.htm</I></A><I><BR>
<BR>
El peri&oacute;dico El Mundo, tambi&eacute;n de Madrid, recoge la declaraci&oacute;n completa traducida, aparte de m&aacute;s datos, fotos, etc...:<BR>
</I><A HREF="http://www.el-mundo.es/internacional/clinton/video/index.html" TARGET="_NEW"><I>http://www.el-mundo.es/internacional/clinton/video/index.html</I></A><I><BR>
<BR>
Finalmente, la propia CNNenEspa&ntilde;ol ha elaborado un extracto detallado:<BR>
</I><A HREF="http://cnnenespanol.com/eeuu_canada/1998/10/03/clinton.internet/index.html" TARGET="_NEW"><I>http://cnnenespanol.com/eeuu_canada/1998/10/03/clinton.internet/index.html</I></A><I><BR>
<BR>
Saludos cordiales,<BR>
<BR>
Mr. Web<BR>
</P></DIR>
</DIR>

</I><P>La ca&iacute;da del Muro de Berl&iacute;n en espa&ntilde;ol.</P><DIR>
<DIR>

<I><P>-----Original Message-----<BR>
From: F. J. Barrantes <BR>
Sent: 29 de octubre de 1998 21:35<BR>
To: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A></P>
<I><P>Subject: <BR>
<BR>
Quisiera saber si tienen informaci&oacute;n sobre la caida del muro de Berlin, si<BR>
la tienen agradeceria si me la mandan o me dicen de donde bajarla, y si no<BR>
si me pueden decir donde puedo conseguirla. Es para un trabajo escolar<BR>
(ultimo a&ntilde;o de la secundaria) de historia que tengo que hacer.<BR>
Muchas gracias...<BR>
Diego Barrantes<BR>
<BR>
Respuesta:<BR>
<BR>
Al haberse producido la ca&iacute;da del muro de Berl&iacute;n antes del boom de Internet, no hay demasiada informaci&oacute;n en espa&ntilde;ol en la red. No obstante, hemos encontrado un sitio web.<BR>
<BR>
Se trata de una estupenda p&aacute;gina argentina dedicada al muro y su ca&iacute;da.<BR>
</I><A HREF="http://www.ciudad.com.ar/publico/home/intsurf/971110/971110is.htm" TARGET="_NEW"><I>http://www.ciudad.com.ar/publico/home/intsurf/971110/971110is.htm</I></A><I><BR>
<BR>
Saludos,</P>
<P>Mr. Web</P></DIR>
</DIR>

</I><P>¿Se cierra el observatorio de Greenwich?</P><DIR>
<DIR>

<I><P>-----Original Message-----<BR>
From: GermanaC<BR>
Sent: 10 de octubre de 1998 16:18<BR>
To: </I><A HREF="mailto:correo@cnn.com"><I>mr.web@cnn.com</I></A><I> <BR>
Subject: ?Fin del observatorio de Greenwich?<BR>
<BR>
Quisiera que me puedan confirmar la noticia del cierre del Observatorio Real<BR>
de Greenwich, observatorio que cre&oacute; el sistema de meridianos y cuyo<BR>
meridiano 0 lleva su nombre.<BR>
Esto ocurrir&iacute;a el dia 31 de Octubre de 1998.<BR>
Esta informaci&oacute;n la vi en la direccion de internet </I><A HREF="http://www.ast.cam.ac.uk/RGO"><I>www.ast.cam.ac.uk/RGO</I></A><I><BR>
&lt;</I><A HREF="http://www.ast.cam.ac.uk/RGO" TARGET="_NEW"><I>http://www.ast.cam.ac.uk/RGO</I></A><I>&gt; (RGO en mayusculas).<BR>
Ante cualquier informaci&oacute;n acerca de este cierre o de un simple alcance de<BR>
nombres, muchas gracias.<BR>
German Aceituno Ibarra<BR>
<BR>
Respuesta:<BR>
<BR>
Puede confirmar esta noticia siguiendo las notas de prensa publicadas en el Reino Unido sobre los distintos observatorios.<BR>
</I><A HREF="http://www.ast.cam.ac.uk/ING/director/press.html" TARGET="_NEW"><I>http://www.ast.cam.ac.uk/ING/director/press.html</I></A><I><BR>
<BR>
En particular, la siguiente habla del cierre.<BR>
</I><A HREF="http://www.ast.cam.ac.uk/ING/director/ti97705a.html" TARGET="_NEW"><I>http://www.ast.cam.ac.uk/ING/director/ti97705a.html</I></A><I><BR>
<BR>
Todos estos enlaces est&aacute;n en ingl&eacute;s.<BR>
<BR>
Saludos,<BR>
<BR>
Mr. Web</P></DIR>
</DIR>

</I><P ALIGN="JUSTIFY">Informaci&oacute;n para planificar un viaje por carretera desde Espa&ntilde;a hasta el Estrecho de Bering. Esta fue complicada de contestar, sin duda.</P><DIR>
<DIR>

<I><P>-----Mensaje original-----<BR>
De: artefacto <BR>
Para: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I> <BR>
Fecha: martes 24 de noviembre de 1998 11:45<BR>
Asunto: RV: consulta<BR>
<BR>
Querido mr web, esta es mi consulta:<BR>
En los meses de mayo, junio y julio de 1999 preparamos una expedicion de<BR>
periodistas que partira de Finisterre( La Coru&ntilde;a ) hasta el estrecho de<BR>
Bering ( Rusia ) en tres todo terreno. Necesitaria contactar con direcciones<BR>
rusas de esa zona, asi como con ayuntamientos y administraciones locales y<BR>
demas lugares que nos puedan ser de utilidad. Tambien saber si es posible<BR>
informarse de otras expediciones realizadas similares a esta. Tambien donde<BR>
localizar buenos mapas de carreteras de esa latitud. <BR>
GRACIAS.<BR>
Eduardo Urdangaray.<BR>
<BR>
Respuesta:<BR>
<BR>
Como ya podr&iacute;a imaginar todos los sitios que le vamos a sugerir para su visita est&aacute;n en ingl&eacute;s. Es sumamente dif&iacute;cil (si no imposible) encontrar sitios en espa&ntilde;ol sobre un tema tan espec&iacute;fico.<BR>
La Regi&oacute;n Aut&oacute;noma Rusa de Chukotka es el territorio cuya &uacute;nica separaci&oacute;n de Alaska es el Estrecho de Bering. Hemos tratado de recopilar sitios detallados sobre esta regi&oacute;n.<BR>
<BR>
Puede comenzar por los datos introductorios de la Enciclopedia Encarta de Microsoft.<BR>
</I><A HREF="http://encarta.msn.com/index/conciseindex/AB/0ABF5000.htm" TARGET="_NEW"><I>http://encarta.msn.com/index/conciseindex/AB/0ABF5000.htm</I></A><I><BR>
<BR>
Otra p&aacute;gina describiendo Chukotka.<BR>
</I><A HREF="http://www.expage.com/page/chukotka/" TARGET="_NEW"><I>http://www.expage.com/page/chukotka/</I></A><I><BR>
<BR>
Otra m&aacute;s, &eacute;sta del Russian Council.<BR>
</I><A HREF="http://www.russiancouncil.org/chukotka.html" TARGET="_NEW"><I>http://www.russiancouncil.org/chukotka.html</I></A><I><BR>
<BR>
El recurso Rusline tambi&eacute;n habla sobre Chukotka.<BR>
</I><A HREF="http://www.rusline.com/oblast/CHUKOTKA/CHUKOTKA.html" TARGET="_NEW"><I>http://www.rusline.com/oblast/CHUKOTKA/CHUKOTKA.html</I></A><I><BR>
<BR>
A trav&eacute;s de las p&aacute;ginas de IAITO (Interregional Association of Independent Touroperators of the Russian Far East) puede encontrar mucha informaci&oacute;n sobre el lejano oriente ruso, incluyendo, como no, Chukotka.<BR>
</I><A HREF="http://www.iaito.com/" TARGET="_NEW"><I>http://www.iaito.com/</I></A><I><BR>
</I><A HREF="http://www.iaito.com/chukotka.html" TARGET="_NEW"><I>http://www.iaito.com/chukotka.html</I></A><I><BR>
<BR>
Mapas de Rusia.<BR>
</I><A HREF="http://www.elstead.co.uk/russia.htm" TARGET="_NEW"><I>http://www.elstead.co.uk/russia.htm</I></A><I><BR>
<BR>
M&uacute;ltiples enlaces con detalles sobre Rusia.<BR>
</I><A HREF="http://users.aimnet.com/~ksyrah/ekskurs/russlink.html" TARGET="_NEW"><I>http://users.aimnet.com/~ksyrah/ekskurs/russlink.html</I></A><I><BR>
<BR>
Incluye una interesante secci&oacute;n de mapas en la que tambi&eacute;n esta Chukotka.<BR>
</I><A HREF="http://users.aimnet.com/~ksyrah/ekskurs/maps.html" TARGET="_NEW"><I>http://users.aimnet.com/~ksyrah/ekskurs/maps.html</I></A><I><BR>
<BR>
Otra serie de enlaces interesantes relacionados con Rusia.<BR>
</I><A HREF="http://www.learner.org/exhibits/russia/resource.html" TARGET="_NEW"><I>http://www.learner.org/exhibits/russia/resource.html</I></A><I><BR>
<BR>
Finalmente, la p&aacute;gina de la Uni&oacute;n Rusa de Autoridades Locales, desde podr&aacute; contactar con autoridades rusas en su recorrido. Tambi&eacute;n est&aacute; Chukotka, por supuesto.<BR>
</I><A HREF="http://www.rula.ru/e_home.htm" TARGET="_NEW"><I>http://www.rula.ru/e_home.htm</I></A><I><BR>
<BR>
Saludos y buen viaje,<BR>
<BR>
Mr. Web</P></DIR>
</DIR>

</I><P ALIGN="JUSTIFY">P&aacute;ginas sobre el poeta Khalil Gibran. Para m&iacute; era algo absolutamente desconocido la existencia de este se&ntilde;or. Lo mismo que si yo a &eacute;l le pido informaci&oacute;n sobre mi abuela, poco m&aacute;s o menos. No obstante, algo apareci&oacute;.</P><DIR>
<DIR>

<I><P>-----Mensaje original-----<BR>
De: Roberto y Luz Tamayo <BR>
Para: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I> &lt;</I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I>&gt;<BR>
Fecha: domingo 8 de noviembre de 1998 0:02<BR>
Asunto: sobre KAHLIL GIBRAN<BR>
<BR>
Mr Web<BR>
<BR>
Mucho le agradeceria sime indicra don de nencontrar lla poesia m&iacute;stica de <BR>
Kahlil Gibran, sobre todo aque que entre sus versos incluy lo siguiente<BR>
<BR>
Vuestros Hijos no son hijos vuestros<BR>
son los hijos de la vida<BR>
........................<BR>
<BR>
Atentamente<BR>
<BR>
Respuesta:<BR>
<BR>
Puede revisar los siguientes dos enlaces, dedicados por entero a la poes&iacute;a de Kahlil Gibran.<BR>
Unas p&aacute;ginas chilenas.<BR>
</I><A HREF="http://antonia.webhost.cl/~ekaftan/gibran/cgibran.html" TARGET="_NEW"><I>http://antonia.webhost.cl/~ekaftan/gibran/cgibran.html</I></A><I><BR>
<BR>
Dedicadas a "El Profeta".<BR>
</I><A HREF="http://megared.com/mhornae/profeta/index2.htm" TARGET="_NEW"><I>http://megared.com/mhornae/profeta/index2.htm</I></A><I><BR>
<BR>
Saludos,<BR>
<BR>
Mr. Web<BR>
</P></DIR>
</DIR>

</I><P>Bonita e ingeniosa pregunta para acabar el a&ntilde;o 1998. ¿Por qu&eacute; dividimos el tiempo como lo dividimos (horas, minutos, segundos, etc.)? La respuesta cost&oacute; un poco, pero apareci&oacute;. Por supuesto.</P><DIR>
<DIR>

<I><P>-----Mensaje original-----<BR>
De: Jes&uacute;s Daniel Salas Campo <BR>
Para: </I><A HREF="mailto:'mr.web@cnn.com'"><I>'mr.web@cnn.com'</I></A><I> <BR>
Fecha: jueves, 31 de diciembre de 1998 08:55<BR>
Asunto: Origen de la division del tiempo<BR>
<BR>
Buenas Mr Web...<BR>
<BR>
¿Cual es el origen de las divisiones del tiempo? Es decir, ¿porque<BR>
los dias tienen 24 horas, las horas 60 minutos, etc.?<BR>
<BR>
Gracias de antemano, y un saludo<BR>
Jes&uacute;s Daniel Salas Campo<BR>
<BR>
Respuesta:<BR>
El origen parece ser del sistema de medida de los babilonios, que incluso<BR>
parecen haberlo tomado de los sumerios. Tiene mucho que ver con la divisi&oacute;n<BR>
de la circunferencia seg&uacute;n el sistema sexagesimal. Esto lo usaron y<BR>
potenciaron los antiguos egipcios y ha llegado hasta nuestros d&iacute;as.<BR>
<BR>
Puede verlo en la excelente p&aacute;gina sobre magnitudes y medidas de una persona<BR>
de la Universidad Polit&eacute;cnica de Madrid, Espa&ntilde;a.<BR>
</I><A HREF="http://imartinez.etsin.upm.es/ot1/Units_es.htm" TARGET="_NEW"><I>http://imartinez.etsin.upm.es/ot1/Units_es.htm</I></A><I><BR>
<BR>
Tambi&eacute;n est&aacute; descrito con cierto detalle en la p&aacute;gina Anecdotario<BR>
Matem&aacute;tico, de la Universidad de Granada, Espa&ntilde;a.<BR>
</I><A HREF="http://quevedo.ugr.es/~pepe/anecdotario/anecdotario-s.htm" TARGET="_NEW"><I>http://quevedo.ugr.es/~pepe/anecdotario/anecdotario-s.htm</I></A><I><BR>
<BR>
Y se cita tambi&eacute;n en una interesante p&aacute;gina espa&ntilde;ola con curiosidades (junto<BR>
con muchas otras m&aacute;s).<BR>
</I><A HREF="http://www.ctv.es/USERS/rbluiett/artic_curioso.html" TARGET="_NEW"><I>http://www.ctv.es/USERS/rbluiett/artic_curioso.html</I></A><I><BR>
<BR>
No nos resignamos a citarle tambi&eacute;n dos excelentes sitios en ingl&eacute;s.<BR>
<BR>
Ancient Calendars. P&aacute;gina del Physics Laboratory del National Institute of<BR>
Standards and Technology del gobierno de los Estados Unidos.<BR>
</I><A HREF="http://physics.nist.gov/GenInt/Time/ancient.html" TARGET="_NEW"><I>http://physics.nist.gov/GenInt/Time/ancient.html</I></A><I><BR>
<BR>
FAQ Clocks and Time, del norteamericano Gordon T. Ubber.<BR>
</I><A HREF="http://www.ubr.com/clocks/faq/hrmin.html" TARGET="_NEW"><I>http://www.ubr.com/clocks/faq/hrmin.html</I></A><I><BR>
<BR>
Saludos,<BR>
<BR>
Mr. Web</P></DIR>
</DIR>

</I><P ALIGN="JUSTIFY">Durante este a&ntilde;o de 1999 las preguntas, llegadas de todo el mundo (hasta de Jap&oacute;n), han seguido una t&oacute;nica parecida. Desde las sencillas y r&aacute;pidas de contestar hasta las que llevan algunas horas. No os aburrir&eacute; con m&aacute;s ejemplos, pues hay de todos los temas pensables.</P>
<P ALIGN="JUSTIFY">Eso s&iacute;, me gust&oacute; la que, supongo que mosqueado porque todas las preguntas ten&iacute;an su respuesta, realiz&oacute; una persona interes&aacute;ndose ya definitivamente por los trucos o t&eacute;cnicas que usaba Mr. Web para encontrar cosas en Internet. La respuesta para esta pregunta tambi&eacute;n se dio, puesto que aqu&iacute; no hay truco. Aunque se dio casi de la misma forma que los prestidigitadores explican sus trucos al p&uacute;blico. Ah&iacute; va:</P><DIR>
<DIR>

<I><P>-----Mensaje original-----<BR>
De: Daniel Gayo Avello <BR>
Para: </I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I> &lt;</I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I>&gt;<BR>
Fecha: martes, 08 de diciembre de 1998 00:47<BR>
Asunto: ¿Qu&eacute; t&eacute;cnicas utiliza Mr. Web?<BR>
<BR>
Hola! Me gustar&iacute;a saber que buscadores son los que prefiere para<BR>
llevar a cabo sus b&uacute;squedas, trucos que utiliza, etc. (M&aacute;s que nada para no<BR>
tener que fre&iacute;rle a preguntas) ¿C&oacute;mo realizan sus b&uacute;squedas?, ¿Por qu&eacute; son<BR>
realmente exhaustivas?<BR>
<BR>
Gracias, por adelantado.<BR>
Un saludo, Dani<BR>
<BR>
Respuesta:<BR>
<BR>
Mr. Web no utiliza ning&uacute;n truco especial. Los buscadores que utiliza son<BR>
varias decenas (no son demasiados si se piensa que hay m&aacute;s de dos mil),<BR>
desde los m&aacute;s conocidos hasta los m&aacute;s espec&iacute;ficos y raros.<BR>
<BR>
Adem&aacute;s, hay software especializado en b&uacute;squedas por Internet que resulta muy<BR>
&uacute;til. El resto es experiencia, sentido com&uacute;n, un poquito de cultura general y conocimiento de algunos idiomas.<BR>
<BR>
Ah, y no se preocupe lo m&aacute;s m&iacute;nimo, no nos importa que nos "fr&iacute;an a<BR>
preguntas", como usted dice.</P>
<P>De todas formas, puede aprender sobre c&oacute;mo Mr. Web hace sus<BR>
b&uacute;squedas en el siguiente art&iacute;culo de iWorld.<BR>
</I><A HREF="http://www.idg.es/iworld/199811/articulos/buscadores.asp" TARGET="_NEW"><I>http://www.idg.es/iworld/199811/articulos/buscadores.asp</I></A><I><BR>
<BR>
Saludos,<BR>
<BR>
Mr. Web</P></DIR>
</DIR>

</I><P ALIGN="JUSTIFY">Finalizo ya. La historia de Mr. Web contin&uacute;a todos los d&iacute;as en su sitio web. La secci&oacute;n continuar&aacute; todo este a&ntilde;o de 1999 (¡ojo! Vacaciones en julio, merecidas, creo yo) y probablemente en el 2000. Aunque en este a&ntilde;o trataremos de que haya algunas sorpresas que a&ntilde;adan inter&eacute;s a la secci&oacute;n.</P>
<P ALIGN="JUSTIFY">Y para cerrar esta peque&ntilde;a colaboraci&oacute;n que Macedonia ha tenido la deferencia de publicarnos, una pregunta de hace pocos d&iacute;as cuya respuesta ha sido realmente costosa de localizar. No indicar&eacute; en este caso la respuesta proporcionada por Mr. Web al usuario, aunque s&iacute; os digo que, sin ser un tema dif&iacute;cil, ha costado mucho dar con ella. Pero, eso s&iacute;, la respuesta se ha encontrado y el preguntante se nos ha mostrado de lo m&aacute;s agradecido.</P><DIR>
<DIR>

<I><P>----- Mensaje original -----<BR>
De: sergisc </P>
<P>Para: &lt;</I><A HREF="mailto:mr.web@cnn.com"><I>mr.web@cnn.com</I></A><I>&gt;<BR>
Enviado: s&aacute;bado, 08 de mayo de 1999 13:30<BR>
Asunto: Buscando un libro<BR>
<BR>
Busco un libro llamado "vidas breves de imb&eacute;ciles". ¿Me pod&eacute;is decir su<BR>
autor?. Me parece que su autor es italiano.<BR>
Much&iacute;simas gracias.<BR>
</P></DIR>
</DIR>

</I><P ALIGN="JUSTIFY">Saludos a todo Macedonia y a sus lectores,</P>
</FONT>

<br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
