<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=3 face="arial"><B>rcade Total</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<br><br><br>
<H3>Historia de los First Person Shooting (I).</h3>
<P ALIGN=justify>

Todo el mundo da por supuesto que <B>Wolfenstein 3D</B> fue el juego que 
empez&oacute; el g&eacute;nero. Lo cierto es que no fue as&iacute;. Algunos meses antes sali&oacute; <B>Ultima Underworld</B>, que aunque no es un FPS (se trata de un juego de rol), pose&iacute;a algunas de las bases del g&eacute;nero: vista en primera persona, desplazamientos por un entorno simulado 3D, uso de diferentes armas... Antes de Ultima Underworld vimos algunas aventuras gr&aacute;ficas en el mismo estilo programadas para el Spectrum como <B>The Dark Side</B>. Pero esto ya es ponerse muy quisquilloso. Aceptemos barco ;). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se dice tambi&eacute;n que Wolf3D fue el juego que empez&oacute; la fiebre 3D. Tampoco esto es cierto. Pero s&iacute; que puso la base para el programa que la empezar&iacute;a: Doom. Con estas dos clarificaciones, empecemos con nuestra historia de los FPS. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/fps1a.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El legendario Wolfenstein 3D</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Wolfenstein 3D fue programado por id Software y distribuido por Apogee en el a&ntilde;o 92, y se distribuy&oacute; como programa shareware. Se pod&iacute;a coger libremente el primer episodio del juego, y si pagabas el registro (unas 4000 por aquel entonces), recib&iacute;as 5 episodios m&aacute;s para jugar, con unos 8 niveles cada uno. Wolf3D tuvo un recibimiento caluroso, aunque no demasiado. Sorprendi&oacute; por su uso de las 3D, por aquel entonces usadas casi siempre en simuladores de vuelo en un mercado invadido de juegos de plataformas y aventuras gr&aacute;ficas. Los gr&aacute;ficos eran aceptables, la m&uacute;sica pegadiza (un poco demasiado patri&oacute;tica ;) y, lo m&aacute;s importante, el juego daba una libertad de movimientos desconocida en los juegos PC. Adem&aacute;s, Wolf3D presentaba un tema que levant&oacute; no pocas controversias, como era el de luchar contra los nazis en un juego plagado de esv&aacute;sticas, siendo incluso Hitler el enemigo final en una de las fases. No en vano Wolf3D sigue estando prohibido en Alemania. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pocos defectos se le podr&iacute;an sacar a Wolf3D analiz&aacute;ndolo en su momento. El m&aacute;s grande, quiz&aacute;, es la falta de un mapa. Teniendo en cuenta que algunos niveles son verdaderamente laber&iacute;nticos, llega a sacar de quicio el pasar 5 veces por el mismo sitio sin haber conseguido nada. Wolf3D ten&iacute;a adem&aacute;s algunas virtudes extra. Por ejemplo, salieron herramientas extra que permit&iacute;an hacer nuestros propios niveles, o cambiar alguno de los gr&aacute;ficos, algo que alarg&oacute; su vida. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El modesto &eacute;xito de Wolf3D (modesto para un juego normal, pero sin precendentes para un juego shareware que no ven&iacute;a avalado por una compa&ntilde;&iacute;a grande) llev&oacute; a hacer una ampliaci&oacute;n que se llam&oacute; <B>Spear of Destiny</B>. 6 nuevas misiones, alg&uacute;n enemigo y alg&uacute;n gr&aacute;fico nuevo en un juego que apenas se distingu&iacute;a del original. Sin embargo, en aquel momento todo esto era nuevo y nadie puso el grito en el cielo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por desgracia, la serie Wolfenstein no se hizo p&uacute;blica en nuestro pa&iacute;s. A las distribuidoras debi&oacute; parecerles muy arriesgado eso de sacar un producto shareware, y las revistas del sector no sol&iacute;an (ni suelen) comentar productos <I>independientes</I>. As&iacute; que Wolf3D entr&oacute; en Espa&ntilde;a por otro m&eacute;todo: el pirateo. S&oacute;lo se pudo comprar de forma legal cuando, a&ntilde;os despu&eacute;s, y con la fiebre Doom, se cre&oacute; Friendware. Pero para Wolf3D ya era demasiado tarde. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con el <I>engine</I> (el programa que renderiza el entorno gr&aacute;fico del juego) de Wolf3D se hicieron otros juegos, que manteniendo la base, cambiaban el escenario. Un arma nueva, gr&aacute;ficos, etc. As&iacute; llegaron <B>Blake Stone: Aliens of Gold</B> o <B>Corridor Seven: Alien Invasion</B>, localizados en el futuro, que no aportaron realmente nada al g&eacute;nero. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tras el &eacute;xito de Wolfenstein 3D, en Apogee se iniciaron los planes para crear Wolfenstein 3D 2, pero las cosas se torcieron y los miembros de id Software abandonaron el proyecto Wolf3D (y con &eacute;l sus derechos sobre la serie) para embarcase en uno propio, mientras que en Apogee se limitaron a contratar un equipo nuevo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute;, alg&uacute;n tiempo despu&eacute;s, id Software da la gran campanada. Despu&eacute;s de alg&uacute;n tiempo calentando los &aacute;nimos por las &aacute;reas de mensajes de Internet (entonces no era ni de cerca lo que lo es ahora), el 10 de diciembre de 1993 id saca la versi&oacute;n shareware de <B>Doom</B> disponible para todo el mundo. La gente se queda impresionada con el juego, lo que no es de extra&ntilde;ar. Doom era un juego realmente impresionante para su &eacute;poca, pues ten&iacute;a tres caracter&iacute;sticas que le distingu&iacute;an de todos sus competidores: <BR>
&nbsp; </P>

<UL>
<P ALIGN="JUSTIFY"><LI><P ALIGN="JUSTIFY">Doom es un juego 2.5D, pero el engine, unido al excelente trabajo de los dise&ntilde;adores de niveles y las texturas realizadas por los grafistas, hac&iacute;a que pareciera un juego 3D real. El tema estaba muy trabajado, aunque levant&oacute; alguna que otra reacci&oacute;n de los de siempre (en cuanto se nombra el diablo o el infierno siempre pasa), la m&uacute;sica y los efectos sonoros eran sencillamente perfectos. Siguiendo las m&aacute;ximas de John Romero, uno de sus programadores, el juego te ten&iacute;a en tensi&oacute;n constante. Nada como jugar de noche con la luz apagada y los cascos puestos ;). </LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI><P ALIGN="JUSTIFY">Doom fue adem&aacute;s el primer juego que permit&iacute;a modificar pr&aacute;cticamente todas sus partes: niveles, sonidos, m&uacute;sica, gr&aacute;ficos, da&ntilde;os que hac&iacute;an las armas, mediante programas hechos por los fans, como Dehacked o DEU. Esto hizo que todo el mundo se lanzara a hacer su propio mapa para Doom, e incluso se juntaban equipos que hac&iacute;an Conversiones Parciales (PCs) o Totales (TCs), consistentes en dise&ntilde;ar un nuevo Doom. As&iacute;, podr&iacute;amos citar el Aliens TC de Justin Fisher, basado en la pel&iacute;cula, que contaba con gr&aacute;ficos nuevos con los aliens, niveles bien realizados y armas nuevas, una extensi&oacute;n que pone los pelos de punta :). </LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Pero sin embargo, lo que realmente lanz&oacute; 
a este juego y a todo el g&eacute;nero FPS fue otra caracter&iacute;stica: la opci&oacute;n MultiPlayer. Hasta ahora, el jugar contra otro adversario humano no hab&iacute;a sido muy trabajado m&aacute;s que en alg&uacute;n simulador de vuelo como F29 Retaliator o en alg&uacute;n programa de estrategia como Populous. Doom puso de golpe y porrazo un juego rebosante de acci&oacute;n en el que pod&iacute;amos darnos contra un amigo por m&oacute;dem o conexi&oacute;n serie, e incluso jugar 4 personas por medio de una red local (algo ahora cada vez m&aacute;s normal gracias a esto). No fueron pocas las empresas que prohibieron que se jugara a Doom, incluso fuera de horas de trabajo, dado el descenso que tuvieron en su productividad, y m&aacute;s de un empleado fue despedido cuando se encontr&oacute; Doom en su disco duro.</LI></P></UL>
<br><br><center>
<table >
<td><img src="jpg/fps1b.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El Doom, uno de los juegos más<br> influyentes de la historia.</center></b></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como no pod&iacute;a ser menos, el gran &eacute;xito de Doom gener&oacute; una fiebre por hacer juegos que aprovechasen el fil&oacute;n. Uno de ellos lo hizo la propia id software: alg&uacute;n tiempo despu&eacute;s, en 1994, sal&iacute;a <B>Doom 2: Hell on Earth</B>. Doom 2 tra&iacute;a una nueva arma, la escopeta de dos ca&ntilde;ones, que equilibraba a&uacute;n m&aacute;s los combates DeathMatch, adem&aacute;s de un c&oacute;digo mucho m&aacute;s estable, y l&iacute;mites m&aacute;s altos para todos los objetos que la gente pod&iacute;a editar. As&iacute;, hoy podemos encontrar en las &aacute;reas de </FONT><A HREF="http://www.cdrom.com/pub/idgames" target="_new"><FONT SIZE=2>CDRom.com</FONT></A><FONT SIZE=2 color="#000000"> miles de mapas para Doom entre otras cosas, adem&aacute;s de que se escribieron varios libros sobre el tema. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Recientemente, id cedi&oacute; al p&uacute;blico el c&oacute;digo fuente de Doom 2, para estudiarlo, modificarlo cada uno a su antojo, etc, evidentemente sin fines comerciales. Ya se han empezado a ver verdaderas maravillas, como resoluciones de 1024x768, transparencias, men&uacute;s al estilo Quake o DeathMatchs de 8 personas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como dec&iacute;amos, el &eacute;xito de Doom inspir&oacute; a muchas compa&ntilde;&iacute;as a producir sus propios clones, a&ntilde;adiendo una cosita aqu&iacute;, otra all&aacute;, por si colaban. La mayor&iacute;a de &eacute;stos eran malos o muy malos y/o no ten&iacute;an ninguna novedad. Entre ellos podemos nombrar <B>Witchaven</B> o <B>Cyclones</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Curiosa es la historia de <B>In Extremis</B>. In Extremis era un clon de Doom programado por la compa&ntilde;&iacute;a francesa Infogrames. Algunos meses despu&eacute;s de la salida de Doom, alguna revista espa&ntilde;ola empez&oacute; a lanzar piropos al juego, tild&aacute;ndolo de maravilla, as&iacute; que tuvo que ir un chaval con algunos disquetes a la redacci&oacute;n a ense&ntilde;arles lo que era Doom. Y es que <I>Spain is different</I>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pocos juegos inspirados en Doom merecen realmente la pena. Curiosamente, dos de ellos, aunque usaron el engine de Doom, fueron juegos de rol, por lo que no los veremos en profundidad. &Eacute;stos eran <B>Shadowcaster</B> y <B>Strife</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">
El primer FPS basado en Doom (de hecho tambi&eacute;n usaba su engine) es <B>Heretic</B>, de Raven Software. El sistema de juego era el mismo, los enemigos y las armas se parec&iacute;an sospechosamente a los de Doom, pero Raven introdujo algunas mejoras que hicieron que el juego mereciera la pena: la posibilidad (limitada) de mirar hacia arriba y hacia abajo, la mayor variedad de power-ups, el cogerlos y poder usarlos a nuestra conveniencia, y una l&iacute;nea argumental bastante m&aacute;s s&oacute;lida. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/fps1c.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>Imagen del Heretic.</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>Tras Hexen vino <B>Heretic</B>, tambi&eacute;n de Raven, basado en el engine de Doom 2. Al igual que Doom 2 respecto a Doom, las mejoras de Heretic al compararlo con Hexen eran un simple lavado de cara con alg&uacute;n detalle interesante: unos gr&aacute;ficos bastante mejores, y la posibilidad de elegir entre tres tipos de personaje con los que jugar, cada uno de ellos con sus propias caracter&iacute;sticas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pasamos al siguiente juego: <B>Rise of the Triad</B>. ¿Record&aacute;is que cuando id abandon&oacute; Apogee, &eacute;stos siguieron programando Wolfenstein 3D 2?. Pues bien, ROTT es el resultado. El equipo al mando de Tom Hall ampli&oacute; el engine de Wolf 3D hasta conseguir ROTT, pero tom&oacute; una decisi&oacute;n equivocada: mantener los &aacute;ngulos de 90&amp;ordm; entre paredes, esto es, todos los mapas se hacen simplemente remarcando l&iacute;neas en una hoja cuadriculada. &Eacute;sto y el hecho de que los gr&aacute;ficos no fueran ninguna maravilla (aunque no estuvieran mal) hizo que ROTT fuera despreciado por jugadores y revistas por igual. Sin embargo, una vez que olvidamos la fachada, ROTT fue un juego que introdujo muchas innovaciones. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, pod&iacute;amos elegir entre 5 personajes distintos para jugar. Todos los enemigos del juego estaban digitalizados (de hecho, el equipo de creaci&oacute;n de ROTT fue el que hizo de los distintos enemigos), se inclu&iacute;an muchos modos de juego, al estilo de Capturar la Bandera, T&uacute; la Llevas, y as&iacute; hasta unos cuantos m&aacute;, adem&aacute;s de permitir jugar hasta 11 personas simult&aacute;neamente. ROTT inclu&iacute;a como extra transmisi&oacute;n de voz por red. Si est&aacute;bamos jugando contra un amigo, pod&iacute;amos pulsar F11 y gritarle de todo al micr&oacute;fono, que lo o&iacute;a perfectamente en su terminal. Tras ROTT, los jefes en Apogee aciertan cual ser&aacute; el camino a seguir y crean 3D Realms, una subcompa&ntilde;&iacute;a que se dedicar&aacute; exclusivamente a crear FPS. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de ROTT viene una &eacute;poca con sequ&iacute;a de ideas, en la que se ve alguna cosa horrible (<B>Fortress of Dr. Radiaki</B>). En ella, sin embargo, un juego resplandece por encima de los dem&aacute;s: <B>Dark Forces</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los autores del juego son LucasArts, que siguen con su idea de hacer juegos de todos los g&eacute;neros con su licencia de Star Wars. La verdad es que no podemos quejarnos mientras mantengan la calidad (que ya ha flaqueado m&aacute;s de una vez), pero a veces canta la cosa. Con Dark Forces, en cualquier caso, hicieron un trabajo realmente bueno. El argumento est&aacute; bien trabajado, y las escenas entre nivel y nivel le dan mucha fuerza. Pero adem&aacute;s, en el aspecto t&eacute;cnico hay muchas mejoras: para empezar, ahora tenemos la posibilidad de saltar y agacharnos, se ven pisos sobre pisos (hasta ahora, ning&uacute;n objeto pod&iacute;a estar encima de otro), casi todas las armas tienen dos modos de disparo... La &uacute;nica pena es que DF no era tan editable como Doom o cualquiera de sus sucesores, y en LucasArts no hicieron lo m&aacute;s m&iacute;nimo por ayudar a la gente, por lo que las ampliaciones creadas por fans para Dark Forces son realmente pocas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><P ALIGN="JUSTIFY">
<table align="right">
<td><img src="jpg/fps1d.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El esperado Dark Forces.</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>Dark Forces s&oacute;lo tuvo dos problemas. Uno fue que no permit&iacute;a jugar contra m&aacute;s gente. El otro, que no pod&iacute;amos usar un sable de luz ni poderes de la fuerza. Ambos problemas se solventaron recientemente con su segunda parte. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con el engine de Dark Forces se program&oacute; tambi&eacute;n el a&ntilde;o pasado <B>Outlaws</B>. Las mejoras t&eacute;cnicas son m&iacute;nimas (quitando el parche 3Dfx y la posibilidad de una resoluci&oacute;n mayor), aunque merece la pena aunque s&oacute;lo sea por su excelente banda sonora y por su trabajado argumento. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de Dark Forces llega el que fue uno de los grandes &eacute;xitos aqu&iacute; en Espa&ntilde;a: <B>Duke Nukem 3D</B>, de la mano de 3D Realms. Duke es el primer FPS que va m&aacute;s all&aacute; de la barrera de los 320x200, permitiendo en su setup seleccionar hasta 800x600, e incluso m&aacute;s si alter&aacute;bamos el fichero de configuraci&oacute;n manualmente. Aunque el engine es del estilo de Dark Forces y no aporta nada nuevo, sus gr&aacute;ficos son realmente buenos,&nbsp; y en &eacute;l se ve sangre, sangre y m&aacute;s sangre (de alien casi toda, eso s&iacute;), adem&aacute;s de comentarios jocosillos y un machismo que levant&oacute; tambi&eacute;n m&aacute;s de una protesta (alg&uacute;n ex-empleado de 3D Realms ha dicho recientemente que se busca intencionadamente esta controversia porque vende). </P>
<br><br><center>
<table >
<td><img src="jpg/fps1e.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El irrepetible Duke Nukem.</center></b></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En multijugador, hasta 8 personas pod&iacute;an jugar un DukeMatch, con algunos objetos que lo hacen muy entretenido, como el HoloDuke (holograma del jugador al estilo Perseguido), o las bombas activadas a distancia. El sistema de manejo de estos objetos es el mismo que el de Heretic. Duke era tambi&eacute;n bastante ampliable, y el editor de mapas era realmente sencillo, con lo que tambi&eacute;n en Internet pueden encontrarse numerosas ampliaciones. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tras Duke llegaron algunos Add-Ons de calidad, como el Plutonium Pak o Duke in Vacation. Algunas compa&ntilde;&iacute;as, como Xatrix o Monolith licenciaron el engine Build, sacando juegos entretenidos con su propio toque, como <B>Redneck Rampage</B> o <B>Blood</B>. Posteriormente, a mediados del 97, 3D Realms saca Shadow Warrior, con apenas mejoras, con lo que todos los juegos del momento lo dejan m&aacute;s que atrasado. Shadow Warrior contaba para su venta con la controversia habitual, &eacute;sta vez en forma de racismo. Entre otros detallitos, el personaje, japon&eacute;s, lleva un nombre chino, algo que no debi&oacute; sentar nada bien a ninguno de los jugadores de ambos pa&iacute;ses, dados sus piques habituales (la raza humana es as&iacute;). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pues bien, con Shadow Warrior vamos a acabar con esta primera parte. En la pr&oacute;xima podremos encontrar Quake y todo lo que vino despu&eacute;s, pero adem&aacute;s un juego que sali&oacute; poco despu&eacute;s de Doom y que se ha ganado por derecho su presencia en el segundo n&uacute;mero. ¡Hasta entonces!. </P>
</FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadea.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

