<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=3 face="arial"><B>rcade Total</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<H3>Historia de los First Person Shooting (II).</h3>
<P ALIGN=justify>

Antes de terminar nuestra historia particular de
los First Person Shooters, un nuevo dato para completar la primera parte.
Nuestro compa&ntilde;ero Antonio Monreal nos apunta que hab&iacute;a varios
juegos tiempo antes del Dark Side que podr&iacute;an clasificarse como
FPS. En concreto, nombra <B>The Eidolon</B> para Atari o <B>Rescue on Fractalus</B>
y <B>Koronis Rift</B> para Amstrad CPC. &iexcl;Gracias, Antonio!.
<P ALIGN=JUSTIFY> Bien, volvamos al final de la primera parte. En ella
dec&iacute;a que un juego anterior a Duke3D se hab&iacute;a ganado el aparecer
en esta segunda parte. &iquest;Qu&eacute; juego?. &iquest;Por qu&eacute;?.
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY><table align="right">
<td><img src="jpg/descent.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El Descent abrió un nuevo camino<br> en la aplicación de la tecnología 3D <br></center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY>Pues bien, este juego es <B>Descent</B>, y aparece
aqu&iacute; gracias a que fue el primer juego que funcionaba en tres dimensiones
, a diferencia de sus adversarios en su tiempo que usaban las habituales
dos y media. En Descent manejamos una nave que va limpiando niveles de
robots, para resumir el t&iacute;pico argumento inexistente ;). Descent
permite que nos movamos en los 3 ejes, y sus mapas est&aacute;n realmente
bien dise&ntilde;ados. Podemos tambi&eacute;n encontrar otra cosa nueva:
enemigos en 3 dimensiones, a diferencia de los bitmaps habituales en los
juegos del g&eacute;nero, lo que posibilitaba que pudi&eacute;ramos verlos
desde cualquier &aacute;ngulo perfectamente, en vez de pegar botes del
estilo "de visi&oacute;n delantera a delantera derecha". Descent ten&iacute;a
adem&aacute;s otra innovaci&oacute;n: permit&iacute;a nada menos que 8
jugadores al mismo tiempo (antes que ning&uacute;n otro juego) y fue el
primero en incorporar una estructura de red cliente/servidor. Me explico:
en Doom, todos los que van a jugar tienen que entrar al juego al mismo
tiempo, y se va a la velocidad del m&aacute;s lento. Los datos de cada
uno se mandan a todos los dem&aacute;s. En la estructura cliente/servidor,
un ordenador hace de <I>server</I>, y cada uno de los dem&aacute;s conecta
con &eacute;l. Esto favorece, por una parte, que si hay un ordenador lento
jugando no frene a los dem&aacute;s, y por otra, el poder entrar en la
partida en cualquier momento.
<P ALIGN=JUSTIFY> Descent tuvo una segunda parte, <B>Descent 2</B>,
que no aport&oacute; mucho nuevo. Recientemente ha salido <B>Descent: Freespace</B>,
un simulador al estilo Wing Commander basado en el universo Descent, y
se est&aacute; trabajando en <B>Descent 3</B>.
<P ALIGN=JUSTIFY> Volvemos a 1996 en nuestra l&iacute;nea temporal.
Va a salir el juego que va a revolucionar el escenario multijugador en
Internet para siempre: <B>Quake</B>.
<table align="left">
<td><img src="jpg/quake.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El salto de Quake frente al Doom fue brutal.<br>De Sprites pasamos a polígonos y, de nuevo,<br> Id dirigía el rumbo de los FPS</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY> &iquest;Qui&eacute;n no conoce Quake?. Realizado
por el mejor equipo de id Software, antes de que sus miembros empezasen
a formar sus propias compa&ntilde;&iacute;as, Quake qued&oacute; a a&ntilde;os
luz de sus competidores. No en vano estaba programado por <B>John Carmack</B>
y <B>Michael Abrash</B> (este gurú de la programación gráfica descubrió el modo X, es
decir, reprogramó los registros de la VGA obteniendo una resolución de 320x240 
con unos pixels más cuadrados que la clásica de 320x200 y lo que es más importante,
el paso de 1 pantalla virtual a 3), y entre sus dise&ntilde;adores pod&iacute;an
encontrarse nombres como <B>John Romero</B>, <B>American McGee</B> o <B>Tim
Willits</B>, y hasta <B>Sandy Petersen</B>, conocido por su trabajo en
el juego de rol "La Llamada de Cthulhu", basado en las novelas de terror
de <B>H. P. Lovecraft</B>. De hecho, el 'argumento' de Quake est&aacute;
basado tambi&eacute;n en &eacute;stas, pues adem&aacute;s de los bichos
peque&ntilde;os, nos enfrentaremos con Chthon y Shub-Niggurath.
<P ALIGN=JUSTIFY> Quake es el siguiente juego, tras Descent, que funciona
con 3D reales. Pero no s&oacute;lo eso, Quake tiene algo que no encontr&aacute;bamos
en Descent: un modelo f&iacute;sico realista. As&iacute;, podremos notar
cosas como el efecto de la gravedad o el salir despedidos tras un cohetazo
bien colocado. Quake ven&iacute;a adem&aacute;s con un sistema de iluminaci&oacute;n
totalmente innovador. Hasta ahora, se iluminaban los trozos de mapa por
separado, intentando hacer las luces lo m&aacute;s realistas posible. Con
Quake, se colocan focos de luz, y el editor calcula su efecto sobre la
zona adyacente.
<P ALIGN=JUSTIFY> En cuanto a jugabilidad, la modalidad Single Player
se beneficiaba de la novedad y de los enemigos en 3 dimensiones, y de la
espectacularidad de efectos como la lava o el agua. Sin embargo, una vez
terminado el primer episodio (de los cuatro posibles), el resto del juego
era pr&aacute;cticamente id&eacute;ntico y uno acababa realmente aburrido
de Quake. La forma de matar a los enemigos finales no ayud&oacute; en lo
m&aacute;s m&iacute;nimo. Sin embargo, la modalidad MultiPlayer si que
fue algo completamente distinto. Cuanto m&aacute;s se jugaba, m&aacute;s
enganchaba. Quake ven&iacute;a con 6 niveles DeathMatch, muy bien equilibrados,
que todo veterano de Quake conoce hasta su &uacute;ltima esquina. Pero
lo m&aacute;s importante de la modalidad multijugador es que tra&iacute;a
soporte para el protocolo TCP/IP, lo que posibilitaba el que Quake pudiera
jugarse en... Internet.
<P ALIGN=JUSTIFY> Eso aqu&iacute; en Espa&ntilde;a es como no decir
nada. Si alguno de vosotros hab&eacute;is jugado en Internet, me entender&eacute;is.
Uno puede acostumbrarse, pero nunca se parecer&aacute; m&iacute;nimamente
al juego en una LAN. Sin embargo, en EEUU, donde la calidad de las telefon&iacute;as
es muy superior y los precios muy inferiores (tarifas planas inclu&iacute;das),
Quake fue una verdadera bomba. Todos los servidores de Quake estaban llenos
d&iacute;a y noche de jugadores peg&aacute;ndose misilazos aqu&iacute;
y all&aacute;. Pronto, Quake cre&oacute; lo que se ha dado en llamar la
Comunidad Quake. Gran cantidad de gente empez&oacute; a trabajar de forma
desinteresada por la comunidad, y as&iacute;, aprovechando las grandes
posibilidades de ampliaci&oacute;n que Quake daba, empezaron a verse nuevos
mapas, nuevos sonidos, p&aacute;ginas de noticias que contaban lo &uacute;ltimo
en el g&eacute;nero, la formaci&oacute;n de clanes (equipos), ligas de
todo tipo. Todo esto sigue en activo, no ten&eacute;is m&aacute;s que visitar
<A HREF="http://www.bluesnews.com">Blue's News</A>, y desde ah&iacute;
pod&eacute;is saltar a cualquier punto de la Comunidad.
<P ALIGN=JUSTIFY> Pronto la gente se fue asociando en proyectos mayores,
y as&iacute; pudimos ver parches como Capture the Flag o TeamFortress.
Estos parches cambiaban los gr&aacute;ficos del juego y creaban nuevas
modalidades como el capturar la bandera, consistente en dos equipos, cada
uno de los cuales tiene que defender su propia bandera, situada en su base,
e intentar conquistar la del equipo contrario. En todo este tiempo, en
id no se quedaron dormidos, y fueron experimentando cosas que luego llevar&iacute;an
a Quake 2. La primera modificaci&oacute;n fue QuakeWorld. Como ya hemos
dicho, Quake iba casi bien por Internet en los EEUU, pero los americanos
quer&iacute;an que fuera bien bajo un modem normal. QW era un cliente especial
para Internet, que posibilitaba un juego mucho m&aacute;s fluido, a la
vez que a&ntilde;ad&iacute;a algunas caracter&iacute;sticas, como aumentar
el m&aacute;ximo de jugadores a 32. Tras QuakeWorld lleg&oacute; otra gran
revoluci&oacute;n: GLQuake. GLQ estaba programado usando las librer&iacute;as
gr&aacute;ficas Open GL de Silicon Graphics, y lo que hac&iacute;a era
aprovechar las capacidades de las tarjetas aceleradoras basadas en el chip
Voodoo. Esto proporcionaba efectos de luz incre&iacute;bles, filtro bilineal,
agua transparente, resoluciones superiores, y todo ello sin perder velocidad.
R&aacute;pidamente otros fabricantes se fueron metiendo en el ajo, lo que
ha llevado a la ebullici&oacute;n actual en el sector 3D.
<P ALIGN=JUSTIFY> El &eacute;xito de Quake pronto provoc&oacute; que
otras compa&ntilde;&iacute;as hablaran con id, algunas para licenciar el
engine para sus propios proyectos, otras para crear los llamados Mission
Packs. Los MPs eran Add-Ons de Quake, que b&aacute;sicamente tra&iacute;an
nuevos mapas, enemigos y armas, creados profesionalmente, y cuyo buen trabajo
hac&iacute;a que mereciesen la pena. As&iacute; podemos encontrar el <B>Scourge
of Armagon</B> de Hipnotic (ahora Ritual) o el <B>Dissolution of Eternity</B>
de Rogue. Recientemente sali&oacute; un tercer Mission Pack, <B>Abyss of
Pandemonium</B>, que por problemas con el distribuidor se distribuy&oacute;
de forma gratuita, lo que pronto llevar&aacute; a que programadores y distribuidores
se encuentren en el juzgado.
<P ALIGN=JUSTIFY> Otra consecuencia de Quake fue la creaci&oacute;n
de los <I>.plans</I>. Con las p&aacute;ginas de noticias, los fans quer&iacute;an
saber qu&eacute; hac&iacute;a su programador o su dise&ntilde;ador favorito
cada d&iacute;a, y al final se crearon una especie de diarios que &eacute;stos
pod&iacute;an rellenar voluntariamente, y a los que cualquier pod&iacute;a
acceder. Se ha llegado de esta forma a situaciones como, por ejemplo, que
John Carmack anuncie sus noticias (como cambios por ejemplo en su proyecto
Quake 3) a trav&eacute;s de los .plans antes que hacerlo directamente a
la prensa. Adem&aacute;s, Quake tambi&eacute;n posibilit&oacute; el que
muchas compa&ntilde;&iacute;as encontrasen a sus recambios a trav&eacute;s
de Internet. Se han visto ya muchas contrataciones realizadas gracias a
los niveles o al parche que alguien realiz&oacute; en su tiempo libre para
que jugase toda la Comunidad Quake.
<P ALIGN=JUSTIFY><table align="right">
<td><img src="jpg/hexen2.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>El Hexen 2 utilizó el engine del Quake 2<br> mejorando ciertos aspectos y aportó detalles<br> "video aventureros"</center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY><P ALIGN=JUSTIFY> Avanzamos un poco hasta el oto&ntilde;o del 97. Casi
juntos salen <B>Hexen 2</B> y <B>Dark Forces 2: Jedi Knight</B>. Hexen
2 es un juego realizado con el engine Quake, al que se le han hecho bastantes
mejoras. El engine GL viene ya de serie, proporcionando unos gr&aacute;ficos
muy buenos al juego. Los niveles no son ahora lineales, sino que nos movemos
en grupos de 4 o 5 niveles entre los que nos podemos mover libremente.
La modalidad de un jugador mencion&oacute; enormemente desde Quake, al
tener unos objetivos m&aacute;s concretos que cumplir, adem&aacute;s de
ser mucho m&aacute;s variados los niveles. Cada grupo de &eacute;stos representa
una cultura antigua: romanos, mayas, medieval y egipcia. Adem&aacute;s,
Hexen 2, al igual que Hexen, nos permite elegir entre varios tipos de personajes:
el guerrero, el cl&eacute;rigo, el nigromante y la asesina, cada uno con
capacidades especiales. Debe resaltarse sin embargo que cada uno de ellos
tan s&oacute;lo dispon&iacute;a de 4 armas. Aunque Hexen 2 era tan ampliable
y adictivo como Quake, no tuvo mucho &eacute;xito debido a la proximidad
del lanzamiento de Quake 2, que le afect&oacute; muy negativamente. Hexen
2 tuvo tambi&eacute;n su correspondiente HexenWorld, para poder jugar mejor
por Internet, adem&aacute;s de un Mission Pack, <B>Portal of Praevus</B>,
que adem&aacute;s de nuevos niveles de la calidad esperada, inclu&iacute;a
un nuevo personaje, la Demonia.
<P ALIGN=JUSTIFY><table align="left">
<td><img src="jpg/jedi.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b><center>¡Hey!, al fín sable ;) </center></b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=JUSTIFY><P ALIGN=JUSTIFY> Pasamos a Jedi Knight. La segunda parte de Dark Forces
era, en varios aspectos, inferior t&eacute;cnicamente a Quake, a pesar
de haber salido un a&ntilde;o m&aacute;s tarde. Sin embargo, la programaci&oacute;n
de JK se centr&oacute; casi exclusivamente en algo m&aacute;s importante:
su jugabilidad. Esto di&oacute; excelentes resultados. Los niveles si tienen
algo que les hace resaltar: v&eacute;rtigo. Jugad a JK y me entender&eacute;is.
Cuando uno va caminando por un borde y ve que no hay fondo, se pone realmente
en tensi&oacute;n. Adem&aacute;s, JK cumple los dos deseos que los fans
ped&iacute;an desde el primer Dark Forces. El primero era el poder usar
un sable de luz y habilidades de la fuerza. JK nos permite adem&aacute;s
elegir nuestro camino: defender el bien o adentrarnos en los caminos del
Lado Oscuro. Unos v&iacute;deos bien realizados (aunque con unas actuaciones
bastante malas) aportaban mucho a ambos caminos. El otro era el poder luchar
contra otros jugadores. La combinaci&oacute;n de las distintas habilidades
de la fuerza y las 10 armas posibles da para mucha diversi&oacute;n.
<P ALIGN=JUSTIFY> JK tambi&eacute;n tiene una extensi&oacute;n, <B>Mysteries
of the Sith</B>. Aunque &eacute;ste no tiene v&iacute;deos, merece la pena
adquirirlo por su excelente argumento y los a&ntilde;adidos que se hacen
a JK: nuevas armas, nuevas habilidades de la fuerza, nuevos modos de juego...
Lo t&iacute;pico, vamos :).
<P ALIGN=JUSTIFY> Ya nos queda poco. Navidades del 97. El esperado
<B>Quake 2</B> llega y da un nuevo est&aacute;ndar en la jugabilidad multijugador.
Poco nuevo que contar, pod&eacute;is ver un review de &eacute;l en esta
misma revista pulsando <a href="quake2.htm">aqui</a>. A resaltar de Quake 2 que a estas alturas, 8 meses despu&eacute;s,
a&uacute;n siguen sacando parches para intentar cargarse todos los bugs
:(.
<P ALIGN=JUSTIFY> Quake 2 es el &uacute;nico FPS que sale en navidades.
Todos sus competidores se van retrasando uno a uno. Incluso <B>Unreal</B>,
lo que levant&oacute; algunas ampollas. Por fin, &eacute;ste sale en mayo,
despu&eacute;s de a&ntilde;os de espera y de <I>Vaporware</I>. Poco que
contar tambi&eacute;n, ya que pod&eacute;is tambi&eacute;n encontrar un
review de Unreal pulsando <a href="unreal.htm">aqui</a>.
<P ALIGN=JUSTIFY> Entre Quake 2 y Unreal sale <B>Forsaken</B>. Forsaken
puede describirse simple y sencillamente como un Descent con unos efectos
visuales incre&iacute;bles. El juego Single Player os aburrir&aacute; pronto,
pero el Multiplayer es algo realmente incre&iacute;ble por su rapidez y
espectacularidad.
<P ALIGN=JUSTIFY> Y hemos llegado al momento actual.
<BR>
<BR>
<h4>Un vistazo al futuro</h4>
<P ALIGN=JUSTIFY> Parece que a&uacute;n no cansa a la gente el g&eacute;nero.
Varios t&iacute;tulos est&aacute;n en producci&oacute;n y por los previews
vistos ser&aacute;n grandes juegos.
<P ALIGN=JUSTIFY> El que m&aacute;s nos afecta, al menos moralmente,
es <B>Blade</B>. Blade est&aacute; siendo programando por la compa&ntilde;&iacute;a
espa&ntilde;ola Rebel Act Studios y, al igual que Unreal, su historia est&aacute;
plagada de retrasos y m&aacute;s retrasos, tantos que Commandos le ha quitado
el status de abanderado del soft espa&ntilde;ol en el extranjero. La fecha
actual de salida es finales de a&ntilde;o, y si no hacen cambios en el
engine, que cuanto m&aacute;s tiempo pasa, m&aacute;s atrasado se queda,
se espera que su jugabilidad compense sus carencias.
<P ALIGN=JUSTIFY> El que parece que ser&aacute; el primero en salir
es <B>SiN</B>, programado por Ritual Entertainment. Este 26 de julio sali&oacute;
la demo, que ha provocado muy buenos comentarios. SiN se centra en la jugabilidad
y en un juego Single Player con personajes que evolucionan y muy centrado
en el argumento.
<P ALIGN=JUSTIFY> <B>Half-Life</B> es el siguiente. Su fecha de salida
te&oacute;rica es "verano del 98". Programado por Valve Software y distribuido
por Sierra, su foco principal es la inteligencia artificial. Esperan crear
un juego cuyos personajes act&uacute;en de forma diferente cada vez que
juguemos, y lo que es m&aacute;s importante, de una forma cre&iacute;ble.
<P ALIGN=JUSTIFY> Ya para navidades tenemos <B>Daikatana</B>. La ni&ntilde;a
bonita de Ion Storm, cuyo programador jefe es John Romero, trata sobre
viajes en el tiempo, con la compa&ntilde;&iacute;a de dos personajes que
nos ayudar&aacute;n a lo largo del juego, 9 o 10 armas para cada periodo
temporal (edades oscuras, Grecia, San Francisco 2150 y San Francisco 2450),
y sobre todo gore, mucho gore.
<P ALIGN=JUSTIFY> Ya en el 99 nos encontramos con <B>Duke Nukem Forever</B>,
de 3D Realms. Este ha dado ya varias sorpresas. Primero por su uso del
engine de Quake, algo impensable para los "archienemigos" de id, y despu&eacute;s
por el abandono de &eacute;ste y de el trabajo realizado para volver a
empezar con el engine Unreal.
<P ALIGN=JUSTIFY> M&aacute;s adelante tenemos otros juegos que prometen,
como <B>Shogo: Mobile Armor</B> y <B>Blood 2</B> (Monolith), <B>Prey</B>
(3D Realms), <B>Heretic 2</B> (Raven) o <B>Descent 3</B> (Volition). Y
es que parece que el g&eacute;nero est&aacute; m&aacute;s vivo que nunca.


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadea.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

