<HTML>
<BASE TARGET="TEXTO">
<body BGCOLOR="FFFFFF">
<BR>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>R</B></font><FONT color="#000000" size=7 face="arial"><B>ecuerdos de 8 Bits</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Museo del Vídeojuego</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:serandel@arrakis.es">Serandel</A>.
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Fred, el primer gran juego para muchos.
</FONT>
</H3>

<P ALIGN=justify>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
<table align="left">
<td><IMG SRC="gif/fred1.gif" WIDTH="254" HEIGHT="192"></td>
<tr>
<td><DIV align="center"><FONT color="#000000" size=1 face=arial><b>Aqu&iacute; empezamos...</b></DIV></td>
</table>
<FONT color="#000000" size=2 face=arial>

<P ALIGN=JUSTIFY>
<P ALIGN=justify>&#161;Vaya si lo fu&eacute;! Empezando por los autores. S&oacute;lo fijaos en los cr&eacute;ditos que salen bajo el men&uacute;. <B>Fernando Rada</B>, <B>Paco Men&eacute;ndez</B> y <B>Carlos Granados</B>. Seguro que los m&aacute;s veteranos de vosotros ya habr&eacute;is reconocido esos nombres, &#191;verdad? Creado bajo el nombre de <B>Indescomp</B>, el &eacute;xito de este juego, no s&oacute;lo en Espa&ntilde;a sino fuera de nuestras fronteras (en Inglaterra peg&oacute; fuerte), fue el que dio pie a la creaci&oacute;n de <B>Made in Spain</B>, compa&ntilde;&iacute;a que m&aacute;s adelante derivar&iacute;a en <B>Zigurat</B> con la salida de Paco que acabar&iacute;a haciendo ni m&aacute;s ni menos que <B>La Abad&iacute;a del Crimen</B>. Palabras mayores, &#191;eh? As&iacute; que, como quien no quiere la cosa, nos encontramos con que &eacute;ste fue un juego importante en la historia de las casas de videojuegos espa&ntilde;olas. Ah&iacute; queda eso.</P>
<P ALIGN="JUSTIFY">Pero cuando dec&iacute;a lo del primer gran juego para muchos, en quien estaba pensando era en los jugadores. Hagamos un poco de memoria. &#191;Qui&eacute;n no se acuerda de los famosos <I>packs</I> de juegos? S&iacute;, aquel mont&oacute;n de cintas que te daban al comprarte el ordenador de las que le dec&iacute;as a tu padre que con ellas ya no ibas a necesitar comprar m&aacute;s juegos porque ten&iacute;as suficiente y, al fin y al cabo, el ordenador era para estudiar. Snif, recuerdos de infancia. :) </P>
<P ALIGN="JUSTIFY">Pues resulta que a muchos de la generaci&oacute;n del 128K nos regalaron un <I>pack</I> que, entre otras viejas glorias algunas m&aacute;s pasadas que otras (siempre odi&eacute; el <B>Hormigas</B>), tra&iacute;a precisamente el <B>Fred</B>. En aquellos tiempos no ten&iacute;amos ni idea de si era m&aacute;s o menos famoso, o si hab&iacute;a vendido m&aacute;s o menos, pero al ponerlo se convert&iacute;a r&aacute;pidamente en nuestro favorito. Nuestro primer gran juego, que te hac&iacute;a pasar horas frente al televisor con aquel <I>joystick</I> de s&oacute;lo un bot&oacute;n en las manos.</P>
<P ALIGN="JUSTIFY">&#161;Pero todav&iacute;a no os he contado nada del juego! Vamos a remediarlo.</P>

<center>
<table>
<td><IMG SRC="gif/fred2.gif" WIDTH="253" HEIGHT="191"></td>
<tr>
<td><FONT color="#000000" size=1 FACE=ARIAL><b><center>&#161;Por Dios, esto est&aacute; plagado de bichos!</center></b></td>
</table></center>

<P ALIGN="JUSTIFY">Como habr&eacute;is podido ver en las im&aacute;genes que acompa&ntilde;an al art&iacute;culo el juego en s&iacute; es bastante sencillo. &#191;La historia? M&aacute;s simple a&uacute;n. Eres una especie de <B>Indiana Jones</B> con pistola en lugar de l&aacute;tigo (un cambio bastante pr&aacute;ctico) y una prominente nariz. En cada pantalla apareces dentro de una curiosa pir&aacute;mide cuadrada (y digo yo, &#191;por d&oacute;nde entra este hombre?) y tu misi&oacute;n es salir de ella. Claro que si por el camino consigues alg&uacute;n tesorito tampoco le vas a hacer ascos, que la vida est&aacute; muy cara.</P>
<P ALIGN=justify>Dicho as&iacute; no parece gran cosa, pero hay dos problemas. El primero es que la pir&aacute;mide es todo un se&ntilde;or laberinto y lo &uacute;nico que sabes es que la salida se encuentra en el nivel m&aacute;s alto. El segundo son la cantidad de enemigos que te vas a encontrar rondando por ah&iacute;.</P>

<FONT color="#000000" size=2 face=arial>

<P ALIGN="JUSTIFY">

<P ALIGN="JUSTIFY">Al principio empezamos con los fantasmillas, s&aacute;banas con nariz que atraviesan paredes y que son invulnerables, aunque con un buen tiro se vuelven y siguen andando hacia el otro lado. (!) Tambi&eacute;n est&aacute;n las ratas rosas (!!) a las cuales puedes burlar de un salto (por cierto que <B>Fred</B> s&oacute;lo puede dar saltitos hacia arriba y van bastante justos). Siempre que te encuentres s&oacute;lo una, claro, porque cuando veas cuatro o cinco vini&eacute;ndote por los dos lados... O las gotas de &aacute;cido que caen del techo y se filtran por toda la pir&aacute;mide. Y eso en un principio, porque ya vendr&aacute;n las momias, que bajan a toda velocidad por las cuerdas con una habilidad que ya querr&iacute;a m&aacute;s de un alpinista y son capaces incluso de teleportarse a otra parte cuando se ven encerradas, los esqueletos que suben y bajan como quieren, los murci&eacute;lagos vampiros, a los que no le afectan las balas, las lagartijas que se pasean por las paredes esperando a que te roces con ellas, y m&aacute;s...</P>
<P ALIGN="JUSTIFY">
<table align="left">
<td><IMG SRC="gif/fred3.gif" WIDTH="320" HEIGHT="200" ALT=""></td>
<tr>
<td><FONT color="#000000" size=1 face=arial><center>Lagarto, lagarto...</center></td>
</table>
<P ALIGN="JUSTIFY">&#191;Ayudas? Bueno, tambi&eacute;n hay algunas. Para empezar tienes tu rev&oacute;lver, aunque cuida las balas porque s&oacute;lo tienes seis y es dif&iacute;cil encontrar los cargadores que hay escondidos por ah&iacute;. Y un alt&iacute;metro que te serv&iacute;a, principalmente, para desesperarte cuando llegas a un t&uacute;nel sin salida y te fijas en que ya estabas en el nivel 2. Tambi&eacute;n te he dicho ya que puedes dar unos rid&iacute;culos saltitos que con mucha suerte te podr&aacute;n librar de un toque. Afortunadamente tu barra de vida aguanta bastantes impactos, aunque para equilibrar te rellenan muy pocos cuando pasas de fase. Incluso, si tienes potra, puedes encontrarte un mapa, que te ense&ntilde;ar&aacute; el trazado de una parte de la pir&aacute;mide (el problema es que no te dice d&oacute;nde est&aacute;s t&uacute;, as&iacute; que llegar a situarte puede ser bastante complicado ;) O, ya puestos, aprovecharte del algoritmo del laberinto, ya que tiene tendencia a poner el camino de la salida en uno de los dos laterales de la pir&aacute;mide.</P>


<FONT color="#000000" size=2 face=arial>

<P ALIGN="justify">
Con todo lo dicho creo que habr&aacute; quedado claro que era un juego dif&iacute;cil, &#191;no? As&iacute; era, y eso fue un factor importante que contribuy&oacute; a su gran adicci&oacute;n. Baste con decir que, por mucho que jugara, pocas veces pas&eacute; m&aacute;s all&aacute; de la tercera o cuarta pir&aacute;mide. Todo un reto. Tambi&eacute;n podr&iacute;a decir que otra de las razones del pique era su sonido claramente hipn&oacute;tico. (Los que ya conozcan el juego se estar&aacute;n sonriendo.) S&oacute;lo se escuchaban los pasos y saltos de <B>Fred</B>, pero no ve&aacute;is c&oacute;mo se te acababan metiendo en la cabeza (evidentemente, este fen&oacute;meno era m&aacute;s acusado tras cuatro o cinco horas de juego ininterrumpido ;-) <B>Tuc-tuc-tuc-tuc-tuc-tuc-puing-tico-tico-tico-tico...</B> euh... se me est&aacute; yendo la olla. <B>8-D</B> </P>
<table align="right">
<td><IMG SRC="gif/fred4.gif" WIDTH="253" HEIGHT="192"></td>
<tr>
<td><FONT color="#000000" size=1 face=arial><b><center>&#161;Come plomo, fantasma del demonio!</center></b></td>
</table>
<P ALIGN="JUSTIFY">Por &uacute;ltimo, creo que una de las razones de que me gustara tanto era su car&aacute;cter claramente multiusuario. En serio. Y sin necesidad de que ni siquiera tocara el ordenador nada m&aacute;s que uno. Tened en cuenta que en aquellos tiempos poner el ordenador era toda una ocasi&oacute;n, precedida por la ceremonia de echar a todo el mundo del televisor, rodearte de hermanos y/o amiguetes, y disponerse a jugar en grupo. (Yo dir&iacute;a que incluso te ayudaba a hacer amigos :) Pues el Fred era uno de los pocos juegos que hac&iacute;an que nadie se aburriese mientras esperaba su turno.  &#191;A qu&eacute; me refiero? Pues al laberinto, obviamente. Todos y cada uno ten&iacute;amos nuestras propias teor&iacute;as respecto al camino a seguir, y el que jugaba era poco m&aacute;s que un portavoz que se dejaba aconsejar por los m&uacute;ltiples copilotos.</P>

<P ALIGN="JUSTIFY">
-&#161;Oye, que el tunel se divide en dos! &#191;Por d&oacute;nde tiro?<BR>
-&#161;Ve por la izquierda, que yo antes he visto un tesorito por ah&iacute;!<BR>
<B>Nota hist&oacute;rica:</B> los tesoritos se consideraban se&ntilde;al de buena suerte, si cog&iacute;as uno probablemente ibas por buen camino.<br>
-&#161;No, hombre, seguro que por arriba llegas! &#191;Para qu&eacute; te vas a desviar?<BR>
-<b>&#161;No seas tonto, por la izquierda!</B><BR>
-<b>&#161;Que por arriba!</B><BR>
...<BR>
-<B>&#161;Bueno, yo tiro por donde yo quiero que para eso el juego es m&iacute;o! </B>Pues voy a ir por arriba.
<BR><BR>
Un par de minutos m&aacute;s tarde...<BR><BR>
-Ops, pero si no hay salida... &#191;Por d&oacute;nde quedaba exactamente la bifurcaci&oacute;n? <B>^_^'</B>

<BR>


</P>

<FONT color="#000000" size=2 face=arial>
<P ALIGN="JUSTIFY">Como ep&iacute;logo, me queda por deciros que el &eacute;xito de este juego acab&oacute; propiciando, c&oacute;mo no, la aparici&oacute;n de una secuela llamada <B>Sir Fred</B>. Sin embargo, &eacute;sta era una producci&oacute;n bastante diferente, ya toda una se&ntilde;ora videoaventura, con un desarrollo mucho m&aacute;s complejo, pero que s&oacute;lo compart&iacute;a con el <B>Fred</B> original el nombre y el parecido en los gr&aacute;ficos de los personajes. A algunos les gust&oacute; m&aacute;s, a otros nos gust&oacute; menos, pero no cabe duda de que es otro gran juego que tambi&eacute;n alcanz&oacute; su buena cuota de fama. Pero eso ya es otra historia.</P></FONT>

<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index02.htm"><font FACE="ARIAL"><B>[Recuerdos de 8 Bits]</B></font></a> <BR>
<HR>
<A HREF="8bitsd.htm"><font FACE="ARIAL"><B>[El Museo del Vídeojuego]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">RECUERDOS DE 8 BITS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

