<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:jvpons@dtect.com">José Vicente Pons.</A><br>
<FONT color="#009933" size=2 face="arial">Jefe de desarrollo de Exelweiss.</font>
</b></FONT>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
La escarmentada experiencia
</FONT>
</H3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">Me hab&iacute;an pedido un articulo sobre el dise&ntilde;o y posterior realizaci&oacute;n de un videojuego.  Pero, ¿qu&eacute; decir que no hayas le&iacute;do ya por los faqs, news, ircs, mails, y revistas del sector?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Os podr&iacute;a contar la necesidad imperiosa de realizar un script previo al inicio de cualquier parte de c&oacute;digo o gr&aacute;ficos. Y, aunque supongo que eso tambi&eacute;n lo sabr&eacute;is, siempre promet&eacute;is hacerlo para el siguiente proyecto y nunca lo lleg&aacute;is a confeccionar. Para qu&eacute; nos vamos a enga&ntilde;ar, tira m&aacute;s empezar a programar desde un principio, que pasarse varias semanas exprimi&eacute;ndose el cerebelo para ver cuatro l&iacute;neas que se parecen como dos gotas de agua al juego que tanto os gusta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo que voy a hacer es esbozar unas cuantas l&iacute;neas sin cohesi&oacute;n alguna pero que pueden servir tanto al grupo ya formado como a los que piensan formarlo. Tomar todo lo que viene a continuaci&oacute;n como lo que es; una opini&oacute;n personal de alguien que ya lleva alg&uacute;n tiempo en el mundillo.</P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">¿Hacia donde queremos ir?</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta es la primera pregunta que nos debemos de hacer. ¿Qu&eacute; idea tienen los componentes del grupo, tanto colectiva como individualmente, del camino que debe de tomar su proyecto?. Esta pregunta resulta b&aacute;sica antes de ponerse a realizar nada. Tanto es as&iacute; que puede terminar con el grupo siquiera antes de que &eacute;ste se haya puesto a realizar nada. Preguntaros esto; ¿qu&eacute; futuro hubiera tenido nuestro proyecto, con individuos que no saben a d&oacute;nde quieren ir?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seguramente, los individuos se mentir&aacute;n. "<I>Todos vamos a luchar al m&aacute;ximo y emplear todo el tiempo posible en trabajar para el &lt;&lt;GRUPO&gt;&gt;</I>".<I> </I>Aqu&iacute; es cuando el <I>Leader</I> debe saber exactamente lo que espera que sea el grupo y hacia donde quiere dirigirlo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora vamos a suponer que el <I>Leader</I> quiere formar un grupo con el objetivo de que, dentro de un tiempo (poco tiempo), se transforme en una compa&ntilde;&iacute;a de videojuegos. Este es un camino largo y tortuoso en d&oacute;nde los muros son alt&iacute;simos y dif&iacute;ciles de escalar.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2 color="cc0000"><P ALIGN="CENTER">Aqu&iacute; es donde empiezo a meter l&iacute;neas sin cohesi&oacute;n: mentiras y falacias. Lo que no se debe hacer.</P>
<P ALIGN="CENTER"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Desde ahora vamos a llamar al grupo, <I>Empresa</I> (si no pensamos como tal; todo lo que sigue a continuaci&oacute;n no tend&iacute;a sentido si escribirlo ni leerlo) La &uacute;nica diferencia que debe existir entre una <I>Empresa </I>y una <I>Compa&ntilde;&iacute;a</I> (que es una empresa ya establecida), es que todos los miembros de esta &uacute;ltima est&aacute;n cobrando por su trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo primero que debemos de hacer es distinguir entre amistad y negocios. De todos es sabido lo dif&iacute;cil que es encontrar individuos dispuestos a pasarse un a&ntilde;o (dato aproximado) trabajando con la &uacute;nica seguridad de que, "a lo mejor", el producto pueda colocarse y podamos rentabilizar todo el esfuerzo y dinero invertido. No hay que caer, por ning&uacute;n concepto, en el error de admitir como miembro a un amigo que s&iacute;, de vez en cuando, hace alguna cosa. <I>&quot;No te preocupes, como termino de trabajar a las 6 de la tarde, tengo varias horas libres m&aacute;s luego el fin de semana</I>&quot;. Esta cl&aacute;sica y temida frase, que todos hemos escuchado, enfrenta nuestros sentimientos hacia esa persona (que es nuestro amigo), con la realizaci&oacute;n del proyecto. Si no sabes tomar la decisi&oacute;n correcta a su debido tiempo, luego te dar&aacute;s cuenta de que esas horas libres de "t&uacute; amigo" se invierten en salir con la novia o mujer, ver un partido de f&uacute;tbol, ir al cine, ir con los amigos, etc. Aceptar a un amigo en el equipo, por el &uacute;nico hecho de ser un amigo, traer&aacute; problemas y malos rollos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro caso t&iacute;pico es el tomar el videojuego como un "escudo". Es la disculpa ideal delante de sus padres y as&iacute; no pegar golpe. Es muy f&aacute;cil culpar (escudarse) los malos resultados acad&eacute;micos echando la culpa al gran trabajo que se est&aacute; haciendo. Si alguna vez llamas por tel&eacute;fono a alguien en esta situaci&oacute;n, seguro que te dir&aacute;n: "<I>Est&aacute; durmiendo se ha pasado toda la noche trabajando en el videojuego</I>". Por supuesto, el <I>Leader</I> del grupo, nunca recibir&aacute; ese "gran" trabajo que el miembro ha estado realizando por las noches. Este caso es m&aacute;s peligroso, si cabe, que el anterior pues la familia te puede pedir explicaciones al <I>Leader</I> (que es la persona sobre la que descansa toda la responsabilidad del asunto).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay que conseguir que la <I>Empresa</I> sea autosuficiente. Para eso hay que tener todos los elementos necesarios. ¿Cu&aacute;les son estos elementos esenciales que dan cohesi&oacute;n en la <I>Empresa</I>?. Estos elementos son las personas que lo integran. Una configuraci&oacute;n ideal, bajo mi opini&oacute;n, ser&iacute;a la siguiente:</P>
<P ALIGN="JUSTIFY"></P><DIR>


<B>Un Dise&ntilde;ador</B> y <B>Coordinador</B>.<br>
<B>Tres Programadores</B> (uno principal, uno de rutinas IA y otro de apoyo)<br>
<B>Tres Grafistas</B>(un infografista, un animador y otro encargado de temas digitales) <br>
<B>Un M&uacute;sico</B> y <B>Webmaster</B>.<br>
<br></DIR>


<P ALIGN="JUSTIFY">Si se puede, deber&iacute;an de a&ntilde;adirse un Escritor y unos Dise&ntilde;adores de Niveles. En este caso, vamos a suponer que el Dise&ntilde;ador se encarga de suplir el puesto del escritor y que el equipo en conjunto lleva adelante los temas de dise&ntilde;o de niveles. (&eacute;sta estructura expuesta aqu&iacute;, depende tambi&eacute;n del tipo de videojuego a realizar si bien, resulta ser casi ideal).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El siguiente paso ser&iacute;a repartir el trabajo m&aacute;s exhaustivamente. He aqu&iacute; una peque&ntilde;a lista que puede ayudar:</P>
<P ALIGN="JUSTIFY"></P><DIR>

<P ALIGN="JUSTIFY">
El <B>dise&ntilde;ador </B>y<B> coordinador</B> del equipo, llevar&iacute;a las tareas de creaci&oacute;n de gui&oacute;n, niveles, mapeado, y la importante tarea de coordinaci&oacute;n del equipo. <BR>
El <B>programador principal</B> se encargar&iacute;a del engine del juego, de los temas de f&iacute;sica, de l&oacute;gica, etc. <BR>
El <B>programador de IA</B>, llevar&iacute;a las tareas de soporte de red, sonido y, claro est&aacute;, la propia IA del juego.<BR>
El <B>programador de apoyo</B>, ser&iacute;a el encargado de realizar los editores, conversores, compresores, instaladores, etc.<BR>
El <B>grafista principal</B>, deber&iacute;a de llevar el dise&ntilde;o art&iacute;stico del juego, su modelado, texturado y animaciones. El m&uacute;sico, adem&aacute;s de encargarse de la m&uacute;sica del juego, tambi&eacute;n podr&iacute;a llevar el tema del sitio web.<BR>
<BR></DIR>


<P ALIGN="JUSTIFY">Pasemos ahora a hablar un poco sobre la tem&aacute;tica del juego que queremos crear. Pese a que &eacute;ste apartado es algo muy personal, existe la creencia de que una empresa que no hace juegos con un engine 3D, significa que no sabe hacer juegos. Esta falacia se esta oyendo demasiado. Un juego puede ser divertido independiente del engine que use. Est&aacute; claro que los juegos que todos tienen en la mente, utilizan motores 3D ("Quake" y similares). Debemos de ser realistas; el poder crear un juego AAA no est&aacute; al alcance de nuestra <I>Empresa</I>. Ni tenemos recursos, ni personal para poder crear un videojuego que pueda competir en ese terreno tecnol&oacute;gico. Entonces, ¿por qu&eacute; tenemos que volcarnos en proyectos imposibles?. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, un juego AAA tiene que pasar por las manos de una gran distribuidora. (no nos enga&ntilde;emos, un "Quake" confeccionado por un grupo sin el apoyo de una gran distribuidora, se convierte en un juego budget  con mas o menos aceptaci&oacute;n.). Debemos de tener en cuenta que, en la mayor&iacute;a de los casos, todos los elementos que hacen que un juego sea AAA son externos. Si lo que el juego da de s&iacute;, por su calidad, es un 10%, el resto se lo lleva el marketing del que dispone el producto. Preguntaros ahora qu&eacute; ser&iacute;a "Quake" sin esas partidas "deadmatch", sin esos "mapeadores" de misiones, sin esos.... Para qu&eacute; seguir. Lo que trato de exponer es que no hay que obcecarse en crear juegos de &eacute;ste tipo, y ser capaces de volcarnos en un proyecto divertido y original. Cosas, &eacute;stas &uacute;ltimas, de las que adolecen una proporci&oacute;n muy grande los AAA que est&aacute;n saliendo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay que centralizar el desarrollo. Que el proceso de creaci&oacute;n del videojuego pasa por multitud de vicisitudes, es algo obvio. Todos estos problemas, necesitan de la participaci&oacute;n directa de los miembros del equipo y esto s&oacute;lo lo podremos conseguir si somos capaces de centralizar en alg&uacute;n sitio el desarrollo de nuestro proyecto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay que fijar objetivos. El proyecto que se est&aacute; realizando debe de estar muy claro en la cabeza de cada uno de los componentes del grupo. Para ello, se debe poner unos objetivos en cuanto a su magnitud y caracter&iacute;sticas. En otras palabras, durante el transcurso que dure el proyecto, &eacute;ste ha de cambiar lo menos posible.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay que trabajar de acuerdo con un calendario. Si no somos capaces de llevar un ritmo constante, acabaremos teniendo nuestra particular "Obra del Escorial". Un videojuego no es videojuego hasta que no se ha acabado y de proyectos inacabados est&aacute; el mundo del videojuego. S&oacute;lo hace falta echar un vistazo a proyectos que comenzaron sin fecha de finalizaci&oacute;n y se alargaron hasta la muerte o se abandonaron por quedar completamente desfasados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya para acabar, vuelvo un poco al principio de &eacute;ste art&iacute;culo; hay que ser consciente de que el proyecto del videojuego es un proyecto com&uacute;n. El simple fallo de alguien del grupo est&aacute; fastidiando y condicionando al resto de miembros del equipo. Hay que asumir las responsabilidades que se adquieren al comenzar la creaci&oacute;n del juego y no perder, nunca, la ilusi&oacute;n de realizar una obra maestra y un trabajo bien hecho.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En esto de los videojuegos, hay que tener presente un dogma de fe; "las cosas bien hechas, adem&aacute;s de dar una gran satisfacci&oacute;n al final de su realizaci&oacute;n; acaban ofreciendo, al que ha participado de su construcci&oacute;n, el reconocimiento del resto del mundo ".</P></FONT>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
