<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto: garcifer@iies.es">David García "Gato".</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Piratas, ¿víctimas o bandidos?
</FONT>
</H3>


<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
<P ALIGN=JUSTIFY>
Uno de los grandes problemas para las empresas de inform&aacute;tica en los &uacute;ltimos tiempos es la constante pirater&iacute;a que sufren. Millones de copias piratas se mueven anualmente por el mundo. Son muchas las acusaciones y denuncias que se producen cada a&ntilde;o, y son muchas tambi&eacute;n las empresas que cierran por este motivo, como podemos leer en el art&iacute;culo, publicado aqu&iacute;, de Kapit llamado &quot;Pirater&iacute;a&quot;. Aqu&iacute; dar&eacute; una visi&oacute;n personal a la situaci&oacute;n actual de la pirater&iacute;a. Intentar&eacute; ver causas y consecuencias del alto &iacute;ndice de pirater&iacute;a de Espa&ntilde;a. Hablar&eacute;, ante todo, de la pirater&iacute;a casera, la que no tiene fines comerciales, solo personales, puesto que la pirater&iacute;a como forma de ganar dinero f&aacute;cil es otro mundo. Ya que sabemos de qu&eacute; va este art&iacute;culo empezar&eacute; mi reflexi&oacute;n, pero antes quiero dejar claro lo siguiente:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="CENTER">NO APOYO, DE NINGUNA MANERA, LA PIRATER&Iacute;A INFORM&Aacute;TICA NI NADA RELACIONADO CON ELLA. SOLO EXPONGO AQU&Iacute; LA OPINI&Oacute;N DE MUCHA GENTE QUE, COMO YO, VE EL MUNDO DE LA INFORM&Aacute;TICA DESDE UN PUNTO DE VISTA PRACTICO Y CASERO, SIN M&Aacute;S PRETENSIONES.</P>
</FONT><P ALIGN="CENTER"></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Al que s&iacute; apoyo es a ese estudiante de arquitectura que debe conseguir un programa CAD de m&aacute;s de 100.000 pesetas o al peque&ntilde;o usuario que pretende conseguir un buen, y caro, sistema operativo. Ellos son los que no tienen ninguna culpa si copian el programa que sea, <B>ellos son las v&iacute;ctimas y no los bandidos</B>.</P>
</FONT><P ALIGN="CENTER"></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ya est&aacute;. Sin temor a equ&iacute;vocos, ahora s&iacute; que empiezo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Qui&eacute;n no ha necesitado alguna vez un programa para, por ejemplo, retoque fotogr&aacute;fico? Decides ir a una tienda a preguntar precios.</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>Hola, buenos d&iacute;as. Estaba buscando alg&uacute;n programa para retoque de fotos. ¿Me puede dar precios y caracter&iacute;sticas de cada uno?</LI></P>
<P ALIGN="JUSTIFY"><LI>¡Claro! Mira tenemos el Photo Truker plus plus alpha MegaDelux. Es muy bueno.</LI></P>
<P ALIGN="JUSTIFY"><LI>¿Y cu&aacute;nto cuesta? </LI></P>
<P ALIGN="JUSTIFY"><LI>Solo 95.000 pesetas, sin IVA. Pero adem&aacute;s te regalamos el Truky Imagen 1.0 beta3 para pintar l&iacute;neas rojas en papel satinado DIN A8.</LI></P>
<P ALIGN="JUSTIFY"><LI>¿Y si no me regala nada? ¿en cuanto se queda?</LI></P>
<P ALIGN="JUSTIFY"><LI>No hijo, no puedo hacer eso. El Truky va incluido en el paquete. </LI></P>
<P ALIGN="JUSTIFY"><LI>Jo, ¿y algo m&aacute;s barato? </LI></P>
<P ALIGN="JUSTIFY"><LI>¡Por supuesto! El Microproft Photo Paint v8.0.2 beta6 secci&oacute;n3 plus GigaLux. Este te sale por solo 35.995, m&aacute;s IVA, claro.</LI></P>
<P ALIGN="JUSTIFY"><LI>Bueno, gracias, me lo pensar&eacute;. Adi&oacute;s.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este chico seguramente ver&aacute; alg&uacute;n d&iacute;a un anuncio como este en cualquier sitio. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="CENTER">Photo Truker plus plus Alpha MegaDelux m&aacute;s 200 Megas de librer&iacute;a gr&aacute;ficas y el programa Microtach Picturer por SOLO 3.500 pesetas. (manuales de regalo).</P>
<P ALIGN="CENTER">Llamar al 91694678950 y preguntar por Pepe.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y aqu&iacute; surge la tentaci&oacute;n: ¿me gasto 3.500 pelas y me lo compro pirata? O ¿me lo compro original por 95.000? Los pros del original son, que es original, y el soporte t&eacute;cnico. Lo malo su elevad&iacute;simo precio. La ventaja del pirata es su bajo precio y ya. Pero su desventaja es la falta de seguridad que tiene, pero seguro que el pirata de turno no quiere tener problemas y se ha asegurado del funcionamiento de su CD. ¿Qu&eacute; har&aacute; nuestro comprador? Pues os lo voy a decir, para usar el programa en su casa, se comprar&aacute; el pirata. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esto es lo que suele pasar d&iacute;a a d&iacute;a en el mundo de la inform&aacute;tica personal. En el caso de las empresas ya tiene m&aacute;s delito, ya que &eacute;stas s&iacute; que tienen pasta para gastar en software. La mayor&iacute;a de la gente a la que conoc&eacute;is tiene el Windows 95, el Word o el WordPerfect, el Excel, el C++, etc. Pero, ¿cu&aacute;ntos de ellos se lo han comprado original? ¿Qui&eacute;n se ha podido gastar las 70.000 pesetas del Office 97 Pro o las 15.000 del W95? </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro caso que se suele ver el del Shareware. </P>
<P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>¡Mira Luis que programa tan flipante trae el CD de la revista SharePC de &eacute;ste mes!</LI></P>
<P ALIGN="JUSTIFY"><LI>¡C&oacute;mo mola! Pero solo dura 30 d&iacute;as... ¿cu&aacute;nto cuesta registrarlo? </LI></P>
<P ALIGN="JUSTIFY"><LI>Veamos... 45$. ¡¡Cachis!! Pues nada... a disfrutarlo solo 30 d&iacute;as...</LI></P>
<P ALIGN="JUSTIFY"><LI>¡Espera Pepe! Ayer vi una web que dec&iacute;a algo sobre registrar gratis tus programas... ¡Isla Tortuna, el para&iacute;so de los tortunos! S&iacute;, as&iacute; se llamaba. Echemos una ojeada. </LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pepe y Luis entrar&aacute;n ah&iacute; y descubrir&aacute;n que los n&uacute;meros de registro de todos sus programas Sharaware los pueden encontrar en la red, en cualquier web de cracks o n&uacute;meros de serie, y nunca m&aacute;s pagar&aacute;n un duro por uno de esos programas de las revistas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hemos visto dos ejemplos de uno de los fen&oacute;menos m&aacute;s preocupantes, para unos, y alucinantes, para otros, que est&aacute; sucediendo ahora en la red. Ante los abusivos precios de <B>algunos</B>, y recalco la palabra &quot;<B>algunos</B>&quot;, programas la gente est&aacute; optando por conseguirlos de forma poco legal. ¿Y la culpa de esto qui&eacute;n la tiene? Pues, en mi modesta opini&oacute;n, la tienen las empresas de software, por haber intentado pasarse, aprovech&aacute;ndose de los consumidores, que estaban indefensos ya que eran ellos los que impon&iacute;an precios a su antojo, con poca o nula competitividad entre ellos. Bueno, siempre est&aacute; la gente comodona, que prefiere no pagar un duro nunca cueste lo que cueste, pero de esos no hablamos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Por qu&eacute; un juego tiene que costar 9.000 pesetas? Dentro de tres o cuatro meses te habr&aacute;s cansado de ese fant&aacute;stico programita, y entonces... ¿qu&eacute; haces con &eacute;l? 9.000 pesetas a la basura. Mira los del PC Futbol, sacan sus productos por solo 2.900 pesetas, pues por dos mil y pico s&iacute; que me lo compro. O gente como un tal Miguel JF que sac&oacute; un programa reproductor multimedia, muy bueno, por solo 1000 pesetas, pues tambi&eacute;n me lo compro. Pero si tengo que pagar la millonada de un CAD o de un PhotoAlgo, pues nada, que bajen el precio y me lo pienso. ¿Por qu&eacute; no puede costar el MS Word97 3.000 pesetas? Con la de pasta que tiene el Gates, ya podr&iacute;a bajar un poco el precio de sus productos, seguro que as&iacute; ganar&iacute;a m&aacute;s pasta a&uacute;n. Aqu&iacute; debo felicitar a Microsoft por su idea de las licencias para estudiantes. Por un precio mucho menor al normal, aunque sigue siendo alto, te facilitan el software para el uso en tus estudios. No todo es malo :) en la inform&aacute;tica.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las compa&ntilde;&iacute;as de software se defienden diciendo que la pirater&iacute;a les obliga a subir m&aacute;s a&uacute;n los precios, y por esto la gente compra cada vez menos. Es una pescadilla que se muerde la cola. Un problema que no tiene, a&uacute;n, soluci&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El contraataque de las multinacionales del software ha sido la BSA, la Asociaci&oacute;n de Empresas de Software. Adiada por unos y criticada por otros debido a sus m&eacute;todos, abusivos muchas veces, como se demostr&oacute; en Espa&ntilde;a hace poco con lo de FER13 y compa&ntilde;&iacute;a, la BSA es la enemiga, el drag&oacute;n escupefuego, que amenaza a el ideal del cracker y el pirata inform&aacute;tico. El destructor de las esperanzas de muchas personas que poseen un PC y que no disponen de 100.000 pesetas anuales para ponerse al d&iacute;a de los programas que van saliendo. Ya veremos qu&eacute; pasa con la BSA.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya hab&eacute;is visto cual es la situaci&oacute;n actual. Si bien es cierto que la pirater&iacute;a casera ha disminuido en los &uacute;ltimos a&ntilde;os, no es, en absoluto algo marginal. Hace a&ntilde;os el 70% del software en Espa&ntilde;a era pirata. Ahora ronda el 50%. ¿Por qu&eacute;? Pues porque el software viene ahora en CD y no todos tienen un CD grabador, que si no ya ver&iacute;an como sub&iacute;a el tanto por ciento otra vez. Ahora que los CDs han bajado de precio hay un peque&ntilde;o repunte de pirater&iacute;a... Pero llega el DVD para sustituirle y volvemos a empezar. ¿Por qu&eacute; cre&eacute;is sino que los CDs grabadores cuestan tanto dinero, mientras que los lectores casi los regalan? Pues para alejarlos del gran p&uacute;blico e impedir la copia masiva de software. Con el DVD pasar&aacute; lo mismo, hasta que llegue un nuevo formato para sustituirle.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, creo que ya he dicho suficiente por hoy. He expuesto un punto de vista que, creo yo, tiene mucha gente, o al menos comparten en gran parte. Espero que alguien lea esto y reflexione sobre el mundo de la inform&aacute;tica y su futuro, y que vea alguna luz en medio de esta batalla oculta entre Grandes Empresas y peque&ntilde;os usuarios. </P>
<P ALIGN="JUSTIFY"></P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <hR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>



<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

