<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Word 97</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gilabeni@netspain.com">Juan Carlos Gilarranz.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial">
<FONT color="#000000"><br><br><br>
<H3>
Cap&iacute;tulo 3.<br>Primeros pasos
</H3>
<p align=justify>

Para comenzar a trabajar con Word lo podemos hacer de distintas formas&nbsp;:</P>
<OL>
<br><br>
<LI>Desde el men&uacute; INICIO&nbsp;:</LI>
<BR>
&#9;&#9;a.- Pincharemos el men&uacute; de Programas.
<BR>
&#9;&#9;b.- Y dentro de esto, elegiremos WORD.<BR>
<LI>Si tenemos un Acceso Directo solamente pincharemos el que corresponda a WORD.<BR></LI>

<LI>Si tenemos la barra de acceso de Office le pincharemos tambi&eacute;n.</LI></OL>

<P ALIGN="JUSTIFY">Si nos damos cuenta, y a lo largo del curso, para una misma cosa podemos ir por varios caminos.</P>
<H4>Primera entrada en Word.</H4>
<P ALIGN="JUSTIFY">Cuando iniciamos Word por primera vez nos aparecer&aacute; una cuadro de texto, en el cual, si lo tenemos iniciado el ordenador con red nos pedir&aacute; nuestro nombre y las iniciales para despu&eacute;s trabajar con ellos. Tambi&eacute;n sirve para saber quien crea los documentos por defecto.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n aparecer&aacute; un cuadro para elegir el tipo de documento que queremos escribir. Este ultimo aparecer&aacute; cuando demos Nuevo.</P>
<h4>Elementos de la pantalla de Word.</h4>
<P ALIGN="JUSTIFY">Al ejecutar Word nos aparecer&aacute; la siguiente pantalla&nbsp;:</P>
<center><img src="jpg/word1.jpg"></center>

<UL>
<B><I><LI><P ALIGN="JUSTIFY">Barra de t&iacute;tulos</B>&nbsp;</I>: Aparece en la primera l&iacute;nea y asigna el nombre del documento por el usuario o el gen&eacute;rico asignado por el ordenador. Un documento tendr&aacute; nombre cuando se grabe .</LI>
<B><I><LI><P ALIGN="JUSTIFY">Barra de men&uacute;s</B></I>&nbsp;: Es la que aparece en la segunda l&iacute;nea y corresponde a los men&uacute;s (Archivo, Edici&oacute;n, Ver, ... ) que realizara una serie de funciones cuando se desplieguen.</LI>
<B><I><LI><P ALIGN="JUSTIFY">Barras de herramientas</B></I>&nbsp;: En estas barras aparecen las acciones mas usuales de Word, que se activan con solo una pulsaci&oacute;n sobre los Iconos. Normalmente aparece las barras Est&aacute;ndar y la de Formato, aunque existen otras barras que las podemos insertar o realizar unas barras especiales (Lo veremos en Personalizar Word).</LI>
<B><I><LI><P ALIGN="JUSTIFY">Reglas&nbsp;</B></I>: permiten establecer tabuladores y sangr&iacute;as para todos los p&aacute;rrafos y ajustar las columnas period&iacute;sticas. Tambi&eacute;n se puede modificar los m&aacute;rgenes preestablecidos utilizando las reglas horizontal y vertical.</LI>
<B><I><LI><P ALIGN="JUSTIFY">Zona de texto</B></I>&nbsp;: es la que escribimos.</LI>
<LI><P ALIGN="JUSTIFY">Barras de desplazamientos&nbsp;: Se encuentran en el borde inferior y derecha de la pantalla y su funci&oacute;n es para desplazar el punto de inserci&oacute;n (I) con rapidez por la zona de texto.</LI>
<B><I><LI><P ALIGN="JUSTIFY">Barra de selecci&oacute;n</B></I>&nbsp;: Zona invisible situada entre el borde y el margen izquierdo. Se utiliza para seleccionar texto, haciendo un clic cuando el puntero del rat&oacute;n adopta la forma de flecha hacia arriba apuntando hacia el texto.</LI>
<B><I><LI><P ALIGN="JUSTIFY">Barra de estado&nbsp;</B></I>: Es la ultima l&iacute;nea de la pantalla y ofrece informaci&oacute;n adicional como el numero de pagina actual, posici&oacute;n del cursor y adem&aacute;s de describir una peque&ntilde;a ayuda de la opci&oacute;n de men&uacute; elegida.</LI></UL>

<P ALIGN="JUSTIFY">Tambi&eacute;n existen otros elementos que pueden aparecer en la pantalla&nbsp; de Word, como son&nbsp;:</P>

<UL>
<B><I><LI><P ALIGN="JUSTIFY">Cuadros de dialogo&nbsp;</B></I>: si al final de una opci&oacute;n aparece unos puntos suspensivos, esto indicara que detr&aacute;s de ella aparecer&aacute; un cuadro de dialogo. Un cuadro de dialogo aparecer&aacute; con varias fichas o pesta&ntilde;as.</LI>
<B><I><LI><P ALIGN="JUSTIFY">Men&uacute;s contextuales&nbsp;</B></I>: Otra forma de trabajar con Word es a trav&eacute;s de los men&uacute;s contextuales, es decir, opciones de men&uacute;s que haciendo un clic en el bot&oacute;n derecho del rat&oacute;n y seg&uacute;n se haga el clic nos presentaran diferentes men&uacute;s emergentes.</LI></UL>

<h4>Cerrar documento</h4>
<P ALIGN="JUSTIFY">Si tienes varios documentos a la vez en Word y quieras despejar o quitar de la memoria alguno de ellos lo tendremos que realizar de las siguientes pasos&nbsp;:</P>
<OL>
<OL>

<LI><P ALIGN="JUSTIFY">Pinchar en el men&uacute; Archivo.</LI>
<LI><P ALIGN="JUSTIFY">A continuaci&oacute;n, elegir la opci&oacute;n Cerrar.</LI></OL>
</OL>

<h4>Nuevo documento</h4>
<P ALIGN="JUSTIFY">Cuando queremos escribir un nuevo documento o uno diferente, se tendr&aacute; que realizar los siguientes pasos&nbsp;:</P>
<P ALIGN="JUSTIFY">&#9;&#9;1.- Pinchar en el men&uacute; Archivo.</P>
<P ALIGN="JUSTIFY">&#9;&#9;2.- A continuaci&oacute;n, elegir la opci&oacute;n de Nuevo.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s saldr&aacute; un cuadro de dialogo si queremos utilizar plantillas y si lo lo queremos le daremos a documento vac&iacute;o.</P>
<h4>Agilidad de movimiento y utilización del Word</h4>
<P ALIGN="JUSTIFY">Cuando trabajas por primera vez en Word, te puede ocurrir que no sepas como borrar, como pasar mas adelante del documento, etc ...</P>
<P ALIGN="JUSTIFY">Solo tienes que saber unas normas o consideraciones iniciales&nbsp;:</P>

<UL>
<P ALIGN="JUSTIFY"><LI>La tecla Retroceso sirve para borrar hacia la izquierda.</LI></P>
<P ALIGN="JUSTIFY"><LI>La tecla SUPR sirve para borrar hacia la derecha.</LI></P>
<P ALIGN="JUSTIFY"><LI>La tecla <I>INTRO/ENTER</I> para ir a la siguiente l&iacute;nea. Word pasa autom&aacute;ticamente al final de la l&iacute;nea.</LI></P></UL>

<P ALIGN="JUSTIFY">Tambi&eacute;n existe un m&eacute;todo para acceder a los men&uacute;s como es con la tecla <I>ALT.</P>
</I><h4>Modos de presentación</h4>
<P ALIGN="JUSTIFY">Word presenta la posibilidad de trabajar o visualizar los documentos que realicemos de diferentes modos o formas. Todos estas formas de visualizaci&oacute;n lo tenemos bajo el men&uacute; VER o en los botones de visualizaci&oacute;n que est&aacute;n situados en el extremo inferior izquierdo de la pantalla junto a la barra de estado. Podemos visualizar desde el 10% hasta el 500%.</P>

<ul>
<B><I><LI><P ALIGN="JUSTIFY">Vista normal</I>. </B>Es la pagina que esta predeterminada de Word y es la que trabajamos mas habitualmente.
Cuando escribes, una pagina en blanco tiene, de manera predeterminada unos valores de 2,5 cm. De m&aacute;rgenes superior e inferior y 3 de izquierda y derecha.
En este modo no se visualizara los m&aacute;rgenes.</p>
</LI>

<B><I><LI><P ALIGN="JUSTIFY">
Vista dise&ntilde;o de pagina. </B></I>En este modo de visualizaci&oacute;n es posible ver los m&aacute;rgenes, gr&aacute;ficos, pies y encabezados. Es decir, mostrara el documento tal como le imprimiremos. <br>
Es muy &uacute;til para ver el aspecto general del documento, pero ha de tener en cuenta que pueda dificultar la rapidez de edici&oacute;n, ya que se necesitara mas memoria de trabajar y en ordenadores con poca RAM trabajara con dificultad con varios documentos a los vez, llegando a bloquear el ordenador.
</p>
</LI>
<B><I><LI><P ALIGN="JUSTIFY">Vista dise&ntilde;o en pantalla. </B></I>Es un nueva presentaci&oacute;n que tiene esta versi&oacute;n.
Consiste en visualizar la pantalla de modo que optimice el dise&ntilde;o de un documento para facilitar su lectura en pantalla.</p>
<B><I><LI><P ALIGN="JUSTIFY">Vista esquema. </B></I>Este modo de presentaci&oacute;n permite contraer apartados para ser imprimidos de manera parcial o expandir todo el documento para verlo o imprimirlo completo.
</p>
</li>
</UL>

<h4>Guardar un documento</h4>
<P ALIGN="JUSTIFY">Para guardar o grabar un documento se realizara de la siguiente forma&nbsp;:
<P ALIGN="JUSTIFY">1.- Pinchar en el men&uacute; Archivo.
<P ALIGN="JUSTIFY">2.- A continuaci&oacute;n elegir una de estas dos opciones&nbsp;:


<UL>
<I><LI><P ALIGN="JUSTIFY">Guardar como</I>&nbsp;: Cuando se realiza por primera vez.</LI>
<I><LI><P ALIGN="JUSTIFY">Guardar</I>&nbsp;: Las veces restantes.</LI></UL>
</UL>

<P ALIGN="JUSTIFY">Cuando elegimos "<I>Guardar como</I>" nos saldr&aacute; un cuadro para especificar el nombre del documento y donde va a estar su ubicaci&oacute;n.</P>
<h4>Eliminar fichero</h4>
<P ALIGN="JUSTIFY">Para borrar o eliminar un fichero debemos de realizar los siguientes pasos&nbsp;:</P>
<OL>

<LI><P ALIGN="JUSTIFY">Pinchar en el men&uacute; Archivo.</LI>
<LI><P ALIGN="JUSTIFY">A continuaci&oacute;n elegir la opci&oacute;n Guardar como&nbsp;.</LI>
<LI><P ALIGN="JUSTIFY">Localizar el archivo a borrar.</LI>
<LI><P ALIGN="JUSTIFY">Una vez localizado dar al bot&oacute;n derecho del rat&oacute;n para que nos salga un men&uacute;. Dentro de este, elegir Eliminar.</LI></OL>

<h4>Salir del Word</h4>
<P ALIGN="JUSTIFY">Para finalizar la sesi&oacute;n con Word, tenemos que seguir cualquiera de estas opciones&nbsp;:</P>
<OL><OL>
<LI><P ALIGN="JUSTIFY">Ir al men&uacute; Archivo y dentro de este elegir Cerrar.</P></LI>
<LI>Dar un doble clic a la W de la esquina superior izquierda.</P></LI>
</OL></OL>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulao.htm"><font FACE="ARIAL"><B>[Curso de Word97]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
