<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<img src="jpg/gtfmn1a.jpg" align="left"><h3>Ranma 1/2</h3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Al escribir un articulo, lo primero que uno se pregunta es: ¿Por donde empiezo?. Generalmente, la respuesta es bastante f&aacute;cil, siempre y cuando no se trate de un tema demasiado complejo o largo. Ahora me resulta que me toca escribir sobre Ranma. Y entonces me hago esa pregunta, y me parece complicad&iacute;sima en este momento. Decid&iacute; empezar por lo m&aacute;s b&aacute;sico, lo casi obvio. As&iacute; que ah&iacute; voy compa&ntilde;eros, me lanzo a escribir sobre una de mis series favoritas, Ranma ½.</P>
<P ALIGN="JUSTIFY">Ranma ½ es uno de los anime que mas fama ha tenido en toda la historia de este genero. Muchas veces, el hecho de que sea famoso no repercute en su alta calidad, como pasa con casos como Sailor Moon, La Blue Girl, etc., pero Ranma no cae en esta categor&iacute;a de "malo pero conocido". Es una historia bastante compleja de amor y luchas que por momentos puede hacernos llorar de emoci&oacute;n, o re&iacute;r a carcajadas.</P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">El Autor (o autora, en este caso)</P>
</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Rumiko Takahashi es la creadora de esta joya del anime. Probablemente nuestra querida Rumiko sea una de las mangaka m&aacute;s prol&iacute;ficas que tiene Jap&oacute;n. Con 42 a&ntilde;os de edad, cuenta con una gran cantidad de series famosas, como Mermaid Forest, Urusei Yatsura, Maison Ikokku, One Pound Gospel, Rumik Theatre y su mas reciente &eacute;xito : Inu Yasha. Sus obras son muy, como ya dije, incre&iacute;blemente prol&iacute;ficas, y parece que no hubiese genero que no pudiese abarcar. Por cierto, como ya se pueden ir imaginando, es una de las mangakas mejor pagadas de todo su pa&iacute;s.</P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">La Historia</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Todo comienza el d&iacute;a que Ranma Saotome llega a la casa de la familia Tendo. Hacia muchos a&ntilde;os, su padre, Genma Saotome, hab&iacute;a entrenado artes marciales con el due&ntilde;o de esa casa, Sowun (o Soun) Tendo. Durante ese tiempo juntos, Genma decidi&oacute; que cuando su hijo creciera se casar&iacute;a con una de las tres hijas de Sowun. Hasta aqu&iacute; todo entendido, ¿verdad?. Pero resulta que cuando Ranma llega a la casa de los Tendo (en realidad, venia forzado por su padre, porque el no quer&iacute;a nada de noviazgos a esta edad) y Sowun sale a recibirlo, algo muy extra&ntilde;o pasa. Ambos se abrazan, y entonces Sowun siente algo extra&ntilde;o en el cuerpo de Ranma, ¡Pechos!. ¡Ranma era una mujer!. ¿Por qu&eacute;?. He aqu&iacute; la raz&oacute;n:</P>
<center><img src="jpg/gtfmn1b.jpg"></center>
<P ALIGN="JUSTIFY">Resulta que luego de que Genma y Sowun tomaron caminos separados, Genma decidi&oacute; comenzar con el entrenamiento de su hijo, para volverlo tan fuerte como &eacute;l. Luego de varios a&ntilde;os de peleas y aprendizaje, Ranma se convirti&oacute; en un tremendo guerrero. Su padre, decidi&oacute; en ese momento que lo llevar&iacute;a a un sitio de entrenamiento sagrado e important&iacute;simo, los pozos de Jusenkyo, en China. El lugar era algo as&iacute; como un mont&oacute;n de charcos de agua con palos alt&iacute;simos, clavados verticalmente. El objetivo del lugar era pelear parado sobre la parte superior de los palos, sin caer al agua, porque cada charco estaba hechizado. Ranma y Genma, sin saber esto, se lanzan a pelear, solo para caer cada uno en un charco distinto. Y he aqu&iacute; el problema, en cada uno de los charcos, hace 2000 a&ntilde;os, algo se ahogo, provocando que cualquiera que caiga al agua se convierta inmediatamente en lo que sea que se hubiese ca&iacute;do all&iacute;. La &uacute;nica manera de revertir el hechizo era con agua caliente, pero esto solo era temporal, porque con el agua fr&iacute;a, volv&iacute;an a su nueva forma. As&iacute; fue como, con agua fr&iacute;a, Genma se convierte en un panda gigantesco, y Ranma se convierte en una bella pelirroja.</P>
<P ALIGN="JUSTIFY">volviendo a la casa Tendo, una vez explicado el problema, Sowun no tiene problema en entregarle a Ranma (que se resiste violentamente a esto) una de sus hijas para casarse. De las tres hermanas (Kasumi, Nabiki y Akane), Akane, la menor, es la elegida. Aqu&iacute; surge un nuevo problema. Akane, al igual que Ranma, no quiere novios, y tampoco le interesan los hombres. Adem&aacute;s, Akane y Ranma tuvieron una fuertis&iacute;ma pelea en el momento anterior a la explicaci&oacute;n. Ranma (en forma de mujer) al llegar a la casa corri&oacute; hacia el ba&ntilde;o para darse una ducha de agua caliente y volver a ser hombre. Akane, desnuda, entr&oacute; al ba&ntilde;o creyendo que Ranma (aun mujer) estaba dentro, pero en lugar de la pelirroja se encontr&oacute; a un chico de su misma edad, y tambi&eacute;n desnudo, ¿se lo imaginan?. </P>
<P ALIGN="JUSTIFY">Esta es la historia base de Ranma, a partir de aqu&iacute; surgen todo tipo de malentendidos, peleas, amores, etc., entre Ranma y Akane, que como dice el viejo dicho "los que se pelean, en realidad se aman".</P>
</FONT>
<h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">Informaci&oacute;n Miscel&aacute;nea</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El nombre de Ranma ½ (o Ranma Nibunnoichi) no creo que sea necesario explicarlo. La palabra japonesa Nibunnoichi significa literalmente "dos partes de uno solo", que en un alarde de interpretaci&oacute;n podr&iacute;amos traducirlo como "un medio" o "1/2". </P>
<P ALIGN="JUSTIFY">La serie de televisi&oacute;n consta de 4 temporadas, con 130 cap&iacute;tulos m&aacute;s o menos. Luego, para v&iacute;deo existe una cantidad numerosa de cap&iacute;tulos fuera de la serie, como por ejemplo "Buscando desesperadamente a Shampoo", o "Como agua para Ranma".</P>
<center><img src="jpg/gtfmn1c.jpg"></center>
<P ALIGN="JUSTIFY">Las pel&iacute;culas, o OVA´s son tres, editados hace poco tiempo, teniendo en cuenta la antig&uuml;edad de la serie.</P>
<P ALIGN="JUSTIFY">La banda sonora de Ranma ½ es interpretada por el grupo de pop japon&eacute;s "DoCo", que esta formado por los mismos miembros del staff de voces de la serie de televisi&oacute;n. Esta banda sonora es considerada por muchos como una de las mejores del anime, con canciones como "Omoide ga Ippai" (Full of Memories, "Jajauma ni Sasenaide" (Don´t Make me a Shrew) o la mas famosa de todas, "It´s Love (Need I Say More?)", la &uacute;nica que no interpret&oacute; ni compuso el grupo DoCo.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<BR>


<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="gtfmn.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







