<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<img src="jpg/gtfmn2a.jpg" align="left"><h3>Rurouni Kenshin</h3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Advertencia : Puede haber spoilers en este articulo, asi que si alguien esta viendo la serie, quiz&aacute;s deba omitir algunos fragmentos.</P>
<P ALIGN="JUSTIFY">Cada a&ntilde;o se estrena una cantidad realmente impresionante de mangas en Jap&oacute;n. De que uno de ellos se llegue a destacar dependen muchisimos aspectos, entre ellos podr&iacute;a nombrar la calidad gr&aacute;fica, la m&uacute;sica, los efectos de sonido, pero en general, la que mas atrae a la gente es la historia. As&iacute; es, el gui&oacute;n de un manga (o anime) generalmente es el que determina el futuro de una serie. Podemos ver casos como Ranma ½, cuyo gui&oacute;n es terriblemente divertido, lo que le adjudico una terrible fama, o el oscuro e indescifrable gui&oacute;n de Akira, que muchos de los que la vieron aun se preguntan "¿Qui&eacute;n era ese Akira entonces?". Por cierto, no me pregunten, porque yo tampoco lo se.</P>
<P ALIGN="JUSTIFY">Hace poco un manga emerg&iacute;a a la luz con el nombre de Rurouni Kenshin, nombre completo "Rurouni Kenshin: Meiji Kenkaku Romatan", o si lo traducimos literalmente, seria algo como "El vagabundo Kenshin: La historia rom&aacute;ntica de un espadachin de la era Meiji". Con un titulo as&iacute; podr&iacute;a esperarse algo mas bien rom&aacute;ntico, pero nada mas lejos de la realidad, Rurouni Kenshin es de esos mangas que son combate tras combate, toda la serie, pero con una gran trama.</P>
<P ALIGN="JUSTIFY">El comic original fue creado por el mangaka japon&eacute;s Nobuhiro Watsuki, e inicio su publicaci&oacute;n el 7 de septiembre de 1994 en el legendario semanario "Shonen Jump". Enseguida se convirti&oacute; en un &eacute;xito, lo que le vali&oacute; el titulo de "sucesor de Dragon Ball" en lo que se refiere a la importancia dentro de la revista. La raz&oacute;n probablemente sea la gran originalidad del argumento, y un detalle por primera vez incorporado en un manga: personajes reales hist&oacute;ricos.</P>
</FONT>
<h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">Contexto hist&oacute;rico</h4></FONT>
<img src="jpg/gtfmn2b.jpg" align="right"><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para poder disfrutar, e incluso entender, el contexto en que se ubica Rurouni Kenshin hay que tener alguna idea sobre historia de Jap&oacute;n. Los acontecimientos se desarrollan en el a&ntilde;o 1878, once despu&eacute;s de la guerra civil, que marco el final de la era feudal en Jap&oacute;n. En cuanto la victoria estuvo asegurada, el asesino mas famoso del bando vencedor, los Ishin Shishis, desaparece sin dejar rastro, dejando una marca en la memoria popular. El hecho que probablemente afecte mas a la trama de la historia es una de las leyes del nuevo gobierno: la disoluci&oacute;n de la clase Samurai. Esto dejo en la calle a muchisimos guerreros, que tomaron caminos muy distintos, desde la adaptaci&oacute;n a los nuevos tiempos, hasta muchos que tomaron malos caminos, por decirlo as&iacute;.</P>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">La historia</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La historia comienza mostr&aacute;ndonos como un d&iacute;a cualquiera, Himura Kenshin se tropieza con una joven llamada Kaoru, la cual esta a cargo del dojo de su fallecido padre. Esta chica esta persiguiendo continuamente a un asesino llamado Hitokiri Battousai (el asesino desaparecido del que hable antes) que pregona que es alumno del dojo de Kaoru, desprestigi&aacute;ndolo. Por supuesto que ya se imaginaran que este asesino es un fraude total, que no es el verdadero, y que en realidad solo quiere tomar venganza con el padre de Kaoru, un antiguo enemigo suyo. Ahora todo este asunto se complica cuando nos enteramos de que Kenshin, el protagonista, no es otro que Hitoriki, que en realidad ha hecho un juramento de paz, prometiendo no matar a nadie nunca mas. Kenshin entonces decide quedarse en el dojo, para ayudar a Kaoru a recuperar su honor y el de su escuela o dojo. Este es el punto de partida para ua historia llena de combates e incluso algunas escenas rom&aacute;nticas o c&oacute;micas.</P>
<center><img src="jpg/gtfmn2c.jpg" ></center>
</FONT><h4><FONT FACE="Arial"><P ALIGN="JUSTIFY">En Conclusion</h4></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Como creo que ya habr&aacute;s adivinado, me encanta esta serie, y por supuesto que la recomiendo a cualquiera. Algo que me olvide de nombrar en el articulo es el asunto de los llamados OVA´s, o pel&iacute;culas. En la pel&iacute;cula que se planeo para Rurouni Kenshin, se cambio radicalmente el dise&ntilde;o de personajes del manga, e incluso de anime. Todo se debe a una campa&ntilde;a de Sony (la productora) de "humanizar" mas los personajes, que para ellos significa, hacerlos mas al estilo americano. Esto hace que la serie pierda un poco ese contenido tan oriental, pero ser&aacute; interesante ver que sale de esta mezcla, ¿verdad?.</P></FONT><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<BR>


<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="gtfmn.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







