<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<img src="jpg/eva1.jpg" align="left"><h3>Evangelion</h3>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">
Esta serie probablemente sea una de las m&aacute;s renombradas y aclamadas del anime de los &uacute;ltimos a&ntilde;os.</P>
<p align="justify">Evangelion es una creaci&oacute;n del estudio Gainax, un grupo de otakus que se juntaron en una empresa, y que ahora tienen mucho &eacute;xito. Esta serie dista mucho de ser un t&iacute;pico anime de ciencia-ficci&oacute;n, y con su tem&aacute;tica filos&oacute;fica y extra&ntilde;a, sorprende mucho que haya tenido tanto &eacute;xito como el que tiene. ¿Cu&aacute;l es su secreto?. La verdad es que nadie lo sabe, solo podemos admirar esta joya del anime y elogiarla todo lo que podemos.</P>
<FONT SIZE=4>
<p align="justify">El Argumento </P>
</FONT>
<p align="justify">Por alguna raz&oacute;n, siempre se me hace dif&iacute;cil explicar el argumento de alguna serie de anime, y justo ahora me meto con uno de los argumentos m&aacute;s complejos de toda la animaci&oacute;n japonesa. Que suerte la m&iacute;a, ¿no?. Bueno, la cosa es mas o menos as&iacute;:</P>
<p align="justify">Una linda ma&ntilde;ana, Shinji Ikari llega con su bolso a Tokio-3. No hay nadie en la ciudad, todo parece solitario y abandonado. Hace algunos d&iacute;as, Shinji hab&iacute;a recibido una carta de su padre, el cient&iacute;fico Gendo Ikari, llamando a Tokio-3 por alguna raz&oacute;n desconocida. Hacia ya 3 a&ntilde;os que no se ve&iacute;an, y no ten&iacute;an una buena relaci&oacute;n, pero aun as&iacute;, Shinji acudi&oacute; al llamado. Mientras que esperaba que lo recogiesen, Shinji mira con horror a una especie de mounstro gigante que esta luchando con el ejercito de la ONU, y que poco a poco se acerca a la ciudad. Justo cuando el gigante esta a punto de pisar a Shinji, un coche frena junto al, y una chica muy guapa lo invita a entrar. Se trata de Misato, una teniente de NERV, la mega corporaci&oacute;n para la que trabaja Gendou. Shinji es llevado a las apuradas hasta la base de NERV, el llamado Geo-Front, una especie de gigantesca ciudad enterrada bajo Tokio-3. All&iacute; se le revela a Shinji el motivo de su llamado. La corporaci&oacute;n NERV sabia de la existencia de ese &quot;gigante&quot;, al que ellos le llaman &quot;Angel&quot;, y sabe que existen m&aacute;s. Por eso construyeron una serie de robots gigantes (mechas) llamados &quot;Evangelions&quot;. Por alguna raz&oacute;n, los &quot;Eva´s&quot; solo pueden ser pilotados por ciertos chicos muy especiales, y de 14 a&ntilde;os de edad. El primer piloto, la extra&ntilde;isima Rei Ayanami, se encontraba muy malherida luego de su entrenamiento con su robot, el Eva-00, que tambi&eacute;n se encuentra destrozado y en reparaciones. Aqu&iacute; entra Shinji, quien parece ser uno de esos chicos especiales, y que ha sido destinado a manejar el Eva-01, muy contra su voluntad. A partir de aqu&iacute;, la historia entra en recovecos y volteretas rarisimas, que como alguien dijo: &quot;Por fin puedo usar el doctorado en Filosof&iacute;a que saque para entender Akira, porque Evangelion es igual o mas compleja&quot;.</P>
<center><img src="jpg/eva2.jpg" ></center>
<FONT SIZE=4><p align="justify">Los Personajes</P>
</FONT>
<p align="justify">Con miedo a revelar mucho, solo hablare de los personajes m&aacute;s principales :</P>


<UL>
<LI>Shinji Ikari: Hijo de Gendou, y piloto (muy a su pesar) del Evangelion-01. Es un chico terriblemente t&iacute;mido e introvertido, que disfruta de la soledad. Tiene una relaci&oacute;n muy conflictiva con su padre, y de alguna manera que ni el mismo lo sabe, siente algo por Rei Ayanami</LI>
<LI>Gendou Ikari: Brillante cient&iacute;fico de la corporaci&oacute;n NERV. &Eacute;l fue quien dise&ntilde;&oacute; y superviso la construcci&oacute;n de los Eva´s. Hombre muy fr&iacute;o y calculador, esta obsesionado con su proyecto y no deja que nada se ponga en su camino. Es tambi&eacute;n muy introvertido, y sabe mucho mas de lo que deja a los dem&aacute;s creer.</LI>
<LI>Misato Kasturagi: Tiene el cargo de teniente, y es la estratega de NERV. Es un personaje muy at&iacute;pico, siempre haciendo bromas y tom&aacute;ndose todo a la ligera, excepto cuando trabaja, que es terriblemente obsesiva y controladora. Tiene un gran problema con la bebida, y su apartamento es lo mas desordenado que existe. Siente un especial afecto por Shinji, y tampoco se lleva muy bien con Gendou. Es terriblemente sociable.</LI>
<LI>Rei Ayanami: Piloto del Eva-00, y la primera en entrar al proyecto Evangelion. Es el personaje mas extra&ntilde;o en la serie. Pareciera que no tiene emociones, y tiene una especie de cari&ntilde;o por Gendou, al cual es al &uacute;nico que escucha. Todos sus datos hasta la fecha de su inmersi&oacute;n en el proyecto Evangelion desaparecieron, as&iacute; que nadie sabe nada sobre ella. Es muy callada e introvertida, y tiene una actitud totalmente indiferente respecto a todo.</LI></UL>

<p align="justify">Podr&iacute;a seguir hablando de otros personajes, como Asuka, Pen-Pen, etc., pero prefiero dejarlos con la intriga.</P>

<FONT SIZE=4><p align="justify">Opini&oacute;n Personal y Conclusi&oacute;n</P>
</FONT>
<p align="justify">A esta altura se estar&aacute;n planteando la pregunta que todos, TODOS, se hacen sobre Evangelion. What is the Matrix? No, no, no, perd&oacute;n, esa era otra pregunta ;-). La pregunta en cuesti&oacute;n es, ¿Es Evangelion taaaaan buena como dicen?. La respuesta es facil y simple: Es mejor de lo que dicen. Es una experiencia que se debe disfrutar solo, y luego emitir juicios. Yo, personalmente, no puedo soportar las series de mechas (robots gigantes, naves transformables, etc.) estilo &quot;Robotech&quot;, &quot;Voltron&quot;, etc., por eso tarde tanto en decidirme por Eva. Pero un d&iacute;a, harto de que todos hablaran de ella, fui y me compre el primer v&iacute;deo. Esa fue una grandiosa decisi&oacute;n y al mismo tiempo una muy inconveniente. Fue genial porque acababa de descubrir una serie con una trama alucinante, con un estilo de animaci&oacute;n inmejorable, y con escenas realmente espectaculares. Fue inconveniente, porque al no ser una serie que se emita por televisi&oacute;n aqu&iacute; en Argentina, tendr&eacute; que comprar los 13 videos que la conforman, mas las dos pel&iacute;culas, lo que me quitara un gran peso de mi bolsillo.</P>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<BR>


<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="gtfmn.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







