<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:aradriel@geocities.com">José Antonio Suárez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<h3>K.O.R. Kimagure Orange Road</h3>

<FONT FACE="Arial" SIZE=2><p align="justify"><font size=-1>Kimagure Orange Road, o KOR, es una de esas historias
tan sencillas y preciosas, que te pueden hacer sentir bien con tan solo
recordarla.</font>
<center><img SRC="jpg/kor2.jpg" height=203 width=258></center>
<p align="justify">
<br><font size=-1>Hace muchos a&ntilde;os comenzaron a emitir una "serie
de dibujos animados" llamada "Johnny y sus Amigos".</font>
<br><font size=-1>Yo v&iacute; el primer episodio por casualidad, un domingo
a las cinco o a las seis de la tarde.</font>
<p align="justify"><font size=-1>Parec&iacute;a una m&aacute;s de esas que estaban echando
cont&iacute;nuamente sobre j&oacute;venes (B&eacute;same Lycia, Piruetas
y otras que ya no recuerdo), pero incluso en el primer episodio pude notar
algo distinto.</font>
<br><font size=-1>No fue la m&uacute;sica, desde luego, ya que apenas ten&iacute;a
en la versi&oacute;n traducida al espa&ntilde;ol, ni los dibujos, que eran
normalitos, ni la historia en s&iacute; misma... entonces, qu&eacute; ser&iacute;a
lo que me enganch&oacute;. Pues a&uacute;n sigo sin saberlo.</font>
<p align="justify"><font size=-1>Siguiendo en el pasado, me acuerdo que a la semana siguiente
comenzaron a emitirla tambien a las cinco o a las seis, y desde ese momento
me qued&eacute; enganchado a su existencia.</font>

<br>&nbsp;<font size=+1></font>
<p align="justify"><b><font size=+1>&iquest;Pero de qu&eacute; trata la serie?</font></b>
<p align="justify"><font size=-1>Pues es un no-t&iacute;pico tri&aacute;ngulo amoroso entre
un joven adolescente y dos compa&ntilde;eras de clase, y lo de no-t&iacute;pico
es porque fue el primero. A partir de aqu&iacute;, los tri&aacute;ngulos
comenzaron a aparecer por todos lados en series japonesas.</font>
<p align="justify"><font size=-1>Se trataba de un estudiante de tercer curso llamado Kyosuke
(voy a usar sus nombres originales en lugar de los "traducidos"), que era
bastante mediocre en todo. Pr&aacute;cticamente se le podr&iacute;a catalogar
como un p&aacute;nfilo si no fuera porque ten&iacute;a un don especial:
poderes extrasensoriales entre los que se encontraba la teletransportaci&oacute;n
y la telekinesia (mover las cosas con la mente) sobre todo.</font>
<p align="justify"><font size=-1>Este Kyosuke es bastante d&eacute;bil, y cuando usa sus
poderes se vuelve a&uacute;n m&aacute;s d&eacute;bil, y uniendo esto a
que la mayor&iacute;a de las veces tan solo le sirven para enredar m&aacute;s
las cosas, pues las escenas comprometedoras est&aacute;n aseguradas, sobre
todo cuando entran en acci&oacute;n sus dos hermanas, que son gemelas y
se llaman Kurumi y Manami, con poderes tambi&eacute;n.</font>
<p align="justify"><font size=-1>La segunda esquina del tri&aacute;ngulo aparte de Kyosuke,
es Hikaru, una estudiante de un curso inferior al de &eacute;l, y con un
car&aacute;cter arrollador capaz de darle alegr&iacute;a a un desierto,
en contraposici&oacute;n al car&aacute;cter de Kyosuke, que es un completo
indeciso. Por esto, la una siempre va a tirar del otro, que se deja llevar
por la impetuosidad de la que ella misma ha decidido que sea su pareja
(darling).</font>
<p align="justify"><font size=-1>La tercera esquina es Madoka. &iexcl;Aaaaaaaaaah! Hermosa
morena de pelo largo y de ojos verdes, misteriosa y distante, de car&aacute;cter
fuerte e indomable... y deliciosamente tierna cuando se lo permite a ella
misma.</font>
<br><font size=-1>Madoka es la madurez en la juventud. Es la mejor amiga
de Hikaru y se conocen desde la infancia, al contrario que Kyosuke, que
hace que la historia comience cuando &eacute;l y su familia se mudan a
la ciudad donde viven ellas dos.</font>
<br>&nbsp;
<center>
<p align="justify"><img SRC="jpg/chik.jpg" height=100 width=93>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img SRC="jpg/ckyo.jpg" height=100 width=97>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img SRC="jpg/cmad.jpg" height=100 width=112>
<br>Hikaru&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Kyosuke&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Madoka</center>

<br>&nbsp;
<p align="justify"><br>
<br><font size=+1></font>
<p align="justify"><b><font size=+1>La Historia</font></b>
<p align="justify"><font size=-1>Todo comienza cuando Kyosuke llega a la ciudad y conoce
a Madoka en un lugar emblem&aacute;tico para la serie: Las escaleras de
99/100 escalones. En ella, Kyosuke estaba contando los escalones que hab&iacute;a
cuando de repente aparece un sombrero rojo volando (al que en un principio
confunde con un ovni), y que coge al vuelo de un salto. Es entonces cuando
la ve, y cuando ella lo ve.</font>
<p align="justify"><font size=-1>A partir de aqu&iacute;, sus dos corazones se van acercando
poco a poco a lo largo de la serie, que comienza como una comedia y termina
con los sentimientos a flor de piel.</font>
<p align="justify"><font size=-1>En el principio todo era armon&iacute;a y situaciones
divertidas, donde parece que a Madoka no le importa demasiado que Hikaru
se "adue&ntilde;e" del indeciso Kyosuke, quien se deja llevar pero siempre
tiene algo en su interior que le hace recordar a la fr&iacute;a y distante
Madoka.</font>
<br><font size=-1>Conforme avanza la historia, a Madoka comienza a notarsele
que le duele lo que ella misma siente, por lo que poco a poco las cosas
van dejando de ser tan divertidas, y cada situaci&oacute;n en que Hikaru
se interpone entre ella y Kyosuke, va minando su dureza.</font>
<br><font size=-1>Al final, y tras 48 episodios donde la vida de estos
personajes pasa a formar parte de la nuestra, por f&iacute;n se produce
el desenlace y sucede lo que todos quer&iacute;amos que sucediera: Madoka
se une por f&iacute;n a Kyosuke. Es aqu&iacute; cuando habr&iacute;a que
decir que el final real de la serie no es un cap&iacute;tulo, sino una
pel&iacute;cula tratada desde un punto de vista distinto, m&aacute;s realista
y duro, llevando el tri&aacute;ngulo a su ruptura definitiva.</font>
<br>&nbsp;<b><font size=+1></font></b>
<p align="justify"><b><font size=+1>El Autor</font></b>
<p align="justify"><font size=-1>Kimagure Orange Road o El Capricho de la Calle Naranja,
fue un manga (o c&oacute;mic japon&eacute;s) creado por Izumi Matsumoto
en 1984, y desde entonces, diversas aportaciones en distintos formatos
han ido apareciendo para completar y hacer de esta historia una obra de
arte.</font>
<br><font size=-1>Aparte del manga, or&iacute;gen de todo, est&aacute;
el anime (serie animada) con 48 episodios, una pel&iacute;cula final y
8 ovas (cap&iacute;tulos independientes que se intercalan a distintas alturas
del anime). Tambien hay un grand&iacute;simo n&uacute;mero de CDs de m&uacute;sica,
juegos de ordenador, novelas, art-books e incluso una nueva pel&iacute;cula
llamada Shin-KOR (nuevo KOR)</font>
<br><font size=-1>Pero si alguien ha contribuido a la belleza de las im&aacute;genes
de los personajes, es sin duda, Akemi Takada, la dise&ntilde;adora del
anime.</font>
<br><font size=-1>Sus dibujos e ilustraciones le dieron vida real a los
personajes, e hicieron m&aacute;s intensos los sentimientos que despertaban
(sobre todo Madoka).</font>
<center>
<p align="justify"><img SRC="jpg/ayukawa.jpg" height=339 width=183>
<br>Madoka Ayukawa</center>

<p align="justify"><b><font size=+1>La M&uacute;sica</font></b>
<p align="justify"><font size=-1>KOR es sin duda, una de las series con m&aacute;s CDs
de m&uacute;sica que existen. Y no es solo la cantidad, sino la calidad.</font>
<br><font size=-1>Su banda sonora es una aut&eacute;ntica preciosidad,
con baladas de una cantante que hizo honor a la serie: Wada Kanako, cuya
voz acompa&ntilde;&oacute; a toda la serie desde principio a f&iacute;n.</font>
<br><font size=-1>Son inolvidables los solos de saxo interpretados por
Madoka cuando se sent&iacute;a triste, las peque&ntilde;as composiciones
musicales que llenaban los silencios de los protagonistas... y todo en
m&aacute;s de 30 CDs que son la delicia para los o&iacute;dos que los escuchan.</font>
<br><font size=-1>Hay desde rock&amp;roll hasta baladas, desde interpretaciones
de piano y saxo hasta m&uacute;sica disco e incluso orquestales.</font>
<br><font size=-1>Desde luego, la m&uacute;sica es uno de los puntos fuertes
de la serie, haci&eacute;ndote encontrar sin saber por qu&eacute;, tarareando
la melod&iacute;a de una de las baladas.</font>
<br>&nbsp;
<br>&nbsp;
<p align="justify"><b><font size=+1>La Continuaci&oacute;n</font></b>
<p align="justify"><font size=-1>Por suerte para muchos, fue tal el &eacute;xito de esta
serie, que a&uacute;n se sigue aprovenchando su tir&oacute;n, e incluso
10 a&ntilde;os despu&eacute;s, ha sido creada una nueva pel&iacute;cula:
Shin-KOR, basada en la primera de las dos novelas que Izumi Matsumoto escribi&oacute;
junto a Kenji Terada, y que contaban lo que pas&oacute; despu&eacute;s
de la ruptura del tri&aacute;ngulo, cuando Madoka y Kyosuke se unieron,
e Hikaru se qued&oacute; sola y se separ&oacute; de ellos.</font>
<br><font size=-1>Estas novelas son un incalculable tesoro para todos aquellos
a los que el final les pareci&oacute; demasiado duro y real, porque se
cuenta el despu&eacute;s.</font>
<br><font size=-1>Y por suerte para nosotros, han sido traducidas al espa&ntilde;ol
por Carlos Alejo, y las pod&eacute;is descargar aqu&iacute;:</font>
<p align="justify"><font size=-1><a href="zip/shinkor.zip">Novela Shin-KOR1</a></font>
<p align="justify"><font size=-1><a href="zip/shinkor2.zip">Novela Shin-KOR2</a></font>
<p align="justify"><font size=-1>Disfrutad de ellas porque son una joya.</font>
<br>&nbsp;
<br>&nbsp;
<p align="justify"><b><font size=+1>Lo que pas&oacute; en Espa&ntilde;a</font></b>
<p align="justify"><font size=-1>Lo que pas&oacute; en Espa&ntilde;a fue que, yo y todos
los espa&ntilde;olitos vimos la serie totalmente censurada, con la m&uacute;sica
casi completamente eliminada, y los episodios cortados.</font>
<p align="justify"><font size=-1>&iquest;Por qu&eacute; pas&oacute; esto?</font>
<p align="justify"><font size=-1>Hay tantas teor&iacute;as que no voy a decir ninguna,
que cada uno se imagine la suya. El caso es que apenas se pudieron escuchar
4 de las 50 obras de arte musicales de que constaba. Y lo m&aacute;s grave
en este aspecto fue la supresi&oacute;n de dos de las mejores canciones
de la serie: "Abr&aacute;zame otra vez", y "Como un P&aacute;jaro", que
fueron eliminadas de la pel&iacute;cula final, en los momentos m&aacute;s
&aacute;lgidos y cruciales, donde la fuerza de esas canciones y de lo que
contaban, hubieran hecho soltar las l&aacute;grimas al m&aacute;s duro,
porque se trataba de canciones que hablaban sobre los protagonistas, sobre
lo que sent&iacute;an en ese momento... y nosotros tan solo o&iacute;mos
"silencio". No hubo di&aacute;logos, tan solo silencio y el ru&iacute;do
de fondo de la lluvia.</font>
<p align="justify"><font size=-1>Y si a este hecho lamentable se le une que de los 60 minutos
que duraba la pel&iacute;cula, cortaron 20... junto a que la mayor&iacute;a
de las escenas "picantes" (que en realidad eran inocentes), fueron eliminadas...
pues nos qued&oacute; lo que vimos.</font>
<br><font size=-1>Pero incluso a pesar de todo esto, yo me enganch&eacute;
a ella, y cuando fui descubriendo a&ntilde;os m&aacute;s tarde lo que nos
perdimos, poco a poco mi pasi&oacute;n por la serie fue aumentando y manteni&eacute;ndose
hasta ahora.</font>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<BR>


<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="gtfmn.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







