<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:aradriel@geocities.com">José Antonio Suárez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>

<h3>La música en el ánime</h3>

<FONT FACE="Arial" SIZE=2><p align="justify"><font size=-1><FONT SIZE=2><p align="justify">Yo soy un apasionado de la m&uacute;sica, y cuando descubr&iacute; hace unos a&ntilde;os el mundo de la m&uacute;sica de las series japonesas, encontr&eacute; un fil&oacute;n todav&iacute;a incombustible, de nuevas melod&iacute;as para mi disfrute.</P>

<p align="justify">Existe un hecho totalmente claro en el anime, y es que los japoneses le dan tanta importancia a la banda sonora como a la propia animaci&oacute;n e historia.</P>
<p align="justify">Para ellos es algo normal que existan grupos musicales que &quot;tan solo&quot; se dediquen a crear m&uacute;sica para el Anime (los llamados J-Pop), que viven por y para &eacute;l. Cantantes como Kouda Mariko, Aikawa Nanase, Wada Kanako, grupos como X-Japan, Glay, Globe... son aut&eacute;nticos &iacute;dolos en el pa&iacute;s nip&oacute;n.</P>
<p align="justify">Y no es para menos, ya que los japoneses piensan en sus creaciones de anime como los due&ntilde;os de Dysney a la hora de hacer sus largometrajes, esto es: ganar dinero haciendo la mejor banda sonora posible.</P>
<p align="justify">Y si pensamos que esto incluso se aplica a series que en principio no son el &uacute;ltimo grito de la animaci&oacute;n ni pertenecen a autores conocidos, te puedes encontrar con aut&eacute;nticas maravillas en series que aparecen como &quot;por casualidad&quot;.</P>

<p align="justify">Existe un comercio impresionante que rodea a la m&uacute;sica del anime, y es el de los CDs con las bandas instrumentales y las musicas-im&aacute;genes (canciones dedicadas a un protagonista en concreto).</P>
<p align="justify">Al tomarse tan en serio este tema, existen grand&iacute;simas canciones que hablan sobre la propia historia del anime, con nombres propios y situaciones tomadas de &eacute;l. Por eso, cuando a la fuerza visual del anime se le a&ntilde;ade la m&uacute;sica expresamente creada para esos momentos cruciales, elevan algunas escenas a aut&eacute;nticas obras de arte.</P>
<p align="justify">Ejemplos de esto pueden ser:</P>

<p align="justify">I’m your Prisioner, en el opening de Record of Loddos War</P>
<p align="justify">Hold me Again, en la pel&iacute;cula final de Kimagure Orange Road</P>
<p align="justify">Sayonara, en varios pasajes de Marmalade Boy</P>
<p align="justify">Cruel Angel Thesis, en el opening de Evangelion</P>
<p align="justify">Ano hi ni Kaeritai, en el opening de VideoGirl Ai</P>

<p align="justify">Y tambien otras series cuentan con bandas sonoras impresionantes y extens&iacute;simas tales como:</P>
<p align="justify">Maison Ikkoku, Slayers, Sailor Moon, Final Fantasy, Gundam, Macross, City Hunter, Please save my Earth...</P>

<p align="justify">Pero ninguna tan sublimes como el &uacute;ltimo exponente de lo que puede llegar a ser la supremac&iacute;a de los largometrajes por encima de la todopoderosa Dysney: Mononoke Hime.</P>
<p align="justify">Esta pel&iacute;cula, aut&eacute;ntica maravilla de la animaci&oacute;n, que relata la historia de la princesa Mononoke, posee, en mi opini&oacute;n, una de las mejores bandas sonoras de las pel&iacute;culas de este tipo, con unas interpretaciones sublimes y espeluznantes en calidad interpretativa.</P>

<p align="justify">Pero no todas las pel&iacute;culas tienen el mismo estilo de m&uacute;sica. Las hay desde empalagosas melod&iacute;as, hasta el rock m&aacute;s duro, pasando por las t&iacute;picas pero pegadizas baladas y sin olvidar a las instrumentales (mis preferidas).</P>


<p align="justify">&nbsp;</P>
<p align="justify">Un hecho que cabe destacar, es algo muy caracter&iacute;stico en lo que vemos de Jap&oacute;n desde fuera de &eacute;l, y nos parece que esa gente debe de dominar muy bien el ingl&eacute;s. Pero esto en realidad no es as&iacute;, ya que su nivel general de esta lengua no es superior al nuestro.</P>
<p align="justify">Por eso, choca cuando muchas canciones est&aacute;n interpretadas en ingl&eacute;s y cuando cont&iacute;nuamente utilizan expresiones en esa lengua.</P>
<p align="justify">Los motivos no los conozco, ya que no soy experto en cultura japonesa, pero ah&iacute; queda la idea.</P>
<p align="justify">Lo que s&iacute; puedo asegurar es que, si a alguien le encanta la m&uacute;sica mel&oacute;dica como a m&iacute;, tendr&aacute; un fil&oacute;n inagotable en el anime, pero lo que habr&aacute; que tener muy presente es c&oacute;mo conseguir esos CDs.</P>

<p align="justify">Ahora voy a tratar un tema peliagudo: la pirater&iacute;a en MP3 de los CDs de m&uacute;sica.</P>
<p align="justify">Este hecho no pasa de largo en el anime, e incluso el nivel ha llegado a que en las revistas que se dedican a la explotaci&oacute;n del anime y del manga en Espa&ntilde;a, incluyan como reclamo CDs con bandas sonoras completas almacenadas en MP3, con lo que las 3000 o 4000 pesetas por cada CD que nos costar&iacute;a poder escucharlas y tenerlas, se convierten en 700 u 800 pesetas en un CDROM lleno de las mejores obras musicales.</P>
<p align="justify">Esto desde luego que es un lastre para el mercado, e incluso yo mismo compro esas revistas para tener esos MP3s, porque o si no, nunca las podr&iacute;a escuchar.</P>
<p align="justify">Yo tan solo constato el hecho, y que juzguen los dem&aacute;s.</P>

<p align="justify">Pero no iba a terminar dejando un mal sabor de boca con este tema, sino que prefiero hablar por &uacute;ltimo de lo que significa para m&iacute; la m&uacute;sica anime.</P>
<p align="justify">Lo puedo definir con una sola palabra: evasi&oacute;n.</P>
<p align="justify">Conecto los seis altavoces de mi equipo al ordenador, y me pongo en el centro del cuadrado sonoro que conforman. Selecciono las sensaciones que quiero tener en ese momento (tristeza, alegr&iacute;a, melancol&iacute;a, fuerza...) y me dejo llevar.</P>
<p align="justify">De esta forma, encuentro algo que tan solo puedo alcanzar con otros tipos de m&uacute;sica tales como New Age y B.S.O. de pel&iacute;culas comerciales.</P></FONT><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<BR>


<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="gtfmn.htm"><font FACE="ARIAL"><B>[General]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







