<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>B</B></font><FONT color="#000000" size=2 face="arial"><B>reve Introducción al Mundo del Hacking</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:perota082@mx3.redestb.es">Pedro Ferrera "BaDBoY"</A>
</b></FONT>
<br><br>


<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Cap&iacute;tulo 1.<br> El arte del Hacking
</H3>
<P ALIGN=justify>


Saludos, internautas de todo el mundo.  Soy {B4DB0Y} y voy a intentar resumiros en cuatro o cinco lecciones lo que yo creo que deb&eacute;is saber si os quer&eacute;is convertir en hackers. Este curso est&aacute; orientado a todas aquellas personas que est&eacute;n interesadas en aprender el arte del hacking, pero del hacking tal y c&oacute;mo se entiende, y esta es una cuesti&oacute;n que vamos a tratar especialmente esta unidad. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero ¡cuidado! Este curso, tal y como su nombre indica, es de car&aacute;cter introductorio. Todo lo que voy a ense&ntilde;aros no es m&aacute;s que lo que ten&eacute;is que aprender para empezar, de alguna manera, a hackear. Es simplemente lo m&aacute;s b&aacute;sico, con esto no os vais a convertir en &eacute;lite. Deber&eacute;is buscar m&aacute;s material y con el tiempo acabareis siendo &eacute;lite, pero no quer&aacute;is aprenderlo todo en un d&iacute;a, y no os obsesion&eacute;is mucho en este peque&ntilde;o tutorial. Simplemente tom&aacute;roslo como el primer paso para entrar en el hacking. Una vez hay&aacute;is hecho este paso ya estar&eacute;is dentro y no os ser&aacute; f&aacute;cil salir.</P>

<h4>¿Por qu&eacute; un curso de car&aacute;cter introductorio y no uno completo?.</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, creo que lo que m&aacute;s cuesta es iniciar, empezar a hacer algo de hacking. Es decir, os pod&eacute;is pasar horas leyendo documentos en ingl&eacute;s que pueden explicar cosas muy interesantes como el IP Spoofing o c&oacute;mo programar caballos de troya en C, pero que no os ser&aacute;n de utilidad si antes no sab&eacute;is que ten&eacute;is que tener determinado sistema operativo y unos determinados conocimientos b&aacute;sicos para aprovechar ese material. Y es que, de hecho, en Internet hay pocos tutoriales que realmente expliquen paso a paso qu&eacute; hacer para empezar a hackear. Por eso creo que este tutorial cumple una funci&oacute;n muy importante. Como ya os he dicho antes, con este tutorial podreis dar un primer paso. Luego, ya os espabilareis. En segundo lugar, aunque llevo un tiempecillo en esto del hacking, no me considero &eacute;lite y no tengo suficientes conocimientos para hacer un curso completo que abarque todo lo que se puede hacer hackeando.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">¿Requerimientos?. </P>

</h4>No importa si no sab&eacute;is mucho de inform&aacute;tica, lo m&aacute;s importante es que teng&aacute;is ganas de aprender y no se&aacute;is muy cortos de cabeza. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este material lo dejo aqu&iacute; y no me hago responsable de lo que hag&aacute;is con &eacute;l. As&iacute; mismo, no consentir&eacute; que nadie haga una copia descarada de esto, si m&aacute;s no sin antes avisarme.  </P>
<P ALIGN="JUSTIFY">El curso se divide b&aacute;sicamente en:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI>Introducci&oacute;n al hacking</LI>
<LI>Teor&iacute;a: Entorno LINUX (incluyendo ejemplos, ejercicios pr&aacute;cticos, etc…)</LI>
<LI>Teor&iacute;a: Entornos UNIX internacionales </LI>
<LI>M&eacute;todos de hacking: entrar un sistema</LI>
<LI>M&eacute;todos de hacking: salir y no dejar huellas en un sistema</LI></UL>

<P ALIGN="JUSTIFY">  </P>
<h4><P ALIGN="JUSTIFY"> Antes de empezar…</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">He aqu&iacute; unas definiciones que deb&eacute;is saber, porque las voy a ir usando durante el curso. Estas son solo las b&aacute;sicas, a medida que avance el curso ir&eacute;is aprendiendo m&aacute;s. La mayor&iacute;a de estas definiciones las sabr&eacute;is, pero, repito, este curso est&aacute; orientado a toda clase de usuarios, expertos y novatos.</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><B>Linux</B> : Sistema Operativo multiusuario, versi&oacute;n UNIX de PC.</LI>
<LI><P ALIGN="JUSTIFY"><B>Login</B>: Nombre de usuario que se usa para entrar en un sistema determinado</LI>
<LI><B><P ALIGN="JUSTIFY">Password</B>:Clave que tiene cada usuario para entrar en un sistema determinado</LI>
<LI><B><P ALIGN="JUSTIFY">Anonymous</B>: Login predeterminado para sistemas que dejan entrar usuarios libremente sin ped&iacute;rles identificaci&oacute;n. Esto comporta siempre limitaciones y restricciones.</LI>
<LI><B><P ALIGN="JUSTIFY">FTP</B>: File Transfer Protocol. Es el puerto 21 de un sistema determinado, que usa un programa servidor de FTP para que otros usuarios entren con un programa cliente de FTP con el fin de poder subir/bajar archivos de/a ese sistema. </LI>
<LI><B><P ALIGN="JUSTIFY">Telnet</B>: Corresponde al puerto 23 de un sistema determinado. Podemos entrar en &eacute;l y,  dependendiendo del tipo de cuenta que tengamos en el sistema podemos manipular ese ordenador como si fuese nuestro, tecleamos las &oacute;rdenes como las teclear&iacute;amos en nuestro Linux.</LI>
<LI><B><P ALIGN="JUSTIFY">Listening</B>: Se dice que un ordenador est&aacute; listening si est&aacute; esperando conexiones, es decir, si acepta conexiones remotas. Cualquier ordenador que est&eacute; listening es vulnerable, nunca olvideis esto.</LI>
<LI><B><P ALIGN="JUSTIFY">Root</B>: Es el super-usuario de un sistema determinado, lo cual quiere decir que puede manipular el ordenador sin ning&uacute;n tipo de restricci&oacute;n. Esto significa que puede ver/manipular/eliminar cualquier archivo de cualquier directorio del sistema. El root es, por supuesto, el amo del sistema, pero cualquier usuario que tenga acceso a &eacute;ste, puede, si sabe c&oacute;mo, obtener este nivel. Es de hecho en lo que se basa el hacking. </LI>
<LI><B><P ALIGN="JUSTIFY">IP</B>: Es la combinaci&oacute;n de n&uacute;meros que nuestro proveedor de Internet nos asigna cada vez que conectamos y que nos identifica. Ejemplo: 194.179.106.2 (xxx.xxx.xxx.xxx). Cada usuario de Internet tiene una distinta. Los sistemas, por supuesto, tambi&eacute;n tienen la suya, pero es fija y por eso su Host tambi&eacute;n es fijo. Ciertos usuarios tambi&eacute;n pueden contratar una IP fija si lo desean en su proveedor.</LI>
<LI><B><P ALIGN="JUSTIFY">Host</B>: Es la manera f&aacute;cil de leer una IP, ya que est&aacute; formada por palabras y algunos n&uacute;meros. Ejemplo: ppp342.redestb.es.</LI></UL>

<h4>Introducción al Hacking. ¿Qu&eacute; es el hacking?</h4><P ALIGN="JUSTIFY"> Si hici&eacute;semos esta pregunta a cien personas, quiz&aacute;s solo quince nos dir&iacute;an una definici&oacute;n adecuada y correcta. El Hacker es aquella persona capaz de irrumpir en un sistema cualquiera, sin permiso previo, para coger, modificar, o simplemente curiosear entre la informaci&oacute;n que hay dentro de este, y marchar sin dejar ning&uacute;n rastro. Un hacker no es aquella persona que anda por el IRC diciendo a todo el mundo: &quot;Soy un hacker de la &eacute;lite y te voy a romper el ordenador y la reparaci&oacute;n te va a costar … &quot; . Esas personas ni son hackers ni son &eacute;lite, simplemente son personas que se aburren, que tienen complejos de inferioridad y que no saben en qu&eacute; invertir su tiempo.  </P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">¿Para qu&eacute; sirve el hacking?</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A parte de ser un entretenimiento que te hace aprender mucho sobre sistemas, es un reto intelectual que te somete a un esp&iacute;ritu de constante superaci&oacute;n. Es peligroso, s&iacute;, pero eso es parte del juego. El hacking te llena adem&aacute;s de amplios conocimientos de sistemas y telecomunicaciones en general. Aprendes a usar un sistema operativo alternativo (LINUX), descubres los errores de TCP/IP, los fallos de seguridad de los sistemas UNIX… Es en definitiva una manera de ampliar nuestros conocimientos si de verdad nos interesa este mundillo que es la inform&aacute;tica.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Las normas del hacking</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay muchos boletines en Internet que contienen las normas, los mandamientos, es decir, las pautas que tiene que seguir un buen hacker. Estas diez normas son las que yo creo m&aacute;s importantes:</P>
<P ALIGN="JUSTIFY"></P>
<OL>

<LI><P ALIGN="JUSTIFY">No hay que hacer acciones que perjudiquen a terceras personas. Por ejemplo, borrar el contenido de un directorio de inicio de un usuario que no conocemos de nada.</LI>
<LI><P ALIGN="JUSTIFY">No hay que dar nunca nuestros datos personales en ning&uacute;n sitio, solo a las personas que conozcamos y tengamos confianza en ellas.</LI>
<LI><P ALIGN="JUSTIFY">No hay que hackear en sistemas gubernamentales. Nos encontrar&iacute;an f&aacute;cilmente. Las peque&ntilde;as empresas y las universidades muchas veces no se permiten el lujo de buscarnos en el caso que nos dejemos nuestra IP en el sistema.</LI>
<LI><P ALIGN="JUSTIFY">No hay que dar datos del sistema en el que estamos hackeando a nadie. ¿No querr&aacute;s que otro hacker te robe el trabajo que llevas hecho? </LI>
<LI><P ALIGN="JUSTIFY">Solo destruiremos aquella informaci&oacute;n que nos perjudique o que perjudique a alguna persona, no destruiremos nada si no tenemos ning&uacute;n buen motivo para hacerlo.</LI>
<LI><P ALIGN="JUSTIFY">Modificaremos solo los archivos que borren nuestras huellas y los que nos permitan un futuro acceso.</LI>
<LI><P ALIGN="JUSTIFY">Si nos detienen es porque hemos hecho algo mal, siempre que hayamos dejado intacto el sistema no tienen nada que alegar en contra nuestra, a no ser que hayamos tenido acceso a informaci&oacute;n muy privada, de sistemas muy importantes como la FBI, la NASA… entonces hay que contactar con un abogado. A un buen hacker no le caen nunca condenas grandes. </LI>
<LI><P ALIGN="JUSTIFY">No hay que estar m&aacute;s de dos horas conectado a un sistema cuando se es root. </LI>
<LI><P ALIGN="JUSTIFY">Hackearemos cuando estemos seguros de que el sysop del sistema no est&eacute; delante del ordenador (por la noche o en festivos).</LI>
<LI><P ALIGN="JUSTIFY">No usaremos nukes, mail bombs, ni chorradas del estilo para putear a otras personas, a no ser que tengamos un buen motivo para hacerlo. Es decir, no usaremos esos programas por simple diversi&oacute;n.</LI></OL>

<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Lo  b&aacute;sico del hacking </P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora ya sab&eacute;is qu&eacute; es y para qu&eacute; sirve el hacking, y c&oacute;mo os deb&eacute;is comportar si quer&eacute;is ser buenos hackers. Este punto aclarar&aacute; todas o casi todas las dudas que teng&aacute;is una vez llegado aqu&iacute;. Cada uno de vosotros tendr&aacute; una motivaci&oacute;n diferente respeto al hacking. Pero deb&eacute;is conocer las fronteras y los l&iacute;mites de este. Es decir, lo que pod&eacute;is y lo que no pod&eacute;is hacer sabiendo hackear. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, no os hag&aacute;is ilusiones, no podr&eacute;is entrar en el ordenador de un amigo y manejar el prompt de MS-DOS como si estuvieseis ah&iacute;. Entrar en un ordenador que no est&aacute; listening (esperando conexiones) es m&aacute;s dif&iacute;cil y se hace a trav&eacute;s de un puerto que muchos, casi todos los usuarios de Internet suelen tener abierto. Pero esto no lo voy a explicar porque la intenci&oacute;n del curso no es esta. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En este curso solo aprender&eacute;is a entrar en ordenadores UNIX, y que tengan al menos telnet o ftp en listening. No os preocup&eacute;is, la mayor&iacute;a de ordenadores de universidades, ftp’s y dem&aacute;s usan UNIX, solo unos pocos usan sistemas como Mac o NT. </P>
<P ALIGN="JUSTIFY">Lo tendr&eacute;is muy dif&iacute;cil si quer&eacute;is hackear ordenadores de proveedores de Internet, ya no suelen tener el telnet nunca abierto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este curso est&aacute; enfocado al hacking desde LINUX, que es el sistema UNIX que podemos tener m&aacute;s a mano. En el pr&oacute;ximo cap&iacute;tulo voy a explicar c&oacute;mo conseguir LINUX y c&oacute;mo instalarlo. Desde WinBug 95 se puede hacer muy poca cosa, por no decir nada. <br>
Visitad esta web: <a href="http://personal.redestb.es/perota082"target="_new">http://personal.redestb.es/perota082"</a> para ver 
algunos truquillos para hackear en WinBug 95. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y, b&aacute;sicamente es esto. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nos vemos en la pr&oacute;xima lecci&oacute;n.</P>



<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulag.htm"><font FACE="ARIAL"><B>[Breve Introducción al Mundo del Hacking]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
