<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>B</B></font><FONT color="#000000" size=2 face="arial"><B>reve Introducción al Mundo del Hacking</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:perota082@mx3.redestb.es">Pedro Ferrera "BaDBoY"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Cap&iacute;tulo 3.<br> Breve análisis a los sistemas Unix
</H3>
<P ALIGN=justify>

En esta unidad aprender&eacute;is:</P>
<P ALIGN="JUSTIFY"></P>
<BR><BR><BR>
<UL>

<UL>
<LI><P ALIGN=JUSTIFY>M&aacute;s sobre los sistemas UNIX</LI>
<LI><P ALIGN=JUSTIFY>Tipos de sistemas UNIX</LI>
<LI><P>Caracter&iacute;sticas de los sistemas 
UNIX m&aacute;s importantes</LI></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si est&aacute;s aqu&iacute; se supone que sabes:</P>
<P ALIGN="JUSTIFY"></P>

<UL>

<UL>
<LI><P ALIGN=JUSTIFY>Lo que es en realidad el hacking</LI>
<LI><P ALIGN=JUSTIFY>Para qu&eacute; sirve el hacking</LI>
<LI><P ALIGN=JUSTIFY>C&oacute;mo se comporta un hacker</LI>
<LI><P ALIGN=JUSTIFY>Qu&eacute; es LINUX </LI>
<LI><P ALIGN=JUSTIFY>Iniciarse en el entorno LINUX/UNIX</LI>
<LI><P ALIGN=JUSTIFY>Entender el entorno multiusuario UNIX</LI>
<LI><P ALIGN=JUSTIFY>Otros ejercicios pr&aacute;cticos para LINUX</LI></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien, en este minicap&iacute;tulo vamos a aprender algo sobre los sistemas UNIX universales, casi todos los que existen en Internet. Inicialmente esta informaci&oacute;n no os ser&aacute; de gran utilidad, pero m&aacute;s adelante os servir&aacute;, o sea que guardarla. </P>
<P ALIGN="JUSTIFY"></P>
<H4>Sistemas UNIX</H4><P ALIGN="JUSTIFY">Desde los or&iacute;genes de Internet, este ha estado formado b&aacute;sicamente por m&aacute;quinas UNIX. Se trata de un sistema multiusuario que es usado, b&aacute;sicamente, como servidor. As&iacute;, podemos encontrar m&aacute;quinas UNIX en servidores de FTP, en servidores de correo electr&oacute;nico, en servidores de WWW, en servidores de IRC... Pero dado su entorno multiusuario es tambi&eacute;n usado mucho en Universidades, Bancos, as&iacute; como en algunas entidades gubernamentales. Actualmente el n&uacute;mero de sistemas UNIX en Internet est&aacute; disminuyendo y est&aacute; aumentando el de sistemas NT, aunque UNIX sigue siendo claramente superior (alrededor del 65% de m&aacute;quinas de Internet son UNIX). El otro 35%, lo forman b&aacute;sicamente sistemas como el NT, ya mencionado, aunque tambi&eacute;n existen otros como VM/CMS, VM/ESA, VMS... </P>
<P ALIGN="JUSTIFY"></P>
<H4>Clasificaci&oacute;n de sistemas UNIX</H4>
<P ALIGN="JUSTIFY">Inicialmente podemos dividir los sistemas UNIX seg&uacute;n el tipo (BSD, System V, etc...). Pero en este cap&iacute;tulo vamos a hacer una distinci&oacute;n seg&uacute;n los fabricantes de cada sistema UNIX:</P>
<P ALIGN="JUSTIFY"></P>

<UL>

<UL>
<LI><P ALIGN=JUSTIFY>AIX - Fabricado por IBM</LI>
<LI><P ALIGN=JUSTIFY>SunOS y Solaris - Fabricados por Sun</LI>
<LI><P ALIGN=JUSTIFY>HP-UX - Fabricado por Hewlett Packard</LI>
<LI><P ALIGN=JUSTIFY>Ultrix y OSF/1 - Fabricados por DEC</LI></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque Linux no ha estado fabricado por ninguna multinacional, he cre&iacute;do conveniente incluirlo en esta lista.</P>
<P ALIGN="JUSTIFY"></P>

<UL>

<UL>
<LI><P ALIGN=JUSTIFY>Linux - UNIX para PC, no ha sido fabricado por ninguna multinacional</LI></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estos son los m&aacute;s importantes, despu&eacute;s hay otros como el IRIX, el Convex, el UnicOS... de menor proliferaci&oacute;n. </P>
<P ALIGN="JUSTIFY">Voy a describir cinco de estos sistemas: AIX, SunOS, Solaris, Linux y HP-UX. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">AIX</P>
</B><P ALIGN="JUSTIFY">AIX es la versi&oacute;n UNIX de IBM. Desde que sali&oacute; ha sido de los sistemas que m&aacute;s bugs ha presentado. Para que os hag&aacute;is una idea, la versi&oacute;n 3.25 ten&iacute;a fallos tan gordos como estos:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1 - El comando lquerypv pod&iacute;a ser utilizado para leer cualquier archivo:</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">$ lquerypv -h /etc/passwd</P>
<P ALIGN="JUSTIFY">root:Xds4cdXcMoV:0:0::/root:/bin/bash</P>
<P ALIGN="JUSTIFY">...</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2 - Este bug habla por s&iacute; solo:</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">$ echo "badboy::0:0:blablabla:/:/bin/sh" &gt;&gt;/etc/shadow</P>
<P ALIGN="JUSTIFY">$ telnet localhost</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">login: badboy</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"># whoami</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">root</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3 - Otro bug:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">$ rlogin localhost -l -froot</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"># whoami</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">root</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4 - Y otro bug que permite enROOTarse:</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">$ tproof -x /bin/sh</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Naturalmente, existen parches para estos bugs tan tontos.</P>
<P ALIGN="JUSTIFY">La versi&oacute;n 3.25 fue substituida por la 4.1, aunque esta tambi&eacute;n presenta errores (como todos los sistemas). Estos son los cambios de la 3.25 a la 4.1:</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">Versi&oacute;n 3.25 y 4.1.x</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tanto la versi&oacute;n 3.2.5 como la 4.1 de AIX son compatibles con los tres sistemas IBM RISC System/600 (POWER, POWER2 y PowerPC 601). La versi&oacute;n 4.1, adem&aacute;s, incorpora compatibilidad con sistemas PowerPC.</P>
<P ALIGN="JUSTIFY">En la versi&oacute;n 4.1 se incluyen los estandartes de programaci&oacute;n POSIX 1003.2 y 1003.2a, FIPS 151-2 y XPG4.</P>
<P ALIGN="JUSTIFY">Las librer&iacute;as TCP/IP permiten el uso de BIND y NIS para resolver direcciones IP. </P>
<P ALIGN="JUSTIFY">En la versi&oacute;n 4.1, el IP forwarding est&aacute;, por defecto, desactivado. </P>
<P ALIGN="JUSTIFY"></P>
<H4>SunOS
</H4><P ALIGN="JUSTIFY">Se trata de un sistema de la casa Sun. Estos son sus fallos:</P>
<P ALIGN="JUSTIFY">El SunOS, es, inicialmente vulnerable a IP Spoofings, si la opci&oacute;n Source routing est&aacute; activada. Aunque, para que SunOS sea totalmente seguro a un ataque de spoof, se tienen que introducir ciertas modificaciones en el kernel referentes a IP forwarding. Por eso, probablemente en este sistema una t&aacute;ctica muy aconsejable es el IP Spoofing.</P>
<P ALIGN="JUSTIFY">SunOS Tambi&eacute;n presenta fallos en la configuraci&oacute;n NFS, a no ser que est&eacute; activado el NFS por monitoring (por defecto no lo est&aacute;). </P>
<P ALIGN="JUSTIFY">Un fallo muy importante es que, inicialmente, la librer&iacute;a ruserok(3) permite el acceso a .rhosts y a hosts.equiv con cualquier comando "r". </P>
<P ALIGN="JUSTIFY">El fichero /dev/eeprom es inicialmente le&iacute;ble por cualquier usuario, pero este suele ser un bug que casi todos los admins suelen solucionar. Otro bug tonto: muchos admins dejan activada la cuenta "sync" sin password.</P>
<P ALIGN="JUSTIFY"></P>
<H4>Linux
</H4><P ALIGN="JUSTIFY">Linux es el famoso sistema operativo disponible para PC y para otras plataformas. A&ntilde;ade a UNIX un SO de 32 bits, soporta multitud de dispositivos (PCI, SCSI...) y es capaz de leer FAT32 y NTFS. Se trata de un sistema especialmente estable y fiable, poco propenso a colgarse. Pone a disposici&oacute;n del usuario el c&oacute;digo fuente del Kernel. Funciona en un 386 con 4 de RAM, gracias a que s&oacute;lo utiliza los recursos que necesita. Es multitarea y incorpora un entorno gr&aacute;fico parecido a Windows 95, llamado X-Windows. Hay diferentes distribuciones de Linux, y no todas son gratuitas, las m&aacute;s importantes (gratuitas) son:</P>
<P ALIGN="JUSTIFY"></P>

<UL>

<UL>
<LI><P ALIGN=JUSTIFY>Slackware : Se puede conseguir en ftp.cdrom.com:/pub/Linux/slackware.</LI>
<LI><P ALIGN=JUSTIFY>Debian: Para conseguirla, se puede hacer un ftp a ftp.debian.org o en slug.ctv.es.</LI>
<LI><P ALIGN=JUSTIFY>Red Hat: ftp.redhat.com para conseguirla. </LI></UL>
</UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como principales bugs voy a destacar:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>En Debian Linux 2.0, /usr/bin/suidexec permite nivel de root a cualquier usuario.</LI>
<LI><P ALIGN=JUSTIFY>En cualquier sistema Linux se puede sobreescribir un buffer en /usr/X11/bin/color_xterm para obtener nivel root.</LI>
<LI><P ALIGN=JUSTIFY>En cualquier sistema Linux se puede exploitar la librer&iacute;a vsyslog() 5.4.38 para obtener root.</LI>
<LI><P ALIGN=JUSTIFY>Aunque es un bug muy viejo, se puede obtener nivel root sobreescribiendo un buffer en /usr/bin/splitvt</LI>
<LI><P ALIGN=JUSTIFY>En distribuciones RedHat de Linux, se puede conseguir nivel root sobreescribiendo un buffer en /usr/bin/zgv</LI></UL>
<P ALIGN="JUSTIFY"></P>
<H4>Solaris</H4>
<P ALIGN="JUSTIFY">Se trata de un sistema mejorado de la misma casa que SunOS (por supuesto, SUN). Las &uacute;ltimas versiones de este sistema se caracterizan por contener un mejorado sistema de WebNFS.</P>
<P ALIGN="JUSTIFY">Pero como todo sistema, Solaris tiene tambi&eacute;n muchos bugs. Los m&aacute;s importantes son:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>Se pueden crear o borrar cualquier tipo de ficheros como si fu&eacute;semos root usando el statd (s&oacute;lo en la versi&oacute;n 2.5.1)</LI>
<LI><P ALIGN=JUSTIFY>El sistema peta si el syslog recibe un mensage y no puede resolver la IP que lo ha producido.</LI>
<LI><P ALIGN=JUSTIFY>En cualquier sistema Solaris 2.x, podemos petar o reiniciar el sistema con un ping flood (enviando una gran cantidad de paquetes de manera que se quede bloqueado)</LI>
<LI><P ALIGN=JUSTIFY>Se pueden aprovechar los archivos /usr/bin/ps y /usr/ucb/ps para conseguir acceso root en cualquier sistema Solaris</LI>
<LI><P ALIGN=JUSTIFY>As&iacute; mismo, sobreescribiendo un b&uacute;fer determinado en /usr/bin/fdformat tambi&eacute;n podemos conseguir root en cualquier Solaris 2.x</LI>
<LI><P ALIGN=JUSTIFY>Tambi&eacute;n se puede aprovechar y explotar /usr/lib/nis/nispopulate en los sistemas Solaris 2.5</LI>
<LI><P ALIGN=JUSTIFY>Sobreescribiendo un b&uacute;fer determinado en el archivo passwd podemos enROOTarnos, s&oacute;lo en la versi&oacute;n 2.5, igualmente, en esta versi&oacute;n podemos explotar /usr/openwin/bin/kcms_calibrate para obtener root</LI></UL>

<P ALIGN="JUSTIFY"></P>
<H4>HP-UX
</H4><P ALIGN="JUSTIFY">HP-UX ha sido fabricado por la conocida multinacional Hewlett Packard. Se han hecho multitud de versiones de este sistema, tanto es as&iacute; que una de las &uacute;ltimas versiones es la 9.01. A diferencia de otros sistemas UNIX, presenta pocos bugs, de los cuales destaco:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>SAM (System Administration Manager) puede ser usado en cualquier sistema HP-UX para modificar archivos.</LI>
<LI><P ALIGN=JUSTIFY>En la versi&oacute;n HP-UX 9, el programa rpc.mountd contiene un bug que puede ser explotado para obtener privilegios NFS.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta informaci&oacute;n es m&aacute;s importante de lo que parece. Pero esto ya lo descubrir&eacute;is m&aacute;s adelante. <BR>¡ Nos vemos en la pr&oacute;xima lecci&oacute;n !</P>



<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulag.htm"><font FACE="ARIAL"><B>[Breve Introducción al Mundo del Hacking]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
