<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>H</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>ardware gen&eacute;rico</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>


<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:auryn@retemail.es">Alejandro Santacreu.</A>

</b></FONT>

<br><br>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

Soluciones a los problemas de sobrecalentamiento en el PC

</H3>



<p align=justify>

<P ALIGN="JUSTIFY">Es probable que muchos de vosotros hay&aacute;is tenido noticias sobre los problemas derivados del sobrecalentamiento de cualquier componente electr&oacute;nico. Para los menos dados en la materia es preciso decir que el exceso de temperatura reduce la conductividad de los componentes, es decir, cuanto m&aacute;s calor peor es la transmisi&oacute;n de se&ntilde;ales el&eacute;ctricas. La explicaci&oacute;n es bien sencilla, cu&aacute;nto m&aacute;s se calienta un metal conductor mayor es la vibraci&oacute;n del n&uacute;cleo de sus &aacute;tomos, con lo que se degrada la conducci&oacute;n el&eacute;ctrica. </P>

<P ALIGN="JUSTIFY">Los microprocesadores son los componentes electr&oacute;nicos m&aacute;s sensibles a estas variaciones de temperatura, deben procesar infinidad de instrucciones por segundo y dichas instrucciones no son sino gigantescas combinaciones de ceros y unos (c&oacute;digo binario), que, en esencia, no son m&aacute;s que apagado (ceros) y encendidos (unos). Cualquier microprocesador "apaga" y "enciende" millones de veces por segundo las miles de diferentes conexiones que lo componen, si no se encuentra debidamente refrigerado la l&iacute;nea que distingue un cero de un uno queda desdibujada y entonces se produce un error con el consecuente cuelgue del sistema. Algunos os preguntareis por que los ordenadores de hace unos a&ntilde;os no presentaban este problema, la respuesta es igualmente sencilla. Los microprocesadores de &eacute;pocas pasadas, l&eacute;ase 386 o inferiores, estaban fabricados siguiendo un proceso de laminaci&oacute;n rudimentario si lo comparamos con el actual. Los microprocesadores, desde el punto de vista morfol&oacute;gico, son varias capas dispuestas una encima de otra y almacenando los diversos transistores, es equivalente a un circuito integrado s&oacute;lo que mucho m&aacute;s peque&ntilde;o. Estas capas estaban sometidas a voltajes de entre 5V e incluso 12V, la frecuencia de trabajo de estos microprocesadores no exced&iacute;a, en el mejor de los casos, los 40Mhz, y por ello, a pesar de su elevado voltaje (comparado con el actual) no se incurr&iacute;a en un aumento de temperatura. </P>

<P ALIGN="JUSTIFY">Estos microprocesadores no dispon&iacute;an, porque no lo necesitan, de ning&uacute;n elemento refrigerante a parte de la fuente de alimentaci&oacute;n de la carcasa, la cual extrae el aire caliente del interior del ordenador. A medida que se consegu&iacute;an unas frecuencias de trabajo cada vez mayores la temperatura del microprocesador iba aumentando, con la llegada de los 486 se introdujo el disipador de aluminio, se trata de una plancha plana por un lado (el de contacto) y ondulada por el opuesto (para aumentar la superficie de disipaci&oacute;n) adherida encima del micro, el calor que este desprende es inducido a la plancha debido al contacto entre ambos y de esta manera, debido a la mayor superficie de la plancha ondulada, el calor se disipa en mayor grado. </P>

<P ALIGN="JUSTIFY">Llegados a los 66Mhz se hizo necesaria, o al menos recomendable, la adici&oacute;n de un ventilador a la plancha disipadora, a partir de este momento no se ha aportado ninguna gran novedad en este segmento, al menos a nivel domestico. Actualmente tenemos a nuestro alcance microprocesadores que se sit&uacute;an sin problemas en los 300Mhz y cuya temperatura ascender&iacute;a a m&aacute;s de 100ºC de no ser porque cuentan con potentes ventiladores adheridos a enormes planchas de aluminio. A pesar de haber descendido el voltaje de los microprocesadores hasta los 2V (dependiendo del micro este voltaje oscila entre los 2V y los 3'5V, esto se debe a una reducci&oacute;n en el grosor del laminado de los procesadores) su temperatura sigue, y seguir&aacute;, requiriendo de avanzados sistemas de refrigeraci&oacute;n. </P>

<P ALIGN="JUSTIFY">En principio, un ordenador cl&oacute;nico con un microprocesador con una frecuencia sobre los 300Mhz, equipado con los componentes b&aacute;sicos y montado en una carcasa que cumpla con todas las normativas vigentes no debe presentar problemas a la hora de mantener una temperatura optima. No obstante la calidad de estos componentes suele quedar un tanto descuidada por los montadores, quiz&aacute;s no tanto en lo referente a las fuentes de alimentaci&oacute;n pero si en cuanto a ventiladores de microprocesador se refiere. Un cl&oacute;nico gen&eacute;rico no suele llevar mas de 1.000 ptas. invertidas en el ventilador del micro y por este precio no pueden esperarse grandes milagros, si ampliamos nuestro equipo y vamos restando espacio libre a la carcasa la temperatura ir&aacute; aumentando hasta que la capacidad de los ventiladores m&aacute;s econ&oacute;micos quede en entre dicho. </P>

<P ALIGN="JUSTIFY">Es muy frecuente tener graves e inexplicables problemas derivados de cuelgues producidos por sobrecalentamiento. Si nuestro ordenador tiene un interior abarrotado de accesorios (lectores de CD, grabadoras, unidades ZIP, controladoras SCSI, aceleradoras 3D) es muy probable que lo estemos sometiendo a una temperatura excesiva y que tarde o temprano experimentemos la degradaci&oacute;n de uno o varios componentes. Para evitar esto tenemos varias soluciones: </P>

<B><P ALIGN="JUSTIFY">Reducir la temperatura de la carcasa: </P>

</B><P ALIGN="JUSTIFY">a) Si nuestro nivel de conocimientos nos lo permite, as&iacute; como el disponer de un lugar seguro, podemos quitar la tapa a la carcasa haciendo funcionar el ordenador al descubierto. Obviamente hay que tener cuidado de no da&ntilde;ar su interior con l&iacute;quidos, golpes... Es el m&eacute;todo m&aacute;s efectivo para reducir la temperatura global de la carcasa. </P>

<P ALIGN="JUSTIFY">b) Si las condiciones de trabajo no nos lo permiten o, sencillamente, no deseamos ver las interioridades de nuestro PC tenemos varias soluciones: </P>

<P ALIGN="JUSTIFY">B1) Agrupar y reordenar los cables de tal forma que se mejore la circulaci&oacute;n de aire en el interior del ordenador. </P>

<P ALIGN="JUSTIFY">B2) Si la carcasa se encuentra sobrecargada comprar una m&aacute;s grande y de mejor refrigeraci&oacute;n. </P>

<P ALIGN="JUSTIFY">B3) Si la carcasa lo permite a&ntilde;adir un segundo ventilador a todo el conjunto. </P>

<B><P ALIGN="JUSTIFY">Reducir la temperatura del microprocesador:</P>

</B><P ALIGN="JUSTIFY">En las tiendas habituales de inform&aacute;tica no suelen encontrarse ventiladores de calidad, si queremos uno con mec&aacute;nica de rodamientos y que sea capaz de desplazar un gran volumen de aire podemos recurrir a los fabricantes indicados al final de este articulo. En ellos se ofrecen soluciones realmente capaces y de gran calidad, por un coste de unas 3.000 pesetas podemos adquirir un conjunto de ventilador - disipador que supere en mas de un 40% a los ventiladores gen&eacute;ricos. Es una medida muy efectiva pero no hay que olvidar que el ventilador refrigera el microprocesador moviendo el aire del interior de la carcasa y que si esta se encuentra sobrecargada el aire aprovechable para la refrigeraci&oacute;n del micro no ser&aacute; de gran ayuda al estar ya demasiado caliente. </P>

<P ALIGN="JUSTIFY">A efectos pr&aacute;cticos la soluci&oacute;n a aplicar depender&aacute; de nuestro nivel de conocimientos y, como no, del dinero que podamos invertir. Si estamos familiarizados a indagar las tripas de nuestro PC con conocimiento de causa la soluci&oacute;n m&aacute;s efectiva es la destapar el ordenador y sustituir el ventilador del microprocesador por un modelo de calidad, esta operaci&oacute;n requerir&aacute; de unas 3.000 pesetas de inversi&oacute;n m&aacute;xima en concepto de: ventilador, disipador y gastos de env&iacute;o. Si por el contrario no deseamos ver a nuestro PC funcionando de manera tan provocativa, bien por no estar dados en la materia, bien por no disponer de un lugar seguro para ello; podemos adquirir una carcasa tipo semitorre, torre o incluso gran torre junto con un ventilador - disipador para el microprocesador, todo ello disponible en algunos de los fabricantes indicados al final del articulo. Teniendo en cuenta que lo ideal es comprar una torre con doble ventilador y una fuente de alimentaci&oacute;n de al menos 230 vatios el conjunto puede salirnos por unas 10.000/30.000 pts, dependiendo del tama&ntilde;o de la carcasa as&iacute; como el tipo, ya que las ATX son algo mas caras. Una vez con las piezas en nuestras manos lo mas seguro, para aquellos que no est&eacute;n familiarizados con el bricolaje inform&aacute;tico, es llevar nuestra carcasa junto con la nueva carcasa y ventilador - disipador a una tienda de confianza, all&iacute; realizaran el traslado de componentes no debiendo cobrar nunca mas de 5.000 ptas. por la mano de obra, de hecho lo honesto seria un precio en torno a las 2.000/3.000 ptas. </P>

<P ALIGN="JUSTIFY">Si alguno tiene como practica habitual el "over-clocking" (hacer trabajar el microprocesador a una frecuencia mayor a la recomendada) conocer&aacute; sin duda los problemas del sobrecalentamiento, para ello existe un accesorio que refrigera nuestro microprocesador mediante un compresor, el equipo cuesta unas 120.000 pts instalaci&oacute;n incluida y permite conseguir proezas tales como mover un K6 a mas de 400 MHz. Si hay alg&uacute;n interesado puede ponerse en contacto conmigo y gustosamente le facilitare los datos del fabricante. </P>

<P ALIGN="JUSTIFY">Por ultimo se&ntilde;alar que el criterio m&aacute;s importante a la hora de escoger un ventilador para nuestro microprocesador es el volumen de aire desplazado. Los fabricantes rese&ntilde;ados lo indican en todos sus modelos con la unidad de medida CFM, el m&iacute;nimo para un ventilador de calidad es de 5 unidades CFM pero existen modelos que rozan las 13 unidades y que no por ello cuestan el doble. Los ventiladores con mayor flujo de aire desplazado suelen tener una refinada mec&aacute;nica de rodamientos, y, por otro lado, existen modelos que incluyen un sensor de calor que nos avisara con una alarma en caso de sobrepasar la temperatura m&aacute;xima recomendada.</P></FONT>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgen.htm">
<FONT FACE="ARIAL"><B>[Hardware gen&eacute;rico]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>