<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>celeraci&oacute;n gr&aacute;fica</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:sargue@ctv.es">Sergio Baila.</A>

</b></FONT>

<br><br>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

3Dfx Voodoo 3

</H3>

<p align=justify>

<p align = "justify"><font face=arial size=2>3Dfx ha desvelado ya los detalles de la que ser&aacute;

su pr&oacute;xima creaci&oacute;n: el Avenger, o lo que es lo mismo, la

Voodoo 3. Aunque el nombre no acaba de hacerle justicia, puesto que m&aacute;s

que Voodoo3 deber&iacute;a llamarse Banshee 2, ya que ser&aacute; una soluci&oacute;n

combinada 2D/3D, y no solo 3D. 3Dfx espera que la tarjeta vea la luz aproximadamente

en el segundo trimestre del pr&oacute;ximo a&ntilde;o. El chip se fabricara

con tecnolog&iacute;a de 0.25 micras, lo que permitir&aacute; alcanzar

velocidades de trabajo bastante altas. Concretamente, habr&aacute; dos

versiones: la Voodoo 3 2000 y la Voodoo 3 3000.</font>

<p align = "justify"><font face=arial size=2>La 2000 funcionara a la nada despreciable velocidad de

125 MHz, mientras que su hermana mayor lo har&aacute; a 183 MHz. A efectos

comparativos, recordemos que la actual Voodoo 2 corre a 90 MHz, igual que

la Riva TNT. La Banshee aumenta esta cota ligeramente hasta los 100 MHz.

Claro esta, que estas &uacute;ltimas se fabrican con 0.35 micras. El chip

Voodoo 3 constara de la nada despreciable cifra de 8'2 millones de transistores.</font>

<p align = "justify"><font face=arial size=2>Si continuamos hablando de MHz, nada mejor que nombrar

la desmesurada cifra del RAMDAC que utilizaran las Voodoo 3. Nada mas y

nada menos que a 350 MHz funcionara la 3000, qued&aacute;ndose en "solo"

300 MHz la 2000. Esto permitir&aacute; trabajar a una resoluci&oacute;n

de 2048x1536 a 85 Hz... eso si encontramos un monitor que permita esas

frecuencias y resoluciones, cosa muy dif&iacute;cil, por no decir que imposible.

Quiz&aacute;s esto anime a los fabricantes de monitores a mejorar las frecuencias

de sus monitores.</font>

<p align = "justify"><font face=arial size=2>Uno de los puntos pendientes de 3Dfx, que ya se hecho

en falta en la Voodoo2, es el color, que se mantuvo a 16 bits como la Voodoo

1. Sin embargo, parece que los ingenieros de 3Dfx o no aprenden la lecci&oacute;n,

o est&aacute;n teniendo problemas para lograr un buen rendimiento a esa

profundidad. La Voodoo 3 continuara utilizando 16 bits de color externamente,

aunque internamente utilice 32 bits para los c&aacute;lculos.</font>

<p align = "justify"><font face=arial size=2>Uno de los temas mas comentados &uacute;ltimamente en

el mundillo 3D es sobre el tama&ntilde;o y numero de texturas de las escenas.

Estas discusiones tratan temas como el AGP-texturing y la memoria local

de las tarjetas. Pues bien, 3Dfx falla otra vez en este punto. Si bien

si aceptara modo AGPx2, e incluso 4x cuando salga, resulta que las texturas

han sido limitadas a solo 256x256, y la memoria local de la tarjeta se

queda en 16 MB. Los ingenieros de 3Dfx est&aacute;n estudiando la viabilidad

de dotar a la tarjeta de 32 MB.</font>

<p align = "justify"><font face=arial size=2>El Z-Buffer presentara una novedad curiosa: utilizara

n&uacute;meros en coma flotante para los c&aacute;lculos. Los ingenieros

de 3Dfx han bautizado esto como W-Buffer.</font>

<p align = "justify"><font face=arial size=2>Pero pasemos a los puntos fuertes de esta tarjeta. Si

algo hace bien 3Dfx, es crear potencia desbordada en cada tarjeta. Y en

eso contin&uacute;an sorprendiendo: nada mas y nada menos que 366 millones

de pixels con textura (texels) por segundo puede rellenar este "monstruo"

devorador de pixels. Esto corresponde a mas del doble que una Voodoo 2,

que se quedan en 180 millones. Recordemos que la Banshee tan solo llega

a los 100 millones. La Voodoo 2 SLI , que es, por ahora, la soluci&oacute;n

m&aacute;s potente del mercado domestico, consigue 360 millones.</font>

<p align = "justify"><font face=arial size=2>La Voodoo 3 3000 es capaz de comerse 7 millones de tri&aacute;ngulos

por segundo, qued&aacute;ndose su hermana menor, la 2000, en los 4 millones.</font>

<p align = "justify"><font face=arial size=2>Los chicos de Sharky Extreme (www.sharkyextreme.com),

una p&aacute;gina dedicada al hardware, pudieron encerrarse con los t&eacute;cnicos

de 3Dfx y probar a fondo una Voodoo3 alfa, fabricada solo 3 d&iacute;as

antes. Pese a ser una versi&oacute;n muy preliminar, no dio ning&uacute;n

problema. Para las pruebas se utilizo el testador universal de aceleradoras

3D, el Quake 2. Para empezar abriendo boca, lo pusieron a 1152x864 y a

1280x960, modos en los que tiraba a mas de 60 fps. Entonces probaron a

1600x1200, con lo que os pod&eacute;is imaginar con que calidad se deb&iacute;an

ver las im&aacute;genes. La Voodoo3, sudando un poquito, pudo mover el

Quake 2 a esta resoluci&oacute;n a 32 fps, suficientes para jugar suavemente.

La prueba se realizo sobre un Pentium II a 450 MHz. Ante todo esto hay

que tener en cuenta que el driver era una versi&oacute;n muy poco optimizada,

y la tarjeta aun corr&iacute;a a "solo" 160 MHz, y la versi&oacute;n final

lo har&aacute; a 183 MHz, representando un incremente de un 20% sino m&aacute;s.

El &uacute;nico defecto a estas resoluciones (1600x1200) es que le faltan

quiz&aacute;s los 24 bits de color... quiz&aacute;s con la Voodoo 4.</font>

<p align = "justify"><font face=arial size=2>En el apartado 2D integra el mismo motor que el Banshee.

O sea que la Voodoo 3 solo ofrecer&aacute; mejoras en el aspecto 3D. Tambi&eacute;n

incorporara descompresi&oacute;n MPEG2 para DVD, funcionalidad que no pod&iacute;a

faltar en una tarjeta destinada al publico exigente. El engine interno

es de 128 bits, lo que unido a la transferencia interna con la memoria

de 3 GB/s dota a la Voodoo3 de una prestaciones 2D impresionantes.</font>

<p align = "justify"><font face=arial size=2>Asimismo, el chipset estar&aacute; preparado para la tecnolog&iacute;a

LCDfx desarrollada por la propia 3Dfx para la ocasi&oacute;n, y que dotar&iacute;a

a la tarjeta de una salida digital para la conexi&oacute;n de pantallas

LCD.</font>

<p align = "justify"><font face=arial size=2>Como dato final, es posible que la tarjeta contemple la

posibilidad de funcionar en SLI.</font>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgra.htm">
<FONT FACE="ARIAL"><B>[Aceleraci&oacute;n gr&aacute;fica]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>