<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>M</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>icroprocesadores</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@email.com">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

El AMD K7 al detalle

</H3>

<p align=justify>

<p align = "justify"><font face=arial size=2>No es la primera vez que uno de los competidores directos

del gigante californiano Intel parece a punto de sacar su ultimo producto

con la expectaci&oacute;n de batir a Intel de una vez por todas de su posici&oacute;n

de l&iacute;der absoluto e indiscutible en la plataforma domestica. Sin

embargo, pocas veces el alboroto ha durado mucho, pues al poco Intel ha

anunciado su siguiente procesador que acaba con la competencia... pero

no esta vez.</font>

<p align = "justify"><font face=arial size=2>La apuesta de AMD por su K7 es fuerte, y muy arriesgada.

Arriesgada porque abandona su hasta ahora plaza fuerte que es el Socket

7, donde conect&aacute;bamos nuestros Pentiums cl&aacute;sicos, y se pasa,

por primera vez, a un conector propietario, el Slot A. Muchos pueden pensar

que esto solo da&ntilde;ara a la competitividad del micro, pero aun no

hemos visto sus caracter&iacute;sticas. Vamos por pasos:</font>

<br><br><center><img SRC="gif/hard5_1.gif"></center>

<br><br><h4>1. El bus</h4></font><br><br>

<p align = "justify"><font face=arial size=2>El Slot A, y por tanto el AMD K7, no utilizaran el protocolo

de bus de Intel P6 GTL+, sino que implementaran el EV6, utilizado por los

Alpha de Digital. EV6 tiene muchas ventajas sobre el GTL+, como el 'point-to-point

topology' para multiproceso sim&eacute;trico. Como novedad incluso sobre

el EV6 implementado para los Alpha, el bus del K7 alcanzara los 200 MHz,

dejando muy atr&aacute;s las previsiones de Intel para sus pr&oacute;ximos

productos (anunciado hasta 133 MHz) o los actuales (100 MHz con chipsets

BX). Con esta velocidad de bus es cuando realmente empieza a tener sentido

las nuevas memorias directas, como la RDRAM o la DDR-SDRAM. Por ejemplo,

la RDRAM corriendo a 100 MHz ofrece un pico de 1.6 GB/s, mientras que el

bus GPL+ de Intel solo absorbe, funcionando a 100 MHz, 800 MB/s, y funcionando

a 133 MHz alcanza los 1066 MB/s. El pico m&aacute;ximo alcanzado por la

RDRAM solo lo puede manejar en su totalidad el bus EV6 a 200 MHz del K7.</font>

<p align = "justify"><h4>2. La cache primaria</h4>

<p align = "justify"><font face=arial size=2>El K7 tendr&aacute;, como m&iacute;nimo, 128 KB de cache

de primer nivel (L1 cache), repartidas entre 64 KB para datos y 64 KB para

instrucciones. Contara, por tanto, con cuatro veces mas cache de primer

nivel que los actuales Pentium II que disponen de 32 KB (16+16). Parece

ser que los Katmai dispondr&aacute;n de 64 KB (32+32). Una cache de primer

nivel de gran tama&ntilde;o solo tiene sentido para procesadores que funcionen

a una frecuencia interna muy elevada, para evitar los estados de espera

del microprocesador y poder aprovechar completamente el paralelismo (pipelining)

implementado. Y el K7 funcionara muy r&aacute;pido.</font>

<p align = "justify"><h4>3. La cache secundaria</h4>

<p align = "justify"><font face=arial size=2>El K7 ser&aacute; bastante flexible en este punto. Vendr&aacute;

con una cache 'backside', como la implementada en la arquitectura P6 de

Intel. El K7 dispone de una tag RAM interna suficiente para manejar 512

KB de cache L2, pero AMD planea tambi&eacute;n versiones del K7 con no

menos de 2 MB, pudiendo llegar a los 8 MB de cache de segundo nivel, utilizando

una tag RAM adicional externa, como hace Intel en el caso de los P6 (PPro).</font>

<p align = "justify"><font face=arial size=2>La velocidad de esta cache variara entre 1/3 de la frecuencia

del micro hasta la misma frecuencia (recordemos, del micro no del bus).

Podr&aacute; utilizar tanto RAM 'normal' como SRAMs de 'doble flujo de

datos' (DDR : Double Data Rate).</font>

<p align = "justify"><font face=arial size=2>Toda esta flexibilidad en la cache secundaria permitir&aacute;

a AMD ofrecer varias l&iacute;neas de su K7, para rangos de publico variando

desde el nivel domestico hasta servidores de altas prestaciones.</font>

<p align = "justify"><h4>4. Velocidades de reloj</h4>

<p align = "justify"><font face=arial size=2>El AMD K7 ya funciona en estos momentos a 500 MHz, pero

para el momento de su lanzamiento, en el primer trimestre del pr&oacute;ximo

a&ntilde;o, se espera haber superado esta cifra ampliamente. El K7 dispone

de buffers realmente profundos para poder conseguir estas velocidades tan

elevadas, pudiendo llegar a tener 72 instrucciones x86 ejecut&aacute;ndose.

(&iexcl;A eso le llamo yo paralelismo!)</font>

<p align = "justify"><h4>5. La unidad de coma flotante (FPU)</h4>

<p align = "justify"><font face=arial size=2>El proceso en coma flotante ha sido siempre la asignatura

pendiente de AMD. Bien, todos nos pregunt&aacute;bamos hasta cuando. Pues

hasta el K7 ni m&aacute;s ni menos.</font>

<p align = "justify"><font face=arial size=2>El AMD K7 dispondr&aacute; de 3 (&iexcl;tres!) l&iacute;neas

de ejecuci&oacute;n (pipelines), totalmente paralelas y con ejecuci&oacute;n

fuera de orden (out-of-order execution). Literalmente, el K7 pulverizara

el rendimiento de cualquier micro actual de Intel y de los pr&oacute;ximos

que ha anunciado.</font>

<br><br><center><img SRC="gif/hard5_2.gif"></center><br>

<br><h4>6. La arquitectura del microc&oacute;digo</h4>

<p align = "justify"><font face=arial size=2>Aun con el peligro de que muchos os perd&aacute;is, voy

a entrar un poco en la arquitectura interna del K7. Si no entend&eacute;is

ni una palabra, es normal, para entender esto hay que estar algo familiarizado

con la construcci&oacute;n de microprocesadores.</font>

<p align = "justify"><font face=arial size=2>La entrada al microprocesador cuenta con tres decodificadores

de instrucciones x86, que trasladan las instrucciones x86 a 'Macro-Ops',

operaciones de longitud fija para que sean tratadas por el micro. Las operaciones

de longitud fija son una de las bases de la filosof&iacute;a RISC. Estos

tres decodificadores alimentan con 'Macro-Ops' a la unidad de control de

instrucciones de 72 entradas. Cada una de estas 'Macro-Ops' consisten en

una o dos operaciones. Hay dos maneras de decodificar las instrucciones

x86, el 'direct-path' (camino directo) que como su nombre indica efect&uacute;a

una conversi&oacute;n directa y, por tanto, muy r&aacute;pida, y el 'vector-path'

(camino por vectores) que utiliza una tabla de traducciones en ROM, llamada

MROM (MacroCodeROM).</font>

<p align = "justify"><font face=arial size=2>Una vez las instrucciones son decodificadas pasan a la

unidad de control de instrucciones, donde pueden esperar hasta 72 de ellas.

Esta unidad las va enviando, seg&uacute;n corresponda, al Planificador

de Enteros (Integer Scheduler) o a la unidad FPU/Multimedia. El planificador

de enteros puede almacenar hasta 15 Macro-Ops, representando hasta 30 operaciones

(recordemos que cada Macro-Op puede contener una o dos operaciones). Su

trabajo es distribuirlas entre las tres unidades de ejecuci&oacute;n paralelas,

cada una de las cuales esta acompa&ntilde;ada de una unidad de generaci&oacute;n

de direcciones, responsable de los accesos a memoria. Estas unidades se

encargan de optimizar el acceso a la cache de primer y segundo nivel, para

minimizar el tiempo de respuesta.</font>

<p align = "justify"><h4>Conclusiones</h4>

<p align = "justify"><font face=arial size=2>Intel lo tiene crudo esta vez. Hay que tener varios factores.

Hoy por hoy, la base de K6-2 es enorme y crece r&aacute;pidamente, por

lo que el soporte para 3DNow! esta aumentando. DirectX 6 esta optimizado

para utilizarlo, y MMX ha resultado no servir para nada. Intel sacara pronto

el Katmai, que implementara el KNI (MMX2) muy similar, aunque superior,

al 3DNow!, pero al ser el ultimo procesador de Intel saldr&aacute;, como

siempre, a un precio elevado y por tanto 3DNow! continuar&aacute; avanzando.

Por otra parte, en unos meses AMD sacara una nueva revisi&oacute;n de su

n&uacute;cleo del K6, el K6-3, del que hablaremos en un pr&oacute;ximo

articulo, y del que os podemos adelantar que utilizara el mismo Socket7

que utilizan los K6 y continuara con el 3DNow!. Plantara cara muy seriamente

al Katmai.</font>

<p align = "justify"><font face=arial size=2>Y luego vendr&aacute; el K7 que barrera todo lo que tenga

Intel (incluido el Xeon). La mejor propuesta a casi un a&ntilde;o vista

de Intel es el Coppermine, un Pentium II con el n&uacute;cleo de .18 micras,

pero que sigue siendo el n&uacute;cleo Deschutes del Katmai, inferior al

del K7, y por tanto la &uacute;nica manera de superarlo ser&aacute; con

mas frecuencia de reloj (recordar que antes era al rev&eacute;s). Por tanto,

Intel va a tener que trabajar duramente para sacar antes de los previsto

su Williamette.</font>

<p align = "justify"><font face=arial size=2>El &uacute;nico defecto que se le puede achacar al K7

es la utilizaci&oacute;n de un bus propietario, el Slot A, y por tanto

de un chipset propio. Pero hoy por hoy para ir al d&iacute;a hay que comprar

una nueva placa con cada nuevo procesador, por lo que de hecho no es ning&uacute;n

defecto.</font>

<p align = "justify"><font face=arial size=2>Dicho todo esto no tenemos que olvidar a alguien que ha

estado &uacute;ltimamente muy en las sombras... Cyrix. No ha muerto, ni

mucho menos. Os informaremos tambi&eacute;n dentro de poco de Jalapeno,

su &uacute;ltimo proyecto.</font>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwmic.htm">
<FONT FACE="ARIAL"><B>[Microprocesadores]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>