<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>celeraci&oacute;n gr&aacute;fica</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>


<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:sargue@ctv.es">Sergio Baila.</A>

</b></FONT>

<br><br>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

Savage4, lo último de S3

</H3>

<p align=justify>

<p align = "justify"><FONT face=Arial size=2>En Mayo del pasado a&ntilde;o, la empresa S3 volvi&oacute;, tras a&ntilde;os de silencio, al mercado de las aceleradoras gr&aacute;ficas con su <I>chipset</I> Savage3D. El lanzamiento fue acompa&ntilde;ado por una campa&ntilde;a de lanzamiento digna de elogio para una empresa como S3, anunciando a bombo y platillo las magnificas innovaciones de su <I>chipset</I>. Era, por ejemplo, la primera en utilizar 0.25 micras en el proceso de fabricaci&oacute;n, y su sistema de compresi&oacute;n de texturas (propietario), el S3TC, era realmente asombroso en funcionamiento.</P>



<p align = "justify"><FONT face=Arial size=2>Pero como suele pasar en estos casos, la Savage3D fue v&iacute;ctima de su propia novedad. Los drivers deb&iacute;an cambiarse constantemente para corregir errores, e incluso hubo que actualizar la BIOS flash del chipset hasta tres veces. Adem&aacute;s, la tarjeta s&oacute;lo admit&iacute;a hasta 8 MB, cuando la competencia llegaba a los 16. Y el tan asombroso sistema de compresi&oacute;n de texturas pr&aacute;cticamente s&oacute;lo se pod&iacute;a apreciar en funcionamiento en la demo preparada expresamente a tal efecto por la gente de S3.</P>



<p align = "justify"><FONT face=Arial size=2>Evidentemente, S3 no se ha amilanado por el poco &eacute;xito cosechado el pasado a&ntilde;o, y vuelve a la carga con un nuevo producto: el Savage4. Este producto ha sido enfocado esta vez no tanto desde el punto de vista de la innovaci&oacute;n, sino de manera funcional y pr&aacute;ctica. Ofrece buenos rendimientos y un precio competitivo en un mercado cada d&iacute;a m&aacute;s fiero. Sin embargo, y a pesar de ello, a&uacute;n nos guarda un par de sorpresas interesantes.</P>



<p align = "justify"><FONT face=Arial size=2>El Savage4 va a distribuirse con dos <I>sabores</I>: "GT" y "Pro". La versi&oacute;n GT est&aacute; orientada al mercado OEM (ensambladores) funcionando a 125 MHz y soportando un m&aacute;ximo de 16 MB de memoria. El modelo Pro se presenta como el tope de la gama Savage4 funcionando a 143 MHz con hasta 32 MB de memoria local. Lo sorprendente de este &uacute;ltimo es su precio, que se situar&aacute; al parecer por poco m&aacute;s de 20 mil pesetas o 125 €. En cuanto al bus que utilizar&aacute;n ambos, la versi&oacute;n GT se queda con el AGP x2, y el Pro soportar&aacute; el nuevo AGP x4, que ofrece hasta 1 GB/s de transferencia.</P>



<p align = "justify"><FONT face=Arial size=2>En cuanto a sus cualidades m&aacute;s t&eacute;cnicas, el Savage4 lo tiene todo previsto: soporte AGP Execute Mode, renderizaci&oacute;n en color real, multitexturado en una sola pasada, compresi&oacute;n de texturas S3TC, texturas de hasta 2000 x 2000, Z-Buffer de 32 bits, salida digital para pantallas planas, RAMDAC a 300 MHz, etc.</P>



<p align = "justify"><FONT face=Arial size=2>Entre sus novedades exclusivas, destacar por ejemplo que es la &uacute;nica con soporte para filtro trilineal por hardware en una sola pasada. Tambi&eacute;n han mejorado notablemente su exclusivo sistema S3TC de compresi&oacute;n de texturas. Y para que no les ocurra como el pasado a&ntilde;o, que se quedaron solos con su sistema sin soporte para pr&aacute;cticamente ning&uacute;n producto del mercado, en S3 han optado por una estrategia similar a la que est&aacute; siguiendo AMD con su set de instrucciones 3D Now!, hacer ellos mismos sus propias versiones. Entre estas conversiones ahora mismo est&aacute;n trabajando entre otros en: Quake 3 Arena, Unreal / Tournament Edition, Half-Life, Anachronox, Expendable y True Space (Caligari).</P>

<br><br><center><IMG SRC="jpg/hard8_1.jpg"></center><br><br>

<p align = "justify"><FONT face=Arial size=2>En otra faceta del apartado l&uacute;dico, se ha mejorado la calidad visual de la decodificaci&oacute;n DVD, adem&aacute;s de reducir la carga sobre la CPU. Ha esto se une tambi&eacute;n el soporte para pantallas planas.</P>



<p align = "justify"><FONT face=Arial size=2>En el tema quiz&aacute;s m&aacute;s importante para nuestros lectores, el rendimiento, la gente de <I>Sharky Extreme</I> (</FONT><A HREF="http://www.sharkyextreme.com/"><FONT face=arial size=2>www.sharkyextreme.com</FONT></A><FONT ><FONT face=Arial size=2>) predice, seg&uacute;n unas pruebas de ellos mismos, un rendimiento un 15% por encima de una TNT para el caso de la Savage4 GT. Esto tambi&eacute;n pondr&iacute;a la Savage4 GT entre un 5% y un 10% por encima de la ATI Rage Fury de 32 MB.</P>



<p align = "justify"><FONT face=Arial size=2>Sobre la disponibilidad de estas tarjetas, se espera que las primeras aparezcan en los distribuidores en el mes de Abril.</P></FONT>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>




<br>

<HR>





<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgra.htm">
<FONT FACE="ARIAL"><B>[Aceleraci&oacute;n gr&aacute;fica]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>