<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>H</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>ardware gen&eacute;rico</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:caliban@arrakis.es">Francisco Domínguez.</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Glosario sobre hardware
</H3>

<P ALIGN=JUSTIFY>Con este glosario vamos a intentar construir un verdadero diccionario de términos hardware que se irá
 actualizando a medida que esta sección crezca en número de artículos y, cómo no, de participantes. Sólo espero que lo que
  aqui voy a ir recogiendo, pueda servir de referencia a la hora de leer los diversos artículos técnicos que existen sobre el
  mundo del hardware, la programación gráfica, etc.
<br><br>
<CENTER>
<FONT SIZE=1 FACE=COURIER>
<HR>
<a href="#A"><B>[A]</B></A> <a href="#B"><B>[B]</B></A> <a href="#C"><B>[C]</B></A> <a href="#D"><B>[D]</B></A> <a href="#E"><B>[E]</B></A> [F]
[G] [H] <a href="#I"><B>[I]</B></A> [J] [K] [L]
<a href="#M"><B>[M]</B></A> [N] [Ñ] [O] <a href="#P"><B>[P]</B></A> [Q]
<a href="#R"><B>[R]</B></A> [S] <a href="#T"><B>[T]</B></A> [U] <a href="#V"><B>[V]</B></A> [W]
[X] [Y] [Z]
<HR> 
</FONT>
</CENTER>

<A NAME="A"><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">[A]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>AGP</b>: Accelerated Graphics Port. Es un bus de interconexi&oacute;n creado por Intel específicamente para tarjetas gráficas. Cuenta con un diseño algo superior al PCI y una velocidad superior.</P>
</FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>

<A NAME="B"><P ALIGN="JUSTIFY"><b>[B]</b></P></font>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Bits en paralelo</B>: normalmente, la informaci&oacute;n (los bits) viajan por el ordenador y los cables en paralelo, esto es, todos a la vez, aunque tambi&eacute;n existe la transmisi&oacute;n en serie (de uno en uno), ¿cu&aacute;l crees que ser&aacute; m&aacute;s r&aacute;pido?, efectivamente, el paralelo, ya que se mandan varios de golpe.  </P>
</FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>

<A NAME="C"><P ALIGN="JUSTIFY"><b>[C]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>CAD-CAM-CAE</B>: Iniciales de dise&ntilde;o asistido por ordenador, y control de maquinas por ordenador. Usados en el dise&ntilde;o y fabricaci&oacute;n industriales.  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Chipset</B>: conjunto de chips que se encargan de gestionar y coordinar todo el sistema interno de un ordenador, incluidos procesador, memoria, buses y tarjetas conectadas. Es vital para el funcionamiento del sistema.</P>
<P ALIGN="JUSTIFY"></P>

<A NAME="D"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[D]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>DirectX:</B> son APIs (lugares a través de los cuales los programas acceden al sistema) y estan diseñado para dar un acceso rápido a el hardware multimedia.</P>
<P ALIGN="JUSTIFY"></P>

<A NAME="E"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[E]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>Estados de latencia</B>: de la memoria, es el número de ciclos de computación que tarda la memoria en servir un dato al microprocesador.</P>
<P ALIGN="JUSTIFY"></P>

<A NAME="I"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[I]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>Interfaz</B>: Elemento que act&uacute;a de intermediario entre un ente y otro (en este caso el ordenador y el usuario), permitiendo la comunicaci&oacute;n en uno o en los dos sentidos. Ejemplos :interfaz gr&aacute;fico, desde el programa que realiza los gr&aacute;ficos ( windows), pasando por la tarjeta gr&aacute;fica, hasta el monitor.  </P>
<P ALIGN="JUSTIFY"></P>

<A NAME="M"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[M]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>MB</B>: unidad de medida de informaci&oacute;n. 1 Bit es la unidad m&iacute;nima de medida de la informaci&oacute;n, 1byte son 8 bits, y 1 MB son un mill&oacute;n de bytes.  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MBps</B>: millones de bytes que se transmiten en un segundo.  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Memoria RAM</B>: es la memoria de trabajo del ordenador. En ella se cargan los programas que ser&aacute;n ejecutados por el microprocesador. Es vol&aacute;til, esto significa, que una vez se apaga el ordenador, se pierde la informaci&oacute;n contenida en ella. De estas tal vez haga un art&iacute;culo pr&oacute;ximamente.  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MHz</B>: unidad de medida de la fracuencia de reloj del ordenador, puede ser del bus (33 MHz para la PCI ), o del microprocesador (166, 200, etc MHz).  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Microprocesador</B>: Es el coraz&oacute;n del ordenador. Realiza todos los calculos y computación que hacen que funcione el ordenador. Suele estar apoyado por el chipset.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">MMX</B>: siglas de un sistema de c&oacute;digo de instrucciones ampliados para aplicaciones multimedia en microprocesadores de &uacute;ltimas generaciones.  </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Multiplexar</B>: t&eacute;cnica de transmisi&oacute;n de informaci&oacute;n, que consiste en mandar en paralelo y en varias veces dicha informaci&oacute;n, y a la vez por unas l&iacute;neas de control las se&ntilde;ales necesarias para recomponer lo mandado en paralelo, esto hace aumentar virtualmente en ancho del bus, por ejemplo, en lugar de mandar 8 bytes, se pueden mandar 16 (el doble) multiplexados, primero 8, y despu&eacute;s otros 8, donde se reciben, se recogen y se ordenan, poniendo los primero 8 delante de los segundos. Los inconvenientes son varios, mayor lentitud, mayor complejidad de la circuiter&iacute;a, y mayor complejidad a la hora de programar, esto &uacute;ltimo puede que no suceda si los circuitos realizan todo el trabajo.  </P>
<P ALIGN="JUSTIFY"></P>

<A NAME="P"></FONT><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">[P]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>PCI</B>: un tipo de bus usado en ordenadores, sirve para transmitir informaci&oacute;n entre los componentes. Sigue leyendo por donde ibas y sabr&aacute;s m&aacute;s sobre &eacute;l.  </P>
<P ALIGN="JUSTIFY"></P>

<A NAME="R"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[R]</b></P></font>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>Renderizados y texturas</B>: T&eacute;cnicas para la creaci&oacute;n de escenas en 3D fotorealistas, esto es, que parecen sacadas del mundo real. </P>
<b><P ALIGN="JUSTIFY">Requisitos</B>: si quieres saber m&aacute;s te conviene ir a la p&aacute;gina . </P>
<P ALIGN="JUSTIFY"></P>

<A NAME="T"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[T]</b></P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>Tarjetas</B>: MCGA Y SVGA son iniciales de dos tipos de tarjetas gr&aacute;ficas, la primera de lso inicios de los ordenadores, la otra de la actualidad. Tal vez escribamos un art&iacute;culo alg&uacute;n d&iacute;a sobre las tarjetas gr&aacute;ficas desde sus or&iacute;genes, explicando como eran y son, como funcionan y como sacarles el mejor partido, incluida programaci&oacute;n.  </P>
<P ALIGN="JUSTIFY"></P>

<A NAME="V"></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"><b>[V]</b></P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>Visores VRML</B>: Visores que se pueden incorporar, o que traen ya incorporados los navegadores de internet. VRML son iniciales de lenguaje de marcas de realidad virtual, un lenguaje del mismo tipo que el HTML pero usado para crear mundos virtuales, donde el visitante puede interactuar con los objetos.  </P></FONT></BODY>
<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<br>
<hr>
<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgen.htm">
<FONT FACE="ARIAL"><B>[Hardware gen&eacute;rico]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>