<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>celeraci&oacute;n gr&aacute;fica</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A HREF="mailto:sargue@ctv.es">Sergio Baila.</A>

</b></FONT>

<br><br>



<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>

ATi Rage Pro 128

</H3>

<p align=justify>

<p align = "justify"><font face=arial size=2>Finalmente ha llegado. El l&iacute;der mundial indiscutible

de ventas en el sector gr&aacute;fico, la empresa canadiense ATi, ha desvelado

el sucesor de su Rage Pro. Mucho ha cambiado desde que apareci&oacute;

el Rage Pro, y el mercado es ahora totalmente diferente, encarnizado en

una brutal batalla, liderada por 3Dfx y nVidia. Para que ATi mantenga su

liderato, deb&iacute;a presentar un producto sorprendente. Y ese producto

es, en parte al menos, el ATi Rage 128GL de 0.25 micras.</font>

<br><br><center><img SRC="jpg/hard7_1.jpg"></center>

<br><br><font face=arial size=2><p align=justify>El primer producto con el Rage 128 de la empresa canadiense

ser&aacute; la tarjeta AGP de 32 MB ATi Rage Fury. Equipada con el Rage

128, esta tarjeta ser&aacute; una excelente soluci&oacute;n para quien

quiere aceleraci&oacute;n 2D/3D de muy buena calidad, descompresi&oacute;n

DVD por hardware, salida de televisi&oacute;n y una buena cantidad de memoria.</font>

<p align = "justify"><font face=arial size=2>El Rage 128 correr&aacute; finalmente a 90 MHz, diez menos

que los anunciados hace tres meses, pese ha estar fabricado con tecnolog&iacute;a

state-of-the-art de 0.25 micras, cuando la mayor&iacute;a de chips se fabrican

actualmente con 0.30 micras. La raz&oacute;n es el intenso calor generado

por la Rage 128, que pese a haber visto reducida su frecuencia a 90 MHz

y estar fabricada bajo 0.25 micras, puede llegar a los 91 grados cent&iacute;grados,

una temperatura incluso peligrosa para nuestras manos. Incre&iacute;blemente,

el Rage 128 no viene equipado ni siquiera por un disipador de calor. En

cualquier caso, la temperatura, una vez dejamos de utilizar aceleraci&oacute;n

3D, desciende en solo 30 segundos hasta unos moderados 60 grados. ATi esta

trabajando en un redise&ntilde;o de la pastilla para optimizar la energ&iacute;a

y no generar tanto calor.</font>

<p align = "justify"><font face=arial size=2>Entremos en su interior. Nos encontramos con una unidad

de aceleraci&oacute;n paralelizada con dos v&iacute;as, pudiendo renderizar

dos texels (pixels con textura) con filtro bilineal por cada clock. Esto

le da la velocidad de 180 Mtexels/s, id&eacute;ntica a la TNT y la Voodoo2.</font>

<p align = "justify"><font face=arial size=2>Pero ah&iacute; no acaban sus especificaciones: cache

de texturas, filtrado trilineal, bump mapping y las t&iacute;picas prestaciones

que ya ofrece la TNT y la Voodoo2. Asimismo, y al igual que estas dos,

posee la capacidad de multitexturado, con lo que ya son tres los chips

que pueden hacerlo. Pero hay algo que ni la TNT ni la Voodoo2 poseen. El

Rage 128 dispone de etapas especializadas dentro del chip para la descompresi&oacute;n

de MPEG2 para DVD, con lo que, seg&uacute;n ATi, el 85% de la descompresi&oacute;n

la puede hacer el Rage 128. El soporte de la Rage 128 no se limita a descomprimir

DVD, sino que incorpora adem&aacute;s compensaci&oacute;n de movimiento

(hardware motion compensation) e iDCT, todo ello consumiendo &uacute;nicamente

un 10/15% de CPU, mientras muestra DVD a pantalla completa, y color real.

Adem&aacute;s, dispondr&aacute;, como ya viene siendo habitual, de salida

para TV y tambi&eacute;n de salida digital para pantallas planas.</font>

<p align = "justify"><font face=arial size=2>El tema del color, algo muy pol&eacute;mico desde que

salto ha escena la primera versi&oacute;n de la Voodoo3, da resultado francamente

sorprendentes en el Rage 128. Las im&aacute;genes pueden visualizarse hasta

con 32 bits de profundidad de color, igual que la TNT, pero que ni la Voodoo2

ni la Voodoo3 pueden conseguir. La sorpresa esta en que la TNT pierda un

40% de rendimiento al cambiar de 16 a 32 bits de color, mientras que la

Rage 128 apenas pierde un 10%. Esto significa que con la Rage 128 se puede

jugar perfectamente a 32 bits de color sin una perdida notable. Se acabaron

los efectos de bandas en los degradados y nieblas. 3Dfx declaraba hace

unas semanas que no dotan a su l&iacute;nea de productos de 32 bits de

salida porque liquida todas las prestaciones, disminuyendo los cuadros

por segundo hasta niveles injugables. Creo que los ingenieros de 3Dfx tiene

que algo que aprender de la gente en ATi.</font>

<br><br><center><img SRC="gif/hard7_2.gif"></center><p align=justify>

<br><br><font face=arial size=2>El rendimiento 3D en 16 bits se queda un 5% por debajo

de la TNT, por lo que podr&iacute;amos decir que tanto la Voodoo2, la TNT

y la Rage 128 quedan a un nivel muy similar en este punto. Sin embargo

hay que se&ntilde;alar que la dependencia de la CPU es mas elevada en el

caso de la Rage 128, aunque tambi&eacute;n es cierto que las pruebas realizadas

son sobre un driver beta, y ATi es bien conocida por desarrollar unos drivers

muy optimizados y mantenerlos bien actualizados en su web. De hecho, tiene

casi listo un ICD OpenGL completo para Win95/98 y NT 4.0.</font>

<p align = "justify"><font face=arial size=2>En el apartado de calidad de imagen 3D, la Rage 128 queda

a la altura de la TNT, estando por tanto ambas por encima de la Voodoo2.

Sobre la nitidez y claridad en modo 2D, parece ser que el resultado es

excelente, quedando a la altura de las dos campeonas actuales de esta categor&iacute;a,

la Matrox G200 y la Number Nine Revolution IV.</font>

<p align = "justify"><font face=arial size=2>Por supuesto hemos de tener en cuenta que esta tarjeta

saldr&aacute; aun dentro de un mes, y sus competidores, con los cuales

la hemos comparado, llevan muchos meses en el mercado. Adem&aacute;s, tanto

nVidia como 3Dfx dispondr&aacute;n pr&oacute;ximamente de productos que

superaran en potencia al Rage 128, por lo que los que quieran lo ultimo

en potencia 3D, deber&aacute;n esperar a la Voodoo3 o a la TNT-2. En cambio,

para los que estaban pensando en cambiar su tarjeta de v&iacute;deo por

algo vers&aacute;til sin desmerecer de ninguna manera en potencia 3D, quiz&aacute;s

la soluci&oacute;n sea pedir una ATi Rage Fury a los Reyes Magos</font>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR><hr>

<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgra.htm">
<FONT FACE="ARIAL"><B>[Aceleraci&oacute;n gr&aacute;fica]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>