<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Heroes of Might and Magic II.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> New World Computting.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Estrategia por turnos.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95 / DOS. </b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 66%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<FONT color="#000000">
<P ALIGN=justify>
<FONT color="#000000">
<P ALIGN=justify>

<CENTER><IMG src="gif/heroes2.gif"></CENTER>
<BR>

<P align="justify">
Nos encontramos ante la &uacute;ltima parte del, con permiso del Warlord, juego m&aacute;s
popular de entre todos relacionados con la estrategia por turnos y ambientada
en el medievo fant&aacute;stico.
<BR>
<BR>
Los primero que me llam&oacute; la atenci&oacute;n cuando pude instalar la primera parte de
este juego fue, sin lugar a dudas, la belleza con la que se hab&iacute;an creado
todos y cada uno de los escenarios por los que deb&iacute;amos jugar. Esta es una 
de las virtudes, más grandes, con las que cuenta la saga de los chicos de 
New World Computing,
ya que esta segunda parte, no s&oacute;lo cuenta con unos escenarios
igual de trabajados que la primera parte, sino que en muchas ocasiones mejora a su antecesor.
<BR>
<BR>
Pero pasando m&aacute;s a matera, <I>¿C&oacute;mo es el juego Heroes Of Might & Magic II?</I>. La 
respuesta es: SIMPLON PERO CAUTIVADOR. S&iacute;, pese a que esta segunda
parte incluye tintes de ROL, pese a que la inteligencia artificial
es de lo MEJOR que yo he podido ver, pese a que los escenarios son, como ya he 
dicho fabulosos, pese a que se ha incluido una historia,
PESE A TODO ESO, el juego, la esencia del juego, sigue siendo igual que la de su antecesor, muy,
muy simple.
</P>
<BR>
<TABLE>
<IMG src="gif/tndragon.gif" align="left">
<P align="justify">
<I>¿Que dónde est&aacute; la simpleza?</I>. A primera vista el 
juego no ofrece ningún atisbo de decepción. Es m&aacute;s, HOM&M pertenece a ese reducido
 espectro de juegos en los que al cabo de un cuarto de hora, aproximadamente, 
 saltas y dices "vaya, creo que este es mi juego preferido&quot;, pero que 
 seg&uacute;n transcurren las horas descubres que falla "algo"...
<BR>
La idea en la que se basa la pr&aacute;ctica
totalidad estrategica de este juego es conseguir el mayor número de tropas e ir a
lucar contra tú enemigo... para eso no hac&iacute;a falta &quot;estrategia&quot;
basada en turnos.

Cierto es que hay que reclutar una serie de h&eacute;roes. Estos ir&aacute;n 
mejorando sus habilidades seg&uacute;n vayan ganando combates. También es cierto 
que hay que ir encontrando artefactos o aprendiendo hechizos en las distintas 
ciudades pero...<i>¿y qu&eacute;?</i>. Consigue un poco de
dinero, el suficente para armarte con alguna unidad potente y algo numerosa, 
y...¡ya está!. Todos los dem&aacute;s aspectos ya no son necesarios. 
<BR>
<BR>
Lo que intento decir es que, este juego, cuenta con una maravillosa "capa". Esta
 "capa" es capaz de ocultar la idea simplona en la que se basa pero, a medida que 
 pasas las fases, (y dejando a un lado la historia que le da bastante vida 
 al producto), lo que es el juego en s&iacute;, ofrece poco con respecto a su 
 antecesor y con respecto al mundo de la estrategia en general. 
<BR>
<BR>
Sin embargo, para gustos son los colores, y en este caso en concreto, 
es muy comprensible que existan jugadores que se sientan totalmente cautivados con
&eacute;l. Como comente antes, el HOM&M, es un juego que se presta mucho a ello. Digamos que 
"trata bien al jugador".
<BR>
<BR>
<IMG src="gif/tnwcast.gif" align="right">
<p align=justify>
Pasando ya a relatar un poco el funcionamiento del mismo, decir que
si ya tuvist&eacute;is la oportunidad de jugar a la primera parte, el juego no
ofrece nada nuevo en el aspecto puramente... estrat&eacute;gico si ya has jugado
 a la primera parte. Si, por el contrario, este es t&uacute; primer HOM&M. Decir
que est&aacute;s ante un juego de estrategia por turnos, con ambiente medieval
fant&aacute;stico, en el que hay bastantes gui&ntilde;os al mundo del ROL (cosa por otro
lado l&oacute;gica, si tenemos en cuenta que la creadora es New World Computing, 
el fabricante de la maravillosa saga de juegos de ROL Might And Magic) y que, merece la
pena tenerlo.
<BR>
<BR>

La mec&aacute;nica es muy simple. A grandes rasgos, 
debes de elegir a un personaje, que ser&aacute; t&uacute; h&eacute;roe inicial (existen caballeros, b&aacute;rbaros, druidas...). 
Con dicho h&eacute;roe debes de expandir tus dominios mediante la conquista de 
otros reinos (que son castillos o villas).
<br>
<br>
Para poder realizar dicha empresa, has de elegir las tropas m&aacute;s potentes
y en mayor n&uacute;mero que puedas junto a un h&eacute;roe que poseea sufiente
experiencia. Pero claro, para ello has de construir determinadas
estructuras en t&uacute;s ciudades que te permitan atraerlas y a su vez, dichas
estructuras necesitan de ¡RECURSOS! (muy t&iacute;pico tambi&eacute;n), ¿CONSECUENCIA?, 
has de conseguir aserraderos, minas de oro, de piedras preciosas, de hierro etc etc.
<BR>
<BR>
En defintiva, <i>¿Qu&eacute; es lo que se echa en falta un jugador del primer HOM&M?</i>. 
<BR>
<BR>
<ul>
<LI><P ALIGN="JUSTIFY">
Un aspecto imperdonable es que no incluya la opci&oacute;n de negociaci&oacute;n. 
Sería muy de agradecer que se pudieran entablar alianzas, treguas... .<i>¿Tanto 
costaba incluir un sistema de &quot;conversaci&oacute;n&quot; con el adversario?
</i>
<LI><P ALIGN="JUSTIFY">La gesti&oacute;n de tus recursos es muy simple. Tan 
s&oacute;lo puedes convertir de uno a otro o venderlos, pero....<i>¿Por 
qu&eacute; no se pueden gastar las minas?</i>. <i>¿Por qu&eacute; no puedes 
hacer pillaje?</i>. <i>¿Por qu&eacute; no puedes dejar tropas vigilando ciertas
explotaciones de forma fija?</i>... Eso s&iacute; dar&iacute;a algo de 
&quot;toque&quot; estrat&eacute;gico al tratamiento de los recursos. No existe 
nada que se acerque remotamente a una gesti&oacute;n m&aacute;s o menos
interesante de los recursos (tal y como debería de lucir un juego de estrategia, por
 turnos, en condiciones). 
<LI><P ALIGN="JUSTIFY">La idea de ofrecer m&aacute;s tintes de ROL a esta segunda 
versi&oacute;n est&aacute; muy bien, pero...<i>¿Por qu&eacute; no puedes seguir 
con tus h&eacute;roes cuando acabas una fase?</i>. Parece una tonter&iacute;a 
pero a todos (a una inmensa mayoría) de los que nos gusta el ROL, solemos 
identificarnos con alg&uacute;n personaje al cual nos gusta manejar
durante todo lo que dure la partida. Ir subi&eacute;ndole de nivel, etc. Además, ¿no
 se supone que la historia es robusta?. Cuando ocurren cosas como esta la historia 
 empieza a dar qué pensar.
<LI><P ALIGN="JUSTIFY">Que con cada castillo te den X cantidad de dinero es una 
forma muy f&aacute;cil de quitarte de encima el desarrollo de un sistema 
econ&oacute;mico mucho m&aacute;s din&aacute;mico (estrat&eacute;gico) que es, al fin y al cabo, el que nos
interesa...<i>¿Por qu&eacute; no incluir un sistema de asignaci&oacute;n 
de impuestos?</i>. Esto haría que tus ciudades se pudieran "enfadar", que hubieran reveliones, 
d&aacute;ndole al juego un aspecto mucho más estrategico. No todo se reducir&iacute;a, prácticamente,  
a ir ganando batallas.</UL>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestrab.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

