<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso Acelerado de HTML</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>


<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Capítulo 9. Final del curso acelerado</H3>
<p align=justify>


Como ya se anunci&oacute; en el cap&iacute;tulo de la edici&oacute;n pasada, el cursillo r&aacute;pido sobre HTML toca a su fin irremediablemente sin embargo, hay gran cantidad de temas que no se han tratado en este &uacute;nicamente por querer ofrecer una visi&oacute;n lo m&aacute;s sencilla y pr&aacute;ctica del &quot;lenguaje&quot;. No dud&eacute;is que, pese a que el HTML es un &quot;lenguaje&quot; sencill&iacute;simo, hay un mont&oacute;n de cosas que nos hemos dejado en el tintero y merecer&iacute;an la pena tratar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Temas como la posibilidad de permitir al usuario escribir en nuestras p&aacute;ginas datos y que luego nos lo mande v&iacute;a mail (imaginaros un cuestionario), creaci&oacute;n de men&uacute;s en los que el visitante pueda interactuar m&aacute;s directamente, m&aacute;s comandos (muchos m&aacute;s) que nos hagan la &quot;vida m&aacute;s f&aacute;cil&quot; a la hora de trabajar &quot;a pelo&quot; en la construcci&oacute;n de nuestras p&aacute;ginas WEB, inclusi&oacute;n de CGI´s, en definitiva, que s&oacute;lo hemos dado y muy por encima, un vistazo a las posibilidades que se nos pueden ofrecer a la hora de dise&ntilde;ar una p&aacute;gina. De todos modos, creo que lo m&aacute;s importante, esto es, sentar las bases para la creaci&oacute;n de p&aacute;ginas WEB, est&aacute; hecho. Tan s&oacute;lo queda animar a gente que lea esto y posea conocimientos suficientes para que se proponga realizar alg&uacute;n curso sobre JAVA y HTML m&aacute;s avanzado a fin de poder derivar en una exposici&oacute;n mucho m&aacute;s competa y seria de lo que aqu&iacute; se ha pretendido ense&ntilde;ar. (¿qu&eacute; os parece &quot;HTML Avanzado&quot; &oacute; &quot;La hora del JAVA&quot;?. Al menos ya tenemos nombres para las &quot;¿secciones futuras?&quot; ;) )</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hablar, como dec&iacute;a m&aacute;s arriba, de temas que se nos han quedado en el tintero nos llevar&iacute;a mucho tiempo pero citar&eacute; que hay bastantes comandos no vistos y que pueden seros de mucha utilidad. Tan s&oacute;lo ten&eacute;is que pasar por alguna WEB en espa&ntilde;ol que tenga alg&uacute;n tipo de tutorial. La verdad es que hay much&iacute;simas en d&oacute;nde elegir y siempre encontrar&eacute;is informaci&oacute;n a vuestro gusto as&iacute; que os animo a una sesi&oacute;n con vuestro buscador favorito.</P>
<P ALIGN="JUSTIFY">Otros temas &quot;m&aacute;s avanzados&quot; como el uso de CGI´s tampoco han sido tratados ya que alargar&iacute;an innecesariamente el cursillo, dejando de ser este eso, un cursillo ;). Nuevamente pido de &quot;valientes&quot; capaces de hablarnos de estos temas o, incluso, otros s&iacute; ya m&aacute;s serios como la programaci&oacute;n en JAVA.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, espero que os sirva de algo este primer &quot;curso&quot; que acaba en Macedonia o, al menos, que os deis cuenta que aprender este &quot;lenguaje&quot; no es nada complicado. Recordad que, lo visto aqu&iacute;, sirve para crear algo como Macedonia ;).</P>

<br>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulap.htm"><font FACE="ARIAL"><B>[Curso Acelerado de HTML]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
