<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>rogramación y Desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Hazlo gratis
</FONT>
</H3>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Uno de los mayores dilemas que se 
presentan cuando vamos a comenzar a realizar un proyecto, es el referido a poner o no 
precio a nuestro trabajo. En la mayor&iacute;a de las ocasiones, siempre se tiende a 
distribuir el programa de tal forma que el usuario tenga que desembolsar una determinada 
cantidad de dinero para conseguirlo (distribuci&oacute;n &quot;Shareware&quot;). En otras 
ocasiones, sin embargo, el propio creador decide distribuir gratuitamente su producto 
entre toda la comunidad inform&aacute;tica (de forma &quot;Freeware&quot;). Uno puede pensar 
que las ambiciones o que las metas de la persona que decide donar todo su trabajo de 
forma altruista son m&aacute;s bien escasas, sin embargo, esto no suele ser, ni mucho menos, 
as&iacute;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo peor que puede hacer una persona que comienza a introducirse en el mundo del desarrollo con el fin de adquirir experiencia y conseguir que su trabajo llegue al mayor n&uacute;mero de usuarios es poner precio a su trabajo. Todos estamos de acuerdo en el hecho de que regalar un programa (o cualquier otro tipo de &quot;software&quot;) que nos ha &quot;robado&quot; cantidades importantes de tiempo, no resulta muy agradable de cara al inicio del desarrollo. Es m&aacute;s, seguramente que no llegaremos a tener ni noticias de alguien que lo ha visto o utilizado (y si las tenemos, se contar&aacute;n con los dedos de una mano). Sin embargo, no resulta menos cierto que distribuir un programa, que en absoluto est&aacute; pensado para que podamos comer de él, de tal forma que sus capacidades sean mermadas en extremo hasta que alguien decida registrarse, es algo que va a limar, de forma exagerada, su posible expansi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A medida que vas haciendo m&aacute;s y m&aacute;s cosas y observas y analizas las creaciones de otras personas, adquieres una actitud mucho m&aacute;s humilde y propicia para el aprendizaje futuro a lo largo de tu vida. Quiz&aacute; esta sea la clave, es decir, el ir madurando como creador &quot;de algo&quot;, hace que te des cuenta de tus limitaciones, y de la cantidad ingente de cosas que te quedan por aprender. Si a esto unimos que el 99% del &quot;Shareware&quot; que se hace en nuestro pa&iacute;s no est&aacute; destinado a mantener a la persona que est&aacute; detr&aacute;s sino, m&aacute;s bien, a darla a conocer, resulta un poco contradictorio que el mismo creador decida poner precio a su tarjeta de presentaci&oacute;n. Obviamente esta visi&oacute;n es muy personal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Creo que hay que saber el momento en que debes de poner precio al trabajo que est&aacute;s realizando o vas a realizar. Trabajar de forma desinteresada y recibir, muy de vez en cuando, alguna que otra felicitaci&oacute;n por tu labor es algo que no se puede comparar a saber que est&aacute;s cobrando por realizarlo. Y cuando digo esto, lo digo por experiencia. Una persona que trabaja de forma desinteresada, sin esperar nada a cambio, adquiere un sentido de la responsabilidad que est&aacute; a a&ntilde;os luz de cualquier otra que nunca haya trabajado de esa manera. Obviamente los ejemplos que aqu&iacute; muestro son proporcionales, es decir, cuando hablo de &quot;realizar algo&quot; me refiero a la utilizaci&oacute;n del tiempo libre, no del tiempo laboral.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En definitiva, cuando vayas hacer cualquier cosa por iniciativa propia, antes plant&eacute;ate si de verdad vas a necesitar imponer, despu&eacute;s, una determinada tasa para que la gente contemple tu creaci&oacute;n. Quiz&aacute;s para determinadas personas esto sea algo dif&iacute;cil de comprender. El trabajar altruistamente en algo que te gusta y apasiona es la mejor inversi&oacute;n que puedes hacer a corto y largo plazo. Sin duda, hazlo gratis.</P></FONT>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionb.htm"><font FACE="ARIAL"><B>[Opinión Programación / Desarrollol]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>



