<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Internet, el final de una ilusión.
</FONT>
</H3>

<P align="justify">
<FONT color="#000000" size =2 face="arial" >        
<P ALIGN=JUSTIFY>
Todav&iacute;a no ha ocurrido, pero estamos en camino. Internet se pierde, irremisiblemente. El d&iacute;a a&uacute;n no ha llegado, pero quiz&aacute;s no exista ese d&iacute;a, sino que se trate de un cambio gradual que ya ha empezado a fraguarse y que va a quitarnos de las manos el invento m&aacute;s genial de la modernidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La palabra Internet, vocablo puesto de moda por peri&oacute;dicos, televisiones, revistas y lo m&aacute;s granado del plantel de esnobistas que nos bombardean desde los mass-media, ha calado en la sociedad de una manera parcial, desvirtuada y tendenciosa. Internet representa para una gran parte de del p&uacute;blico en general un antro de corrupci&oacute;n, pornograf&iacute;a y delincuencia. Esta opini&oacute;n es fruto del desmesurado sensacionalismo del que hacen gala los informativos m&aacute;s vistos de nuestro pa&iacute;s y que centran sus esfuerzos no en las noticias sino los dichosos &iacute;ndices de audiencia. Pero esto no es Internet. Internet es algo muy distinto. Tan distinto que incluso muchos usuarios veteranos de la red a&uacute;n desconocen. Internet no son los routers, servidores, clientes, l&iacute;neas de conexi&oacute;n, el Playboy, Pamela Anderson, Visa o Microsoft.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hoy Internet es el resultado de una red de comunicaciones que se fragu&oacute; en el entorno acad&eacute;mico norteamericano, que desarroll&oacute; todas sus herramientas si ver un duro privado, que creci&oacute; gracias a la colaboraci&oacute;n de investigadores, que en la mayor&iacute;a de los casos ni siquiera se conoc&iacute;an, y que cristaliz&oacute; su filosof&iacute;a de trabajo seg&uacute;n las normas del trabajo en equipo creando herramientas para que eso siguiera siendo as&iacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando Internet no estaba disponible al gran p&uacute;blico el ambiente de trabajo en las Universidades poblaba la red con todas sus influencias, tendencias, intenciones y ramificaciones. Cuando la red empez&oacute; a hacerse presente en las grandes empresas y a extender su presencia a los hogares de usuarios finales, campar por ella era descubrir un mundo de posibilidades inmenso, lugares donde discutir sobre multitud de temas y un campo abonado para toda una serie de divagaciones y predicciones que hoy siguen caldeando numerosos foros de debate. El esp&iacute;ritu de "crecer compartiendo recursos", de "todos y para todos" y "abierto sin restricciones" nos sorprendi&oacute; a muchos, resultando ser un descubrimiento muy esperanzador en medio de un mundo mercantilizado y lleno de intereses hasta el hast&iacute;o.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El paso de los a&ntilde;os hizo descubrir este vergel a un n&uacute;mero creciente de usuarios que entraban en masa a la red. Tanto, que el crecimiento ha sido disparatado. Cifras de conexi&oacute;n que se doblaban cada pocas semanas, atascos en el flujo de datos, gente por todos sitios y...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y lo que se adivinaba. Lo que antes era una desorganizaci&oacute;n muy bien organizada ahora es una desorganizaci&oacute;n may&uacute;scula. Ese ideal de sitio libre, abierto, sin control ni restricciones, de la filosof&iacute;a del "aporta tanto como te lleves" que tantos recursos de valor ha creado dentro de la red, se va al traste por d&iacute;as. Internet se nos va de las manos, se nos escapa... al menos la Internet que muchos conocimos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hoy darse un paseo por las news es encontrarse con m&aacute;s mensajes basura que mensajes con contenido coherente, con gente que pide m&aacute;s que ofrece, con mercaderes de todo, con mentirosos, buscabullas, provocadores y aprovechados. Pasearse por el WWW es atragantarse con p&aacute;ginas cargadas de banners publicitarios hasta la misma colcha, p&aacute;ginas insulsas, p&aacute;ginas escaparate donde todo es previo pago. Utilizar el e-mail puede ser un infierno si no camuflas tu identidad ya que tu buz&oacute;n puede ser inundado por cantidades ingentes de correo no solicitado. Encontrar una conversaci&oacute;n coherente y agradable en el IRC es como andar por la jungla...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estamos rodeados. Se acab&oacute; el maravilloso descubrimiento que tanto promet&iacute;a y que va a obligar, tarde o temprano, a poner puertas al campo y tener que regular la forma de comportarnos en la red. Las news no funcionan con tanta basura, el www no se hizo para que nos costara dinero entrar en las p&aacute;ginas, el correo electr&oacute;nico no se cre&oacute; para enviar folletos publicitarios ni el IRC para aburrirse.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Los culpables de que esto est&eacute; pasando? Vamos por partes, primero nosotros: los usuarios. Nos quejamos a las primeras de cambio de que la libertad no se puede coartar, que todos tenemos derecho a hacer o deshacer, decir o desmentir, pero somos los primeros en tener el concepto de libertad mal entendido. No har&iacute;a falta coartar, controlar ni cerrar nada si todos hici&eacute;ramos un uso correcto de los servicios de la red. Si utiliz&aacute;ramos las news correctamente no habr&iacute;a que perder tanto tiempo buscando entre la basura, si no desperdici&aacute;ramos ancho de banda las comunicaciones ser&iacute;an m&aacute;s r&aacute;pidas... Pero al parecer no podemos tener nada abierto, gratuito ni de acceso no controlado. El buen funcionamiento de este tipo de recursos es directamente proporcional al sentido com&uacute;n, educaci&oacute;n y grado de civismo de los usuarios, y a la vista de los resultados, no es esto lo que sobra en la red precisamente. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Segundo: los mercaderes. La red est&aacute; siendo invadida por los b&aacute;rbaros de las finanzas. En Wall Street las empresas de telecomunicaciones est&aacute;n que bullen. Todo lo relacionado con Internet es perseguido por las grandes multinacionales que quieren quedarse con la mayor parte del pastel que ellos est&aacute;n inventando: comprar y vender por Internet. Todo con  precio, con medidas, con claves... si no tienes no entras, si no gastas te quedas sin ello. Internet jam&aacute;s fue as&iacute;. Antes cualquiera entraba en cualquier sitio, lo que hab&iacute;a estaba disponible al 100% y el que dejaba algo en la red sab&iacute;a que as&iacute; era. La informaci&oacute;n se elaboraba por muchos y quedaba disponible a todos. Una vez que te conectabas, la red era un terreno sin tabiques, donde entrabas a todos sitios porque las puertas estaban abiertas. Hoy existen puertas que se est&aacute;n empezando a cerrar y donde para entrar necesitas un n&uacute;mero VISA y una cuenta de donde se pueda sacar dinero.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y tercero: las compa&ntilde;&iacute;as de tel&eacute;fono. Lo m&aacute;s vergonzoso, al menos en Espa&ntilde;a. Cuando en Estados Unidos entrar en Internet es tan normal casi como encender la TV, en Espa&ntilde;a Internet es un esnobismo que queda muy bien en boca de pol&iacute;ticos, presentadores de televisi&oacute;n e invitados a tertulias de radio pero que cada vez nos pilla m&aacute;s lejos. Las maravillas de este invento, que puede ayudar a conseguir una sociedad cada vez m&aacute;s educada, informada y con unas posibilidades tremendas de acceso a la cultura y la informaci&oacute;n en general, van quedando relegadas al desuso por los intereses de unos especuladores ambiciosos que tienen en sus manos parte del desarrollo cultural de nuestro pa&iacute;s. Es penoso que en Estados Unidos el gasto telef&oacute;nico de conexi&oacute;n a Internet sea de 4.000 pesetas al mes y que en Espa&ntilde;a por s&oacute;lo dos horas se rocen las 700 pesetas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El panorama no es nada alentador. El sue&ntilde;o se nos escapa de las manos. Por la falta de educaci&oacute;n de unos y los intereses de otros la historia volver&aacute; a repetirse una vez m&aacute;s. Volvemos a demostrar de nuevo que no estamos preparados para vivir sin barreras, sin controles y con las puertas abiertas. No estamos hechos para aprovechar los recursos que tenemos a la mano, sino para abusar de ellos. Si no ponemos remedio (optimista que es uno) Internet desaparecer&aacute; tal como lo conocimos un d&iacute;a. S&oacute;lo quedar&aacute; su sombra y en ella un mont&oacute;n de nost&aacute;lgicos apurando los ecos de lo que un d&iacute;a nos pareci&oacute; fant&aacute;stico.</P></FONT></BODY>
</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionc.htm"><font FACE="ARIAL"><B>[Opinión Internet]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
