<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:oscarg@salleurl.edu">Oscar García "Kokopus"</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Segunda conferencia IMSC-USC. "What's next!"
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
Antes de empezar a relataros lo que se aconteci&oacute; en la mencionada conferencia os comentare un poco lo que significan las siglas IMSC y USC.</P>
<P ALIGN="JUSTIFY">Situada en el coraz&oacute;n de Los Angeles (California, USA) se erige una de las mas avanzadas universidades del mundo en materia inform&aacute;tica, </FONT><A HREF="http://www.usc.edu/" target="_new"><FONT FACE="Arial" SIZE=2>USC</FONT></A><FONT FACE="Arial" SIZE=2> (<U>U</U>niversity of <U>S</U>outhern <U>C</U>alifornia). Entre sus profesores se encuentran algunas de las personas que han escrito los libros que consultamos aqu&iacute; en Espa&ntilde;a durante nuestros estudios. Pioneros en la creaci&oacute;n de Internet (Arpanet), controlan la adquisici&oacute;n y determinaci&oacute;n de dominios en la red de redes. Cuentan con algunos de los mas modernos laboratorios del mundo en materia de investigaci&oacute;n. Situ&aacute;ndonos en nuestro campo, la Inform&aacute;tica, os dir&eacute; que est&aacute;n desarrollando aplicaciones de Realidad Virtual (VR - <U>V</U>irtual <U>R</U>eality)&nbsp;y Realidad Aumentada (AR - <U>A</U>ugmented <U>R</U>eality) para importantes multinacionales como la empresa aeron&aacute;utica McDonnell-Douglas o las inform&aacute;ticas HP e Intel.</P>
<P ALIGN="JUSTIFY">Dentro de la universidad se encuentra el primer centro nacional norteamericano de investigaci&oacute;n en temas Multimedia. Fue escogido el a&ntilde;o pasado como centro pionero Multimedia del pa&iacute;s y est&aacute; subvencionado por el gobierno as&iacute; como por diversas empresas multinacionales. Se trata del </FONT><A HREF="http://imsc.usc.edu/" target="_new"><FONT FACE="Arial" SIZE=2>IMSC</FONT></A><FONT FACE="Arial" SIZE=2> (<U>I</U>ntegrated <U>M</U>edia <U>S</U>ystems <U>C</U>enter). Abordan absolutamente todas aquellas categor&iacute;as que puedan ser englobadas dentro de cualquier aplicaci&oacute;n Multimedia que se precie: gr&aacute;ficos y animaci&oacute;n, procesado de se&ntilde;ales, compresi&oacute;n, visi&oacute;n artificial y por supuesto las "nuevas realidades", la ya conocida realidad virtual y un nuevo concepto llamado <I>realidad aumentada</I>.</P>
<P ALIGN="JUSTIFY">IMSC est&aacute; trabajando como centro pionero en cooperaci&oacute;n con diversas universidades de otros estados y ciudades tales como Illinois, Carolina del Norte y Nueva York. Juntos desarrollan nuevas tecnolog&iacute;as que permitan al usuario trabajar de forma "distribuida" o lo que es lo mismo, que sea una realidad poder atender a clase v&iacute;a sat&eacute;lite desde casa o cooperar en un proyecto desarrollado en Alemania sin moverte de tu sill&oacute;n en las islas Azores...</P>
<P ALIGN="JUSTIFY">Perfecto. Ahora ya sabemos que USC es una universidad y que IMSC es uno de sus departamentos...bueno pues, ¿que tal fue la conferencia?, vamos a ello.</P>
<P ALIGN="JUSTIFY">Tuve la oportunidad de asistir a la mencionada conferencia gracias a mi estancia durante un semestre en USC. Estuve precisamente trabajando &iacute;ntimamente con el IMSC hasta hace unos pocos d&iacute;as y quede francamente interesado con todo lo que est&aacute;n llevando a cabo.</P>
<P ALIGN="JUSTIFY">Este a&ntilde;o, para ser exactos el 4 de Abril, IMSC celebro su segunda conferencia "</FONT><A HREF="http://imsc.usc.edu/Personnel/sretreat98.html" target="_new"><FONT FACE="Arial" SIZE=2>What's next !</FONT></A><FONT FACE="Arial" SIZE=2>" (¿Que es lo siguiente?) para dar a conocer todos sus proyectos en curso as&iacute; como ofrecer la oportunidad a diversos profesionales de ofrecernos a nosotros "los aprendices" sus respectivas opiniones acerca de <B><I>"lo que depara el futuro de la Multimedia"</B></I>.</P>
<P ALIGN="JUSTIFY">El evento consto de diversas partes. La ma&ntilde;ana del d&iacute;a se aprovecho para dejar a los profesionales hablar y para mostrar algunos de los proyectos que se est&aacute;n desarrollando en el IMSC. El mediod&iacute;a se amenizo con diversas salas de discusi&oacute;n donde hasta los mas profanos pod&iacute;an participar libremente. Durante la tarde continuaron las presentaciones ofreciendo una estupenda visi&oacute;n de lo que es "el estado del arte actual".</P>
<P ALIGN="JUSTIFY">Se mencionaron para empezar algunas de las nuevas tecnolog&iacute;as en las que la Multimedia est&aacute; empezando a ser algo mas que una "opci&oacute;n diferente". Me refiero con esto a las <I>librer&iacute;as digitales</I>, la <I>realidad aumentada</I>, la <I>teleimmersion</I>, la <I>videoconferencia 3D</I> o las <I>bases de datos Multimedia</I>. No comentare todas estas tecnolog&iacute;as porque acabar&iacute;ais todos/as durmiendo y pagando la conexi&oacute;n a la vez (lo cual es un gran despilfarro tal y como est&aacute; el tema de tarificaci&oacute;n hoy en d&iacute;a...jejejeje.....) pero si intentare desvelaros un poquito el misterio que se cierne sobre la nueva AR, que como pod&eacute;is leer unos cuatro p&aacute;rrafos hacia arriba, es la Realidad Aumentada.</P>
<P ALIGN="JUSTIFY">Pues bien empezare con lo que un par de profesionales de la Industria del entretenimiento dijeron en cuanto al futuro...</P>
<P ALIGN="JUSTIFY">Seg&uacute;n <B><I>Tom Leeser,</B></I> director de una importante empresa de efectos especiales afincada en Hollywood, el futuro se presenta: </P>

<UL>
<LI><B><I><P ALIGN="JUSTIFY">Barato</B></I>, y es que solo hay que ver lo que vale una SGI ahora y lo que val&iacute;a hace un par de lustros... </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Dirigido al PC</B></I>, hoy en d&iacute;a ya se pueden hacer buenos gr&aacute;ficos con un PC y con un robusto sistema operativo. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Integrado</B></I>, todo todo todo...lo queremos todito en un mismo CD, ¿os suena el tema DVD?. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Orientado a Internet</B></I>.....pooooorrrrr supuestooooo!!!!.......8). </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Tiempo de vida del soft muy corto</B></I>, actualizar y actualizar y actualizar mas.....y ahora ya directamente v&iacute;a Internet !. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Digital</B></I>, y es que se construir&aacute; "gente simulada" o lo que es lo mismo, cuidado que al final "lo real" ser&aacute; lo extra&ntilde;o y sino atenci&oacute;n a los actores digitales de Titanic o Batman. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Necesitado de personas duales</B></I>. Existen muy pocos ingenieros o t&eacute;cnicos con capacidades sociales y art&iacute;sticas interesantes. Esta clase de individuo se busca cada vez mas obviando muchas veces su experiencia o curriculum. </LI></P></UL>

<P ALIGN="JUSTIFY">Como pod&eacute;is observar su punto de vista es como el de un t&eacute;cnico con conocimiento sobre la materia. Veamos ahora lo que dijo <B><I>Alex Singer</B></I>, uno de los directores de Star Trek, desde un punto de vista totalmente art&iacute;stico:</P>
<B><I><P ALIGN="JUSTIFY">"¿Es que se nos ha olvidado lo que es el arte?, tanto ordenador nos est&aacute; quitando la capacidad de dirigir y pensar.....si volvieran los viejos tiempos...." </B></I>as&iacute; resumir&iacute;a yo un poco lo que mr.Singer vino a decir. Manifest&oacute; estar de acuerdo con el progreso y la tecnolog&iacute;a pero jamas obviando a las personas o provocando el paro entre los actores si todo acaba siendo Digital. Y es que la pugna entre el t&eacute;cnico y el artista est&aacute; servida y para rato....no es f&aacute;cil hacerlos coincidir os lo aseguro y lo digo por experiencia propia...(<B><I>pista:</B></I> yo no pinto cuadros, mas bien programo en OpenGL...).</P>
<P ALIGN="JUSTIFY">Ahora que ya ten&eacute;is una peque&ntilde;a idea sobre lo que las dos caras de la moneda opinan, voy a comentaros algunos de los mas interesantes proyectos que all&iacute; se presentaron para que teng&aacute;is una idea de lo que los norteamericanos est&aacute;n haciendo ahora mismito. As&iacute; pues tenemos: </P>

<UL>
<LI><B><I><P ALIGN="JUSTIFY">Reconocimiento facial on-line</B></I>. El sistema es capaz de reconocer a una persona recibiendo como entrada una secuencia de v&iacute;deo de esta. Se dispone de una galer&iacute;a de im&aacute;genes est&aacute;ticas de diversas personas con diferentes expresiones en una base de datos. El sistema la compara con la informaci&oacute;n sobre el sujeto extra&iacute;da de la secuencia de v&iacute;deo de entrada. En tiempo real y con eficiencias alt&iacute;simas. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Simulaci&oacute;n facial para videoconferencia 3D</B></I>. Se trata de seguir los movimientos de un individuo con una c&aacute;mara, reconocerlos, enviarlos v&iacute;a Internet a un receptor y "redibujar" al sujeto en destino. Es lo que se llama videoconferencia 3D en la que no se env&iacute;a informaci&oacute;n de v&iacute;deo sino tan solo de movimiento. En recepci&oacute;n se dispone de un modelo gr&aacute;fico 3D de la persona con la que se est&aacute; hablando de forma que es este modelo el que se mueve y orienta seg&uacute;n lo est&aacute; haciendo la persona emisora desde el transmisor. El sistema pretende ser rapid&iacute;simo ya que no se env&iacute;a se&ntilde;al de v&iacute;deo, muy costosa en Internet como todos/as sab&eacute;is. Colaboran en este proyecto universidades tanto de Los Angeles como de Nueva York. Pretenden construir dos habitaciones id&eacute;nticas, una en cada ciudad, en las que dos personas puedan sentarse, recibir el "tracking" de la c&aacute;mara y moverse/hablar con total libertad, vi&eacute;ndose la una a la otra a trav&eacute;s de unas gafas especiales (visor gr&aacute;fico). Se supone que podr&aacute;n interactuar "virtualmente" entre ellas a modo de intercambio de ficheros o documentos como si f&iacute;sicamente lo realizaran. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Optimizaci&oacute;n de consultas en bases de datos distribuidas</B></I>. Las consultas v&iacute;a Internet ya no son cosa de cuatro amiguetes amantes de la red. Todo el mundo busca informaci&oacute;n continuamente y demanda una respuesta efectiva y r&aacute;pida. En este proyecto se intenta agilizar el tiempo de respuesta de los servidores cosa nada f&aacute;cil dado su car&aacute;cter impredecible en cuanto a rendimiento as&iacute; como las fluctuaciones de trafico en la red. Dada una consulta, se escoge en que servidor buscar la informaci&oacute;n o se integra informaci&oacute;n de diversas fuentes diferentes. En esta aplicaci&oacute;n Java han conseguido un sistema totalmente optimo que siempre escoge el plan mas optimo para encontrar y traer aquello que se le pide. </LI></P>
<LI><B><I><P ALIGN="JUSTIFY">Realidad aumentada</B></I>. Sin duda interesant&iacute;simo nuevo concepto que puede revolucionar el mundo de la industria en unos pocos a&ntilde;os. Se trata de "aumentar" la realidad existente a&ntilde;adi&eacute;ndole mas informaci&oacute;n de la que ya contiene. Fijaos: </LI></P></UL>
<center><img src="jpg\imsc.jpg"></center>
<P ALIGN="JUSTIFY">Es decir, imaginaos mirando a trav&eacute;s de unas gafas estereosc&oacute;picas 3D, viendo la realidad, es decir lo que ten&eacute;is en frente, pero a la vez viendo gr&aacute;ficos superpuestos a ella que os ayudan en vuestro trabajo. </P>
<P ALIGN="JUSTIFY">Tal como indica el diagrama se trata de "muestrear" ("Tracking") la imagen real de v&iacute;deo en la entrada, interpretarla y as&iacute; generar gr&aacute;ficos (imagen sint&eacute;tica) que puedan a&ntilde;adirse finalmente a la escena real. </P>
<P ALIGN="JUSTIFY">Por poner un ejemplo os dir&eacute; que IMSC est&aacute; produciendo un sistema de AR para la empresa aeron&aacute;utica McDonnell-Douglas. Se trata de un sistema creado para los trabajadores de la compa&ntilde;&iacute;a. Los ingenieros aeron&aacute;uticos deben de consultar pesados manuales continuamente mientras trabajan en sus aviones y por supuesto no pueden equivocarse apretando una tuerca !!!....La idea es que lleven unas gafas 3D a trav&eacute;s de las cuales vean el avi&oacute;n o la parte de este en la que trabajan y superpuestos a la imagen real, gr&aacute;ficos indic&aacute;ndoles todo lo que deben hacer, reparar, etiquetas mencionando que es cada cosa, diagramas de flujo indicando en que orden realizar las operaciones...Es impresionante y sumamente interesante en trabajos de tan requerida exactitud como ese. Creedme si os digo que ya les empieza a funcionar el sistema y a una velocidad de miedo....8). </P>

<UL>
<P ALIGN="JUSTIFY"><LI>Se mostraron otras tecnolog&iacute;as tales como <B><I>pixels inteligentes</B></I>, <B><I>parsers y analizadores gramaticales</B></I> que extraen reglas sint&aacute;cticas de la informaci&oacute;n que buscan en el web, manejo de <B><I>formatos diversos e inconsistentes</B></I> en la red en motores de b&uacute;squeda, <B><I>protecci&oacute;n en frecuencia de </B></I>im&aacute;genes en la red ... </LI></P></UL>

<P ALIGN="JUSTIFY">Ya veis que hay mucho que aprender de las altas esferas investigativas.....esperemos que llegue el d&iacute;a en que nuestro pa&iacute;s dote a las universidades de suntuosas inversiones econ&oacute;micas que nos permitan situarnos a su mismo nivel. Desde luego ganas creo que no nos faltan!!!</P>
<P ALIGN="JUSTIFY">Para mas informaci&oacute;n sobre todos estos proyectos, conectaros a la web de USC y concretamente a la secci&oacute;n dedicada al IMSC. De verdad que vale la pena que le ech&eacute;is un vistazo a todo lo que est&aacute;n desarrollando...</P></FONT></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

