<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>



<H3>Teletrabajo: Los ordenadores al servicio del trabajador</H3>
<P ALIGN="JUSTIFY">Cada d&iacute;a son m&aacute;s las personas que no acuden a su cita habitual con el trabajo, que no se enfrentan a una dura jornada laboral sentadas frente a un escritorio atiborrado de trabajo, sino que es su quehacer diario el que acude a sus casas. Son los teletrabajadores. En Espa&ntilde;a es dif&iacute;cil determinar el n&uacute;mero actual de teletrabajadores aut&oacute;nomos que hay. Hodson afirma que en nuestro pa&iacute;s en 1992 hab&iacute;a ya cerca de 300.000 teletrabajadores por cuenta ajena; sin embargo, el proyecto Teldelt hablaba de poco m&aacute;s de cien mil personas que utilizan los &uacute;ltimos avances en tecnolog&iacute;a de la informaci&oacute;n y de la comunicaci&oacute;n como medio de trabajo y de vinculaci&oacute;n a su empresa. De cualquier manera, esas cifras han experimentado un incremento importante en los &uacute;ltimos a&ntilde;os.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y ello ha sido debido a que el teletrabajo se ha convertido en uno de los componentes de m&aacute;s importancia de la denominada "sociedad de la informaci&oacute;n". El teletrabajo es un t&eacute;rmino que en muchas ocasiones todav&iacute;a se relaciona en Espa&ntilde;a al trabajador c&oacute;modamente sentado en el sofa de su casa, provisto con un port&aacute;til y escribiendo, pudiendo "abandonar" su puesto de trabajo cuando le venga en gana.. Pero eso no es todo el teletrabajo, y desde luego no muestra el verdadero calado de una forma de trabajar y de entender las relaciones laborales que viene, seg&uacute;n todos los expertos, a reformar de arriba abajo muchas estructuras sociales, econ&oacute;micas, laborales, humanas y empresariales.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">¿Qu&eacute; es el teletrabajo?</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El concepto de teletrabajo se puede definir como la substituci&oacute;n parcial o total de las tecnolog&iacute;as de telecomunicaciones por el desplazamiento hacia y desde el lugar de trabajo unido a cambios asociados en la pol&iacute;tica, la organizaci&oacute;n, la direcci&oacute;n y la estructura laboral. De una forma simple, es mover el trabajo hacia los trabajadores, en lugar de los trabajadores al trabajo. Los ordenadores, los tel&eacute;fonos celulares, el fax, y comunicaciones avanzadas como RDSI y el acceso telef&oacute;nico directo han eliminado las barreras f&iacute;sicas que "un&iacute;an" a los trabajadores a sus oficinas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque existen muchas acepciones del t&eacute;rmino, la Comisi&oacute;n Europea considera que hay un nexo com&uacute;n en todo lo que puede denominarse teletrabajo, y es el siguiente: "el uso de ordenadores y las telecomunicaciones para cambiar la geograf&iacute;a aceptada del trabajo".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para no caer en errores, un estudio elaborado por la Escuela de Organizaci&oacute;n Industrial ( EOI/www.eoi.es ), recoge la siguiente indicaci&oacute;n: "Una persona que trabaja a distancia de su empresa, utilizando un equipo inform&aacute;tico que no est&aacute; unido mediante l&iacute;nea de teletransmisi&oacute;n a la compa&ntilde;&iacute;a, no <I>teletrabaja</I> sino que trabaja fuera de la empresa". O lo que es lo mismo, desempe&ntilde;a funciones como aut&oacute;nomo o como <I>freelancer</I>.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Cambio de papeles</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con el desarrollo del teletrabajo se ha producido un cambio de papeles: el trabajador no se acerca a la empresa y es el trabajo el que se desplaza hasta el empleado, a su propio domicilio o a un centro espec&iacute;fico donde desarrolla su labor. En esto consiste el teletrabajo. Se trata de uno de los fen&oacute;menos que caracterizan la denominada sociedad de la informaci&oacute;n: las telecomunicaciones, especialmente la telem&aacute;tica como instrumento esencial y cotidiano, y la comunicaci&oacute;n hacen posible este sistema de empleo, llegando incluso a unir varios puestos de trabajo separados geogr&aacute;ficamente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El teletrabajo desarrollado por un teletrabajador por cuenta ajena ofrece menos problem&aacute;tica: est&aacute; mejor definido, y es la empresa, normalmente grande, la que estudia el modo m&aacute;s eficaz y econ&oacute;mico de sacar rendimiento al empleado y al sistema. Mejor que de "teletrabajadores" habr&iacute;a que hablar de "teleempleados", dejando el t&eacute;rmino de "teletrabajador" m&aacute;s bien para los autoempleados o aut&oacute;nomos que intentan tener ingresos por y para s&iacute; mismos normalmente desde casa en r&eacute;gimen de teletrabajo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Or&iacute;genes</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los or&iacute;genes del teletrabajo como se entiende en la actualidad se remontan a la introducci&oacute;n del t&eacute;rmino <I>telecommuting</I>, acu&ntilde;ado por Jack Nilles en los EE UU en su libro "The telecommunications transportation trade-off" para referir a este tipo de trabajo fuera del lugar habitual. La Comisi&oacute;n Europea, por su parte, ha popularizado el t&eacute;rmino teletrabajo puesto que desde finales de los ochenta y principios de los 90 ha venido fomentando numerosas iniciativas, investigaciones y trabajos para estudiar las aplicaciones del teletrabajo en la generaci&oacute;n de nuevos empleos o en la reactivaci&oacute;n de zonas rurales empobrecidas.</P>
<P ALIGN="JUSTIFY">A Espa&ntilde;a no se sabe cu&aacute;ndo ni c&oacute;mo lleg&oacute; ya que el teletrabajo es un fen&oacute;meno tambi&eacute;n de individuos, y es imposible saber qui&eacute;n fue el primer espa&ntilde;ol aut&oacute;nomo que «teletrabaj&oacute;». En cuanto a teletrabajo por cuenta ajena es posiblemente IBM ( </FONT><A HREF="http://www.es.ibm.com/"><FONT SIZE=2>www.es.ibm.com</FONT></A><FONT FACE="Arial" SIZE=2> ) la pionera en hacer trabajar en casa a su personal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Enn nuestro pa&iacute;s existen una serie de iniciativas y proyectos de teletrabajo. La mencionada empresa IBM, por ejemplo, tiene desde 1995 m&aacute;s de un millar de empleados trabajando desde sus casas, mientras viajan, o desde las oficinas de los clientes. La compa&ntilde;&iacute;a de seguros Mapfre Vida ( </FONT><A HREF="http://www.mapfre.com/"><FONT SIZE=2>www.mapfre.com</FONT></A><FONT FACE="Arial" SIZE=2> ) ha equipado tambi&eacute;n a m&aacute;s de 500 empleados para trabajar mientras viajan por carretera, estando algunos de ellos capacitados para contratar p&oacute;lizas de seguro en l&iacute;nea, de forma instant&aacute;nea. Tambi&eacute;n compa&ntilde;&iacute;as como Bull ( </FONT><A HREF="http://www.bull.com/"><FONT SIZE=2>www.bull.com</FONT></A><FONT FACE="Arial" SIZE=2> ), Olivetti ( </FONT><A HREF="http://www.olivetti.com/"><FONT SIZE=2>www.olivetti.com</FONT></A><FONT FACE="Arial" SIZE=2> ), Telef&oacute;nica ( </FONT><A HREF="http://www.telefonica.es/"><FONT SIZE=2>www.telefonica.es</FONT></A><FONT FACE="Arial" SIZE=2> ) o Airtel ( </FONT><A HREF="http://www.airtel.es/"><FONT SIZE=2>www.airtel.es</FONT></A><FONT FACE="Arial" SIZE=2> ) est&aacute;n desarrollando diferentes proyectos de este tipo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una iniciativa original es la llevada a cabo por el Ayuntamiento de Gordexola, en Vizcaya, que se inici&oacute; en abril de 1997 y que marca de una forma clara las posibilidades del teletrabajo. En la comarca de las Encartaciones, sumida desde hace tiempo en la depresi&oacute;n econ&oacute;mica, el Ayuntamiento de esta localidad ha tratado de reactivar implantando el primer telecentro rural del estado para formentar el empleo gracias al uso de las nuevas tecnolog&iacute;as.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Iniciativa original</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A lo largo de los &uacute;ltimos a&ntilde;os han sido muchas las regiones espa&ntilde;olas que han venido sufriendo una profunda crisis estructural que ha puesto en peligro el futuro econ&oacute;mico de las diferentes zonas y el bienestar de sus habitantes. Varios ayuntamientos se percataron de que no pod&iacute;an permanecer al margen de este problema y comenzaron a llevar a la pr&aacute;ctica varias propuestas que ayudaran a solucionarlo.</P>
<P ALIGN="JUSTIFY">En este sentido, destaca la labor llevada a cabo por el Ayuntamiento de Gordexola ( </FONT><A HREF="http://www.gordexola.net/"><FONT SIZE=2>www.gordexola.net</FONT></A><FONT FACE="Arial" SIZE=2> ), siguiendo la l&iacute;nea marcada por el Plan Estrat&eacute;gico para la Mancomunidad de Las Encartaciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El objetivo del Plan Estrat&eacute;gico pretende el desarrollo de la oferta de servicios en la comarca, propiciando la localizaci&oacute;n de diferentes tipos de actividades, tanto empresariales, como de ocio, cultura y turismo. Dentro de ese objetivo se contempla el estudio de las posibilidades del desarrollo del Teletrabajo en la zona.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la l&iacute;nea de este plan, el Ayuntamiento de Gordexola se mostr&oacute; partidario a favorecer el desarrollo de nuevas formas de trabajo basadas en las modernas tecnolog&iacute;as de la informaci&oacute;n a trav&eacute;s de la puesta en marcha, en abril de 1997, del Telecentro Gordexola. Este es el primer telecentro rural de Espa&ntilde;a, prepara a las empresas y trabajadores ante los nuevos retos de la competitividad y el empleo, convirti&eacute;ndose en un elemento dinamizador.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Factores del teletrabajo</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No todas las empresas pueden aplicar el teletrabajo ni todos los trabajadores son capaces de ejercerlo. Se requieren una serie de factores: por un lado, la conexi&oacute;n por telecomunicaciones entre el teletrabajador y el centro para el que trabaja. Y por otro, el intercambio de informaci&oacute;n y conocimientos entre el empleado y el sistema inform&aacute;tico al que est&aacute; enlazado. Esto exige a la compa&ntilde;&iacute;a unas determinadas caracter&iacute;sticas tecnol&oacute;gicas: que tenga desarrollado un sistema de informaci&oacute;n a la vez que aplicaciones inform&aacute;ticas a las que se pueda acceder a trav&eacute;s de la red, y que exista una cultura desarrollada en la empresa para suministrar y recibir informaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por parte de los trabajadores ocurre otro tanto: no todos est&aacute;n capacitados para desarrollar sus funciones laborales en la distancia. Adem&aacute;s de conocimientos en tecnolog&iacute;a de informaci&oacute;n y comunicaci&oacute;n, son necesarias ciertas actitudes personales: m&aacute;s que conocimientos, es preciso un esp&iacute;ritu empresarial. Y eso no se aprende. Lo que s&iacute; se necesita es una serie de cualidades tales como: tenacidad, disciplina y sentido del riesgo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Ventajas e inconvenientes</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A medida que se expande el uso de las tecnolog&iacute;as de la informaci&oacute;n y las telecomunicaciones (TIC), el teletrabajo gana en adeptos. Esta forma de trabajar desde fuera de la oficina presenta muchas ventajas, aunque tambi&eacute;n algunos inconvenientes.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">1. Ventajas:</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;- Expansi&oacute;n de las fronteras geogr&aacute;ficas de la empresa, haciendo a la empresa m&aacute;s atractiva con nuevas y m&aacute;s flexibles estructuras de trabajo.</P>
<P ALIGN="JUSTIFY">&#9;- Reducci&oacute;n del coste de las oficinas. No es necesario alquilar una oficina en la zona m&aacute;s cara de la ciudad. Se ahorran costes al trabajar muchos empleados fuera.</P>
<P ALIGN="JUSTIFY">&#9;- La productividad aumenta entre un 10 y un 30% seg&uacute;n datos de estudios realizados en EEUU.</P>
<P ALIGN="JUSTIFY">&#9;- Beneficia a los empleados mental y emocionalmente. El absentismo por enfermedad se reduce.</P>
<P ALIGN="JUSTIFY">&#9;- Mitiga los inmensos problemas de tr&aacute;fico que existen en todas las sociedades occidentales. El hecho de que millones de personas tengan que viajar diariamente varias veces desde su casa al trabajo y desde el trabajo a casa se est&aacute; convirtiendo en un problema cada vez mayor para los responsables del tr&aacute;fico de nuestras ciudades. En pa&iacute;ses como Holanda ha sido el propio Ministerio de Transportes el que se ha puesto a la cabeza en la propaganda y difusi&oacute;n del teletrabajo.</P>
<P ALIGN="JUSTIFY">&#9;- Hay otras muchas ventajas que conlleva el teletrabajo, como son la mejora del medio ambiente, el ahorro de combustible, la mejora de las relaciones sociales, el aumento de calidad de vida al ahorrarnos los tiempos de transporte o la mejora de la educaci&oacute;n de los ni&ntilde;os al estar m&aacute;s tiempo con sus padres.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">2. Inconvenientes:</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">&#9;- Supervision y Feedback. Trabajar en un lugar remoto permite menor supervisi&oacute;n sobre el trabajador y menor "feedback" con &eacute;l.</P>
<P ALIGN="JUSTIFY">&#9;- Soledad. Uno de los mayores problemas del teletrabajo es la posibilidad de aislamiento motivado por las p&eacute;rdidas de las relaciones personales que conducen a ese retraimiento del individuo.</P>
<P ALIGN="JUSTIFY">&#9;- La organizaci&oacute;n y administraci&oacute;n del tiempo es m&aacute;s f&aacute;cilmente manejable en una oficina. El teletrabajador deber&aacute; organizarse a s&iacute; mismo. El teletrabajo ofrece la posibilidad, nueva pero a la vez tentadora, de distribuir, a convenir por el sujeto, el tiempo entre el trabajo y el ocio, lo que puede acarrear una cierta desorganizaci&oacute;n al mezclar obligaci&oacute;n con afici&oacute;n. Por ello, el empleado debe planificar su jornada de trabajo y separarla de sus obligaciones familiares. Ha de tener adem&aacute;s: autodisciplina, capacidad para comunicarse por tel&eacute;fono, soportar el aislamiento, entablar relaciones y seguir un horario.</P>
<P ALIGN="JUSTIFY">&#9;- Falta de motivaci&oacute;n. Puede resultar dif&iacute;cil para algunos teletrabajadores trabajar sin sentir la respiraci&oacute;n del jefe, o la mirada de los compa&ntilde;eros.</P>
<P ALIGN="JUSTIFY">&#9;- La falta de contacto entre los trabajadores puede suponer una falta de comunicaci&oacute;n. El empleado se va alejando poco a poco de la visi&oacute;n de los desarrollos que se producen dentro de la compa&ntilde;&iacute;a.</P>
<P ALIGN="JUSTIFY">&#9;- Al estar fuera del lugar de trabajo (donde se toman las decisiones) se corre el riesgo de no ser promocionado a puestos superiores o simplemente a no ser tenido en cuenta para acciones concretas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Algunas dificultades</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Adem&aacute;s de las ventajas, el teletrabajo presenta una serie de dificultades que hay que saber valorar. Uno de las principales es el peligro constante de no poner l&iacute;mite al trabajo. La tecnolog&iacute;a nos pone en bandeja trabajar sin mesura, no existe la rutina de llegar al puesto de trabajo, sentarse, encender el ordenador, trabajar y luego volver a casa. En esta modalidad, el puesto de trabajo est&aacute; siempre en marcha. El teletrabajador debe saber poner l&iacute;mites al trabajo.</P>
<P ALIGN="JUSTIFY">Por otra parte, lo contrario al "sobrebrabajo", es la falta de motivaci&oacute;n. El teletrabajador puede sentirse s&oacute;lo, falto de ganas. Hay que tener mucha autodisciplina para volver a trabajar tras haber tenido un momento de relax . Se deben analizar las causas del des&aacute;nimo y tratar de solventarlas. En este sentido resulta conveniente establecer un calendario muy estricto y marcarse objetivos diarios y semanales.</P>
<P ALIGN="JUSTIFY">Muchas personas eligen esta modalidad de trabajo como una forma de hacer el trabajo creativo en casa, y dejar el trabajo mec&aacute;nico fuera de casa. No hay que enga&ntilde;arse, tambi&eacute;n hay trabajos mec&aacute;nicos en casa y hay que saber resolverlos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Formas de teletrabajar</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El teletrabajo es una forma de trabajar que engloba diversos tipos y modos.</P>
<P ALIGN="JUSTIFY">He aqu&iacute; un listado de los m&aacute;s ilustrativos de trabajar:</P>
<P ALIGN="JUSTIFY">&#9;Trabajo en Casa. Cuando un empleado trabaja desde casa en vez de desplazarse o viajar a la oficina de su empresa o la de su cliente. Es el m&aacute;s habitual.</P>
<P ALIGN="JUSTIFY">&#9;Teletrabajo M&oacute;vil. Ejecutivos o profesionales que gracias al m&oacute;vil y al ordenador port&aacute;til pueden prestar servicios desde las oficinas del cliente o mientras viajan.</P>
<P ALIGN="JUSTIFY">&#9;Telecentros. Son locales independientes de las oficinas centrales de la compa&ntilde;&iacute;a, equipados con ordenadores y servicios de telecomunicaciones que utilizan empleados de una o varias compa&ntilde;&iacute;as con el objetivo de evitar los inconvenientes de trasladarse diariamente al trabajo.</P>
<P ALIGN="JUSTIFY">&#9;Telecottages. Un clase especial de telecentros situados en peque&ntilde;as poblaciones rurales. El movimiento telecottage (Cottage, en ingl&eacute;s: casa peque&ntilde;a, rural) comenz&oacute; en Escandinavia y se ha expandido ahora a muchas otras partes de Europa. En ellos se asesora y se ense&ntilde;a sobre las posibilidades de las nuevas tecnolog&iacute;as aplicadas al trabajo para la poblaci&oacute;n rural.</P>
<P ALIGN="JUSTIFY">&#9;Reubicaci&oacute;n de las oficinas. Cuando se desarrollan ciertos servicios empresariales que anteriormente deb&iacute;an situarse a pie de calle para estar cerca de los clientes, y en las zonas m&aacute;s comerciales de las ciudades, pueden estar situados ahora en cualquier lugar.</P>
<P ALIGN="JUSTIFY">El teletrabajo permite tambi&eacute;n el trabajo de grupos dispersos de empleados por todo el mundo, pudiendo trabajar varios equipos de personas en un mismo proyecto las 24 horas al d&iacute;a y desde diversas zonas del globo.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Equipo T&eacute;cnico</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para trabajar en casa no requiere m&aacute;s que de un PC, una suite ofim&aacute;tica (Lotus SmartSuite, Office 97 o Corel Wordperfect Suite) y una buena l&iacute;nea telef&oacute;nica o dos. Adem&aacute;s de este equipamiento b&aacute;sico, puede a&ntilde;adir a la lista los siguientes elementos opcionales:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">L&iacute;nea y m&oacute;dem RDSI. De esta forma, aunque no habr&aacute; conseguido ni mucho menos la panacea, s&iacute; que aligerar&aacute; muchos procesos y faenas. Basta con acudir a alguna de las muchas empresas que instalan l&iacute;neas RDSI y m&oacute;dem. Una l&iacute;nea RDSI con m&oacute;dem inclu&iacute;do, puede costar del orden de las 56.000 pts las m&aacute;s baratas, m&aacute;s un mantenimiento que no superar&aacute; en mucho las 5000 pts. Lo mejor es dirigirse a una de las empresas que en Espa&ntilde;a ofrecen informaci&oacute;n y asesoramiento, adem&aacute;s de vender. Visitando, por ejemplo, la Web de CD World ( </FONT><A HREF="http://www.cdworld.es/"><FONT SIZE=2>www.cdworld.es</FONT></A><FONT FACE="Arial" SIZE=2> ) uno mismo puede hacerse un presupuesto seg&uacute;n lo que se necesite.</P>
<P ALIGN="JUSTIFY">Los usuarios de la RDSI tienen su propia p&aacute;gina en la que se puede consultar cualquier duda que se nos plantee en un momento dado sobre este tema ( </FONT><A HREF="http://www.geocities.com/SiliconValley/Heigts/570"><FONT SIZE=2>www.geocities.com/SiliconValley/Heigts/570</FONT></A><FONT FACE="Arial" SIZE=2> ). Por otra parte, diversas revistas nacionales en algunos de sus n&uacute;meros han dedicado una atenci&oacute;n especial a la RDSI: PC Actual ( </FONT><A HREF="http://www.bpe.es/pcactual"><FONT SIZE=2>www.bpe.es/pcactual</FONT></A><FONT FACE="Arial" SIZE=2> ), iWorld ( </FONT><A HREF="http://www.idg.es/iworld"><FONT SIZE=2>www.idg.es/iworld</FONT></A><FONT FACE="Arial" SIZE=2> ) o PC-World ( </FONT><A HREF="http://www.idg.es/pcworld"><FONT SIZE=2>www.idg.es/pcworld</FONT></A><FONT FACE="Arial" SIZE=2> ).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una cuenta para acceder a Internet. Se necesita tener acceso a Internet por RDSI a trav&eacute;s de un proveedor de Internet. Este acceso no var&iacute;a pr&aacute;cticamente respecto al acceso v&iacute;a tel&eacute;fono normal. En muchas ocasiones la misma empresa que instala la l&iacute;nea RDSI gestiona una conexi&oacute;n a Internet por esta v&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con esta cuenta, se tiene tambi&eacute;n una direcci&oacute;n de correo electr&oacute;nico. No hay nada como el correo electr&oacute;nico para poder teletrabajar. Ha supuesto una verdadera revoluci&oacute;n a escala empresarial y es un elemento b&aacute;sico y esencial para cualquier teletrabajador.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Programas de acceso remoto. Es f&aacute;cil de manejar y su precio es muy asequible. En Espa&ntilde;a hay dos paquetes muy utilizados y cuyos fabricantes ofrecen amplio servicio t&eacute;cnico y comercial. Por una parte el Symantec pcAnywhere 32 y por otra Laplink para Windows 95.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ambos sirven para poder comunicar el ordenador de casa y cualquier ordenador de la oficina. De esta forma se puede llegar a visualizar realmente el disco duro del ordenador que utiliza en la oficina, desde casa, como si se estuviera trabajando en la oficina.</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<B><P ALIGN="JUSTIFY"><LI>Impresora, fax, fotocopiadora</B>. B&aacute;sico equipo para cualquiera que pretenda montarse una oficina en casa.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Videoconferencia</B>. Debe valorarse si realmente se necesita puesto que aqu&iacute; los precios si pueden variar sensiblemente. Intel se est&aacute; imponiendo como uno de los principales exponentes en paquetes de videoconferencia para usos empresariales.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Sectores para teletrabajar</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los sectores profesionales de m&aacute;s porvenir seg&uacute;n la Uni&oacute;n Europea son todos ellos del sector Servicios: servicios a la vida diaria -mejora de la calidad de vida-, culturales y de ocio/medioambiente. M&aacute;s luego habr&aacute; que considerar aquellos negocios o profesiones</P>
<P ALIGN="JUSTIFY">informatizables y "teletransportables":</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;<B>1. Inform&aacute;tica</P>
</B><P ALIGN="JUSTIFY">&#9;&#9;Programaci&oacute;n: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Servicio t&eacute;cnico: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Creaci&oacute;n: </P>
<P ALIGN="JUSTIFY">&#9;&#9;CAD: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Sistemas: </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">&#9;2. Imagen</P>
</B><P ALIGN="JUSTIFY">&#9;&#9;Publicidad:</P>
<P ALIGN="JUSTIFY">&#9;&#9;Artes gr&aacute;ficas: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Edici&oacute;n: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Internet: </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;<B>3. Administrativo</P>
</B><P ALIGN="JUSTIFY">&#9;&#9;B&aacute;sico: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Contabilidad: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Legal: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Consultor&iacute;a: </P>
<P ALIGN="JUSTIFY">&#9;&#9;Marketing: </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;<B>4. Comunicaci&oacute;n</P>
</B><P ALIGN="JUSTIFY">&#9;&#9;Prensa</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;5. Educaci&oacute;n</P>
</B><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Diferentes asociaciones</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La Asociaci&oacute;n Nacional de Documentaci&oacute;n Teletrabajo, ANADE ( </FONT><A HREF="http://www.pixel24.com/teletra/index.html"><FONT SIZE=2>www.pixel24.com/teletra/index.html</FONT></A><FONT FACE="Arial" SIZE=2> ), es una asociaci&oacute;n sin &aacute;nimo de lucro, que se ha marcado como objetivo, ayudar al teletrabajador en su integraci&oacute;n m&aacute;s efectiva dentro de los distintos sectores econ&oacute;micos. Para tal fin, ANADE ha proyectado realizar un estudio que analice la demanda de teletrabajo en diversos sectores econ&oacute;micos. Antes de ponerse en marcha, han pensado realizar una consulta previa entre los asociados y aquellas personas expertas que les ayuden a delimitar y centrar este primer estudio. Para ello han realizado un cuestionario para pedir la opini&oacute;n de quien quiera participar, agradeciendo sinceramente su coloboraci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El fin primordial que persigue el estudio es aflorar el modelo de teletrabajador que necesita el sector econ&oacute;mico donde se realizar el estudio, para compararlo con el ofertado actualmente por los teletrabajadores y de esta forma potenciar el desarrollo introduciendo los "catalizadores" necesarios.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por su importancia, tambien merece una atenci&oacute;n especial la Asociaci&oacute;n Espa&ntilde;ola de Teletrabajo, AET ( </FONT><A HREF="http://www.ciberteca.es/aet"><FONT SIZE=2>www.ciberteca.es/aet</FONT></A><FONT FACE="Arial" SIZE=2> ). Entre los servicios prestados, adem&aacute;s de la informaci&oacute;n puesta al d&iacute;a sobre teletrabajo y la presencia en la base de datos de Curriculum Vitaes, los socios se proponen tambi&eacute;n solicitar a la Administraci&oacute;n P&uacute;blica la adaptaci&oacute;n de las cuotas de pago de la seguridad social para aut&oacute;nomos y para teletrabajadores a tiempo parcial, en proporci&oacute;n de los ingresos y con una cobertura m&aacute;s adecuada que la actual, en caso de enfermedad o de accidente. La AET mantiene una relaci&oacute;n constante con otras Asociaciones de Teletrabajo de la Uni&oacute;n Europea y procura informar a sus socios sobre iniciativas interesantes, no s&oacute;lo en Espa&ntilde;a sino tambi&eacute;n en otros pa&iacute;ses.</P>
<P ALIGN="JUSTIFY">La defensa de los teletrabajadores y en especial de los aut&oacute;nomos en lo que se refiere al pago sin demora, por parte de las empresas contratantes, de sus facturas u honorarios es otro cometido de la Asociaci&oacute;n. Evidentemente cuanto m&aacute;s socios tengan, mayor ser&aacute; su peso en estos temas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una iniciativa propuesta por los socios actuales es la de crear "listas blancas". A diferencia de las "listas negras", que existen sobre morosos u empresas y personas de poco fiar, las listas blancas se constituyen con referencias mutuas y contrastadas, para indicar los buenos pagadores y las personas o empresas que cumplen con sus obligaciones y demuestran tener sentido &eacute;tico. En este sentido, la Asociaci&oacute;n pretende conferir un "label de calidad" a sus socios conocidos, tanto a nivel individual como a nivel de empresa, promoviendo las buenas pr&aacute;cticas comerciales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">AET ofrece tambi&eacute;n la promoci&oacute;n de, y la asistencia a telecentros regionales, as&iacute; como la comunicaci&oacute;n entre ellos y una serie de convenios en beneficio de los socios, con organizaciones que prestan servicio a los teletrabajadores actuales y potenciales, o que aportan servicios y medios para el desarrollo del teletrabajo.</P>
<P ALIGN="JUSTIFY">Finalmente, la Asociaci&oacute;n aborda los temas que m&aacute;s preocupan a los socios, en la medida en que lo permitan sus recursos.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n merecen una menci&oacute;n la Agrupaci&oacute;n Universal de Teletrabajadores en Espa&ntilde;a ( </FONT><A HREF="http://www.geocities.com/Eureka/Enterprises/9224"><FONT FACE="Arial" SIZE=2>www.geocities.com/Eureka/Enterprises/9224</FONT></A><FONT FACE="Arial" SIZE=2> ) y la Asociaci&oacute;n Espa&ntilde;ola de Empleo, Autoempleo y Teletrabajo ( </FONT><A HREF="http://www.arrakis.es/~grinco"><FONT FACE="Arial" SIZE=2>www.arrakis.es/~grinco</FONT></A><FONT FACE="Arial" SIZE=2> ).</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Listas de discusi&oacute;n</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este asunto del teletrabajo est&aacute; dando mucho de que hablar. Recientemente, el 24 de octubre de 1996, el Dr. Antonio Padilla, profesor de Organizaci&oacute;n de Empresas en la Universidad de M&aacute;laga ( </FONT><A HREF="http://www.uma.es/"><FONT SIZE=2>www.uma.es</FONT></A><FONT FACE="Arial" SIZE=2> ), puso en marcha una lista de discusi&oacute;n sobre "Teletrabajo y Organizaci&oacute;n de Empresas" ( </FONT><A HREF="http://www.rediris.es/list/info/teletrabajo.html"><FONT SIZE=2>www.rediris.es/list/info/teletrabajo.html</FONT></A><FONT FACE="Arial" SIZE=2> ). Su intenci&oacute;n era desarrollar un Foro de Debate Electr&oacute;nico sobre la Organizaci&oacute;n de Empresas, las Tecnolog&iacute;as de la Informaci&oacute;n y de la Comunicaci&oacute;n, y, especialemente, las nuevas formas de organizaci&oacute;n del trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El origen de la lista est&aacute; en la participaci&oacute;n del administrador en diversas listas de discusi&oacute;n sobre el Teletrabajo en ingl&eacute;s, lo que llev&oacute;, tras comprobar su utilidad, a promover una lista en castellano sobre esta cuesti&oacute;n. La idea fue muy bien acogida desde un primer momento por la Red IRIS que en todo momento apoy&oacute; su creaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El objetivo de la lista es promover la participaci&oacute;n de los suscritos a la misma en discusiones relativas al Teletrabajo, sobre todo en lo que tiene que ver con su organizaci&oacute;n y direcci&oacute;n. Dentro de esto, se considera que las participaciones de sus miembros deben ser meditadas y suponer alguna aportaci&oacute;n al resto de suscritos para ir ampliando los conocimientos te&oacute;ricos y pr&aacute;cticos que sobre el Teletrabajo poseen.</P></FONT><BR><BR>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

