<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>


<H3>La blanca Navidad llega a Internet</H3>
<P ALIGN="JUSTIFY">Los pastores caminos del portal, el ni&ntilde;o en la cuna y el &aacute;ngel que lo anuncia est&aacute;n ya en los escaparates de las tiendas. Se encuentran junto a los abetos que caracterizan unas fiestas en las que el consumo es una obligaci&oacute;n, los buenos deseos una cortes&iacute;a y las comidas familiares una enternecedora costumbre. La Navidad est&aacute; en marcha.</P>
<P ALIGN="JUSTIFY">Primero lleg&oacute; el fr&iacute;o, despu&eacute;s las casta&ntilde;as y ahora ya est&aacute;n aqu&iacute; los comerciantes para recordarnos que el verano qued&oacute; muy atr&aacute;s. Sus escaparates nos est&aacute;n recordando que &eacute;stos son d&iacute;as de comprar, de pasear y de procurar ser felices; que es tiempo de Navidad. D&iacute;as de ajetreo, tiendas, regalos, luces y color.</P>
<P ALIGN="JUSTIFY">Pero no son los &uacute;nicos. Los medios de comunicaci&oacute;n nos anuncian ya las colonias y los perfumes con los que agasajar a nuestros parientes en la Nochebuena o en el d&iacute;a de Reyes y de paso nos «cuelan» alg&uacute;n que otro autom&oacute;vil por si nos toca el gordo, nos «visita» la primitiva o decidimos, simplemente «tirarnos un largo» de generosidad y chuler&iacute;a ante los dem&aacute;s.</P>
<P ALIGN="JUSTIFY">Las agencias de viajes disponen  ya de un ampl&iacute;simo cat&aacute;logo de ofertas para disfrutar de las fiestas esquiando en los Pirineos, nadando en las transparentes aguas del Caribe o contemplando el «baile» de los delfines desde la cubierta de un trasatl&aacute;ntico. Y mientras, nuestros buzones se llenan de folletos donde se nos comunican las ofertas de jugosos jamones de pata negra en no s&eacute; qu&eacute; supermercado, de los cavas, de los turrones o de los juguetes que nuestros hijos o hermanos peque&ntilde;os anhelan.</P>
<P ALIGN="JUSTIFY">La Navidad est&aacute; llamando ya a nuestras puertas. Es cuesti&oacute;n de nada. Las luces navide&ntilde;as adornan ya nuestras calles. Se han encendido y as&iacute; permanecer&aacute;n ilumin&aacute;ndonos estas oscuras y fr&iacute;as tardes de oto&ntilde;o.</P>
<P ALIGN="JUSTIFY">Ahora bien, Internet tambi&eacute;n celebra la Navidad. Los &aacute;rboles, Pap&aacute; Noel y belenes del mundo real tambi&eacute;n tienen su sitio en la Red. Adem&aacute;s de la decoraci&oacute;n que lucen un sinf&iacute;n de p&aacute;ginas web, los web sites que guardan relaci&oacute;n con estas entra&ntilde;ables fechas son numerosas.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Un poco de Historia</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya antes de que la Navidad se celebrara el 25 de diciembre (que no ha sido siempre), pa&iacute;ses y gentes de todo el mundo saludaban de modo festivo la llegada del fr&iacute;o invierno. Y en muchos lugares, a&uacute;n se conservan ancestrales y muy originales tradiciones. En la p&aacute;gina </FONT><A HREF="http://www.uacam.mx/campeche/actual/navidad.htm"><FONT FACE="Times,Times New Roman">www.uacam.mx/campeche/actual/navidad.htm</FONT></A><FONT FACE="Arial" SIZE=2> , por ejemplo, se cuenta c&oacute;mo se celebra la Navidad desde la llegada de los primeros conquistadores espa&ntilde;oles a tierras mexicanas. En Holyday Fun (</FONT><A HREF="http://www.maui.net/~mcculc/xmas.htm"><FONT FACE="Times,Times New Roman">www.maui.net/~mcculc/xmas.htm</FONT></A><FONT FACE="Arial" SIZE=2>), se narra c&oacute;mo recib&iacute;an la festividad de diciembre los druidas escoceses, las danzas tibetanas en honor del a&ntilde;o que muere, las festividades japonesas del 8 de diciembre y, entre las m&uacute;ltiples celebraciones cristinas, algunas tan ex&oacute;ticas como las de la Navidades etiopes o la mexicana noche de los r&aacute;banos.</P>
<P ALIGN="JUSTIFY">Pero, para conocer m&aacute;s acerca de la historia de la Navidad, Internet nos ofrece otras muchas p&aacute;ginas webs en las que se puede recopilar m&aacute;s informaci&oacute;n: Christmas Chronicles (</FONT><A HREF="http://www.bconnex.net/~mbuchana/realms/christmas"><FONT FACE="Times,Times New Roman">www.bconnex.net/~mbuchana/realms/christmas</FONT></A><FONT FACE="Arial" SIZE=2>), muy detallado y de gran inter&eacute;s; y A Search For The Meaning of Christmas (</FONT><A HREF="http://www.techdirect.com/christmas"><FONT FACE="Times,Times New Roman">www.techdirect.com/christmas</FONT></A><FONT FACE="Arial" SIZE=2>), donde se da una amplia explicaci&oacute;n del siginificado de la Navidad.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">M&aacute;s sobre la Navidad</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero, en la actualidad, son muchas los web sites en los que tienen cabida una gran parte de las respuestas que solucionan todas las dudas que se plantean sobre esta festividad. Asi, en Bozman Home (</FONT><A HREF="http://www.techdirect.com/christmas"><FONT FACE="Times,Times New Roman">www.techdirect.com/christmas</FONT></A><FONT FACE="Arial" SIZE=2>), un portal impresionante mientras la nieve cae nos da la bienvenida a este magn&iacute;fico lugar con una gran categoria, en el que se hallar&aacute; lo que busca. En castellano, MRB (</FONT><A HREF="http://www.bernaldo.com/"><FONT FACE="Times,Times New Roman">www.bernaldo.com</FONT></A><FONT FACE="Arial" SIZE=2>) es una p&aacute;gina muy completa con la Historia sobre la Navidad; pesebres; villancicos y canciones navide&ntilde;as; gr&aacute;ficos, dibujos y gifs con motivos navide&ntilde;os; iconos navide&ntilde;os; ricas recetas para estas fechas; los Reyes Magos, Papa Noel y Santa Claus; decoraci&oacute;n navide&ntilde;a; salvapantallas navide&ntilde;os; el tiempo en el Polo Norte, donde Santa Claus tiene su hogar y su taller; etc.</P>
<P ALIGN="JUSTIFY">En A Christmas Celebration (</FONT><A HREF="http://www.cyou.com/~christmas"><FONT FACE="Times,Times New Roman">cyou.com/~christmas</FONT></A><FONT FACE="Arial" SIZE=2>) se nos recuerda el tiempo que queda para la llegada del d&iacute;a 25 de diciembre, y en Christmas in Cyberspace (</FONT><A HREF="http://www.mofile.fi/santa"><FONT FACE="Times,Times New Roman">www.mofile.fi/santa</FONT></A><FONT FACE="Arial" SIZE=2>), una de las primeras p&aacute;ginas web en la Red sobre la Navidad, y desde Finlandia, se nos comentan cu&aacute;les son los valores y las tradiciones de estas fechas tan entra&ntilde;ables, as&iacute; como se nos informa sobre otros links de inter&eacute;s sobre el tema.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Sobre belenes y pesebres</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No hace falta salir de la Red para comprar decoraciones con las que adornar nuestros belenes. Reyes Magos, pastores y dem&aacute;s figuritas para el bel&eacute;n, guirnaldas, estrellas luminosas y hasta &aacute;rboles. Todo ello se puede adquirir en el web de unos artesanos valencianos (</FONT><A HREF="http://www.tangaworld.com/artbonet.htm"><FONT FACE="Times,Times New Roman">www.tangaworld.com/artbonet.htm</FONT></A><FONT FACE="Arial" SIZE=2>). Ahora bien, antes de ponernos manos a la obra y de meter las manos en el musgo, quiz&aacute; es conveniente aprender de los belenistas, los aut&eacute;nticos artistas y expertos en este arte. La Asociaci&oacute;n Riojana de Belenistas (</FONT><A HREF="http://www.geocities.com/Heartland/Estates/9430"><FONT FACE="Times,Times New Roman">www.geocities.com/Heartland/Estates/9430</FONT></A><FONT FACE="Arial" SIZE=2>) dispone de una p&aacute;gina web en la que se facilita una enorme cantidad de informaci&oacute;n para confeccionar nacimientos y adornos, todo ello con fotograf&iacute;as de los mejores ejemplos.</P>
<P ALIGN="JUSTIFY">La Red, entre otras cuestiones, tambi&eacute;n nos facilita el acceso a belenes virtuales. En una de estas p&aacute;ginas (</FONT><A HREF="http://www.antaviana.com/pessebre/explorer.htm"><FONT FACE="Times,Times New Roman">www.antaviana.com/pessebre/explorer.htm</FONT></A><FONT FACE="Arial" SIZE=2>), se nos da la posibilidad de colocar las figuras donde a uno le apetezca, con el t&iacute;pico "caganer" de los belenes catalanes como elemento m&aacute;s destacado (y en incansable "actividad"). Tambi&eacute;n nos podemos «pasar» por el Belen Virtual de Buitrago del Lozoya (</FONT><A HREF="http://www.civila.com/hispania/belenviviente"><FONT FACE="Times,Times New Roman">www.civila.com/hispania/belenviviente</FONT></A><FONT FACE="Arial" SIZE=2>), organizado por la Asociaci&oacute;n Cultural de Belen Viviente. Es una web en permanente construcci&oacute;n.</P>
<P ALIGN="JUSTIFY">Y en el Mediterr&aacute;neo parecen preferir tambi&eacute;n las cosas reales, como el Pesebre Viviente de Fontcoberta (</FONT><A HREF="http://www.xtec.es/~lalemany"><FONT FACE="Times,Times New Roman">www.xtec.es/~lalemany</FONT></A><FONT FACE="Arial" SIZE=2>).</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Postales de Navidad</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero antes de empezar a poner adornos, es habitual enviar tarjetas para felicitar a familiares y amigos. El correo electr&oacute;nico nos posibilita mandar "christmas" virtuales. No vale la excusa de "no tengo tiempo". A trav&eacute;s del correo electr&oacute;nico las felicitaciones llegan del remitente al receptor en un periquete. Se pueden enviar las t&iacute;picas con &aacute;rboles y santos (</FONT><A HREF="http://www.adwspain.com/christmas"><FONT FACE="Times,Times New Roman">www.adwspain.com/christmas</FONT></A><FONT FACE="Arial" SIZE=2> o </FONT><A HREF="http://www.intelred.es/postales/temas/navidad"><FONT FACE="Times,Times New Roman">www.intelred.es/postales/temas/navidad</FONT></A><FONT FACE="Arial" SIZE=2>). Tambi&eacute;n se pueden enviarcon un poco de sentido de humor, como el que tienen los dise&ntilde;os de Care-mail Chirstmas Cards (</FONT><A HREF="http://www.care-mail.com/send/catxmas1.html"><FONT FACE="Times,Times New Roman">www.care-mail.com/send/catxmas1.html</FONT></A><FONT FACE="Arial" SIZE=2>). En </FONT><A HREF="http://www.ctv.es/navidad"><FONT FACE="Times,Times New Roman">www.ctv.es/navidad</FONT></A><FONT FACE="Arial" SIZE=2>, quien lo desee podr&aacute; dise&ntilde;ar la felicitaci&oacute;n de navidad que m&aacute;s le guste, a&ntilde;adi&eacute;ndola gr&aacute;ficos, mensajes personales, m&uacute;sica apropiada, etc. Y para llenar las tarjetas con algo de texto, en Seasons Greetings (</FONT><A HREF="http://www.flw.com/merry.htm"><FONT FACE="Times,Times New Roman">www.flw.com/merry.htm</FONT></A><FONT FACE="Arial" SIZE=2>) han conseguido 120 frases de felicitaci&oacute;n navide&ntilde;a en otras tantas lenguas. Se trata, sin duda alguna, de una f&oacute;rmula original y a la vez ex&oacute;tica.</P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Villancicos y canciones navide&ntilde;as</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En Navidad, cualquier momento es bueno para compartir un rato agradable con la familia mientras se cantan unos villancicos. Internet nos facilita las letras, y la m&uacute;sica, de aquellas canciones que en m&aacute;s de una ocasi&oacute;n hemos cantado.</P>
<P ALIGN="JUSTIFY">Web joven (</FONT><A HREF="http://www.geocities.com/EnchantedForest/1470"><FONT FACE="Times,Times New Roman">www.geocities.com/EnchantedForest/1470</FONT></A><FONT FACE="Arial" SIZE=2>) se compone de tres secciones en espa&ntilde;ol e ingles: web karaoke (ingles/espa&ntilde;ol), popgroups (ingles, espa&ntilde;ol) y la p&aacute;gina navide&ntilde;a, una pagina de navidad con muchos villancicos, letras y m&uacute;sicas.</P>
<P ALIGN="JUSTIFY">En La P&aacute;gina Navide&ntilde;a 1999 (</FONT><A HREF="http://www.personal.redestb.es/ahdez/villacas.htm"><FONT FACE="Times,Times New Roman">personal.redestb.es/ahdez/villacas.htm</FONT></A><FONT FACE="Arial" SIZE=2>) tambi&eacute;n se pueden escuchar una selecci&oacute;n de villancicos. Adem&aacute;s, da la oportunidad de escoger el idioma en el que m&aacute;s se desea escucharlos (ingl&eacute;s, alem&aacute;n, franc&eacute;s y lat&iacute;n, adem&aacute;s de castellano).</P>
<P ALIGN="JUSTIFY">Otras direcciones interesantes son dentro de la Red para dar con la canci&oacute;n navide&ntilde;a deseada son: Acordes religiosos (</FONT><A HREF="http://www.100mbps.es/gohan/salmo2.htm"><FONT FACE="Times,Times New Roman">www.100mbps.es/gohan/salmo2.htm</FONT></A><FONT FACE="Arial" SIZE=2>) y Santa's Christmas Music (</FONT><A HREF="http://www.primenet.com/~kringle/carols.html"><FONT FACE="Times,Times New Roman">www.primenet.com/~kringle/carols.html</FONT></A><FONT FACE="Arial" SIZE=2>).</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Sucumbir a la tentaci&oacute;n</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En estos d&iacute;as de tregua en la rutina cotidiana, parece que todo, o casi todo, est&aacute; permitido. Hasta los m&aacute;s estrictos seguidores de severos reg&iacute;menes de adelgazamiento se entregan al desenfreno de la gula y se ponen morados con toda clase de alimentos y dulces.</P>
<P ALIGN="JUSTIFY">Men&uacute;s muy especiales (angulas, besugo, langostinos, percebes, etc.), productos que hartemblar m&aacute;s de un bolsillo, y las bombas de az&uacute;car que componen la t&iacute;pica reposter&iacute;a navide&ntilde;a recuperan as&iacute; el lugar preferente que ocupaban cuando la esbeltez y el colesterol no dictaban su ley como ahora, y la mayor&iacute;a de la gente se alimentaba con escasa moderaci&oacute;n. Las celebraciones en familia, en cualquier caso, se basan en excesos cal&oacute;ricos. Hoy a&uacute;n respondemos a este atavismo y comemos demasiado, pero todo est&aacute; tan rico, que s&oacute;lo cabe sucumbir felizmente a la tentaci&oacute;n.</P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Turrones y recetas navide&ntilde;as</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los turrones y los dulces son el otro s&iacute;mbolo de estas fiestas, del que se llegan a consumir en dos meses unas 30.000 toneladas, casi un kilo por persona. A la cabeza del consumo se mantiene el turr&oacute;n duro, seguido por los trufados y los pralines, y a su altura los blandos, para terminar en una aut&eacute;ntica renovaci&oacute;n golosa a base de turrones de caf&eacute; irland&eacute;s, de tiramis&uacute;, de queso con ar&aacute;ndanos, de crema catalana, de moras con frambuesa, de chocolate y hasta de conguitos, lo que hace pensar que pronto los turrones ser&aacute;n irreconocibles.</P>
<P ALIGN="JUSTIFY">Por el momento, y ajenos al soniquete de ese villancico que se escapa del centro comercial, vamos haciendo acopio de turrones de todo tipo, unas cuantas cajitas de mazapanes y varias botellas de cava. Y es que llega la Navidad.</P>
<P ALIGN="JUSTIFY">Las jugosas im&aacute;genes de los turrones est&aacute;n presentes en las p&aacute;ginas de una pasteler&iacute;a de Barcelona (</FONT><A HREF="http://www.pi-savall.es/renye"><FONT FACE="Times,Times New Roman">www.pi-savall.es/renye</FONT></A><FONT FACE="Arial" SIZE=2>).</P>
<P ALIGN="JUSTIFY">Los m&aacute;s refinados pueden consultar un buen n&uacute;mero de p&aacute;ginas en las que se incluyen exquisitas recetas, ideales para estas fechas. En Recetas para Navidad (</FONT><A HREF="http://www.personal.redestb.es/ahdez/recetas.htm"><FONT FACE="Times,Times New Roman">personal.redestb.es/ahdez/recetas.htm</FONT></A><FONT FACE="Arial" SIZE=2>) se aprende a realizar, con nuestras propias manos Rosc&oacute;n de Reyes, mazap&aacute;n, turr&oacute;n de Guirlache, mantecadas de Astorga, Carlota Navide&ntilde;a, compota, casta&ntilde;as pilongas en dulce, etc. La web de cocina de Koldo Royo (</FONT><A HREF="http://www.afuegolento.com/"><FONT FACE="Times,Times New Roman">www.afuegolento.com</FONT></A><FONT FACE="Arial" SIZE=2>) incluye varias recetas cl&aacute;sicas de esta &eacute;poca.</P>
<P ALIGN="JUSTIFY">Pero tampoco faltan aquellas p&aacute;ginas en las que tambi&eacute;n se recogen otras exquisiteces de estas fechas (</FONT><A HREF="http://www.geocities.com/NapaValley/6685/acomer.htm"><FONT FACE="Times,Times New Roman">www.geocities.com/NapaValley/6685/acomer.htm</FONT></A><FONT FACE="Arial" SIZE=2>) o la web de La Cocina de Yvone (</FONT><A HREF="http://www.geocities.com/NapaValley/8244"><FONT FACE="Times,Times New Roman">www.geocities.com/NapaValley/8244</FONT></A><FONT FACE="Arial" SIZE=2>) en la que se tocan todos los temas culinarios: entrantes, sopas y cremas, pastas, arroces, verduras, huevos, pescados y carnes, legumbres, postres, vinos, etc., y adem&aacute;s, gastronom&iacute;a asturiana.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Burbujas en la Red</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Son muchos los que se&ntilde;alan que la mejor forma de llevar a cabo una campa&ntilde;a publicitaria consiste en combinar con sabidur&iacute;a medios tradicionales (prensa, radio y TV) y modernos (Internet). As&iacute; parece haberlo entendido Freixenet (</FONT><A HREF="http://www.freixenet.es/"><FONT FACE="Times,Times New Roman">www.freixenet.es</FONT></A><FONT FACE="Arial" SIZE=2>). Ya no le basta que famosos y estrellas del cine espa&ntilde;ol rueden sus anuncios. Ahora tambi&eacute;n cuentan con una atractiva p&aacute;gina web, con informaci&oacute;n en 8 idiomas. Codorniu (</FONT><A HREF="http://www.codorniu.es/"><FONT FACE="Times,Times New Roman">www.codorniu.es</FONT></A><FONT FACE="Arial" SIZE=2>) tampoco se queda atr&aacute;s, y tanto la una como la otra ofrecen abundante informaci&oacute;n sobre el proceso de elaboraci&oacute;n del cava.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Loter&iacute;a</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lycos (</FONT><A HREF="http://www.es.lycos.de/"><FONT FACE="Times,Times New Roman">http://www.es.lycos.de</FONT></A><FONT FACE="Arial" SIZE=2>) ha llegado a aun acuerdo con la administraci&oacute;n de loter&iacute;a Del Rosario para llevar la loter&iacute;a a la Red. Los interesados pueden comprar participaciones del n&uacute;mero de este exitoso buscador en </FONT><A HREF="http://www.elgordo.com/"><FONT FACE="Times,Times New Roman">http://www.elgordo.com</FONT></A><FONT FACE="Arial" SIZE=2> Adem&aacute;s de poder comprar la mencionada participaci&oacute;n, en este web site hay un apartado con informaci&oacute;n sobre la loter&iacute;a nacional espa&ntilde;ola, la m&aacute;s antigua del mundo (desde el siglo XVIII) y la que reparte el premio m&aacute;s cuantioso.</P>
<P ALIGN="JUSTIFY">Por si ello fuera poco, el Organismo Nacional de Loter&iacute;as y Apuestas del Estado har&aacute; que el sorteo de la loter&iacute;a de Navidad de este a&ntilde;o pueda seguirse desde Internet (</FONT><A HREF="http://onlae.xpress.es/especialnavidad.htm"><FONT FACE="Times,Times New Roman">http://onlae.xpress.es/especialnavidad.htm</FONT></A><FONT FACE="Arial" SIZE=2>). El seguimiento del Sorteo empezar&aacute; a las 8 de la ma&ntilde;ana, y la informaci&oacute;n ser&aacute; actualizada constantemente con im&aacute;genes en directo del Sal&oacute;n de Sorteos. Tambi&eacute;n se incluye un Gui&oacute;n de los Premios mayores conforme vayan saliendo adem&aacute;s de indicaciones de los municipios agraciados; asimismo, habr&aacute; la posibilidad de comprobar si el d&eacute;cimo que dispone el usuario ha sido premiado, asi como consultar la lista completa.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Ciber-negocio</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando apenas faltan s&oacute;lo unos d&iacute;as para hacer compras antes de Navidad, el trafico cerca de los centros comerciales se convierte en una locura. Ahora bien, en Internet las cosas son bien distintas, ya que sin salir de casa, sin atascos ni agobios se puede comprar y enviar casi de todo, desde el turr&oacute;n a los presentes m&aacute;s insospechados. En estas fechas, los servicios de la Red son especialmente &uacute;tiles para los internautas. De cualquier manera, no todo es de color de rosa. Un nuevo informe de Media Metrix Inc. afirma que todo esta igual de congestionado en la Red.</P>
<P ALIGN="JUSTIFY">La compa&ntilde;&iacute;a, que estudia el flujo de tr&aacute;fico en Internet, ha informado que el tr&aacute;fico hacia los sitios de compras se ha elevado un 80 por ciento en la segunda semana luego del D&iacute;a de Acci&oacute;n de Gracias, en comparaci&oacute;n con la semana anterior al mismo. Y como sucede en los centros comerciales, los almacenes por departamentos recibieron el mayor tr&aacute;fico, siendo los m&aacute;s visitados los de libros, m&uacute;sica y pel&iacute;culas, Todo esto sugiere que los compradores est&aacute;n motivados a usar un rat&oacute;n y un modem en lugar de luchar con multitudes en los centros comerciales o en los sectores de compras.</P>
<P ALIGN="JUSTIFY">En l&iacute;neas generales se expresan desde Cyber Dialogue (</FONT><A HREF="http://www.cyberdialogue.com/"><FONT FACE="Times,Times New Roman">www.cyberdialogue.com</FONT></A><FONT FACE="Arial" SIZE=2>). Las Navidades de 1998 pasar&aacute;n a la historia como el despegue definitivo del comercio electr&oacute;nico a trav&eacute;s de Internet. Seg&uacute;n Cyber Dialogue, adem&aacute;s de estos casi siete millones de personas que comprar&aacute;n directamente a trav&eacute;s de la Red, otros nueve millones lo har&aacute;n en alguna tienda tras haberse informado en Internet sobre el producto que les interesa. Las ventas totales a trav&eacute;s de Internet, esos 2.000 millones de d&oacute;lares (unas 300.000 de pesetas) suponen un aumento de nada menos que el 300% en relaci&oacute;n a los 640 gastados el a&ntilde;o pasado. Los productos m&aacute;s solicitados estas Navidades ser&aacute;n los aparatos electr&oacute;nicos, los ordenadores, el vestido, los productos de belleza, la m&uacute;sica, los libros y art&iacute;culos de regalos especializados.</P>
<P ALIGN="JUSTIFY">Casi todas las empresas que «existen» en Internet han dise&ntilde;ado estrategias especiales para estas fechas, y ofrecen listas de regalos y servicios directos de atenci&oacute;n al consumidor.</P>
<P ALIGN="JUSTIFY">Los expertos afirman que, adem&aacute;s de la gran variedad de productos ofrecidos, el aumento de la demanda a trav&eacute;s de la Red se debe a una creciente confianza por parte de los usuarios para utilizar la tarjeta de cr&eacute;dito sin temor a ser estafados.</P>
<P ALIGN="JUSTIFY">Para que todos estemos m&aacute;s tranquilos y no dudemos en consumir a trav&eacute;s de Internet, las cajas de ahorro, Visa, Telef&oacute;nica y los bancos emisores de la tarjeta 4B se han aliado para crear la Agencia de Certificaci&oacute;n Electr&oacute;nica (ACE) que pretende servir como veh&iacute;culo para realizar transacciones electr&oacute;nicas con seguridad para compradores y vendedores (</FONT><A HREF="http://www.ace.es/"><FONT FACE="Times,Times New Roman">www.ace.es</FONT></A><FONT FACE="Arial" SIZE=2>).</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Cualquier cosa</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El «navegante» puede encontrar cualquier cosa en Internet. Cybercentro (</FONT><A HREF="http://www.cybercentro.com/"><FONT FACE="Times,Times New Roman">www.cybercentro.com</FONT></A><FONT FACE="Arial" SIZE=2>) es un centro de compras virtual con una selecci&oacute;n de tiendas en la Red que van desde fotograf&iacute;a hasta arte, programas inform&aacute;ticos, etc. Hipertienda.com (</FONT><A HREF="http://www.hipertienda.com/"><FONT FACE="Times,Times New Roman">www.hipertienda.com</FONT></A><FONT FACE="Arial" SIZE=2>), por su parte, al igual que cualquier centro comercial, ofrece diferentes secciones: libros, m&uacute;sica, alimentaci&oacute;n, bebidas, electr&oacute;nica, etc.</P>
<P ALIGN="JUSTIFY">El Corte Ingl&eacute;s (</FONT><A HREF="http://www.elcorteingles.es/menu.html"><FONT FACE="Times,Times New Roman">www.elcorteingles.es/menu.html</FONT></A><FONT FACE="Arial" SIZE=2>) pone a disposici&oacute;n de los internautas una gran superficie en Internet, que incluye desde las compras de &uacute;ltima hora hasta los productos navide&ntilde;os en el supermercado.</P>
<P ALIGN="JUSTIFY">La cadena de librer&iacute;as Crisol (</FONT><A HREF="http://www.crisol.es/"><FONT FACE="Times,Times New Roman">www.crisol.es</FONT></A><FONT FACE="Arial" SIZE=2>) ha puesto tambi&eacute;n recientemente su tienda virtual a disposici&oacute;n de todos los internautas. Dispone de un amplio abanico de opciones para los amantes de los libros. Se puede comprar cualquier ejemplar por Internet, acceder a los cat&aacute;logos m&aacute;s le&iacute;dos, las &uacute;ltimas novedades, selecciones, publicaciones por temas y todo su fondo de venta, incluido CDs, discos y v&iacute;deos.</P>
<P ALIGN="JUSTIFY">Adem&aacute;s, buscando en el gran bazar de la Red, tambi&eacute;n es posible encontrar productos tan originales como un aparato que da palmadas en la espalda para subir la autoestima (</FONT><A HREF="http://www.patback.com/"><FONT FACE="Times,Times New Roman">www.patback.com</FONT></A><FONT FACE="Arial" SIZE=2>), despertadores con insultos (</FONT><A HREF="http://www.rudeawakening.com/"><FONT FACE="Times,Times New Roman">www.rudeawakening.com</FONT></A><FONT FACE="Arial" SIZE=2>) o una taza de water con calentador incluido.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Juguetes</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Armados de dinero e ilusione, los m&aacute;s r&aacute;pidos comienzan a pensar en los regalos. Afortunadamente, tanto Santa Claus (</FONT><A HREF="http://www.claus.com/"><FONT FACE="Times,Times New Roman">www.claus.com</FONT></A><FONT FACE="Arial" SIZE=2>), como los Reyes Magos (</FONT><A HREF="http://www.arrakis.es/~montoya/carta.htm"><FONT FACE="Times,Times New Roman">www.arrakis.es/~montoya/carta.htm</FONT></A><FONT FACE="Arial" SIZE=2>) y el simp&aacute;tico y bonach&oacute;n Olentzero vasco (</FONT><A HREF="http://www.jalgi.com/olentzero"><FONT FACE="Times,Times New Roman">www.jalgi.com/olentzero</FONT></A><FONT FACE="Arial" SIZE=2>) disponen de su propio buz&oacute;n en la red para que los m&aacute;s peque&ntilde;os del hogar realicen sus pedidos.</P>
<P ALIGN="JUSTIFY">Por cierto, en una de las p&aacute;ginas dedicadas al popular personaje escandinavo (</FONT><A HREF="http://www.north-pole.net/"><FONT FACE="Times,Times New Roman">www.north-pole.net</FONT></A><FONT FACE="Arial" SIZE=2>) se puede descubrir como este anciano barbudo, rubicundo y cargado de regalos comienza la Navidad. Cada a&ntilde;o, adem&aacute;s, los m&aacute;s peque&ntilde;os pueden enviar sus dibujos navide&ntilde;os, y los «duendes» seleccionar&aacute;n uno cada semana hasta la llegada de la Navidad. Algo parecido ocurre en la p&aacute;gina de Santa Claus (</FONT><A HREF="http://www.santaclaus.com/"><FONT FACE="Times,Times New Roman">www.santaclaus.com</FONT></A><FONT FACE="Arial" SIZE=2>), en la que se puede entrar en la cocina de la se&ntilde;ora Claus, conocer la escuela de los elfos (sus diminutos ayudantes), el taller de juguetes, etc.</P>
<P ALIGN="JUSTIFY">En el caso de Melchor, Gaspar y Baltasar, los ni&ntilde;os podr&aacute;n adentrarse en diferentes &aacute;reas (visitas, juegos, rompecabezas, secci&oacute;n de colorear, etc.) y hasta podr&aacute;n decir si se han portado bien, mal o regular (</FONT><A HREF="http://www.3reyesmagos.org/a/indexi.html"><FONT FACE="Times,Times New Roman">3reyesmagos.org/a/indexi.html</FONT></A><FONT FACE="Arial" SIZE=2>).</P>
<P ALIGN="JUSTIFY">Pero eso no es todo. Recientemente, y tal y como se anuncia en Noticias Intercom (</FONT><A HREF="http://www.noticias.com/"><FONT FACE="Times,Times New Roman">www.noticias.com</FONT></A><FONT FACE="Arial" SIZE=2>) la compa&ntilde;&iacute;a Lego, especializada en la creaci&oacute;n de juguetes de montar y desmontar para los m&aacute;s peque&ntilde;os de la casa, ha puesto en funcionamiento una p&aacute;gina especialmente orientada alas ni&ntilde;as de cinco a diez a&ntilde;os de edad. El objetivo de la website es despertar la imaginaci&oacute;n y la creatividad de las m&aacute;s peque&ntilde;as aprovechando la cada vez mayor curiosidad que sienten los ni&ntilde;os por Internet. Mediante el Lego Scala Planet, (</FONT><A HREF="http://www.lego.com/girls/scala/default.asp"><FONT FACE="Times,Times New Roman">www.lego.com/girls/scala/default.asp</FONT></A><FONT FACE="Arial" SIZE=2>) es posible crear un mundo propio a trav&eacute;s de diversos accesorios -una casa, un cafe, una tienda de moda, etc.- y cambiarlo a voluntad, con lo que potencia su expresividad.</P>
<P ALIGN="JUSTIFY">Pero Internet ha supuesto tambi&eacute;n el despertar de los jugueteros. La Red est&aacute; siendo testigo de excepci&oacute;n de esta guerra comercial entre fabricantes y distribuidores de los regalos que hacen las delicias de los ni&ntilde;os (y los no tan ni&ntilde;os). <B>Etoys</B>, la primera tienda de juguetes que s&oacute;lo existe en la WWW, se enfrenta al gigante <B>Toys'Rus</B>, que ha decidido empezar a vender a trav&eacute;s de Internet.</P>
<P ALIGN="JUSTIFY">En Espa&ntilde;a, la <B>Asociaci&oacute;n de Fabricantes de Juguetes</B> est&aacute; preparando un centro comercial electr&oacute;nico.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"><B>Solidaridad con los dem&aacute;s</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La Navidad suele ser tambi&eacute;n una &eacute;poca propicia para demostrar nuestra solidaridad hacia los m&aacute;s necesitamos. Se multiplican las Campa&ntilde;as del Kilo en muchos pueblos espa&ntilde;oles, se organizan telemaratones en pr&aacute;cticamente todas las cadenas de televisi&oacute;n -como el &uacute;ltimo de Tele 5 (</FONT><A HREF="http://www.telecinco.es/"><FONT FACE="Times,Times New Roman">www.telecinco.es</FONT></A><FONT FACE="Arial" SIZE=2>) en colaboraci&oacute;n con Renfe (</FONT><A HREF="http://www.renfe.es/"><FONT FACE="Times,Times New Roman">www.renfe.es</FONT></A><FONT FACE="Arial" SIZE=2>) y que sirvi&oacute; par recaudar 200 toneladas de alimentos y m&aacute;s de 267 millones de pesetas)-, etc. Tambi&eacute;n Televisi&oacute;n Espa&ntilde;ola (</FONT><A HREF="http://www.rtve.es/"><FONT FACE="Times,Times New Roman">www.rtve.es</FONT></A><FONT FACE="Arial" SIZE=2>) ha organizado para estas fechas el Primer Festival de la Solidaridad en TVE.</P>
<P ALIGN="JUSTIFY">Pero organizaciones hay muchas, si bien cuando se trata de «partirse la cara» por los dem&aacute;s en Bosnia o Ruanda, de visitar c&aacute;rceles y disidentes, y presionar a gobiernos m&aacute;s bien inhumanos, desde hace bastantes a&ntilde;os se repiten casi siempre los mismos nombres. Amnist&iacute;a Internacional (</FONT><A HREF="http://www.a-i.es/"><FONT FACE="Times,Times New Roman">www.a-i.es</FONT></A><FONT FACE="Arial" SIZE=2>) y M&eacute;dicos Sin Fronteras (</FONT><A HREF="http://www.pangea.org/~medsf"><FONT FACE="Times,Times New Roman">www.pangea.org/~medsf</FONT></A><FONT FACE="Arial" SIZE=2>) podr&iacute;an ser un par de ejemplos de esas organizaciones que no se «casan» con nadie y trabajan lo mismo cuando est&aacute;n las c&aacute;maras de televisi&oacute;n que cuando nadie les presta atenci&oacute;n. </P></FONT></BODY>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


