<HTML>
<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>rtículos Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez</A>
</b></FONT>
<br><br>


<H3>
<FONT color="#000000" face="arial">        
Conceptos mínimos de informática
</FONT>
</H3>


<h5>Nivel m&iacute;nimo de conocimientos necesarios: ¿Qu&eacute; es un ordenador?</h5>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
Eh, t&uacute;, s&iacute; t&uacute;... No pases de largo, dame una oportunidad. Ya s&eacute; que te propusiste pasar del tema. Tambi&eacute;n s&eacute; que hasta ahora todas las explicaciones sobre temas inform&aacute;ticos han partido de una base que no tienes. Pero esto es diferente, si lees este texto acabar&aacute;s sabiendo incluso c&oacute;mo encender el ordenador.</P>

<P ALIGN="JUSTIFY">Bueno, empecemos... Si&eacute;ntate justo delante del ordenador. As&iacute;, muy bien.</P>

<P ALIGN="JUSTIFY">A ver, eso que parece una televisi&oacute;n se llama <I>monitor</I>. Enciende el bot&oacute;n que tiene bajo la pantalla. Aunque es posible que no haga falta, pero puede ser necesario, aunque lo m&aacute;s normal es que sea autom&aacute;tico...  uff, mal empiezo. Una vez encendido no intentes cambiar de canal, no tiene...</P>

<P ALIGN="JUSTIFY">Pasando a otro componente, el que tienes delante, el que est&aacute; lleno de cubitos de pl&aacute;stico marcados con letras, n&uacute;meros y s&iacute;mbolos raros. Este te resultar&aacute; familiar porque es similar a una m&aacute;quina de escribir. Pues se llama <I>teclado</I> y los cubitos, <I>teclas</I>.</P>

<P ALIGN="JUSTIFY">Ahora paso a comentar el elemento m&aacute;s importante de un ordenador. Es eso tan grande que est&aacute; junto al monitor o debajo de la mesa. Puede ser de tres formas. Si es m&aacute;s alto que ancho se llama <I>torre </I>o<I> minitorre</I>, si es justo lo contrario se llama <I>sobremesa</I>. Pues esta caja es la que contiene el cerebro, la memoria, el nervio &oacute;ptico,...etc.</P>

<P ALIGN="JUSTIFY">El <I>disco duro</I> es un elemento que est&aacute; dentro de la caja,  por lo que no lo ves. Es donde se almacena toda la informaci&oacute;n. Es como nuestra memoria compuesta por recuerdos. All&iacute; se guarda todo lo necesario para luego utilizar programas y todo eso, pero no nos precipitemos...</P>

<P ALIGN="JUSTIFY">Es de tama&ntilde;o medio y var&iacute;a seg&uacute;n capacidad, &eacute;poca o dise&ntilde;o. Duro, duro es, pero lo mejor es que no lo verifiques, porque si lo haces y luego vas a la tienda, despu&eacute;s de las risas te mandar&aacute;n a la secci&oacute;n de inform&aacute;tica de la librer&iacute;a m&aacute;s pr&oacute;xima.</P>

<P ALIGN="JUSTIFY">Tambi&eacute;n dentro de la torre o sobremesa, se encuentra la parte m&aacute;s importante del ordenador, el <I>procesador</I> (CPU). Es el cerebro, el que realiza todas las operaciones. Se coloca sobre una placa llamada <I>placa base</I> o <I>placa madre</I>. Estos dos componentes se hacen viejos en un par de a&ntilde;os debido a la gran velocidad con la que avanza la tecnolog&iacute;a. La soluci&oacute;n es comprarse unos nuevos con el consiguiente desembolso de una importante cantidad de dinero...</P>

<P ALIGN="JUSTIFY">La memoria de acceso instant&aacute;neo se llama <I>memoria RAM</I>. Como en el caso humano, cuanta m&aacute;s RAM se tenga, m&aacute;s cosas se pueden memorizar, evitando el consultar libros constantemente ganando as&iacute; m&aacute;s velocidad.</P>

<P ALIGN="JUSTIFY">Si miras detenidamente la parte frontal del ordenador, ver&aacute;s que tiene boca. Se llama disquetera y se alimenta de disquettes. Es la forma m&aacute;s tradicional de intercambiar informaci&oacute;n entre ordenadores. Los disquettes son como los discos duros pero en peque&ntilde;o, planos y con una capacidad actualmente rid&iacute;cula. Es la principal v&iacute;a de contagio de <I>virus</I>. Lo mejor es ‘vacunar’ al ordenador y hacerle de vez en cuando una revisi&oacute;n m&eacute;dica. Todo esto se hace simplemente instalando un <I>antivirus</I>, no es necesario coger el ordenador y llevarlo al m&eacute;dico, entre otras cosas porque empezar&iacute;an a dudar de tu salud mental...</P>

<P ALIGN="JUSTIFY">Otra forma de introducir informaci&oacute;n en el ordenador es por medio del <I>CD-ROM</I>. Es como una disquetera pero m&aacute;s digital. El <I>lector</I> lo encontrar&aacute;s en la parte m&aacute;s alta de la torre, si el ordenador es de torre, claro. Se alimenta de <I>CDs</I>, esas cosas planas y circulares en las que se ve el arcoiris. Exacto, son como posavasos de lujo...</P>

<P ALIGN="JUSTIFY">Los CDs s&iacute; que contienen grandes cantidades de informaci&oacute;n. Tienen la gran desventaja de que no se puede copiar nada en ellos. S&oacute;lo una vez y con una grabadora especial, especialmente cara, claro... (Curioso juego de palabras). La verdad es que cada vez es menos cara. Aunque en un breve plazo de tiempo van a aterrizar los <I>DVD</I> convirti&eacute;ndose en componentes est&aacute;ndar, los cuales eliminan gran parte de las desventajas de los CD-ROM...</P>

<P ALIGN="JUSTIFY">Uno de los elementos m&aacute;s importantes del ordenador es ese que est&aacute; al lado del teclado. Es del tama&ntilde;o de la palma de una mano. Se llama <I>rat&oacute;n</I>. ¿Qu&eacute; por qu&eacute; tiene ese nombre?. Bueno, si te fijas un poco ver&aacute;s que tiene una forma m&aacute;s o menos parecida. El cable es el rabo, aunque lo tiene en la cabeza, ¿y los ojos?. ¡¡ Dios m&iacute;o !!. Y los botones ¿qu&eacute; son?...</P>

<P ALIGN="JUSTIFY">Queda por ver la impresora. Con ella sacaremos por papel lo que vemos por pantalla. Puede ser de color o de blanco y negro. Antiguamente hab&iacute;a muchos tipos de impresi&oacute;n, cada vez m&aacute;s evolucionados. </P>

<P ALIGN="JUSTIFY">Existen otros muchos componentes: modems, scaners, unidades zip, joysticks, pads, ...etc.</P>

<P ALIGN="JUSTIFY">Hasta ahora hemos visto s&oacute;lo <I>hardwar</I>e. Vaya, se me olvidaba que no he explicado lo que es el hardware. Pues eso es, todo lo que hemos visto. ¿Y qu&eacute; es lo que hemos visto?. Pues elementos f&iacute;sicos que componen un ordenador, los aparatos, los cacharros, los perif&eacute;ricos, ...etc. Ahora veremos el <I>software</I>, que es lo que hace que todos estos aparatos funcionen resolviendo sus misiones correspondientes. Son programas y aplicaciones inform&aacute;ticas.</P>

<P ALIGN="JUSTIFY">Supongamos que enciendes el ordenador apretando el bot&oacute;n grande. Esperando unos segundos se ve claramente qu&eacute; <I>sistema operativo</I> hay instalado. Lo m&aacute;s seguro es que aparezca una imagen con una ventana con cuatro colores. Se llama Windows 95. Antes de nada voy a aclarar que el sistema operativo es el que controla todas las funciones de los perif&eacute;ricos y dem&aacute;s componentes. Si no hay ninguno instalado no se puede ejecutar ning&uacute;n programa.</P>

<P ALIGN="JUSTIFY">Existen m&aacute;s sistemas operativos (Unix, Linux, OS2, ...etc.) normalmente m&aacute;s ‘poderosos’ y m&aacute;s estables que Windows 95. Pero no nos vayamos por las ramas y centr&eacute;monos en el tema...</P>

<P ALIGN="JUSTIFY">Una vez terminado el arranque se ven una serie de <I>iconos</I>. Los iconos son dibujitos peque&ntilde;os que representan diferentes caracter&iacute;sticas de las aplicaciones a las que est&aacute;n vinculados. Por ejemplo si vemos un bloc de notas con una pluma encima, estaremos ante un programa para escribir texto. Si vemos una paleta de pintor, estaremos ante una aplicaci&oacute;n de dibujo. Si vemos un ojo estaremos ante un visualizador. Si no aparece nada y se ve todo negro, no te preocupes, con Windows esto es normal...</P>

<P ALIGN="JUSTIFY">La flechita esa que se ve en mitad de la pantalla se llama <I>cursor</I>. Con ella podremos ejecutar programas, abrir carpetas, explorar hasta el rinc&oacute;n m&aacute;s escondido y todo por medio del rat&oacute;n.</P>

<P ALIGN="JUSTIFY">Ahora ya se abre un mundo de posibilidades infinitas. Pr&aacute;cticamente sin l&iacute;mites, podremos hacer cosas realmente variadas con un ordenador. Desde ver aplicaciones multimedia repletas de videos, im&aacute;genes, texto, sonido y animaciones hasta navegar por Internet, abri&eacute;ndose a su vez otro submundo con nuevas posibilidades...</P>


<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulam.htm"><font FACE="ARIAL"><B>[Artículos Varios]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

