<HTML>

<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
¿Juegos 2D o 3D?
</FONT>
</H3>

<P align="justify">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya ha pasado bastante tiempo (inform&aacute;ticamente hablando) desde que la primera tarjeta aceleradora saliera al mercado. Quiz&aacute;s sea ahora un buen momento para analizar la situaci&oacute;n de la industria del software de entretenimiento. Ya hemos empezado a saborear el 99, muchos proyectos nuevos han echado a andar y otros tantos comienzan su segunda, y &uacute;ltima, etapa de producci&oacute;n.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Si se echa un vistazo a las listas s&uacute;per ventas que ha habido durante este pasado a&ntilde;o 98, se comprobar&aacute; que sigue existiendo una fuerte presencia de juegos 2D. Sin embargo, si se examina con mayor minuciosidad lo que ha sido el mes de diciembre del 98, se puede observar que grandes baluartes de lo que era el mundo 2D, esto es, las aventuras gr&aacute;ficas, han comenzado a migrar a entornos 3D. Tan s&oacute;lo hace falta mirar el "Grim Fandango" y a la octava parte de la saga "King's Quest". Por otro lado, los juegos de estrategia, importante basti&oacute;n de la representaci&oacute;n 2D, ha consolidado un nuevo subg&eacute;nero, el de los "juegos de estrategia en 3D". ¿Queda alg&uacute;n g&eacute;nero libre de las "garras" de las 3D?. Pues la verdad es que no. ¿Han terminado las 3D con las 2D?. Pues la verdad es que tampoco.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La conclusi&oacute;n que se puede sacar mirando los t&iacute;tulos que han salido editados este pasado a&ntilde;o y los que prometen salir el pr&oacute;ximo, es que las 3D se han asentado como la representaci&oacute;n comercial por excelencia para muchos juegos, y necesaria para otros tantos. Por comercial entiendo aquellos juegos que, sin necesidad de utilizar este nuevo tipo de tecnolog&iacute;a (aventuras gr&aacute;ficas), la adquieren para dar un lavado de cara a los cl&aacute;sicos sistemas de representaci&oacute;n, haciendo evolucionar tecnol&oacute;gicamente estos. Por necesaria entiendo aquellos juegos que sin las 3D no podr&iacute;an existir como tales. Ser&iacute;a impensable hablar de los "Arcade 3D" sin un engine 3D robusto y otro tanto se podr&iacute;a decir de los simuladores de &uacute;ltima generaci&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En l&iacute;neas generales, lo que est&aacute; sucediendo es que las 3D est&aacute;n relevando (mucho m&aacute;s lento de lo que aparentemente parece) a las 2D de la representaci&oacute;n est&aacute;ndar para juegos pero, y esto es lo m&aacute;s importante, sin destruirla. No creo que dejen de existir las aventuras cl&aacute;sicas comerciales jam&aacute;s. Tampoco creo que los juegos de estrategia, en los que los escenarios prerenderizados son capaces de reflejar paisajes mucho m&aacute;s preciosistas que pol&iacute;gonos, puedan desaparecer. Lo m&aacute;s probable es que las multinacionales acaben invirtiendo grandes sumas de dinero, &uacute;nicamente en estos desarrollos pero sin eliminar de su listas de lanzamientos a los 2D puros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro de los factores que van a permitir que las 2D puedan seguir estando "ah&iacute;", es el derivado de la influencia que las 3D tiene sobre los g&eacute;neros. Es indudable que la introducci&oacute;n de una tercera dimensi&oacute;n ha variado bastantes pilares (nunca totalmente claros pero s&iacute; medianamente definidos) dentro de los g&eacute;neros m&aacute;s antiguos. Las aventuras gr&aacute;ficas son el caso m&aacute;s claro de todos. LucasArts, a la hora de echar mano a las 3D, ha tenido que realizar una aventura en la que los fondos renderizados contrastan con los personajes poligonales para, a mi entender, no derivarse a la videoaventura y cortar de ra&iacute;z con lo que se supone que es una aventura gr&aacute;fica. "Grim Fandango" es, quiz&aacute;s, el mejor camino a seguir para la evoluci&oacute;n tecnol&oacute;gica de las aventuras gr&aacute;ficas. Juegos como el "King's Quest VIII" se han desviado de forma exagerada hacia el campo de las videoaventuras perdiendo, pr&aacute;cticamente, todo tipo de nexo con las aventuras gr&aacute;ficas. ¿Esto es malo?. Hombre, depende de por donde se mire. Desde luego, "King's Quest VIII" es una de las mejores videoaventuras que se han creado jam&aacute;s. Si t&uacute; eres un "forofo" de las aventuras gr&aacute;ficas, preferir&aacute;s "Grim Fandango" pero si eres capaz de utilizar cualquier tipo de aventura entonces este juego, hecho totalmente en 3D, te resultar&aacute; excelente. Sin embargo, el "King's Quest VIII" no es capaz de ofrecerte lo que deber&iacute;a de ofrecer una aventura gr&aacute;fica debido a que las 3D (y su indudable "atm&oacute;sfera" de acci&oacute;n, movimiento y rapidez de desarrollo) envuelven al t&iacute;tulo de pies a cabeza.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si saltamos a otros juegos como pueden ser los de estrategia veremos que, dentro de lo que es la divisi&oacute;n m&aacute;s global que se puede hacer (turnos y tiempo real), los juegos en 3D y 2D conviven pac&iacute;ficamente. Y mucho me temo que las cosas no cambiar&aacute;n a corto plazo. ¿Y los juegos de rol?. Acaban de lanzarse t&iacute;tulos de la talla de "Fallout 2" y "Baldur's Gate", ambos son en 2D. El primero luce el mismo engine (isom&eacute;trico) con el que vio la luz su primera parte a principios del 98... ¿Estos juegos son malos, est&aacute;n desfasados tecnol&oacute;gicamente o no merece la pena comprarlos?. Est&aacute; claro que no. "Baldur's Gate", adem&aacute;s de ser, posiblemente, el juego de rol m&aacute;s rico y extenso jam&aacute;s creado desde el "Ultima VII", se ha agotado a los pocos d&iacute;as de salir a la venta en "Yankilandia" pa&iacute;s que, como sab&eacute;is, es el principal consumidor de chips 3D. ¿Y si miramos al futuro de los juegos de rol?. Pues si miramos al futuro de los juegos de rol veremos a "Silver", una producci&oacute;n Europea (de la legendaria Ocean) con personajes 3D y con paisajes renderizados (estilo "Final Fantasy VIII") que tiene todas las papeletas de ser la estrella de finales del 99.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como veis, no es cuesti&oacute;n de si los juegos son en 3D o son en 2D. La cuesti&oacute;n es justificar el uso de la tecnolog&iacute;a. De poco vale crear un juego totalmente en 3D, si ese mismo producto en 2D o, incluso, en sabia combinaci&oacute;n 3D/2D, resulta mucho m&aacute;s jugable, adictivo, divertido y "bonito". Del mismo modo, es impensable desarrollar ciertos productos en 2D bien, porque sencillamente no se puede, o bien porque la complejidad y el realismo que exigen hoy los juegos, te pedir&iacute;a tener a una centena de animadores creando sprites.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En conclusi&oacute;n, pienso que el futuro de los juegos se encuentra en la representaci&oacute;n 3D total (cosa obvia por lo anteriormente expuesto) y en la representaci&oacute;n 3D y 2D combinada. Creo, firmemente, que el g&eacute;nero de las aventuras gr&aacute;ficas cl&aacute;sicas, deber&aacute; de evolucionar por ese camino, respetando la creatividad de los dise&ntilde;adores y dibujantes en la creaci&oacute;n de escenarios, pero permitiendo a los programadores y animadores utilizar las ventajas de las 3D para crear personajes m&aacute;s complejos y m&aacute;s f&aacute;cilmente manipulables. As&iacute;, el g&eacute;nero los juegos de aventuras de tipo "complejo" que hay comercialmente (aventuras gr&aacute;ficas y juegos de rol) apuntan, sin duda, a ese tipo de representaci&oacute;n en el futuro. Las 2D no est&aacute;n muertas pero s&iacute; amoldadas a lo que debe de ser la evoluci&oacute;n en la industria de entretenimiento; las 3D.</P></FONT><br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniond.htm"><font FACE="ARIAL"><B>[Opinión Juegos]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
