<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>
<br>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>irmas Invitadas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
F</font><FONT color="#000000" size=2 face="arial">irma Invitada<br>
<A HREF="mailto:j-espunya@redestb.es"> Jordi Espunya.</A><br>
<FONT color="#009933" size=2 face="arial">Redactor de MeriStation Magazine</font>
</b></FONT>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Efecto Escaparate
</FONT>
</H3>


<FONT color="#000000" size=2 face="arial" >        
<P align="justify">

Algunos de vosotros os preguntar&eacute;is c&oacute;mo puede ser posible que en un sistema operativo, aparentemente tan serio, como NT4 os instale en el disco duro un juego del mill&oacute;n, un pinball. Todos ya est&aacute;is acostumbrados a los juegos del Windows, pero... ¿a qu&eacute; viene tanto juego que se instala con el sistema operativo? Pues, hijos m&iacute;os ileg&iacute;timos, es muy sencillo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todos los sistemas operativos comerciales, cuando aparecen, nos prometen que nos van a solucionar todos nuestros problemas inform&aacute;ticos y colmar&aacute;n nuestros deseos cibern&eacute;ticos, llev&aacute;ndonos al &eacute;xtasis m&iacute;stico en un alarde de multitarea, manejo de memoria, ventanas, men&uacute;s y iconos muy majos. Pero es tambi&eacute;n obvio que no puedes probar las prestaciones de un sistema operativo del mismo modo que sabes si una pelota est&aacute; o no est&aacute; correctamente hinchada. Pasan meses de uso cotidiano hasta que descubres los fallos, las pegas y lo que te saca de quicio de tu querido sistema operativo. Y no hay garant&iacute;a. ¿C&oacute;mo conseguir que los usuarios vean las &quot;ventajas&quot; del nuevo sistema de modo r&aacute;pido&nbsp;? F&aacute;cil, pones tres o cuatro juegos y con ellos aprenden a utilizar la nueva herramienta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De hecho, es una tradici&oacute;n que siempre que se lanza un nuevo microordenador y/o un sistema operativo, &eacute;ste aparezca con unos cuantos juegos que demuestren las pretendidas prestaciones respectivas. Evidentemente, tambi&eacute;n aparecen un manojo de nuevas aplicaciones &quot;serias&quot; que sacan provecho al nuevo &quot;d&uacute;o&quot; de ordenador y sistema operativo, prometiendo ser much&iacute;simo mejores que lo que hasta ese momento exista. Pero lo que siempre llama m&aacute;s la atenci&oacute;n al vulgo en general son esos bonitos jueguecitos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero las cosas no se acaban aqu&iacute;. Los desarrolladores de juegos, llevados por la competencia y las ansias de lucro, se dejan llevar por las modas tecnol&oacute;gicas, y corren a lanzar al mercado esos hermosos videojuegos que incorporan los &uacute;ltimos berridos en animaci&oacute;n tridimensional, sonido envolvente, gr&aacute;ficos recontrarenderizados y pseudointeligencia artificial. As&iacute; consiguen que la gente hable de ellos [en especial, ciertos medios de comunicaci&oacute;n especializados] alabando las ingentes cantidades de recursos humanos, monetarios y de computaci&oacute;n vertidos en el proyecto, y que permiten sacar esos pantallazos tan bonitos que hacen babear a m&aacute;s de uno y desear adquirir el juego de marras antes que gast&aacute;rselos en sexo, drogas o rock n’roll. Es m&aacute;s, cada a&ntilde;o hay que sacar una nueva versi&oacute;n del juego, con algunas mejoras, parte reales, parte supuestas. Nada de expansiones. Hay que exprimir al usuario. Al menos, a la cartera del usuario, hasta que la VISA le saque humo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A estas alturas, no s&eacute; si est&aacute;is notando que esto es un pez que se muerde la cola. O m&aacute;s bien una especie de vor&aacute;gine sin fin. Aparece un nuevo hardware, altamente innovador, en el aspecto multimedia que quer&aacute;is. Naturalmente, debe aparecer alg&uacute;n juego que le saque inmediato provecho. Lo mismo, si lo que surge es un &quot;nuevo&quot; sistema operativo. Si no aparece ese juego, no hay quien coloque en el mercado un ordenador o una copia del S.O. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n, todas las compa&ntilde;&iacute;as que pueden corren a desarrollar juegos que aprovechen esas caracter&iacute;sticas innovadoras de hardware o operativo mejor que sus pobres competidores para intentar recaudar el &uacute;ltimo c&eacute;ntimo que nos quede a los pobres usuarios. Pero cada vez elevan m&aacute;s los requisitos del sistema en esta dura carrera, y acaban agotando las posibilidades del hardware reci&eacute;n aparecido a velocidades cada vez superiores... ayudando a los fabricantes a colocar nuevas versiones, a&uacute;n mejores, de sus hermosas tarjetas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿D&oacute;nde est&aacute; el problema&nbsp;? Alguno de vosotros estar&aacute; pensando que todo es resultado del progreso, y que obtenemos cada vez mejores programas, mejores sistemas operativos, mejores juegos, mejor hardware. Pues pensad de nuevo, apreciados lectores. Porque ni los programas mejoran substancialmente en nada que us&eacute;is realmente&nbsp;; ni las sucesivas ediciones de los sistemas operativos ofrecen mejoras dignas de menci&oacute;n [cada vez menos mejoras y m&aacute;s propaganda, en realidad]&nbsp;; puede que el hardware sea mejor, pero a&uacute;n no hab&iacute;ais aprovechado el antiguo... y los juegos... ¿es mejor un juego porque haya costado un bill&oacute;n de d&oacute;lares y necesite tarjetas de sonido o de v&iacute;deo que os costar&aacute;n el sueldo de tres meses&nbsp;? ¿qu&eacute; hace realmente bueno a un juego&nbsp;? ¿tener requisitos de sistema m&aacute;s exigentes que el resto de la competencia&nbsp;? ¿de verdad&nbsp;?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Mientras tanto, a cambiar el ordenador completo cada tres a&ntilde;os, la consola cada dos y el lector CD cada tres meses. A actualizar el sistema operativo cada vez que Bill quiera ampliar el caser&oacute;n. O eso, o acudir a una cl&iacute;nica de desintoxicaci&oacute;n para videoadictos, curarse la enfermedad y no volver a usar una pantalla de rayos cat&oacute;dicos para nada que no sea ver el Telediario. Dura elecci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo por culpa del Efecto Escaparate. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por su culpa adquirimos un coche que tiene una carrocer&iacute;a deportiva, atrevida. Con unos alerones muy bonitos, spoilers y ruedas de aleaci&oacute;n ligera. L&aacute;stima que si abrimos el cap&oacute; encontramos, en lugar de motor, un par de gnomos d&aacute;ndole a unos pedales. Entonces nos preguntamos a d&oacute;nde van a parar esos litros y litros de gasolina que consume el maldito deportivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero en el escaparate se ve&iacute;a precioso, e impresiona a los vecinos. Ya no nos sentimos timados. Es m&aacute;s, le haremos bastante propaganda. Hasta conseguir que todo el mundo tenga el mismo deportivo. Pero nosotros fuimos los primeros en poseerlo.</P></FONT></BODY>

</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasb.htm"><font FACE="ARIAL"><B>[Firmas Invitadas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
