<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:oscarg@salleurl.edu">Oscar García "Kokopus"</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Al otro lado del charco
</FONT>
</H3>


<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
Hola a todos/as. Soy Oscar Garc&iacute;a Panyella, alias Kokopus, y como algunos ya sabr&eacute;is soy redactor de esta estupenda Macedonia. Estoy viviendo una notable experiencia en Estados Unidos durante unos meses y quisiera trasladaros a todos que tal se vive la fiebre inform&aacute;tica en estas tierras !!! </P>
<P ALIGN="JUSTIFY">S&iacute; s&iacute; s&iacute;.....estoy de acuerdo.......en California hay muchas cosas que hacer adem&aacute;s de pulsar teclas de pl&aacute;stico. Se puede ir a la playa, observar rascacielos, visitar el barrio "Chinatown" de cada ciudad, ver 300 razas de personas diferentes conviviendo, cenar a las 6 de la tarde e incluso y si uno se anima se puede hablar ingles!!!....pero luego...llega la fiebre....es inevitable e irresistible....y nos gusta demasiado.......necesitamos dosis masivas de rayos cat&oacute;dicos que perforen nuestras retinas !......y parece ser que a estos americanos les pasa algo parecido! </P>
<P ALIGN="JUSTIFY">Por tanto veamos que es lo que pasa a diario en este pa&iacute;s en lo que se refiere a nuestro amado "Bytemundo" !!! </P>
<P ALIGN="JUSTIFY">Para empezar uno se asombra de la cantidad de Mac's que se ven por aqu&iacute;. Madre m&iacute;a si los usan para algo mas que dise&ntilde;ar paginas web!!!, que milagro verdad?. Cualquiera con algo de conocimiento inform&aacute;tico sabr&aacute; que las Apple son estupendas maquinas de proceso general, muy superiores a los PC's en diversos aspectos pero poco irrigadas en nuestro pa&iacute;s debido a criterios puramente comerciales ( Apple se neg&oacute; de buen principio a licenciar a otras compa&ntilde;&iacute;as para que crearan cl&oacute;nicos "baratos" de sus maquinas y esa fue su perdici&oacute;n, paralela al auge comercial, que no tecnol&oacute;gico, del PC ). Por tanto seria totalmente correcto afirmar que en USA ambos soportes, Mac y PC, conviven al 50 %........y no es pr&aacute;cticamente imposible encontrar soft para Mac como en Espa&ntilde;a!. </P>
<P ALIGN="JUSTIFY">Bueno bueno......pero a que juegan estos americanos????......al PC F&uacute;tbol???....pues no precisamente como deb&eacute;is imaginar. De hecho yo distinguir&iacute;a dos tipos principales de jugadores: los universitarios y los dem&aacute;s!!!! </P>
<P ALIGN="JUSTIFY">Los universitarios suelen pasarse la vida intensificando en un departamento, doctorando o trabajando como becarios y entonces se produce el fen&oacute;meno: "Pero si tengo las llaves del departamento y hay 20 terminales dentro conectados en red!!!!!, me parece que este Viernes por la noche vamos a echar unas partidillas al Warcraft II !!!!!". Y as&iacute; es. Juegos de red. Eso es lo que manda en los departamentos universitarios sin discusi&oacute;n alguna. </P>
<P ALIGN="JUSTIFY">Uno aprovecha la LAN departamental para instalar juegos como Warcraft II, Diablo, Quake o The Kingdom of the Winds y pas&aacute;rselo pipa jugando entre 4 o 5 o 6 o cuantos mas mejor!!!!!.....Especialmente interesante es el caso del ultimo juego que os he mencionado, es decir el "The Kingdom of the Winds". Este juego fue desarrollado por el grupo programador Nexus (</FONT><A HREF="http://www.nexon.net/kingdom/index.html" target="_new"><FONT FACE="Arial" SIZE=2>http://www.nexon.net/kingdom/index.html)</FONT></A><FONT FACE="Arial" SIZE=2> como uno de los primeros juegos en red de car&aacute;cter internacional. En pocas palabras: Te lo bajas, te lo instalas y ya estas preparado para convivir con diversos jugadores del globo terr&aacute;queo en la tierra de fantas&iacute;a donde se desarrolla el juego. Interesante verdad???, incluso puedes hablar con los otros jugadores como si de un "chat" se tratara mientras los ves en pantalla. El juego esta desarrollado en 2 dimensiones y media, es decir, efectos de perspectiva en los decorados pero personajes planos. </P>
<P ALIGN="JUSTIFY">El principal objetivo del juego es subir de nivel, es decir, conseguir que tu personaje sea cada vez mas fuerte, mas inteligente......a modo de Rol...ya sab&eacute;is, pociones, armas, hechizos...El nivel de adicci&oacute;n que se observa en la universidad debido a este juego es simplemente brutal....sobretodo por el hecho de que uno puede jugar y estar conversando "on-line" con el resto de jugadores del mundo!!!. Sin duda muy recomendable de verdad. Echadle un vistazo a la direcci&oacute;n que he mencionado en el p&aacute;rrafo anterior porque os cautivara... </P>
<P ALIGN="JUSTIFY">Las universidades americanas suelen ser de car&aacute;cter privado, l&eacute;ase "caras", con lo cual manejan grandes cantidades de capital y por lo tanto pueden gastarlo en fabulosos equipos inform&aacute;ticos. Por ejemplo, uno puede deleitarse y alcanzar el sue&ntilde;o dorado de cualquier inform&aacute;tico "adicto" que se precie jugando al Quake en una estaci&oacute;n Silicon Graphics Onyx2. Varios procesadores en paralelo, pipelines gr&aacute;ficos por doquier y claro......una suavidad de movimiento y unas texturas que te hacen llorar cuando vuelves a casa y enciendes tu PC. Y es que la maquinita vale algo as&iacute; como un mill&oacute;n de d&oacute;lares...8-). </P>
<P ALIGN="JUSTIFY">En estas universidades se trata con especial cuidado el tema de los gr&aacute;ficos. Suelen ofrecer muchas asignaturas dedicadas a este fin ( gr&aacute;ficos por ordenador, geometr&iacute;a computacional, desarrollo multimedia, visi&oacute;n por ordenador o bases de datos multimedia entre otras... )&nbsp; y uno se lo pasa realmente bien pues muchas de las practicas son aut&eacute;nticos "juegos" amateur. Imaginaos "jugar estudiando" ya que te piden, por ejemplo, que programes una mini versi&oacute;n del Doom para la semana entrante!!!....de vicio!!!!.....y es que sin duda una de las mejores formas de aprender a programar es el terreno de los juegos, adem&aacute;s de ser tremendamente gratificante. </P>
<P ALIGN="JUSTIFY">Por cierto...si hab&eacute;is adquirido el Quake II y pose&eacute;is hardware especifico 3D, como una tarjeta Voodoo o similar, jugad en modo OpenGL con la tarjeta activa y despu&eacute;s hacedlo desactiv&aacute;ndola.......os vais a quedar mudos de las maravillas que la dichosa plaquita puede hacer en cuanto a numero de tri&aacute;ngulos dibujados por segundo y texturas en tiempo real......simplemente parecen dos juegos diferentes. Sin duda la calidad de placas 3D en PC es alt&iacute;sima permitiendo a nuestros amados ordenadores situarse muy muy cerca de maquinas dedicadas tipo Silicon o Sun. </P>
<P ALIGN="JUSTIFY">Bueno bueno.....as&iacute; que a los universitarios les van los juegos en red...y a los dem&aacute;s???.....pues ciertamente las consolas!!!. No os pod&eacute;is llegar a imaginar la cantidad de consolas que se ven en las casas americanas. Y es que suelen tener mas de una.....una PlayStation y una Saturn, por ejemplo....y por supuesto tambi&eacute;n cuentan con ordenador por si hay que pasar alg&uacute;n trabajillo a limpio.....:). </P>
<P ALIGN="JUSTIFY">Mi ultima experiencia en este sentido fue un apartamento de universitarios donde b&aacute;sicamente se pod&iacute;an distinguir 3 tipos de "cosas" en el comedor. Consolas, un par, juegos en la alfombra, decenas!!! y cerveza!!!!...y es que las "championships parties" que se montan aqu&iacute; los fines de semana son letales para el cuerpo, no se duerme, no se come, no se piensa, no se habla.....se grita y se juega!!!! </P>
<P ALIGN="JUSTIFY">B&aacute;sicamente se estilan juegos del tipo "masacre 3D" (Quake II y compa&ntilde;&iacute;a) y estrategia, a poder ser con inteligencia artificial,&nbsp; ( Diablo... ) quedando muy en un segundo plano el terreno de las aventuras gr&aacute;ficas, por ejemplo. Personalmente soy un gran seguidor de aventuras y no lo acabo de entender pero as&iacute; se percibe en este pa&iacute;s... </P>
<P ALIGN="JUSTIFY">En cuanto a la programaci&oacute;n pura y dura, dos perfiles t&iacute;picos: seguidores de Microsoft y seguidores de GNU ( Unix, Linux y mas...). No se si conocer&eacute;is el tema de GNU (Free Software Foundation - </FONT><A HREF="http://www.gnu.org/" target="_new"><FONT FACE="Arial" SIZE=2>http://www.gnu.org</FONT></A><FONT FACE="Arial" SIZE=2>) pero es un completo proyecto creado en 1984 y sustentado hoy en ida por programadores de todo el mundo. Se trata de una plataforma de creaci&oacute;n de software gratuito multiplataforma, como el Linux o el pol&eacute;mico FreeWin'98, a la cual cualquiera puede adherirse compartiendo sus conocimientos y siempre sin animo de lucro. Para mas informaci&oacute;n consultad la direcci&oacute;n dos l&iacute;neas arriba... </P>
<P ALIGN="JUSTIFY">Son t&iacute;picas las disputas en las clases entre ambos seguidores, muchas veces profesor y alumno, y es que en este mundillo o bien se adora o bien se odia a Bill Gates... </P>
<P ALIGN="JUSTIFY">En las tiendas uno se asombra de la cantidad de "pack's" que pueden encontrarse. Los hay de todas las formas y colores, estilos y precios y la verdad es que suelen ser tremendamente asequibles. De hecho y en general, el precio de un juego en USA es bastante inferior al de Espa&ntilde;a. Diversas tiendas americanas ofrecen la posibilidad de comprar con derecho a devoluci&oacute;n.....pero no aquello de que te dan un vale por la compra si devuelves el juego sin haberle quitado el pl&aacute;stico......de hecho puedes estar un mes jugando sin parar y volver a la tienda diciendo que le regalaste el juego a tu primo y una vez instalado se dio cuenta de que ya lo tenia......y que por lo tanto quieres otro!!!!.....impresionante verdad?, pues os puedo asegurar que hay mucha gente que se dedica a "comprar" juegos y consolas para devolverlos despu&eacute;s con cualquier excusa y llevarse de nuevo mas material a casa......y es que esto es USA!!!!! </P>
<P ALIGN="JUSTIFY">Bueno familia.....espero que os hay&aacute;is divertido un poco leyendo este humilde articulo sobre "el otro lado del charco". Para cualquier dudilla o consulta ya sab&eacute;is que estoy siempre disponible......nos vemos en la pr&oacute;xima edici&oacute;n!!! </P>






<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>



<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

