<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>rogramación y Desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Sin libros sobre el desarrollo de videojuegos
</FONT>
</H3>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De todos es sabido que el n&uacute;mero de libros sobre programaci&oacute;n, o inform&aacute;tica en general, traducidos o producidos en castellano va creciendo de forma exponencial. Cada a&ntilde;o hay m&aacute;s y, aunque siempre ha existido el temor de toparnos con adaptaciones deficientes, es decir, mal o equivocadamente traducidas, en la actualidad la calidad est&aacute;, casi siempre, fuera de toda duda. En efecto, ahora hay una variedad de literatura inform&aacute;tica t&eacute;cnica que abarca todos los campos. Incluso libros sobre entornos que hasta hace un a&ntilde;o, eran poco menos que impensables de ver en nuestras librer&iacute;as. Sin embargo, uno de los campos que mayor necesidad de documentaci&oacute;n necesita, esto es, el campo dedicado al desarrollo de videojuegos, est&aacute; totalmente hu&eacute;rfano de documentaci&oacute;n "oficial" en nuestro pa&iacute;s o, pensando de forma m&aacute;s general, en la comunidad hispana.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pensar que la causa de que no haya este tipo de obras se debe a que las editoriales no tienen suficiente material en el extranjero que adaptar, es totalmente falso. En Estados Unidos, la cantidad de libros destinados a formar, o a servir de referencia, a todas las personas que desean entrar en la industria del software de entretenimiento (o que viven de ella), es realmente abrumadora. Hay mucho material "ah&iacute; fuera" y las editoriales espa&ntilde;olas est&aacute;n haciendo o&iacute;dos sordos sin ni siquiera arriesgarse a comercializar libros que sirvan como "prueba piloto". Esto es una l&aacute;stima pero, sobre todo, una clara traba para que se genere un ritmo mucho m&aacute;s din&aacute;mico en la formaci&oacute;n de personas que puedan comenzar a introducirse, de forma seria y con aspiraciones futuras, en esta maravillosa faceta de la inform&aacute;tica. Se echa muy en falta libros sobre los que construir una base o tener una referencia m&aacute;s o menos exacta. Internet puede arrojar multitud de tutoriales o art&iacute;culos puntuales, pero un libro es un libro y no hay art&iacute;culo, tutorial o similar, que pueda reemplazar las virtudes de una obra impresa.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es un hecho innegable que el desarrollo de videojuegos en nuestro pa&iacute;s ha pasado ya la etapa del "resurgir"; ahora ya ni hablamos de futuras promesas, hablamos de grupos s&oacute;lidos. Es por ello que las editoriales deber&iacute;an de tener en cuenta la situaci&oacute;n que est&aacute; pasando el sector en Espa&ntilde;a y consultar, con las compa&ntilde;&iacute;as o personas m&aacute;s representativas del mercado nacional, qu&eacute; libros pudieran ser interesantes o imprescindibles de cara a ser introducidos o comercializados en nuestro pa&iacute;s. Contar con una adaptaci&oacute;n avalada por miembros de esta industria en Espa&ntilde;a contribuir&iacute;a, sin ninguna duda, a una formaci&oacute;n directa de futuros desarrolladores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El conocimiento que puede ofrecerte una revista t&eacute;cnica, un art&iacute;culo de una p&aacute;gina en Internet u otra persona, es siempre algo espec&iacute;fico y puntual. La necesidad de que un inform&aacute;tico cuente con un libro sobre el que desarrollar sus aptitudes autodidactas es algo indispensable. No todas las personas se encuentran c&oacute;modas con textos en ingl&eacute;s, disponen de una conexi&oacute;n a Internet o pueden desembolsar una elevada cantidad de dinero para conseguir, v&iacute;a importaci&oacute;n, alguna de las innumerables obras sobre el desarrollo de videojuegos que hay fuera de nuestro pa&iacute;s. Es necesario que alg&uacute;n tipo de iniciativa seria parta de alguna casa de desarrollo de videojuegos con relevancia en nuestro pa&iacute;s para que, la editorial que sea, comience a barajar, al menos, la adaptaci&oacute;n y comercializaci&oacute;n de literatura que abarque, &uacute;nica y exclusivamente, el desarrollo (programaci&oacute;n, dise&ntilde;o, grafismo, m&uacute;sica, coordinaci&oacute;n, etc) de videojuegos. Desde luego, y bajo mi humilde opini&oacute;n, hay una legi&oacute;n de personas que lo est&aacute; pidiendo a gritos.</P></FONT></BODY>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionb.htm"><font FACE="ARIAL"><B>[Opinión Programación / Desarrollol]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>



