<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Legado de Nintendo</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>lataformas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:srd@ctv.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Nintendo Entertainment System
</FONT>
</H3>
<FONT COLOR="#000000" SIZE=2 FACE=ARIAL>
<P ALIGN=justify>
La NES, tambi&eacute;n conocida como Famicom en Jap&oacute;n, fue para las consolas lo que el Spectrum para los actuales compatibles. Fue la primera consola de 8 bits que entr&oacute; en nuestras fronteras, al menos a un precio asequible, y su triunfo fue a lo grande.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para ello cont&oacute; con una de las dos series m&aacute;s conocidas de videojuegos; Super Mario Bros, que era un nuevo look de un juego llamado Mario Bros a secas y que te explico en otro art&iacute;culo. Uno de los cap&iacute;tulos de esta serie, Super Mario Bros 3, estuvo varios meses en los m&aacute;s vendidos, y no tiene demasiado secreto pues todos los que nada m&aacute;s ver el juego lo compramos sabemos por qu&eacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otras serie de videojuegos iniciadas en esta consola fueron los roleros Final Fantasy y Zelda. Ambos siguen hoy su maravillosa ruta; FF7 y 8 se han desviado al mundo de contratos exclusivos de Sony, aunque se rumorea que FF9 ser&aacute; para Dreamcast, originando un gran &eacute;xito de ventas. Y qu&eacute; contar de Zelda; todos hemos visto las incre&iacute;bles im&aacute;genes a gran velocidad que la Nintendo 64 es capaz de generar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero lo que no podemos hacer es recordar a esta m&iacute;tica consola como el inicio de sagas triunfantes. Ella misma tenia unos juegos con los que pod&iacute;a subsistir perfectamente sin ayuda de una segunda m&aacute;quina que ofreciera secuelas espectaculares. Hoy en d&iacute;a yo sigo jugando much&iacute;simo a sus juegos mediante emuladores, y he de reconocer que nunca cre&iacute; que unas 2D podr&iacute;an ofrecer tanto entretenimiento. </P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/nes.gif"></center>
<P ALIGN="JUSTIFY">Y es que adem&aacute;s esta consola la sol&iacute;a tener la mayor parte de los jugones de pro, y eso hizo que el intercambio de juegos estuviese muy extendido. Era una maravilla saber que cualquier juego que tuviera cualquier persona pod&iacute;a entrar en tu consola, no como ahora. Eso es algo parecido a lo que pas&oacute; con el Spectrum, pero yo no estuve a&uacute;n as&iacute; en esa &eacute;poca que ahora suena tan pasada como para compararlo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero es que la NES para las consolas y el Spectrum para los compatibles son un claro ejemplo de que tampoco est&aacute; tan mal que casi todo el mundo tenga la misma maquina. A mi parecer eso enriquece mucho m&aacute;s, ya que todos hablamos, digamos, &quot;el mismo idioma&quot;. En los compatibles eso ya no es un problema. Pero, ¿y en las consolas? Las consolas est&aacute;n en una &eacute;poca en la que una nueva compa&ntilde;&iacute;a con un buen nombre, y sin querer criticar puesto que procuro ser subjetivo s&oacute;lo en la secci&oacute;n de opini&oacute;n, lleg&oacute; con una buena m&aacute;quina y se puso a firmar exclusivas con muchas compa&ntilde;&iacute;as para asegurarse el tener juegos. As&iacute; consigui&oacute; que Final Fantasy VII huyese de Nintendo a sus mandos, y que el Tomb Raider s&oacute;lo pueda salir en su consola hasta principios del 2000.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces hundi&oacute; de este modo a Sega, y Nintendo sobrevivi&oacute; gracias a que sus juegos de producci&oacute;n propia arrasan, y a que Rare con juegos tambi&eacute;n perfectos s&oacute;lo publica juegos para sus sistemas desde el comienzo. Y Sega no ha podido sobrevivir puesto que el sistema operativo que cre&oacute; para Saturn era muy complicado y nadie lo quiso usar. As&iacute; que ahora la &uacute;nica compa&ntilde;&iacute;a que queda sin juego sucio detr&aacute;s es Nintendo, puesto que Sega tambi&eacute;n ha corrido a por exclusivas, y ya casi se ha quedado con Street Fighter 3 2<SUP>nd</SUP> Impact, Final Fantasy 9, Resident Evil 3, D2, y posiblemente Tomb Raider 4 para su nueva m&aacute;quina, que contara con un Windows CE adaptado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero eso no hace m&aacute;s que demostrar que la NES es un recuerdo de un pasado consolero perfecto, en el que no se sol&iacute;a hablar de negocios puesto que era una &eacute;poca rica en novedades, y &eacute;ste es el mejor ejemplo que tengo para poder decir que &eacute;sta consola ten&iacute;a un esp&iacute;ritu que hay que intentar recuperar, hay que intentar recuperar el alma del verdadero consolero, que se ha perdido con tanto contrato in&uacute;til que no hace m&aacute;s que destruir lo creado con los 8 y 16 bits, y que puede hacer que las consolas desaparezcan. WE LOVE NES</FONT><FONT FACE="Arial">.</P></FONT>
</FONT>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <BR>
<HR>
<A HREF="ltfnin.htm"><font FACE="ARIAL"><B>[El legado de Nintendo]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>


