<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Legado de Nintendo</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Super Mario Bros 3
</FONT>
</H3>
<FONT COLOR="#000000" SIZE=2 FACE=ARIAL>

<P ALIGN=justify>
<img src="gif/mario31.gif" align="left">A estas alturas nadie duda que el fontanero Mario es el personaje de
videojuegos que m&aacute;s aventuras ha vivido dentro de una consola. Naci&oacute;
a principios de la d&eacute;cada de los 80 tanto en la Nintendo NES como
en la m&aacute;quina recreativa. Poco a poco se fue desarrollando y madurando,
creando un estilo de juego que perfectamente se podr&iacute;a llamar 'plataformas
puro'.

<P align="justify">Pero fue la tercera parte (cuarta si empezamos a contar por el 'Mario
Bros') la que deslumbr&oacute; a jugones y a cr&iacute;tica de todo el
mundo. La campa&ntilde;a comercial fue digna de menci&oacute;n. Un grand&iacute;simo
despliegue publicitario por todos los lados delataba la ambici&oacute;n
y la confianza que Nintendo hab&iacute;a puesto en este gran trabajo.

<P align="justify">El estilo de juego segu&iacute;a siendo el de plataformas puro y duro.
Ten&iacute;a todos los alicientes de las anteriores partes y muchos m&aacute;s.
Las acciones, gr&aacute;ficos, fases, sonidos, melod&iacute;as, enemigos,
movimientos, TODO se multiplicaba por mil. Parec&iacute;a imposible que
tanto cupiera en tan poco...

<P align="justify">Todas las cr&iacute;ticas fueron favorables. Las puntuaciones no bajaban
del 95%. En las listas TOP subi&oacute; r&aacute;pido Mario a la primera
posici&oacute;n y se ech&oacute; una laaaaarga siesta...

<P align="justify">Viendo el juego no hab&iacute;a duda de que se trataba de algo grande.
Mario ya no se limitaba a cambiar de peque&ntilde;o a grande y de grande
a poder disparar. Ahora pod&iacute;a convertirse en rana, en nube, en apache,
...etc. Los enemigos aumentaron en variedad. Los hab&iacute;a para molestar
en el camino y los hab&iacute;a que te lanzaban hachas a distancia. Eso
s&iacute;, las tortuguitas aparec&iacute;an de nuevo, con sus ojos saltones
y sus sonrisas de inocencia aparente, faltar&iacute;a m&aacute;s...
<br><br>
<center><img src="gif/mario32.gif"></center>
<P align="justify">Pero lo que realmente era revolucionario estaba por descubrir. El juego
ya no se limitaba a pasar fases y m&aacute;s fases. Se cre&oacute; un nuevo
sistema y un nuevo concepto, 'los mundos'... Se trataba de un peque&ntilde;o
mapa con los accesos a&nbsp; las diferentes fases. Hab&iacute;a distintos
caminos en los que por narices ten&iacute;as que pasar por un m&iacute;nimo
de situaciones. As&iacute; pues, pod&iacute;as acabar un mundo sin haberte
tenido que pasar todas las fases lo que hac&iacute;a que una vez terminado
el juego, pudieras volv&eacute;rtelo a pasar viviendo nuevas aventuras...

<P align="justify">S&oacute;lo hab&iacute;a dos fases necesarias, en las que era inevitable
tener que jugar: los castillos. A mitad de mundo uno y al final otro, el
decisivo para acabar el mismo. Todo esto, que era nuevo, daba vidilla al
juego.

<P align="justify">Y es que al final todo fueron aciertos. Aciertos como los de incluir
fases de bonus como la del t&iacute;pico juego de parejas, el de acertar
las piezas de un personaje par&aacute;ndolas en un momento dado y el de
elegir el cofre con el contenido m&aacute;s 'sabroso'. Si ten&iacute;amos
suerte, nos esperaban apetitosos premios.
<BR>&nbsp;
<img src="gif/mario33.gif" align="right"><BR>El aspecto sonoro se mejor&oacute; bastante. De nuevo ten&iacute;amos
melod&iacute;as pegadizas pero esta vez hab&iacute;a m&aacute;s variedad
y no se hac&iacute;an mon&oacute;tonas ni machacantes. Nadie dudaba por
aquel entonces que un rasgo caracter&iacute;stico de la saga Mario fue
el sonido y sus melod&iacute;as. Sin este punto a su favor el resultado
no habr&iacute;a sido ni tan perfecto ni tan personal. En poco tiempo los
singulares pitidos y ritmos de la Nintendo cogieron una fama considerable.
Basta con decir que los usaron para la serie de dibujos animados, creando
la atm&oacute;sfera original.

<P align="justify">No menos importante result&oacute; ser el aspecto gr&aacute;fico. Simpleza,
variedad y colorido eran los tres calificativos m&aacute;s adecuados. Los
dise&ntilde;os eran muy personales lo que dot&oacute; a la saga Mario de
personalidad propia. Vuelvo a resaltar &eacute;sto una vez m&aacute;s.

<P align="justify">Y no nos olvidemos de un gran detalle. Si jugando a 2 players uno acababa
alcanzando a otro, se establec&iacute;a una competici&oacute;n que mandaba
al perdedor a la posici&oacute;n de la que ven&iacute;a en perseguidor
en el caso de que ganara el perseguidor, claro, porque en caso contrario
el alcanzado se quedaba donde estaba...

<P align="justify">Y... &iquest;Qu&eacute; mejor competici&oacute;n que la reproducci&oacute;n
del 'Mario Bros' algo mejorada?. Incre&iacute;ble, algo digno de menci&oacute;n.

<P align="justify">Otro de los puntos fuertes de este Mario fue el que nunca se acabara
de descubrir todo. Siempre esperando una nueva sorpresa, un detalle oculto,
algo...
<BR>&nbsp;
<BR>Y ya me he quedado sin calificativos positivos para esta obra de arte.
Sin ning&uacute;n lugar a dudas, este 'Super Mario Bros 3' pasar&aacute;
a la historia de los videojuegos como uno de los mejores. Por lo tanto...
&iquest;c&oacute;mo no iba a estar aqu&iacute; en Macedonia?.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <BR>
<HR>
<A HREF="ltfnin.htm"><font FACE="ARIAL"><B>[El legado de Nintendo]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>


