<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Legado de Nintendo</B></FONT></a>
<HR>
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Super Mario Bros 2
</FONT>
</H3>
<FONT COLOR="#000000" SIZE=2 FACE=ARIAL>

<P ALIGN="JUSTIFY">Despu&eacute;s del genial&iacute;simo Super Mario Bros, que por l&oacute;gica no pod&iacute;a quedarse sin secuela, Nintendo cre&oacute; una segunda parte del juego. Pero esa segunda parte s&oacute;lo sali&oacute; en Jap&oacute;n, pues se consider&oacute; muy parecido a SMB, lleg&aacute;ndose a considerar una actualizaci&oacute;n con m&aacute;s dificultad. Por ello, para el mercado occidental se cre&oacute; otro SMB2 que ninguna relaci&oacute;n guarda con el japon&eacute;s, que es en el que me centro con &eacute;ste art&iacute;culo. Por si a alguien le interesa la &quot;otra&quot; segunda parte, aqu&iacute; se edit&oacute; junto a Super Mario All Stars, para Super Nintendo, bajo el nombre de The Lost Levels, aunque por supuesto los gr&aacute;ficos son muy distantes de la primera versi&oacute;n, pero en s&iacute; el juego es el mismo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A partir de ahora nos centramos en &quot;nuestra&quot; versi&oacute;n, la occidental.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego hab&iacute;a cambiado totalmente. De hecho, la idea sali&oacute; de una recreativa llamada Doki Doki Panic, pero cambiando los personajes de dicho juego por Mario, Luigi, la princesa y la seta Toad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cada uno de ellos ten&iacute;a habilidades distintas. Mario no ten&iacute;a nada especial, tan s&oacute;lo su simpat&iacute;a mundialmente reconocida (esa falta de dieta...). Luigi era ultraligero, y gracias a la habilidad que todos compart&iacute;an de agacharse para aumentar el salto, Luigi llegaba a lugares verdaderamente altos para otros personajes. A pesar de todo, a m&iacute; me pareci&oacute; un personaje muy inc&oacute;modo de manejo. Toad... Toad era Toad. Tampoco ten&iacute;a nada especial, a no ser que fueses una persona que busca la est&eacute;tica en todo, pues el aire ar&aacute;bico que ten&iacute;an muchas de las pantallas encajaba perfectamente con su vestimenta. Y la princesa... levitaba. Esto llegaba a ser muy &uacute;til en pantallas de hielo o en zonas a&eacute;reas donde hab&iacute;a que ir alternando entre varios p&aacute;jaros para sobrevivir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y lo raro del juego ven&iacute;a dado por el cambio total de mentalidad a la hora de matar enemigos: ya no se ten&iacute;a que saltar en ellos: ¡se les ten&iacute;a que tirar hortalizas! Pepinos, calabazas, todo lo imaginable y m&aacute;s, adem&aacute;s de que tambi&eacute;n pod&iacute;as subirte sobre gran parte de los enemigos para que te transportasen (?) y tambi&eacute;n los pod&iacute;as coger como cargamento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y ya no hablemos de los jefes finales: b&aacute;sicamente hab&iacute;an dos tipos. Unos disparaban huevos sobre los que el jugador deb&iacute;a subirse, recogerlo y lanz&aacute;rselo. Otros te iban lanzando bombas, que ten&iacute;as que colocar en su recorrido, en el lugar justo, para que les explotasen en los morros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En definitiva, una apuesta bastante original y entretenida, pero que dista mucho del concepto &quot;juego de Mario&quot;, o al menos en su momento no, pues nos ten&iacute;an acostumbrados a que el fontanero al que nunca llamar&iacute;amos interpretase juegos totalmente diferentes: subir por unas escaleras, disparar a un gorila, hacer batallitas con su querido hermano... Pero las plataformas le vinieron como anillo al dedo y no ha querido soltarse excepto en ocasiones que se ha querido ir de rally o probar con alg&uacute;n otro g&eacute;nero. Por suerte, Mario 3 volvi&oacute; a lo que entendemos por &quot;plataformas 2D made in Mario&quot;.</P></FONT></BODY>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <BR>
<HR>
<A HREF="ltfnin.htm"><font FACE="ARIAL"><B>[El legado de Nintendo]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>


