<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>l Legado de Sega</B></FONT></a><hr>
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<BR><BR><BR><BR>

<h3>Sonic the Hedgehog</h3>

<P align="justify">

</FONT>

<table width="320" align="left"> 
<td><img src="gif/sonic0.gif"></TD>
</table>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La historia de los videojuegos siempre ha evolucionado en base a t&iacute;tulos que, de alguna forma, han roto con las directrices, m&aacute;s o menos establecidas, de cada uno de los g&eacute;neros reinantes. As&iacute;, distinguimos los juegos cl&aacute;sicos de los que no lo son porque con ellos se han redescubierto nuevas formas de abordar un g&eacute;nero o porque han sido capaces de crear nuevas "categor&iacute;as" dentro del mundo de los videojuegos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sonic no lleg&oacute; a crear un g&eacute;nero, pero dio tal lavado de cara a los videojuegos de plataformas que cuando el jugador lo experimentaba por primera vez, le era imposible establecer un parecido con alg&uacute;n otro plataformas de la &eacute;poca.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Pong&aacute;monos en antecedentes</h4>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Hablar de Sonic es hablar de una porci&oacute;n muy importante de la historia de los videojuegos. El popular erizo que Sega dise&ntilde;o para dar el empuje definitivo a sus consolas, ha sido uno de los videojuegos m&aacute;s jugados y galardonados de la historia. </P>
<P ALIGN="JUSTIFY"></P>

<center><table width="320"> 
<td><img src="gif/sonic1.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>¿Quién no recuerda escenas como esta en el Sonic?.</center></font></td> 
</table></center><br>

<P ALIGN="JUSTIFY">A principios de los a&ntilde;os 90, el boom de las consolas sobrevino a Europa. Por aquellas fechas, la firma m&aacute;s importante y con m&aacute;s peso, tanto en Jap&oacute;n como en Norteam&eacute;rica, era Nintendo. Con su entra&ntilde;able NES, Nintendo, hab&iacute;a logrado una posici&oacute;n imbatible en los citados continentes, pero a costa de dejar a un lado a Europa la cual,  se debat&iacute;a entre la muerte de los ordenadores de 8 bits y la nueva etapa para los equipos de 16 bits. Esto sirvi&oacute; a Sega para comenzar su ofensiva comercial a nivel europeo y establecerse como la compa&ntilde;&iacute;a de consolas m&aacute;s importante del viejo continente. El proceso seguido por Sega para dar carisma a sus consolas, se bas&oacute; en el de crear un personaje con el que los jugadores pudieran identificar a sus productos (que, por aquel entonces, eran la Master System, Mega Drive y Game Gear). Esto fue lo que llev&oacute; a la compa&ntilde;&iacute;a nipona a crear Sonic, el aut&eacute;ntico emblema de Sega durante la &eacute;poca dorada de sus consolas. Sonic, de esta forma, sirvi&oacute; de "excusa" para protagonizar algunos de los mejores juegos de la historia. En concreto, el mejor juego de plataformas que una consola de 16 bits haya podido ver jam&aacute;s; "Sonic the Hedgehog"; la excusa ideal para que todo aquel indeciso entre Nintendo y Sega se hiciera con una consola de &eacute;sta &uacute;ltima. Confieso, dicho sea de paso, que un servidor se decanto por una MegaDrive con el &uacute;nico pretexto de jugar a esa maravilla, de la que todo el mundo hablaba, llamada Sonic.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Simplemente genial</h4>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para la realizaci&oacute;n de este art&iacute;culo, he tenido que recurrir, desgraciadamente, a un emulador con el que poder recordar a Sonic. La verdad, es que m&aacute;s que disfrutar jugando con &eacute;l, he disfrutado recordando todas aquellas sensaciones que Sonic me produjo la primera vez que lo jugu&eacute; en la ya cl&aacute;sica MegaDrive. Mampeados llenos de detalles, montones de recovecos por donde meterte, amplias posibilidades de perderte jugando... ¡Qu&eacute; recuerdos!. </P>
<P ALIGN="JUSTIFY"></P>
<table width="320" align="right"> 
<td><img src="gif/sonic2.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Si lográbamos acabar la "zona" con suficientes anillos, teníamos la oportunidad de acceder a esta pantalla de bonus.</center></font></td> 
</table>
<P ALIGN="JUSTIFY">Sonic fue el juego de plataformas que consagr&oacute; el g&eacute;nero. A partir de su lanzamiento, el mundo de los videojuegos de plataformas se instauraron definitivamente en las consolas, dejando patente que los ordenadores de la &eacute;poca eran totalmente incapaces de ofrecer un nivel de rapidez de proceso para juegos de este tipo. Y es que, el juego de Sega, fue el primer desarrollo que puso los dientes largos a todos los que, hasta la fecha, nos hab&iacute;amos resistido a comprar algo que no llevara teclas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Intentar definir qu&eacute; era ese "algo" que ten&iacute;a el Sonic, ser&iacute;a poco menos que imposible. Lo primero que sent&iacute;as cuando comenzabas a jugar, era una sensaci&oacute;n de libertad absoluta. Libertad para correr y perderte en el escenario, libertad para saltar de un lado a otro, libertad para investigar por la infinidad de lugares que escond&iacute;a la pantalla, libertad para... Hasta la fecha, ning&uacute;n plataformas hab&iacute;a logrado hallar la mezcla exacta entre sencillez de manejo y concepci&oacute;n y complejidad de desarrollo Las incre&iacute;bles piruetas de Sonic corriendo "a toda pastilla", el importante nivel de paciencia que deb&iacute;amos de tener en ciertos momentos, la habilidad y los reflejos al realizar los saltos o el exquisito dise&ntilde;o de todas y cada una de las fases hac&iacute;an a este juego grande y &uacute;nico; uno de los juegos m&aacute;s divertidos de la historia, sin duda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nuestra energ&iacute;a o fuente de vida, lo constitu&iacute;an peque&ntilde;os anillos que se hallaban repartidos por todo el escenario. Si un enemigo nos acertaba sin que nosotros dispusi&eacute;ramos de uno de esos preciados objetos, est&aacute;bamos perdidos, en caso contrario, si dispon&iacute;amos de alg&uacute;n anillo, Sonic sal&iacute;a despedido por los aires al igual que todos los anillos de que dispon&iacute;a. Una forma m&aacute;s que original de representar la energ&iacute;a de este carism&aacute;tico h&eacute;roe. Obviamente, el juego part&iacute;a de esa premisa b&aacute;sica pero incorporaba multitud de detalles con los que enriquecer el periplo de Sonic. Hab&iacute;a zonas secretas, escudos de protecci&oacute;n, invulnerabilidad, zapatillas para correr (a&uacute;n) m&aacute;s r&aacute;pido, muelles que te hac&iacute;an pegar grandes saltos, bloques que hab&iacute;a que mover para acceder a otros lugares, pantallas de bonus y as&iacute; un largo etc&eacute;tera que, sin llegar a desbordar al jugador, enriquec&iacute;an estupendamente el juego.</P>
<center><table width="320"> 
<td><img src="gif/sonic3.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Cuando algún enemigo colisionaba con Sonic, perdíamos los anillos (y nunca mejor dicho :).</center></font></td> 
</table></center><br>

<P ALIGN="JUSTIFY"></P>
</FONT><h4><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Un juego Inimitable</h4>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Gracias a Sonic, el mundo de las videoconsolas en Europa alcanz&oacute; su cenit. Se vendieron miles de m&aacute;quinas de Sega con el &uacute;nico pretexto de probar a Sonic. Al mismo tiempo, el resto de casas de la competencia, animadas por el &eacute;xito de Sega en el mercado Europeo, comenzaron a hacer su entrada a lo grande en el viejo continente. Las repercusiones de Sonic como uno de los mejores juegos de plataformas jam&aacute;s creados y como aut&eacute;ntico estandarte del movimiento "consolero", es algo que est&aacute; fuera de toda duda para todo aquel que tenga un m&iacute;nimo de conocimiento sobre la historia de los videojuegos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Me ha resultado muy gratificante volver a probar a Sonic en un emulador, despu&eacute;s de tanto tiempo. Sin embargo, de una cosa te das cuenta, jam&aacute;s sentir&aacute;s todo lo que te puede hacer sentir un juego de estas caracter&iacute;sticas en su h&aacute;bitat natural, esto es, sobre su consola leg&iacute;tima. Si nunca has jugado a Sonic por ignorancia o porque es de la compa&ntilde;&iacute;a que hace competencia a tu consola actual, intenta hacerte con &eacute;l porque es una experiencia que bien merece la pena (re)vivir. Si te apasiona el mundo de los videojuegos, en cualquiera de sus facetas, ver&aacute;s a Sonic como una de esas joyas que nunca terminan de sorprender al jugador. Un juego inimitable, sin duda.</P></FONT>
<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="ltfsega.htm"><font FACE="ARIAL"><B>[El Legado de Sega]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







