<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:martuchi5@yahoo.es">Marta Mañanes.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
El bebé ordenata: Verlo crecer.
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
Afirmar que la vida del ordenador mantiene una analog&iacute;a con la de la persona es descabellado, aunque existe cierto paralelismo. Nuestro ordenador nace, crece y envejece, y por desgracia para nuestra econom&iacute;a, no se reproduce, lo cual nos podr&iacute;a ahorrar cierto dinerito que podr&iacute;a ir aparar en otras actividades.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El nacimiento es apasionante. Despu&eacute;s de haber buscado a la criatura con m&aacute;s o menos empe&ntilde;o, al llegar a casa lo tratamos con cari&ntilde;o, cada pieza recibe una atenci&oacute;n especial. Ninguna ha de sufrir ni la m&aacute;s m&iacute;nima lesi&oacute;n; es como cuando llega el ni&ntilde;o al hogar: al principio todo el mundo est&aacute; encima de &eacute;l, nadie lo coge por miedo a que se les rompa. Luego, cuando ya nos hemos acostumbrado a la presencia del &quot;beb&eacute;&quot; y ya conocemos su comportamiento, lo manejamos con total tranquilidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El crecimiento en un ordenador es algo tambi&eacute;n muy parecido al crecimiento de la persona. Nosotros, como due&ntilde;os de un ordenador, no deseamos que crezca y pierda lo que ten&iacute;a de innovaci&oacute;n. El envejecimiento en un ordenador es mucho m&aacute;s prematura del que pueda serlos en una persona. Sin embargo, a los padres de la criatura tambi&eacute;n les resulta triste ver como su chiquitirr&iacute;n/a crece sin remedio, y no se hacen a la idea que ya no se dar&aacute; marcha atr&aacute;s y nunca m&aacute;s ver&aacute;n a su beb&eacute; en pa&ntilde;ales. La personita de la casa va creciendo y tenemos que ir ampliando la talla de su ropa, de sus gastos escolares y de todo lo que comporta un hijo/a. A nuestro ordenador le ocurre exactamente lo mismo, aquel que lo quiere tener al d&iacute;a y que se resiste a ese envejecimiento prematura, aumenta y amplia, una y otra vez, la capacidad de su ordenador, meti&eacute;ndolo m&aacute;s y m&aacute;s bytes de capacidad, memoria y m&aacute;s memoria. Pero nuestro ordenador se dirige inexorablemente hacia la vejez y no hay byte que lo impida.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Envejecer para una persona significa ver aparecer en el rostro nuevas arrugas, ver en el pelo nuevas canas surgidas con muy mala intenci&oacute;n en los sitios m&aacute;s visibles, observar como la piel ya no es lo que era... en fin, todo eso que tememos que llegue alg&uacute;n d&iacute;a. Pero, para un ordenador envejecer significa ver aparecer, a destajo, nuevos modelos, cada vez surgidos con mayor rapidez y mayor calidad y, lo que es todav&iacute;a peor, a buen precio.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El ordenador sabe que le queremos, pero es inevitable que alg&uacute;n d&iacute;a cedamos de nuevo a la tentaci&oacute;n de traer un nuevo beb&eacute; a casa, mucho m&aacute;s moderno y atractivo que el viejo trasto que <I>un d&iacute;a</I> fue el m&aacute;s avanzado modelo del mercado. La competencia es sin&oacute;nimo para un ordenador a envejecimiento prematuro lo cual resulta injusto para nuestros bolsillos. El ni&ntilde;o/a dicen que viene con un pan bajo el brazo, sin embargo el ordenador yo dir&iacute;a que con lo &uacute;nico que llega es con un cat&aacute;logo de los nuevos modelos del mercado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En fin, todas esas caricias que le dedicamos a nuestro ordenador cuando queremos que nos consiga algo en especial, esos &aacute;nimos que recibe cuando est&aacute; realizando alguna tarea esencial para nuestra vida profesional o acad&eacute;mica... todo ello acaba cuando nuestro &quot;ordenata&quot; ya no nos cunde, en definitiva, cuando ya no es lo que era.</P></FONT></BODY>




<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

