<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="caralo@infotel2.com.ar">Carlos Alonso</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Visita no guiada al Museo del Futuro.
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En nuestra sociedad, tan occidental y respetuosa de los valores constituidos, es posible en la mayor&iacute;a de las ciudades asistir a Museos. En ellos se puede observar c&oacute;modamente y lejos de las inclemencias del polvo, los mosquitos y las distancias que sufren los verdaderos exploradores, pedazos del pasado, regularmente arrancados de su locaci&oacute;n original en nombre de la ciencia o el conocimiento. Aqu&iacute;, en Macedonia, proponemos un paseo diametralmente opuesto: recorrer con nuestra sensibilidad un Museo del Futuro, donde las necesidades de hoy han sido resueltas. Y atenci&oacute;n anarquistas, hastiados de clamar contra el poder de la bestia MS, tomad en cuenta esta reflexi&oacute;n: en la medida que m&aacute;s y m&aacute;s estemos atentos a nuestras necesidades de hoy, lo hagamos saber y seleccionemos no-naturalmente con nuestra compra a aquellos que de verdad atienden a nuestros pedidos, este futuro cercano y a la vez lejano se parecer&aacute; cada vez m&aacute;s a lo que deber&iacute;a ser. Por tanto, visitad curiosos, y no omit&aacute;is cualquier comentario, correcci&oacute;n o agregado que merezca tambi&eacute;n ser expuesto. Vamos, que tal vez en breve invitemos al mismo Bill, a que aprenda alguna cosilla.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">B&uacute;squeda Infructuosa</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo primero que hacemos al ponernos bajo el distribuidor hologr&aacute;fico es buscar la sala de computaci&oacute;n. ¡Gran error!. No hay tal sala, porque las computadoras como las conocemos hoy, m&aacute;quinas fascinantes que los padres adquieren en las tiendas sin saber bien para qu&eacute;, ya no existen. En su lugar, pr&aacute;cticamente no queda actividad del g&eacute;nero humano que no haya sido bendecida –o contaminada- por los cerebros electr&oacute;nicos. As&iacute; pues, veamos cu&aacute;les son las diferencias m&aacute;s importantes con las viejas &quot;PC&quot;.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">El monitor</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Atr&aacute;s han quedado aquellas viejas interfaces en las que con el rat&oacute;n se manipulaban objetos en la pantalla... bueno, no tanto. El cambio radical ocurri&oacute; all&aacute; por el 2005 con la popularizaci&oacute;n del Flat Panel, idea desarrollada el siglo pasado en el MIT, que consiste en un panel delgado y liviano sobre el cual se trabaja y se ve al mismo tiempo. Sencillamente, la pantalla pas&oacute; a la mano, prescindiendo del rat&oacute;n. En su lugar se trabaja con un Pointer, algo as&iacute; como un &quot;l&aacute;piz&quot; completamente configurable con el que se realizan todas las operaciones directamente sobre el panel. Arrastrar, soltar, seleccionar, clickear, y todas esas &quot;...ar&quot; se hacen ahora mucho m&aacute;s r&aacute;pido. El Flat Panel no s&oacute;lo es liviano y a todo color, sino que tambi&eacute;n puede tornarse flexible, adapt&aacute;ndose as&iacute; a la superficie sobre la que estamos trabajando: una mesa, un plano inclinado, o las propias rodillas. Algunos modelos ya descifran cualquier escritura manual sin necesidad de un proceso de &quot;training&quot;, sin embargo est&aacute; en discusi&oacute;n si volver o no a la escritura. ¿Qu&eacute;? Pues... veamos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">El teclado</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Condena del siglo XX, el teclado en uso ya no es el QWERTY, o sea el orden de las letras que, como sabr&aacute;n, fue hecho para dificultar el tipeo. Actualmente el teclado es un elemento no standard, y cada usuario corre una rutina de entrenamiento que determina el grado de habilidad de cada dedo, con lo que se configura un teclado propio, &uacute;nico. A trav&eacute;s de la red, el fabricante guarda este protocolo para caso de roturas o futuras actualizaciones, y el teclado personal queda as&iacute; definido para toda la vida. La misma rutina garantiza que en dos sesiones de cuatro horas es posible escribir al 85% de la velocidad del habla normal, aunque ya cada vez menos gente utiliza este perif&eacute;rico para escribir. ¿Por qu&eacute;? Bueno, a eso vamos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Sonido</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La segunda gran revoluci&oacute;n se estaba gestando a fines del siglo XX, y t&iacute;midamente se ofrec&iacute;an programas que no causaban gran impacto en el p&uacute;blico. Hasta que antes de terminar la primer d&eacute;cada del siguiente siglo, c&oacute;mo no, la empresa pionera en procesadores de texto decidi&oacute; profundizar sus algoritmos de correcci&oacute;n sem&aacute;ntica, aprovechando toda la potencia del reci&eacute;n salido procesador trinario Nova, y aplicarlo al reconocimiento de voz. Resultado: las computadoras reconocieron el habla natural, y ya casi todas las aplicaciones, todas las actividades, desde las m&aacute;s complicadas hasta las m&aacute;s sencillas, se pudieron trabajar sin necesidad de entrenar a la m&aacute;quina para reconocer a su amo-usuario. A partir de aqu&iacute;, poco transcurri&oacute; para que los sitios dedicados a la verificaci&oacute;n de la identidad –y edad- adoptaran c&oacute;digos encriptados que transmit&iacute;a el programa reconocedor de voz. As&iacute;, en cada momento, la aplicaci&oacute;n sab&iacute;a si quien hablaba era su leg&iacute;timo due&ntilde;o, abriendo las puertas adecuadas con solo la identificaci&oacute;n de la &quot;firma&quot; vocal sonora propia de cada uno. Sin embargo, las fuerzas de la oscuridad metieron la cola, y algunos a&ntilde;os despues, aparecieron las primeras denuncias de fraudes realizados mediante la utilizaci&oacute;n de s&iacute;ntesis de voz. Los &quot;Hackers&quot; hab&iacute;an recuperado el tiempo perdido, y amenazaban con tambalear la nueva tecnolog&iacute;a. Pero no dur&oacute; mucho.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Micr&oacute;fono</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como todas las aplicaciones se manejaban por voz, era l&oacute;gico que se destinaran gran cantidad de recursos al desarrollo de mejores perif&eacute;ricos que el micr&oacute;fono de pie, o el conjunto auricular-boom. As&iacute; aparecieron los micr&oacute;fonos personales, que colgaban del armaz&oacute;n de los anteojos, del pendiente o de una lev&iacute;sima vincha que se adaptaba a la forma de la cabeza. Este admin&iacute;culo se comunicaba por infrarrojos con cada unidad a la que iba dirigida, y la sobreabundancia de c&oacute;digos, necesaria por ejemplo para no encender las luces cuando tratamos de bajar el volumen del holovisor, pudo ser absorbida con comodidad por la l&oacute;gica trinaria. Cuando el ataque de los hackers y la crisis de la autenticaci&oacute;n de voz, alguien pens&oacute; en inclu&iacute;r en el micr&oacute;fono un sensor qu&iacute;mico, con el que se tomaban muestras del aliento a raz&oacute;n de varias por segundo. Estos perfiles se cotejaban con los almacenados en el banco de memoria del artefacto utilizado, sea el elaborador de alimentos o el autom&oacute;vil, y aleatoriamente cada cierta cantidad de minutos con un banco alternativo de s&oacute;lo lectura, que pod&iacute;a estar en la entidad bancaria, la Escuela o el Colegio Profesional. Asimismo, con este aparato los autom&oacute;viles se hicieron instant&aacute;neamente in&uacute;tiles para aquellos conductores con un nivel determinado de alcohol en sangre, a la vez que la unidad se comunicaba inmediatamente con el puesto policial m&aacute;s cercano, y... bueno, estamos entrando en otro rubro. Antes de eso, aclarar ese tema de &quot;se comunicaba&quot;.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Comunicaciones</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Qu&eacute; &eacute;poca aquella en que se trataba de persuadir a la gente de las ventajas de la Internet. Hoy en d&iacute;a toda la informaci&oacute;n circula con total fluidez, sin interrupciones. La &quot;conexi&oacute;n&quot; como se la llamar&iacute;a en el siglo XX hoy es permanente, y la l&oacute;gica del aparato determina qu&eacute; porci&oacute;n le interesa: la se&ntilde;al hologr&aacute;fica de un partido de f&uacute;tbol, una se&ntilde;al de audio multidimensional, m&uacute;sica MP4, una comunicaci&oacute;n privada o determinado software. Ah, claro! No hemos aclarado que en la actualidad el software es muy, pero muy barato, porque se carga directamente del desarrollador en el momento de usarlo. Basta de complicaciones teniendo que actualizar ese programa que nos hab&iacute;a costado tanto. Ahora el Soft se baja, con un costo proporcional al tiempo de uso estimado. Siempre se tiene la &uacute;ltima versi&oacute;n, que toma la firma de la anterior que utilizamos y configura las preferencias, detectando incluso las funciones m&aacute;s usadas y los errores m&aacute;s comunes de uso, generando una nueva firma. Vencido el plazo, sencillamente la aplicaci&oacute;n guarda la informaci&oacute;n &uacute;til, se cierra y... se autodestruye. S&iacute;, como lo oyen, cada programa viene con su propia cuenta regresiva, que garantiza el exterminio de la pirater&iacute;a. Bueno, esa es la idea.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Reci&eacute;n nos hemos asomado a lo que ofrece el Museo. Les proponemos que nos comenten sus propias experiencias y nos sigan acompa&ntilde;ando. No, caballero, la salida es por el otro holodistribuidor, gracias.</P></FONT>
<BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

