<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>



<H3>Banco - Internet</H3>
<P ALIGN=justify>
<P ALIGN="JUSTIFY">Hasta hace poco m&aacute;s de un a&ntilde;o, a trav&eacute;s de los numerosos bancos y cajas espa&ntilde;olas presentes en Internet s&oacute;lo se pod&iacute;a acceder a diversa informaci&oacute;n y servicios de valor a&ntilde;adido, sobre todo de car&aacute;cter l&uacute;dico y comercial. En ese instante, la Banca era ya consciente de la gran importancia que la Red representar&iacute;a muy pronto en los negocios, y se preparaba para dar un nuevo salto en Internet. Sin embargo, de un tiempo a esta parte, y gracias al ofrecimiento de las principales entidades financieras espa&ntilde;olas, de s&oacute;lo ofrecer informaci&oacute;n corporativa y sobre todo productos, se ha pasado a mucho m&aacute;s, como la posibilidad de realizar todo tipo de consultas e, incluso, movimientos de dinero en tiempo real. Cualquier cliente, y desde cualquier ordenador, puede realizar pr&aacute;cticamente todo tipo de consultas y un tanto por ciento muy elevado (en el caso de Openbank, el 80%) de las transacciones bancarias habituales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La banca electr&oacute;nica o <I>cyberbanking</I> ha supuesto grandes ventajas para el usuario, como la comodidad de no tener que desplazarse hasta las sucursales para contrastar los diversos productos ofertados. Del mismo modo, se beneficia tambi&eacute;n de unos servicios m&aacute;s r&aacute;pidos e individualizados. E incluso en ocasiones, se facilita informaci&oacute;n adicional. Numerosas son las p&aacute;ginas web que ofrecen informaci&oacute;n sobre las empresas y organizaciones de sus respectivas provincias o comunidades, paseos virtuales por diferentes ciudades, etc.</P>
<B><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Aunque el impacto real de la banca electr&oacute;nica es peque&ntilde;o a&uacute;n, todo apunta a que a largo plazo ser&aacute; importante. La mayor&iacute;a de los bancos y cajas ven en la Red una nueva manera de relacionarse con los clientes. Por ello, las diferentes entidades han comenzado a tomar posiciones ante este emergente y prometedor canal de distribuci&oacute;n de sus productos.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Diferentes razones</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora bien, lo importante es saber cu&aacute;les han sido las diferentes razones que est&aacute;n motivando este «desembarco» de la banca en Internet. Fundamentalmente ser&iacute;an tres: el ahorro de costes, la captaci&oacute;n de clientes y, por &uacute;ltimo, el negocio que representa el comercio electr&oacute;nico -cuesti&oacute;n que merece un tratamiento especial-.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para hacernos una idea, conforme a un estudio de Openbank ( <A HREF="http://www.openbank.es/">www.openbank.es</A>), los costes de una transacci&oacute;n bancaria por Internet son diez veces menores que si se hace por tel&eacute;fono, y treinta veces menores que si se elige una sucursal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta reducci&oacute;n de costes fue una de los primeros argumentos esgrimidos por Bankinter ( <A HREF="http://www.bankinter.es/">www.bankinter.es</a> ) para justificar la importante inversi&oacute;n -cercana a los 350 millones de pesetas- realizada para promocionar sus servicios a trav&eacute;s de Internet. Ahora bien, los frutos ya se est&aacute;n viendo. En algunos meses, el 20% de las transacciones de Bolsa del banco se hacen a trav&eacute;s de Internet, y un 7% del movimiento tambi&eacute;n se hace por la red.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Adem&aacute;s, Bankinter se decidi&oacute; a lanzar, a trav&eacute;s de la Red, un nuevo producto: la ciberhipoteca. De hecho, a trav&eacute;s de sus p&aacute;ginas, se puede conocer, entre otras cuestiones, lo que costar&iacute;a solicitar un cr&eacute;dito hipotecario o la inversi&oacute;n en el fondo que m&aacute;s interesa. Asimismo, los clientes de BKnet -nombre del servicio en Internet- disponen de informaci&oacute;n de la Bolsa actualizada cada 15 minutos, y por 1.000 pesetas mensuales, la cotizaci&oacute;n en tiempo real. Asimismo, la p&aacute;gina web de Bankinter ofrece 150 servicios, haciendo que la presencia f&iacute;sca del cliente en cualquiera de las oficinas s&oacute;lo sea necesaria en el supuesto de que &eacute;ste tenga que firmar alg&uacute;n cr&eacute;dito.</P>
<P ALIGN="JUSTIFY">Independientemente de que se sea cliente o no, cualquier persona puede acceder a la p&aacute;gina de BKnet, que tiene cerca de 45.000 <I>hits</I> diarios.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Banco Central Hispano ( <A HREF="http://www.bch.es/">www.bch.es</a> ), por su parte, opta por otra modalidad, siendo su  caracter&iacute;stica m&aacute;s destacable lo que ofrece, ya que adem&aacute;s de numerosas operaciones, el BCH tiene previsto facilitar a su clientela la posibilidad de comprar y vender valores del mercado cont&iacute;nuo en tiempo real, suscribir y reembolsar participaciones de fondos de inversi&oacute;n, comunicar bloqueos de tarjetas, etc.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Captaci&oacute;n de clientes</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Internet ha revolucionado el concepto de marketing bancario. No cabe la menor duda de que las diferentes entidades bancarias se han asomado a Internet para ofrecer un mejor servicio, pero tambi&eacute;n con el fin de llegar a los segmentos de poblaci&oacute;n m&aacute;s proclives al uso de las nuevas tecnolog&iacute;as, que son, por otra parte, los de nivel socio-econ&oacute;mico m&aacute;s alto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero Internet no s&oacute;lo constituye un medio publicitario en s&iacute; mismo. Tambi&eacute;n es un instrumento ya que algunas entidades como el BCH, el Banco Santander y Bankinter regalan a su clientela la conexi&oacute;n a la Red. Ello ha motivado, entre otras cuestiones, que las altas entre los clientes de algunas entidades como el propio Bankinter se hayan acercado a 70.000 durante el &uacute;ltimo a&ntilde;o.</P>
<P ALIGN="JUSTIFY">De cualquier manera, el proceso de irrupci&oacute;n de la banca en Internet no se ha producido de golpe, sino que se est&aacute; realizando de manera escalonada. As&iacute;, se puede hablar de tres fases.</P>
<P ALIGN="JUSTIFY">Una primera etapa es la de ofrecer informaci&oacute;n y otros servicios de valor a&ntilde;adido. En ella se encuentran situadas las p&aacute;ginas web de Bankinter, el Banco Urquijo ( <A HREF="http://www.bancourquijo.es/">www.bancourquijo.es</a> ) o el propio Banco de Espa&ntilde;a (www.bde.es), donde &uacute;nicamente se accede a informaci&oacute;n acerca de sus responsabilidades.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el caso del Bankoa ( <A HREF="http://www.bankoa.es/bankoa/index.html">www.bankoa.es/bankoa/index.html</a> ), banco comercial con sede en San Sebasti&aacute;n, tambi&eacute;n es otro claro ejemplo de lo dicho anteriormente -si bien sus medios no son los mismos y aporta algo m&aacute;s-, ya que &uacute;nicamente ofrece informaci&oacute;n institucional, sobre banca particulares y empresas, y la posibilidad de realizar consultas v&iacute;a e-mail.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En un segundo nivel, se pasa a poder realizar consultas similares a las que se pueden ejecutar en un cualquier sucursal, si bien el abanico de posibilidades es m&aacute;s amplio.</P>
<P ALIGN="JUSTIFY">Los servicios de valor a&ntilde;adido en esta fase son m&aacute;s completos: informaci&oacute;n sobre el Euro, sobre los marcos financieros, simuladores de operaciones, enlaces a otro tipo de empresas, medios de comunicaci&oacute;n e, incluso, en el caso de La Caixa ( <A HREF="http://www.lacaixa.es/">www.lacaixa.es</a> ), la venta de entradas para espect&aacute;culos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta actividad se inici&oacute; en diciembre de 1997 como un complemento a los cajeros de Servicaixa. Pese a no haberse realizado publicidad alguna, en todo este tiempo, tanto el n&uacute;mero de visitas como la compra de entradas se han duplicado. La oferta de espect&aacute;culos de La Caixa en Internet incluye cines de Madrid, Barcelona, Zaragoza, Valencia, Murcia y Andaluc&iacute;a, as&iacute; como teatros, actos deportivos, conciertos, etc. El internatuta que compra su entrada a trav&eacute;s de la red luego la puede recoger en la misma taquilla o en alguno de los terminales de Servicaixa. Las compras por Internet se realizan con cualquiera de las tarjetas emitidas por La Caixa, pero para tranquilidad de los cibernautas, esta entidad pr&oacute;ximamente dispondr&aacute; del protocolo SET de seguridad, lo que facilitar&aacute; el empleo de cualquier otra tarjeta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la tercera etapa, ya se pueden realizar operaciones que suponen movimientos de dinero. Sin lugar a dudas, casi la totalidad de las entidades est&aacute;n trabajando duro para conseguir esta operatividad y si a&uacute;n no lo han logrado antes es, en gran medida, a la ardua cuesti&oacute;n de la seguridad, no ya para el banco, sino tambi&eacute;n para el usuario.</P>
<P ALIGN="JUSTIFY">Se puede afirmar que, por encima de todo, a los bancos espa&ntilde;oles les une un objetivo: lograr una operatividad que permita hablar de una verdadera banca virtual. Por ahora, s&oacute;lo Openbank se encuentra actuando en ella, pero seguramente por poco tiempo.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Openbank</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una de las entidades pionera en la banca virtual fue Openbank, banco espa&ntilde;ol nacido hace tres a&ntilde;os con la singularidad de no poseer oficinas, el dinero iba y ven&iacute;a por tel&eacute;fono. Desde el 17 de marzo de 1997, los clientes tambi&eacute;n pueden operar por Internet. Fue el primero de Espa&ntilde;a y el segundo del mundo, tras el norteamericano Security First, en realizar todo el trabajo bancario a trav&eacute;s de la Red.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Openbank, del Grupo Santander, emplea a cerca de 250 personas, de las cuales el 95% son universitarios y el 56% mujeres. El grueso de la fuerza laboral se concentra en una sala plagada de tel&eacute;fonos y ordenadores en la Plaza Azca de Madrid.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La diferencia con los dem&aacute;s bancos espa&ntilde;oles es que ofrecen productos de otras entidades y, sobre todo, mejores condiciones econ&oacute;micas. En Openbank no existen las comisiones por transferencias o por cuenta corriente. De ah&iacute;  que en dos a&ntilde;os Openbank haya conseguido 55.600 clientes, de los que 10.600 son internautas.</P>
<P ALIGN="JUSTIFY">De esos 10.600 clientes internautas, cerca de 6.000 mostraron en un primer momento su inter&eacute;s por la banca telef&oacute;nica, para m&aacute;s tarde pasarse a Internet.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde un principio, la m&aacute;s importante ventaja de Openbank estaba en la posibilidad de realizar pagos entre distintas entidades y transferencias entre cuentas, todo ello de forma on-line. Es decir, las operaciones quedaban recogidas en tiempo real, pudiendo as&iacute; consultarse o modificarse las veces que se quisiera.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La oferta de servicios comprende desde la consulta de saldos o movimientos, pasando por suscripciones y reembolsos de fondos contratados o aportaciones a planes de pensiones abiertos, hasta petici&oacute;n de talonarios o informaci&oacute;n sobre productos. Y tambi&eacute;n otra serie de servicios de valor a&ntilde;adido, como correo electr&oacute;nico, b&uacute;squeda de casas y coche y su financiaci&oacute;n, tienda, agencias de viajes, etc.</P>
<P ALIGN="JUSTIFY">Y todo ello con la seguridad que proporciona un sistema que garantiza la salvaguardia y la confidencialidad de las operaciones de los clientes, as&iacute; como la encriptaci&oacute;n de claves y trampas para impedir las posibles acciones de los piratas inform&aacute;ticos.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Banca a Distancia</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De cualquier forma, el concepto que m&aacute;s se ha acu&ntilde;ado gracias al desarrollo de Internet es el de Banca a Distancia. El Banco Santander ( <A HREF="http://www.bsantander.com/">www.bsantander.com</a> ) es el primer banco del mundo en obtener el certificado a nivel internacional para actividades financieras en Banca a Distancia e Internet. Y es que sus actividades de Banca Telef&oacute;nica, Banca por Internet y Gesti&oacute;n de Reclamaciones, agrupadas dentro de Banca a Distancia, obtuvieron el certificado UNE-ENISO 9002 por el que se reconoce la calidad de su gesti&oacute;n, as&iacute; como el dise&ntilde;o y la implantaci&oacute;n del sistema, lo que confirma la calidad como prioridad destacable entre los objetivos del Grupo Santander.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A trav&eacute;s de su p&aacute;gina web -en castellano, ingl&eacute;s y catal&aacute;n-, el internauta puede recopilar informaci&oacute;n corporativa y financiera, y novedades (consultar los resultados del primer semestre de 1998 del Grupo Santander; recoger informaci&oacute;n sobre cr&eacute;ditos y sobre el cambio a Euros; acceder al prestigioso Centro del Accionistas, con ventajas dirigidas a &eacute;stos; etc.).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tambi&eacute;n el BBV ( <A HREF="http://www.bbv.es/BBV/home.html">www.bbv.es/BBV/home.html</a> ) no dud&oacute; en aprovecharse de las ventajas de Internet y desarroll&oacute; su BBVnet, un servicio de banca a domicilio gracias al cual, desde su domicilio y a trav&eacute;s del ordenador y las redes de Internet, el cliente puede acceder a la informaci&oacute;n de sus cuentas bancarias y realizar operaciones con total seguridad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero ah&iacute; no acaba todo. Los clientes del Banco Banif ( <A HREF="http://www.banco-banif.es/">www.banco-banif.es</a> ), del Grupo Central Hispano, disponen de su propio Banquero Personal, un interlocutor &uacute;nico que el banco pone a disposici&oacute;n de cada uno de sus clientes para atenderle personalmente y proporcionarle lo que busca (informe mensual de Econom&iacute;a, informaci&oacute;n sobre fondos, situaci&oacute;n de los mercados, etc.) as&iacute; como dar con la soluci&oacute;n financiera a cualquier problema (seguros, medios de pago, productos de ahoroo, productos de inversi&oacute;n, etc.).</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">¿Es seguro?</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El principal escoll&oacute; que fren&oacute; el desembarco de la Banca en la web fue la inseguridad. Este cuesti&oacute;n es quiz&aacute;s una de las mayores preocupaciones de los clientes de la Banca a Distancia. Sin lugar a dudas, la pregunta que se plantea todo aquel que accede por primera vez a este tipo de servicios es "¿Ser&aacute; seguro?".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para responder a esta cuesti&oacute;n, basta con «pasarse» por la p&aacute;gina web del Banco Atl&aacute;ntico ( <A HREF="http://www.batlantico.es/">www.batlantico.es</a> ). Esta entidad financiera pone a disposici&oacute;n de sus clientes una amplia gama de productos y servicios (cuenta a la vista, dep&oacute;sito a plazos, cr&eacute;ditos, fondos de inversi&oacute;n, etc.), con los que es posible atender cualquier necesidad financiera o de servicio que se pueda plantear. Con ese fin, constantemente desarrollan nuevos productos, con el objetivo de ofrecer comodidad y eficacia en las mejores condiciones, para que el cliente realice sus operaciones bancarias. Tanto el cliente particular a trav&eacute;s de FONATLANTICO como las empresas a trav&eacute;s de ATLANTICO XXI o LINEATLANTICO, sea cual sea su dimensi&oacute;n, encuentran, a trav&eacute;s de la banca Electr&oacute;nica, la posibilidad de efectuar cualquier consulta o transacci&oacute;n desde su propio domicilio, con m&aacute;s efectividad y total seguridad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cualquier particular que disponga de una tarjeta de cr&eacute;dito o d&eacute;bito emitida por Banco Atl&aacute;ntico puede registrarse al servicio Vi@tlantico. Una vez se haya registrado, puede conectarse al servicio a trav&eacute;s del icono de la p&aacute;gina principal. Ahora bien, ser&aacute; necesario que introduzca, cuando le sea requerida, la identificaci&oacute;n de usuario y clave de acceso que le ha sido indicada durante el proceso de registro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la primera conexi&oacute;n, al cliente se le presenta un contrato electr&oacute;nico con las condiciones generales que regir&aacute;n el uso del servicio, que deber&aacute; aceptar si desea operar con Vi@tlantico. Una vez aceptado, se le env&iacute;a a su domicilio el contrato de adhesi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El entorno en el que el cliente opera con Vi@tlantico es lo que se ha venido a denominar un "entorno seguro". Ello quiere decir que la informaci&oacute;n que viaja entre el ordenador del cliente y el del banco, lo hace de forma totalmente encriptada seg&uacute;n el protocolo SSL (Secure Sockets Layers) mediante una clave diferente cada vez que se conecte y s&oacute;lo conocida por ambos ordenadores. El acceso al servicio se realiza a trav&eacute;s de un c&oacute;digo de usuario y una clave confidencial que puede modificar, a su conveniencia, dentro de <A HREF="mailto:Vi@tlantico">Vi@tlantico</a>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para mayor seguridad, al tercer intento fallido de conexi&oacute;n, se desactiva el usuario, pudiendo ser desbloqueado por un procedimiento que se le indica al cliente.</P>
<P ALIGN="JUSTIFY">Un caso similar lo constituye el BCH. S&oacute;lo el cliente puede tener acceso a sus cuentas gracias a un sistema especial para su identificaci&oacute;n y una clave que &eacute;l generar&aacute; y s&oacute;lo &eacute;l conocer&aacute;.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Tambi&eacute;n las Cajas</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las Cajas de Ahorro tambi&eacute;n han sabido sacar provecho de la Red, lo que en principio parece estar en contradicci&oacute;n con su tradicional pol&iacute;tica, basada en el trato directo con el cliente.</P>
<P ALIGN="JUSTIFY">Sin embargo, su incursi&oacute;n en Internet se explica porque entienden que la Red puede constituir un canal complementario para dar todo tipo de facilidades, pero nunca sustitutorio de las oficinas, donde contin&uacute;an llevando a cabo las labores de asesoramiento y negociaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al igual que en el caso de los bancos, no falta la informaci&oacute;n corporativa y la que se refiere a los productos y servicios que comercializan. La Caixa Ourense (194.224.23.67), por ejemplo, brinda un servicio a sus clientes a trav&eacute;s del cual tambi&eacute;n pueden consultar el estado actual de sus posiciones de activo o pasivo, as&iacute; como realizar transferencias de fondos, a cuentas de la propia Caja o de otras entidades. De esa manera, los clientes pueden disfrutar de un mayor control sobre sus cuentas y sobre las operaciones que en ellas se realice, desde su domicilio o lugar de trabajo, sin esperas ni intermediarios.</P>
<P ALIGN="JUSTIFY">El Teleservicio de la Caixa Ourense ofrece una conexi&oacute;n directa a trav&eacute;s de la l&iacute;nea telef&oacute;nica con su centro de proceso de datos, por lo que las operaciones se realizan en tiempo real. Por ejemplo, si un cliente realiza una transferencia de fondos de su cuenta a otra de Caixa, el sistema autom&aacute;ticamente le efect&uacute;a el cargo del importe de la operaci&oacute;n, realizando en ese mismo instante el abono en la cuenta del destinatario.</P>
<P ALIGN="JUSTIFY">Para operar con el teleservicio, la Caixa Ourense facilita gratuitamente una aplicaci&oacute;n desarrollada bajo el sistema operativo para PC's m&aacute;s extendido en el mundo: Windows. Por si ello fuera poco, la Caixa se compromete a realizar el soporte t&eacute;cnico de la aplicaci&oacute;n, enviando al cliente peri&oacute;dicamente las nuevas versiones que del desarrollo de este producto inform&aacute;tico se produzcan.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora bien, las diferentes cajas que ya disponen de sus propias p&aacute;ginas en Internet mantienen algunas peculiaridades que les caracteriza y les diferencia de los bancos. En este sentido, destacan los apartados dedicados a la obra social y cultural. Ello es debido a que un porcentaje de los beneficios de las cajas se destina a esta labor. De ah&iacute; que pr&aacute;cticamente en todas las webs se pueden encontrar informaci&oacute;n acerca de las actividades que financian.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por mencionar alguna, destaca CajaSur Web ( <A HREF="http://www.cajasur.es/">www.cajasur.es</a> ). A trav&eacute;s de Internet facilita informaci&oacute;n sobre los datos m&aacute;s significativos de la entidad, su obra social y cultural, sus servicios y promociones, simulaciones financieras -de amortizaci&oacute;n de pr&eacute;stamos y de dep&oacute;sitos a plazos-, consulta de sus oficinas y cajeros, e, incluso, un paseo virtual por C&oacute;rdoba -su historia, sus rico arte y cultura, etc.-. Algo parecido a lo que se ofrece en las p&aacute;ginas web de la Caja de Ahorros de la Inmaculada ( <A HREF="http://www.cai.es/">www.cai.es</a> ).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un segundo elemento tambi&eacute;n caracter&iacute;stico es que las cajas se dirigen fundamentalmente a Pymes y a econom&iacute;as dom&eacute;sticas. Esta es la raz&oacute;n por la que los usuales servicios a&ntilde;adidos van desde un amplio escaparate de empresas y organizaciones, hasta el interesante servicio que facilita Caja Segovia ( <A HREF="http://www.cajasegovia.es/">www.cajasegovia.es</a> ): tel&eacute;fonos, horarios de autobuses y trenes, cartelera cinematogr&aacute;fica, etc. Todo ello, en un deseo por lograr superar el concepto de cliente particular.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por el momento no son muchas a&uacute;n las cajas que permiten realizar a trav&eacute;s de Internet operaciones de consulta y de movimientos de dinero, si bien es cuesti&oacute;n de tiempo. Pero alguna se puede encontrar. Es el caso de la Caja de Ahorros y Monte de Piedad de Extremadura ( <A HREF="http://www.cajaextremadura.es/">www.cajaextremadura.es</a> ), la cual pone a disposici&oacute;n de sus clientes una modalidad de <I>caja electr&oacute;nica</I>, denominada Servicash, que permite la realizaci&oacute;n de consultas y operaciones a trav&eacute;s de un ordenador personal con m&oacute;dem. Servicash est&aacute; disponible en dos modalidades: a trav&eacute;s de Internet, desde la p&aacute;gina web de la caja -que permite realizar consultas y operaciones conect&aacute;ndose en tiempo real con el ordenador de la caja-; con la instalaci&oacute;n de un programa en el PC del cliente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cabe destacar el hecho de que en el momento de formalizar el contrato con Kutxa ( <A HREF="http://www.kutxa.es/">www.kutxa.es</a> ), se otorga al cliente una firma electr&oacute;nica que debe usar para poder realizar operaciones.</P>
<P ALIGN="JUSTIFY">El servicio de la Kutxa -s&oacute;lo es requisito ser cliente- se ofrece en dos modalidades. Por una parte, aplicaci&oacute;n en su PC que permite gesti&oacute;n local sin conexi&oacute;n adem&aacute;s de la conexi&oacute;n con Kutxa. A trav&eacute;s de esta modalidad, existe tambi&eacute;n la posibilidad de gesti&oacute;n local de sus cuentas. La gesti&oacute;n local, algo en lo que a&uacute;n se est&aacute; trabajando, posibilita fundamentalmente trabajar con ficheros de extractos recibidos en una conexi&oacute;n previa.</P>
<P ALIGN="JUSTIFY">Por otra parte, la conexi&oacute;n a trav&eacute;s de Internet o Infov&iacute;a. Al conectarse con la Caja se solicita el c&oacute;digo de usuario y un PIN (n&uacute;mero secreto) que se facilita al usuario en el momento de contratar el servicio en Kutxa.</P>
<P ALIGN="JUSTIFY">Resulta gracioso e incluso sorpresivo el mensaje que aparece en las pantallas de los ordenadores que visitan el servidor web de Kutxa. En un momento dado -cuando menos te lo esperas-, la caja guipuzco&aacute;na te informa de la oferta de importes en pesetas y en Euros que hace a sus clientes hasta la fecha del 1 de enero de 1999, d&iacute;a en que las autoridades monetarias establecer&aacute;n el tipo de cambio definitivo de la peseta respecto al Euro. Por el momento, el cambio estimado en la Kutxa es de 1 Euro por cada 167,673 pesetas.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">¿Y las Cajas Rurales?</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las cajas rurales no se han querido quedar atr&aacute;s. Por ello, tambi&eacute;n se han lanzado a tomar posiciones en esta carrera y ya hay algunas que disponen de p&aacute;gina en Internet. El contenido de la pr&aacute;ctica totalidad de las webs sigue, por regla general, un esquema fijo que comprende informaci&oacute;n sobre la caja, productos y servicios, y acceso a la banca electr&oacute;nica, a trav&eacute;s de un software espec&iacute;fico que la propia caja facilita a sus clientes.</P>
<P ALIGN="JUSTIFY">Todas ofrecen una operatividad bancaria bastante completa, permitiendo la consulta y los movimientos de dinero en tiempo real. Sin embargo, tambi&eacute;n las hay que ofrecen otra serie de servicios de valor a&ntilde;adido, como es el caso de Caja Rural de Jal&oacute;n ( <A HREF="http://www.cajarural.com/cajalon/default.htm">www.cajarural.com/cajalon/default.htm</a> ) o el de Caja Rural de Soria ( <A HREF="http://www.cajarural.com/soria/index.htm">www.cajarural.com/soria/index.htm</a> ).</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">El entorno burs&aacute;til</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A ra&iacute;z de la Ley de Reforma del Mercado de Valores se constituy&oacute; Bancoval ( <A HREF="http://www.bancoval.es/">www.bancoval.es</a> ) en 1989 por un grupo de entidades financieras vinculadas al entorno burs&aacute;til. Su objetivo es, desde un primer momento, el desarrollo de las actividades de custodia y liquidaci&oacute;n de valores ejercidas con anterioridad por la Junta Sindical de la Bolsa de Madrid.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde el a&ntilde;o 1992, el banco lleva a cabo un proceso de diversificaci&oacute;n y ampliaci&oacute;n de su campo de actuaci&oacute;n, incorporando nuevos productos y servicios que le permiten presentar en la actualidad, a las entidades financieras, una oferta global e integrada capaz de cubrir cualquier necesidad en el &aacute;mbito de la inversi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La misi&oacute;n de Bancoval, tal y como se recoge en su p&aacute;gina web, es la prestaci&oacute;n de una oferta global de servicio de custodia, administraci&oacute;n y soporte operativo en relaci&oacute;n con las distintas actividades del proceso inversor que contribuye a la diferenciaci&oacute;n de las entidades financieras.</P>
<P ALIGN="JUSTIFY">Desde sus p&aacute;ginas en Internet, Bancoval tiene previsto ofrecer pr&oacute;ximamente la Banca Interactiva, lo que permitir&aacute; al inversor disponer de servicios bancarios integrados con mayor nivel de seguridad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La implantaci&oacute;n del sistema de Banca Interactiva se desarrollar&aacute; en tres fases: servicio de informaci&oacute;n de valores -los usuarios de este servicio podr&aacute;n acceder a la base de datos financiera del banco que contiene informaci&oacute;n sobre precios, cotizaciones y hechos relevantes de m&aacute;s de 4.000 activos negociados tanto en mercados nacionales como internacionales-, consulta individualizada de saldos y operaciones, y realizaci&oacute;n de transacciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esta Banca Interactiva se ha dise&ntilde;ado alrededor de las t&eacute;cnicas m&aacute;s avanzadas en lo que a seguridad y cifrado de datos se refiere. Para ello, se han establecido varios niveles de seguridad en funci&oacute;n del tipo de servicio que se quiera utilizar, con distintos sistemas de control de acceso para cada uno de ellos.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">El cliente cibern&eacute;tico</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La experiencia de Openbank ha facilitado un perfil del cliente internauta: "Activo, exigente, cr&iacute;tico. Nos da continuas recomendaciones para mejorar la p&aacute;gina, que puede ser muy bonita, pero si el cliente tarda tres pantallas en llegar al saldo ser&aacute; poco pr&aacute;ctica".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El cliente de este tipo de servicios tiene entre 35 y 45 a&ntilde;os; de clase media, media-alta; universitario y t&eacute;cnico; con m&aacute;s habilidades en nuevas tecnolog&iacute;as que el cliente tradicional; maneja tel&eacute;fono m&oacute;vil; dispone de ordenador y es usuario del cajero; y el 70% son hombres.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Comercio electr&oacute;nico</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Internet es hoy en d&iacute;a el mayor escaparate mundial de productos, donde miles de personas y empresas tienen la posibilidad de comprar y vender bienes y servicios cada d&iacute;a. Este fen&oacute;meno se explica por las indudables ventajas que presenta la Red para compradores y vendedores (horario de venta 24 horas, 365 d&iacute;as al a&ntilde;o; no hay barreras geogr&aacute;ficas; etc.).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El comercio electr&oacute;nico se define como la realizaci&oacute;n a distancia de las operaciones habituales entre un comprador y un vendedor mediante mecanismos basados en la inform&aacute;tica y en las telecomunicaciones. La r&aacute;pida proliferaci&oacute;n de este tipo de comercio se debe a la notable extensi&oacute;n de las redes de comunicaci&oacute;n, como Internet o Infov&iacute;a, por las que navegan millones de usuarios en busca de informaci&oacute;n, los cuales constituyen un colectivo de potenciales compradores de productos y servicios.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Inform&aacute;tica, libros, viajes, alimentaci&oacute;n, servicios financieros, etc., infinidad de productos y servicios de distintas empresas y marcas, expuestos en los escaparates de las denominadas «tiendas virtuales», tiendas que todas aquellas personas conectadas a Internet o Infov&iacute;a pueden visitar a cualquier hora del d&iacute;a o de la noche, sin salir de casa, desde los ordenadores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Recientemente, Banesto ( <A HREF="http://www.banesto.es/">www.banesto.es</a> ) y Compaq Computer firmaron un acuerdo para impulsar el desarrollo del comercio electr&oacute;nico en Espa&ntilde;a. Banesto -la primera entidad financiera en desarrollar un sistema de pagos en nuestro pa&iacute;s a principios de 1996- dispone en la red de un Internet TPVV (Terminal Punto de Venta Virtual) que le permite efectuar la gesti&oacute;n de pagos en las empresas y comercios que lo soliciten.</P>
<P ALIGN="JUSTIFY">Compaq ( <A HREF="http://www.compaq.com/">www.compaq.com</a> ) ofrece a los comercios y empresas que deseen vender sus productos o servicios en la red la posibilidad de realizar operaciones de comercio electr&oacute;nico completas, lo que supondr&iacute;a el paso definitivo la puesta en marcha de un negocio virtual. A trav&eacute;s de su TPVV, Banesto gestiona de una manera segura y fiable las transacciones de cobros y pagos que se efect&uacute;an a trav&eacute;s de Internet.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">La Tienda Virtual</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra idea es facilitar las cosas a las empresas. Para ello, se busca poner juntos el mayor n&uacute;mero de elementos necesarios (equipos, software y sistema de pagos) para que cualquier negocio, con un m&iacute;nimo de inversi&oacute;n y de conocimientos, pueda montar su propia tienda virtual.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En esta l&iacute;nea, el Banco Sabadell ( <A HREF="http://www.bancsabadell.es/">www.bancsabadell.es</a> ) facilita a sus clientes la creaci&oacute;n de su propia tienda virtual en Internet y se ocupa de poner su comercio en la Red, ofreci&eacute;ndole una soluci&oacute;n completa que incluye la construcci&oacute;n de la tienda virtual y la integraci&oacute;n del Medio de Pago (a&uacute;n no disponible). El Banco Sabadell dispone de varias alternativas para introducir el negocio en Internet. Desde la entidad financiera se ofrece la soluci&oacute;n completa de tienda virtual hasta el medio de pago necesario para poder procesar transacciones de compra-venta en Internet.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Banco Sabadell participa en proyectos pioneros de Comercio Electr&oacute;nico con tecnolog&iacute;a SET (Secure Electronic Transaction), siendo el primer banco de Espa&ntilde;a que implant&oacute; en un comercio la mencionada tecnolog&iacute;a de forma real.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y es que el tema de la seguridad constituye un asunto importante para que el comercio electr&oacute;nico empiece a desarrollarse en nuestro pa&iacute;s de una vez por todas. Ya hoy en d&iacute;a, la informaci&oacute;n relacionada con los pagos que viaja por Internet lo hace encriptada, es decir, en clave, para evitar su uso fraudulento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El sistema que todo el mundo considera definitivo es el mencionado SET. Desarrollado por Visa, Mastercard y pr&aacute;cticamente todos los grandes bancos. Desde su despegue definitivo, a principios de 1998, y dado que toda la banca apost&oacute; pr&aacute;cticamente por &eacute;l, el comercio electr&oacute;nico experiment&oacute; un <I>boom</I> definitivo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El principal problema es que esto ha ocurrido a nivel mundial, lo que promete que la competencia, sin respetar fronteras, est&aacute; siendo feroz. Por ello, s&oacute;lo queda confiar en que los empresaros espa&ntilde;oles sepan sacarle el mayor provecho posible a este fen&oacute;nemo de Internet.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Supermercados virtuales</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como ha quedado patente, la entidad financiera se adentra de lleno en el campo del comercio electr&oacute;nico al introducir un espacio exclusivamente dedicado a la venta de productos por la red. La lucha por conseguir clientes est&aacute; llevando a algunas entidades financieras a convertir sus p&aacute;ginas web en aut&eacute;nticos supermercados virtuales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una de ellas es la de La Caixa que recienemente ha ampliado sus estanter&iacute;as virtuales para dar cabida a su secci&oacute;n de comercio electr&oacute;nico, bautizada como Caixa Shopping.</P>
<P ALIGN="JUSTIFY">De momento, s&oacute;lo se han ubicado en sus p&aacute;ginas cuatro tiendas –en las que se puede adquirir electr&oacute;nica de consumo, vinos del Pened&eacute;s, material escolar y merchandising de Televisi&oacute;n de Catalu&ntilde;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al pasar por caja s&oacute;lo se aceptan las tarjetas de la propia entidad y los gastos de env&iacute;o var&iacute;an entre las ochocientas y las mil pesetas por art&iacute;culo.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Adelantarse al resto</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero esta no es la primera experiencia de La Caixa con el comercio electr&oacute;nico, ya que, tal y como se ha mencionado con anterioridad- la entidad fue la pionera en nuestro pa&iacute;s en la venta de entradas para espect&aacute;culos a trav&eacute;s de Internet.</P>
<P ALIGN="JUSTIFY">Este servicio, que ha conseguido alzarse con el t&iacute;tulo de secci&oacute;n estrella dentro de la web, recibe cerca de seis mil peticiones mensuales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El negocio para La Caixa, tanto en su apartado de Caixa Shopping como en la venta de entradas, reside en el porcentaje que cobra de las transacciones de los comercios, a cambio de su tecnolog&iacute;a para realizar los pagos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Toda la estructura de transacciones electr&oacute;nicas est&aacute; protegida con un servidor seguro que encripta la informaci&oacute;n de datos personales y de las tarjetas de pago.</P></FONT></BODY>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

