<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet Básico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
Antonio Caravantes
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>El ancho de banda
</H3>
<P ALIGN=justify>
Este parece el tema cr&iacute;tico, especialmente a la hora de seleccionar un buen proveedor de acceso a Internet. Se supone que cuanto m&aacute;s ancho de banda, pues m&aacute;s rapidez de acceso, pero realmente ¿qu&eacute; significa todo esto?</P>
<P ALIGN="JUSTIFY">El ancho de banda se suele asimilar al di&aacute;metro de una tuber&iacute;a que sirviese para canalizar el flujo de datos. Pero esa simplificaci&oacute;n es excesiva. De entrada, el ancho de banda es la capacidad de una l&iacute;nea para transmitir informaci&oacute;n. Pero hay que tener en cuenta que la l&iacute;nea est&aacute; compartida frecuentemente por muchos usuarios. Por tanto nos sirve de muy poco saber el ancho de banda que tiene un proveedor... si no sabemos cuantos usuarios comparten esa l&iacute;nea en un momento determinado. Hay peque&ntilde;os proveedores con pocos clientes que utilizan una l&iacute;nea "estrecha"; sin embargo pueden ofrecer mejores tiempos de acceso que otros proveedores con canales m&aacute;s potentes, porque &eacute;stos tienen demasiados usuarios compartiendo la l&iacute;nea. La proporci&oacute;n es lo que cuenta, no el ancho en s&iacute; mismo.</P>
<P ALIGN="JUSTIFY">Luego est&aacute; el problema de que las l&iacute;neas utilizadas por los proveedores suelen ser l&iacute;neas del tipo <B>Frame</B> <B>Relay</B>. Esto significa que el ancho disponible no es siempre el mismo; de alguna manera la capacidad de la l&iacute;nea est&aacute; compartida. El proveedor contrata un ancho m&aacute;ximo, por el que paga muy poco; tambi&eacute;n contrata un ancho o caudal m&iacute;nimo garantizado (conocido como <B>CIR</B>) y por este concepto paga bastante m&aacute;s dinero. Estas l&iacute;neas Frame Relay son gestionadas de la siguiente forma: </P>
<P ALIGN="JUSTIFY">Cuando en todo el pa&iacute;s hay pocos usuarios accediendo a Internet (a las cinco de la madrugada) cualquier proveedor podr&iacute;a utilizar todo el ancho m&aacute;ximo que tiene contratado, porque los otros proveedores no est&aacute;n utilizando masivamente el sistema; pero precisamente por ser una hora intempestiva, ese proveedor tambi&eacute;n tendr&aacute; pocas necesidades, pocos clientes conectados. </P>
<P ALIGN="JUSTIFY">Por contra, en las horas con m&aacute;s uso de Internet todos los proveedores estar&aacute;n reclamando el m&aacute;ximo de tr&aacute;fico, por lo que la compa&ntilde;&iacute;a canalizadora solo ofrecer&aacute; a cada proveedor su CIR (o ancho m&iacute;nimo garantizado). As&iacute; pues, resulta que este valor CIR es mucho m&aacute;s crucial que el ancho de banda m&aacute;ximo, que es el valor publicitado por el proveedor para aparentar m&aacute;s capacidad. El CIR es siempre menor que el ancho de banda anunciado, solo que en algunos proveedores es la mitad, y en otros es la cent&eacute;sima parte. Salvo que suelas conectarte a las cinco de la madrugada, el factor cr&iacute;tico para elegir un proveedor es la relaci&oacute;n entre el CIR y el n&uacute;mero de conexiones simult&aacute;neas que tiene el proveedor en una hora punta. </P>
<P ALIGN="JUSTIFY">Pero los proveedores no suelen informar de los valores CIR contratados porque suelen avergonzarse de ellos; y no suelen aumentar su CIR porque &eacute;ste tiene un coste enorme. Tampoco suelen informar del n&uacute;mero de conexiones simultaneas disponibles (o el n&uacute;mero de internautas que tienen contratado el acceso) porque ello les lleva a un callej&oacute;n sin salida: si el n&uacute;mero de clientes parece demasiado alto, eso har&aacute; prever conexiones m&aacute;s lentas; si el n&uacute;mero de clientes parece bajo, eso provocar&aacute; desconfianza hacia el proveedor. Si el n&uacute;mero de conexiones disponibles es grande, podremos deducir que nos corresponder&aacute; menos cuota de transferencia; si el n&uacute;mero de conexiones es escaso, podremos sospechar que en m&aacute;s de una ocasi&oacute;n estar&aacute;n todas ocupadas y no podremos conectar... un foll&oacute;n que pocos proveedores resuelven con sinceridad. </P>
<P ALIGN="JUSTIFY">Adem&aacute;s de todo lo dicho hasta ahora, hay m&aacute;s problemas: la suma del ancho de banda de todos los proveedores nacionales es mucho mayor que la capacidad de las l&iacute;neas que conectan el pa&iacute;s con el resto de Internet. Aunque el proveedor funcione correctamente y no nos ralentice, ni siquiera podremos contar con ello, porque el cuello de botella suele estar en otro sitio.</P>
<P ALIGN="JUSTIFY">Si adem&aacute;s usas <B>Infov&iacute;a</B>, pues piensa que el proveedor tiene unas l&iacute;neas para conectarse a Internet y otras para conectarse a Infov&iacute;a (¡todas suelen ser l&iacute;neas Frame Relay!). Si ambas l&iacute;neas no est&aacute;n bien compensadas... una har&aacute; de freno respecto a la otra, por lo que se estar&aacute; desperdiciando ancho de banda en alg&uacute;n sitio. La fuerza de una cadena es la de su eslab&oacute;n m&aacute;s d&eacute;bil. Y la velocidad de una conexi&oacute;n es la de su tramo m&aacute;s lento (o m&aacute;s saturado). Cuando un proveedor anuncia tal ancho de banda... ¿se refiere a Internet o a Infov&iacute;a? </P>
<P ALIGN="JUSTIFY">Por &uacute;ltimo hay que considerar que las informaciones transmitidas por Internet no viajan en unidades compactas ni en series continuas. El fichero (o el conjunto de datos) es fragmentado en peque&ntilde;os paquetes de un tama&ntilde;o determinado; cada paquete contiene informaci&oacute;n del ordenador remitente y del destinatario; cada paquete hace el "viaje" por su cuenta; cuando todos los paquetes alcanzan el destino, el ordenador receptor recompone la informaci&oacute;n o el fichero. Junto con nuestros "paquetes" hay otros muchos que comparten la misma l&iacute;nea y que van dirigidos a otros ordenadores. El ancho de banda no es como una tuber&iacute;a, sino m&aacute;s bien como un telesilla muy r&aacute;pido (esta analog&iacute;a es original de <B>Nicholas</B> <B>Negroponte</B> en su libro "El mundo digital"). El problema es que hay demasiados paquetes compitiendo por subirse al telesilla, por lo que hay una largu&iacute;sima cola de acceso. Adem&aacute;s suele ocurrir que inexplicablemente hay paquetes que tardan demasiado en subirse al telesilla; parecen perezosos, poco diligentes o tontos que permiten a otros saltarse la cola. Y hay que hacer cola en m&aacute;s de seis telesillas para ir de California (Yankilandia) a Salamanca (Espa&ntilde;a). Para rizar el rizo, ocurre en algunas ocasiones que no todos los paquetes siguen la misma ruta para alcanzar el mismo destino. </P>
<P ALIGN="JUSTIFY">Cuando nuestra transferencia no se limita al servidor de nuestro proveedor, la informaci&oacute;n debe recorrer un largo e incierto viaje por el mundo (en el m&aacute;s literal sentido de la palabra: algunas veces la informaci&oacute;n da la vuelta al mundo o casi). Si una de las estaciones se encuentra ocupada o falla, el proceso queda detenido. El proveedor puede contar la versi&oacute;n que quiera, pero suele ser cierto que nunca conseguimos velocidades de transferencia razonables. Si cambias de m&oacute;dem por otro que tenga el doble de velocidad, puedes tener por seguro que no conseguir&aacute;s transferencias en la mitad de tiempo.</FONT> </P></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetc.htm"><font FACE="ARIAL"><B>[Internet Básico]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

