<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>S</B></font><FONT color="#000000" size=2 face="arial"><B>eguridad</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo cedido al fanzine

</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>Introducción al PGP.
</H3>
<P ALIGN=justify>

PGP es el sistema de criptolog&iacute;a m&aacute;s difundido para proteger la confidencialidad de tus comunicaciones. Usando tu correo normalmente, tus mensajes est&aacute;n totalmente al descubierto para que potencialmente puedan ser ojeados por m&aacute;s personas que pueden intervenir en el recorrido de la informaci&oacute;n, como tu proveedor, por ejemplo. De hecho el correo e-mail equivale a mandar tarjetas postales en vez de hacerlo con sobre, por esta raz&oacute;n, es bastante conveniente acostumbrarse a usar un sistema como PGP que asegura la intimidad de las comunicaciones con bastante fiabilidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La historia de la creaci&oacute;n y difusi&oacute;n del Pretty Good Privacy est&aacute; llena de episodios curiosos y de presiones oficiales. En la actualidad es dif&iacute;cil saber si este sistema es inviolable del todo, pero lo que es seguro es que si lo es un porcentaje muy alto, hasta el punto que se puede asegurar que la duda s&oacute;lo recae a nivel de agencias de seguridad gubernamentales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un falso inconveniente para el uso del PGP puede ser la familiarizaci&oacute;n con &eacute;l. En realidad el uso es muy sencillo y se aconseja hacerlo desde el DOS, pero si la cosa estriba en que somos realmente patosillos para esto de los ordenadores, esto queda muy solventado por un buen surtido de programas que lo hacen correr bajo Windows, e incluso lo integran en populares programas de correo o news, como Eudora, Pegasus o Free Agent.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El sistema en s&iacute; es bastante simple: el PGP encripta cualquier mensaje o fichero mediante dos llaves personalizadas; una ser&aacute; de dominio p&uacute;blico, y otra ser&aacute; s&oacute;lo del usuario. Estas llaves son un trozo de informaci&oacute;n encriptada, una las cuales es adosada al final de tu mensaje, pegando ese trozo de informaci&oacute;n encriptada tal como si fuera una firma. Cualquier usuario al que mandes un mensaje encriptar&aacute; su respuesta con esa llave que previamente tu le has suministrado, te lo mandar&aacute; y luego t&uacute; y s&oacute;lo t&uacute; ser&aacute;s capaz de descifrarlo por que eres el &uacute;nico que tiene la segunda llave. A su vez como ese usuario estar&aacute; usando PGP, te suministrar&aacute; con su 1ª respuesta su propia llave p&uacute;blica, y es entonces cuando se inicia ya la comunicaci&oacute;n encriptada. Todas la llaves quedan almacenadas en una especie de list&iacute;n que posibilita automatizar las operaciones. El PGP te reconoce la persona y su llave. Esto que es largo de explicar, s&oacute;n exactamente dos clicks de mouse si integras PGP en Eudora o en otros programas para Windows, o sea completamente autom&aacute;tico.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=1><P ALIGN="CENTER">(Extra&iacute;do de "PGP Anonimato y Privacidad" http://personal.redestb.es/alakarga/pgp.htm. Cortes&iacute;a del autor alakarga@redestb.es )</P>
</B></FONT>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetd.htm"><font FACE="ARIAL"><B>[Seguridad]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

