<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:srd@sandra.retemail.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>


<FONT color="#000000"><br><br><br>
<H3>Expo Internet 98
</H3>
<P ALIGN=justify>
<P ALIGN="JUSTIFY">Desde hace unos a&ntilde;os se lleva realizando en el Palau Sant Jordi de Barcelona la feria Expo Internet. En ella, los mas reconocidos (o los que m&aacute;s han pagado) servidores, proveedores de productos relacionados con l@ red, revistas que dedican total o parcialmente sus paginas a internet, o empresas con p&aacute;ginas y servicios on-line notables hacen aparici&oacute;n durante 4 d&iacute;as en un stand con m&uacute;ltiples ordenadores conectados mostrando todo lo que han de mostrar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este a&ntilde;o todos ellos no han faltado a la cita y un servidor ha estado ah&iacute; para hablarles de los mas importante que ah&iacute; se present&oacute;.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Explorer VS Netscape</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de maldecir en voz baja a los del bar por el precio de una simple cola, me dispuse a hacer una visita r&aacute;pida a los distintos stands para despu&eacute;s irme parando. Y ya aprovechando que me iba a pasar de forma fugaz por todos los stands, me entro por hacer algo que llevaba dudando unos d&iacute;as antes de ir; ¿que explorador seria el mas usado?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Yo cre&iacute;a que Netscape ser&iacute;a el m&aacute;s usado; no dejan de salir noticias de que si IE tiene problemas de seguridad, que si Bill Gates nos quiere dominar, que si el Netscape no comete fallos... Y quise contarlo, pero me fue imposible; tan solo dos stands ten&iacute;an en funcionamiento uno de ellos. And the winner is... ¡Netscape! Si no me equivoco (y creo que no lo hago) solo los stands de Netscape (...) y el de La Caixa lo ten&iacute;an. Bueno, no me fij&eacute; en cual usaban los veintipico ordenadores de una conferencia en la que estaban ense&ntilde;ando a hacer algo (no s&eacute; de que iba, no todos tenemos el d&iacute;a libre), pero creo que era IE, aunque no se pod&iacute;a considerar del todo un stand.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y la verdad es que no se mostraron grandes cosas en los distintos stands. Los m&aacute;s destacados, seg&uacute;n mi inter&eacute;s personal, fueron los de La Caixa, con su L&iacute;nea Oberta, mediante entre otras cosas puedes comprobar desde cualquier ordenador conectado a la red el estado de tu cuenta corriente, y el que fue lo m&aacute;s importante, la creme de la creme de todo, el de Retevisi&oacute;n y su innovador "Iddeo!".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este sistema, seg&uacute;n me explic&oacute; detalladamente una amable se&ntilde;orita, es una nueva Infovia pero se diferencia en que no pertenece a Teletimo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seg&uacute;n parece al ser un sistema m&aacute;s nuevo que Infovia es, l&oacute;gicamente, m&aacute;s r&aacute;pido, tarda entre un 25 y un 50% menos en cargar cada Kb, y eso favorece mucho a la descarga de archivos y a las altas tarifas vigentes actualmente. Pero yo ya me conformo con saber que no tiene detr&aacute;s el descabellado plan de Telef&oacute;nica de aprovechar sus &uacute;ltimos a&ntilde;os de timo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y a parte de esta mejora en la rapidez, tambi&eacute;n y por el momento no se ha demostrado lo contrario tienen montado un sistema para permitir que si la principal por alg&uacute;n motivo se corta, la llamada pasa a una secundaria en cuesti&oacute;n de mil&eacute;simas y de esta forma no se corta ni se paraliza ni nada. Al contrario que la innombrable, parece que Retevision no piensa solo en el dinero. Pero, ¿durar&aacute; esto m&aacute;s all&aacute; del 2004, cuando todo el mundo se pase pitando a esta compa&ntilde;&iacute;a si tiene un m&iacute;nimo de honor por no seguir siendo una marioneta de Teletimo? Veremos.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Valoraci&oacute;n general</P></h4>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A mi parecer, casi todos los stands estaban all&iacute; por estar, como para decir "¡no me olvides!". ¿Y sin&oacute;, que hacia all&iacute; el stand de Netscape? ¿Qu&eacute; hac&iacute;an all&iacute; varios ordenadores para mostrar un explorador que todo el mundo conoce, si ya hab&iacute;a otros (OTRO, perd&oacute;n) que permit&iacute;an su uso? ¡Y encima es un software gratuito!</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y que hacia all&iacute; el stand de Telef&oacute;nica a parte de provocarme un agujero en el est&oacute;mago? Esta &uacute;ltima no tiene problemas de ser olvidada, y ya nadie est&aacute; interesado en entrar a Infovia despu&eacute;s de ver el cacho-stand de "Iddeo!" y sus incre&iacute;bles ofertas de suscripci&oacute;n (aunque no inclu&iacute;an el IVA)...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y El Pa&iacute;s Digital? ¿En serio mereci&oacute; la pena pagar por tener un stand para promocionar una web gratuita, y pagar a unas se&ntilde;oritas para que cuando alguien deje de usar el ordenador para todo menos para leer el peri&oacute;dico, poner la pagina principal de &eacute;ste?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y la gran ausencia; ¿d&oacute;nde estaba Microsoft para darnos una buena explicaci&oacute;n por sus problemillas de seguridad y para anunciar el patche ya creado para solucionarlo, y para darnos otra buena explicaci&oacute;n sobre los bloqueamientos de IE4.0 y Outlook que TODOS los d&iacute;as sufro?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡Sic! ¡Espa&ntilde;a va mal!</P></FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

