<HTML>
<BODY BGCOLOR="#FFFFFF">
<CENTER><IMG src="g_sec/z_inet.gif"></CENTER>
<BR>
<HR>
<IMG src="g_subsec/netaula.gif">
<HR>

<FONT color="#3399cc" size=2 face="arial" >
<img src="g_misc/69.gif" align=right>
<P align="right">

<B><I>
Artículo realizado por<br>
<A HREF="mailto:aalmansas.valeoclimati@nexo.es">Andrés Almansa</A>
</I></B>

</p>
<FONT color="#000000"><br><br><br>
<H3>Introducción a las redes (I).
</H3>
<P ALIGN=justify>
<img src="g_misc/c.gif" align=left><P ALIGN="JUSTIFY">
on toda certeza podr&iacute;amos encontrar infinidad de definiciones del concepto de &quot;RED&quot;, aunque realmente puede resultar muy confusa en muchas ocasiones, yo he seleccionado una, la cual creo se ajusta bastante a la realidad, y es la siguiente:</P>
<B><P ALIGN="JUSTIFY">Una red de computadoras es un sistema de comunicaciones de datos, distribuido f&iacute;sicamente, compuesto por dos o m&aacute;s dispositivos (computadores y perif&eacute;ricos), enlazados entre si a trav&eacute;s de un canal de comunicaci&oacute;n com&uacute;n a todos ellos, con el objetivo de la compartici&oacute;n de recursos, sean hardware o software.</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Partiendo de esta definici&oacute;n tan gen&eacute;rica, podr&iacute;amos hacer la siguiente clasificaci&oacute;n sobre las redes:</P>
<B><P ALIGN="JUSTIFY">Red de &aacute;rea local (LAN, Local Area Network):</P>
</B><P ALIGN="JUSTIFY">Utilizan generalmente medios de transmisi&oacute;n espec&iacute;ficos para enlaces locales (cables de par trenzados, coaxiales, fibra &oacute;ptica), normalmente tienen una cobertura que va desde un departamento o planta hasta un edificio. Los anchos de banda van normalmente desde los 4 Mbps (practicamente extinguidas) hasta los 100 Mbps (existen tecnolog&iacute;as que proporcionan mayores anchos de banda como ATM/155 Mbps a 622 Mbps, GigaEthernet/1000 Mbps,..).</P>
<P ALIGN="JUSTIFY">Existe una sociedad llamada IEEE (Institute of Electrical and Electronic Engineers) con base en los Estados Unidos, que desarrollan entre otras cosas, normas para la comunicaci&oacute;n de datos, en concreto los comites 802.X del IEEE son los responsables de los desarrollos de los bocetos para las LAN,s, pasando posteriormente al Instituto Norteamericano de Normalizaci&oacute;n ANSI (American National Standards Institute) para su aprobaci&oacute;n, asi mismo el IEEE tambi&eacute;n envia los bocetos a la Organizaci&oacute;n Internacional de Normalizaci&oacute;n ISO (International Organization for Standarization).</P>
<B>Red de &aacute;rea metropolitana (MAN, Metropolitan Area Network):
</B><P ALIGN="JUSTIFY">Interconectan redes de &aacute;rea local (LAN,s) normalmente a trav&eacute;s de un segmento o anillo central de alta velocidad (100/200 Mbps). Principalmente su cobertura es la de un campus universitario, un pol&iacute;gono, etc. Cabe se&ntilde;alar que normalmente estas redes se suelen construir sobre sistemas de fibra &oacute;ptica y tambi&eacute;n sistemas de microondas.</P>
<B>Red de &aacute;rea extensa (WAN, Wide Area Network):</P>
</B><P ALIGN="JUSTIFY">La forma un sistema de comunicaci&oacute;n que interconecta sistemas de computadoras geogr&aacute;ficamente remotos, para esta interconexi&oacute;n se utilizan redes de transmisi&oacute;n de voz y datos (p&uacute;blicas o privadas).</P>
<P ALIGN="JUSTIFY">La normalizaci&oacute;n de estos enlaces  y sus dispositivos viene determinado por las normas &quot;X&quot; y &quot;V&quot; del CCITT. El ancho de banda para estas redes esta entre 1,2 Kbps y los 2 Mbps, dependiendo del tipo de interconexi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Dentro de estos conceptos es evidente que &quot;Internet&quot;, por supuesto entrar&iacute;a en la categor&iacute;a de una WAN, pero a&uacute;n m&aacute;s all&aacute;, un WAN de alcance mundial, global. Pero bajo mi punto de vista existe otra categor&iacute;a que podr&iacute;amos llamar Red Corporativa o tambi&eacute;n lo que hoy se podr&iacute;a llamar &quot;Intranet&quot;, aunque los dos conceptos no son exactamente los mismos.</P>
<B><P ALIGN="JUSTIFY">Red Corporativa / Intranet.</P>
</B><P ALIGN="JUSTIFY">La estrategia de construcci&oacute;n de las redes corporativas podr&iacute;a ser considerada en un principio como la evoluci&oacute;n de la inform&aacute;tica de los grupos de trabajo en las grandes compa&ntilde;&iacute;as, que tend&iacute;an a la integraci&oacute;n de todas las computadoras dentro de la red. Por tanto el &aacute;mbito de las redes corporativas incluye toda la serie de redes que componen la telara&ntilde;a empresarial <B>(LAN,s, WAN,s, MAN,s, etc.</B>), tambi&eacute;n pretende integrar todos los sistemas de una organizaci&oacute;n, donde existen todo tipo de computadoras (<B>DOS, OS/2, Macintosh, UNIX Workstations, miniordenadores, mainframes, etc.).</P>
</B><P ALIGN="JUSTIFY">Una red corporativa deber&iacute;a asemejarse a una plataforma de conexi&oacute;n y trabajo que ofreciera la conectividad necesaria a una organizaci&oacute;n que desea conectar cualquiera de sus recursos inform&aacute;ticos.</P>
<B><P ALIGN="JUSTIFY">Dentro de esta plataforma se contemplan toda clase de protocolos de red (SNA, DECNet, TCP/IP, IPX/SPX, NetBios, etc.), utilizando toda clase de pasarelas (gateways), y con diversas topolog&iacute;as (estrella, anillo, bus, etc.), dispositivos de interconexi&oacute;n (ROUTERS,MODEMS, REMOTE UNITS, HUB,s, MAU,s, SWITCHES, etc.).</P>
</B><P ALIGN="JUSTIFY">Por otra parte en la definici&oacute;n de lo que ser&iacute;a una &quot;Intranet&quot;, deber&iacute;a tener presentes los mismos objetivos que una red corporativa, puesto que lo es, pero con la peculiaridad de utilizar los mismos protocolos de red que se utilizan en &quot;Internet&quot;, en definitiva TCP/IP. En el caso de Intranets, estamos hablando de un &uacute;nico protocolo transparente para todos los sistemas a interconectar, y que al mismo tiempo nos va a permitir el acceso a Internet sin ning&uacute;n tipo de problema, puesto que utilizamos sus propios est&aacute;ndares, dentro de los mismos podemos por ejemplo estar hablando de la utilizaci&oacute;n de navegadores para acceder a nuestras aplicaciones corporativas, podemos estar hablando de la utilizaci&oacute;n extensa del File Transfer Protocol, podemos estar hablando de  conexiones r&aacute;pidas v&iacute;a Telnet (TN5250, TN3270, etc.), y al mismo tiempo permitir que personas ajenas a nuestra empresa puedan acceder a nuestras bases de datos de producto, en definitiva a nuestra Web.</P>
<B><P ALIGN="JUSTIFY">Por tanto, la diferencia entre Red Corporativa e Intranet, se encuentra no tanto en los objetivos a conseguir como en las caracter&iacute;sticas t&eacute;cnicas que  caracterizan a ambas. Podemos ver que en una red corporativa estamos hablando normalmente (no por propio concepto) de distintos protocolos de red, de transporte etc, mientras que una Intranet cumple normalmente la simplificaci&oacute;n a uno solo de ellos (no por propio concepto).</P>
</B><P ALIGN="JUSTIFY">En definitiva el concepto de red plasmado al inicio de este art&iacute;culo es v&aacute;lido para todos los tipos de redes, puesto que al final en todos los casos se persiguen dichos objetivos.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Los componentes de una red.</h4>
<P ALIGN="JUSTIFY">Pero en definitiva todos los conceptos expuestos anteriormente son solo pura teor&iacute;a sino tenemos en cuenta los componentes b&aacute;sicos de una red, los cuales establecen los pilares b&aacute;sicos de todas las infraestructuras expuestas anteriormente.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Hardware de una red.</h4>
<P ALIGN="JUSTIFY">Como parte fundamental de la red es evidente que los <B>ordenadores</B> son la esencia de la misma, si los dejamos fuera, la red no tiene sentido alguno.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los <B>servidores</B> ser&iacute;an aquellos en los cuales se centralizan todos los recursos f&iacute;sicos y l&oacute;gicos, estos pueden ser accedidos y compartidos por todos aquellos usuarios que acceden a la red.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De servidores tenemos para elegir, pero b&aacute;sicamente los m&aacute;s importantes son:</P>
<P ALIGN="JUSTIFY"></P>
<UL><DIR>
<DIR>
<UL>
<LI><P ALIGN="JUSTIFY">De ficheros.</LI>
<LI><P ALIGN="JUSTIFY">De&#9; impresi&oacute;n</LI>
<LI><P ALIGN="JUSTIFY">De comunicaciones</LI>
<LI><P ALIGN="JUSTIFY">De aplicaciones</LI>
</UL>
</DIR>
</DIR>
</UL>
<P ALIGN="JUSTIFY">Y aunque estar&iacute;a incluido probablemente en los anteriores, dada su importancia, podr&iacute;amos hablar de servidores de acceso a internet (proxys, firewalls, sockets, etc.).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las <B>estaciones de trabajo</B> (workstations) son realmente las que utilizan los usuarios para conectarse a la red, y m&aacute;s concretamente a los servidores, aunque podr&iacute;amos decir que a todos los recursos disponibles y para los cuales tiene permiso. Normalmente estamos hablando de PC,s, los cuales ejecutan distintos sistemas operativos, aunque podemos tambi&eacute;n hablar de estaciones de alto rendimiento (UNIX workstation), tambi&eacute;n terminales &quot;no inteligentes&quot;, (Infowindows para AS/400, 3270, etc).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los <B>perif&eacute;ricos </B>forman parte de todo el entramado f&iacute;sico de la red, y de suma importancia para la misma, si cabe a&uacute;n m&aacute;s hoy en d&iacute;a, puesto que en muchos casos admiten la conexi&oacute;n directa a la red, trabajando con los protocolos m&aacute;s extendidos, y proporcionando una inteligencia a la red considerable.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Generalmente cuando hablamos de perif&eacute;ricos nos referimos a Discos, impresoras, librer&iacute;as &oacute;pticas, modems, etc.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero existe un elemento que nos aporta toda la inteligencia suprema en las redes: <B>las tarjetas de red </B>hacen posible la conexi&oacute;n de los ordenadores a la red, se encargan de proporcionar y gestionar el acceso al canal de comunicaci&oacute;n, son dependientes de la m&aacute;quina, del tipo de cableado y de la topolog&iacute;a que se utiliza.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los <B>cables</B> se utilizan para la interconexi&oacute;n de los equipos, el tipo de cable varia dependiendo de las distancias, el ancho de banda utilizado y las condiciones en las que se realizar&aacute; la transmisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los <B>armarios de distribuci&oacute;n de cableado (racks) </B>se utilizan para para tener centralizadas las interconexiones de nuestra red, atrav&eacute;s de HUB,s, MAU,s, SWITCHES, PANELES de cableado etc. De hecho nos ser&aacute;n muy &uacute;tiles a la hora de organizar y mantener nuestro sistema dentro de lo que llamamos cableado estructurado (tema para otro art&iacute;culo).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Finalmente podr&iacute;amos hablar de los <B>dispositivos de conexi&oacute;n</B>, los cuales nos permiten extender la red y poder sobrepasar las limitaciones que los cables nos imponen, tambi&eacute;n nos facilitan la creaci&oacute;n de segmentos de red e interconexi&oacute;n de redes con distintas tecnolog&iacute;as, generalmente estaremos hablando de <B>repetidores, switches, routers</B>, etc.</P>
<P ALIGN="JUSTIFY"></P>
<h4><P ALIGN="JUSTIFY">Software de una red.</h4>
<P ALIGN="JUSTIFY">Permiten, a trav&eacute;s de un soporte l&oacute;gico el correcto funcionamiento de la red, y lo constituyen una serie de elementos que por si solos no tendr&iacute;an fundamento en el concepto de red.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El sistema operativo del servidor </B>ser&iacute;a un componente crucial, puesto que pone su inteligencia a toda la gesti&oacute;n de los recursos disponibles en el sistema, los accesos por parte de los usuarios, la seguridad etc. El gran nucleo de toda esta inteligencia reside como no en el servidor, y una peque&ntilde;a parte en las estaciones de trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El sistema operativo del cliente</B> reside en las estaciones de trabajo y se encarga de hacer funcionar la misma, y proporcionar la conexi&oacute;n con el software de cliente.</P>
<B><P ALIGN="JUSTIFY">El Software de cliente de red</B> es la parte encargada de interceptar las llamadas realizadas al sistema operativo cliente y que est&aacute;n relacionadas con cualquier recurso remoto haciendo las peticiones correspondientes del servicio solicitado dependientes del sistema operativo del servidor.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Controlador o driver de comunicaciones </B>establece la uni&oacute;n entre la tarjeta de red y el software cliente, implementando el protocolo de comunicaci&oacute;n a utilizar (nivel 3 OSI), a&ntilde;adiendo informaci&oacute;n en paquetes y envi&aacute;ndolos al driver de la tarjeta para su distribuci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El controlador de LAN</B> es el interface entre la tarjeta de red y el controlador o driver de comunicaciones, trabaja a nivel de protocolo de enlace (nivel 2 OSI), es dependiente de la tarjeta de red utilizada para la estaci&oacute;n de trabajo, y podr&iacute;amos decir que es el que se comunica directamente con la tarjeta f&iacute;sica.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY"> Las Aplicaciones del cliente </B>son de distintas clases y son las que utilizan normalmente los usuarios en su trabajo diario (Word, Lotus, Excel, Access, etc.)</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Software de comunicaciones </B>proporciona los servicios de comunicaciones necesarios para la conexi&oacute;n de los nodos de la red, conexiones con puntos remotos, a mainframes, como pasarelas (gateways) encargadas de la conversi&oacute;n de formatos y protocolos, tambi&eacute;n como servidores de correo electr&oacute;nico que permitan la interconexi&oacute;n con otras LAN,s etc.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y por &uacute;ltimo una peque&ntilde;a explicaci&oacute;n del funcionamiento de peticiones en las LAN,s.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Sistemas de peticiones en las LAN,S</h4>
<P ALIGN="JUSTIFY">El <B>software cliente de red est&aacute; residente en la memoria de la estaci&oacute;n de trabajo, y es el encargado de la monitorizaci&oacute;n</B> de las peticiones de acceso realizadas por una aplicaci&oacute;n o usuario a los distintos servicios disponibles en la red (servidores de ficheros, impresi&oacute;n, comunicaciones, etc).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si la petici&oacute;n es a nivel de estaci&oacute;n de cliente, esta se pasa al sistema operativo local, pero si es remota el software cliente la intercepta y realiza una petici&oacute;n de servicio correspondiente al formato usado por sistema operativo del servidor, est&aacute; petici&oacute;n se pasa al controlador de comunicaciones encapsulandola en un paquete, utilizando un protocolo de comunicaciones y este al driver de la tarjeta de red, convirtiendose en una trama recibida por la tarjeta f&iacute;sica que realizar&aacute; la transmisi&oacute;n de la misma atrav&eacute;s del canal de comunicaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando el servidor de red reciba la petici&oacute;n a un recurso se producir&aacute; la respuesta en el camino inverso.</P>
<B><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Pienso que ya teneis una buena introducci&oacute;n sobre las redes, espero poder seguir escribiendo muchas cosas m&aacute;s sobre las mismas, hay muchas m&aacute;s  de las que os pensais, su funcionamiento me atrajo desde que las empec&eacute; a conocer.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hasta pronto</P>
<br>
</p>
<hr>
<FONT color="#000000" size=1 face="arial">
<P ALIGN=right>
<img src="g_misc/loglow.gif">
<P ALIGN=left>
<A HREF="inet.htm"><I>¡De vuelta a Macedonia Internet!</I></A>
<br>
<br>
<center>
<a href="http://www.ciudadfutura.com" target="_new"><img src="g_misc/logocf.gif" border=0 ></a> 
</center>

</HTML>

