<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet Básico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
¿Qué riesgos tiene el World Wide Web?
</H3>
<P ALIGN=justify>

Desafortunadamente, hay por qu&eacute; preocuparse. Existen riesgos de seguridad que afectan a los servidores WEB, a las redes de &aacute;rea local donde est&aacute;n conectados y a los inocentes usuarios de los navegadores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los riesgos son m&aacute;s serios desde la perspectiva de los Webmasters (administradores). En el momento en que instalas un servidor WEB, has abierto una ventana a tu red de &aacute;rea local donde toda Internet puede mirar. La mayor&iacute;a de visitantes se contentar&aacute;n con ver ventanas, pero unos pocos tratar&aacute;n de echar el ojo a cosas que no pusiste al alcance de todo el mundo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otros, no contentos con ver sin tocar, intentar&aacute;n forzar las ventanas y arrastrarse adentro. Los resultados pueden variar desde lo meramente vergonzante, como encontrarse una ma&ntilde;ana que las im&aacute;genes de tu p&aacute;gina WEB han sido cambiadas por algo obsceno, al da&ntilde;o ocasionado al ser robada en su totalidad la base de datos de clientes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es una m&aacute;xima en estos entornos que los fallos en el software abren agujeros de seguridad. Es una m&aacute;xima en los entornos de desarrolladores de programas, que los programas grandes y complejos contienen fallos. Desafortunadamente, los servidores WEB son programas grandes y complejos que pueden (y en ciertos casos se ha probado) contener agujeros de seguridad. Adem&aacute;s, la arquitectura abierta de los de los servidores WEB permiten que scripts CGI arbitrarios sean ejecutados en el servidor en respuesta a peticiones remotas. Cualquier script CGI instalado en tu servidor puede contener fallos, y cada fallo es un potencial agujero de seguridad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde el punto de vista de un administrador de red, un servidor WEB representa otro agujero potencial en la seguridad de su red local. El objetivo general en cuanto a seguridad de una red es mantener a los extra&ntilde;os fuera. A pesar de eso, la misi&oacute;n de un sitio WEB es proporcionar al mundo acceso controlado a tu red. La l&iacute;nea de separaci&oacute;n es dif&iacute;cil de trazar. Un servidor WEB mal configurado puede proporcionar un agujero al firewall (cortafuegos) del sistema mejor dise&ntilde;ado. Un firewall mal configurado puede hacer in&uacute;til un servidor WEB. Las cosas se complican en las intranets, donde el servidor WEB debe de estar configurado para reconocer y autentificar varios grupos de usuarios, cada cual con distintos privilegios de acceso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para el usuario final, navegar por el WWW puede parecerle seguro y an&oacute;nimo. Pues no es as&iacute;. Los controles ActiveX y los applets de Java introducen la posibilidad de que a trav&eacute;s de la navegaci&oacute;n se puedan colar virus u otra clase de software no deseado. Los controladores Active tambi&eacute;n tienen implicaciones para el administrador de red, a tal grado que los navegadores pueden llegar a ser una ruta de entrada que se salte el sistema cortafuegos y entren a la red de &aacute;rea local. Incluso sin contenido activo, el simple hecho de navegar deja un rastro electr&oacute;nico de los sitios visitados por el navegante, con los cuales, individuos sin escr&uacute;pulos pueden reconstruir un perfil muy exacto de los gustos y h&aacute;bitos del usuario.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ambos, usuario final y administradores de sitios WEB, deben preocuparse por la confidencialidad de los datos transmitidos v&iacute;a WEB. El protocolo TCP/IP no fue dise&ntilde;ado pensando en la seguridad; por lo tanto es vulnerable al espionaje en la red. Cuando se transmiten documentos confidenciales del servidor al navegador, o cuando el usuario final env&iacute;a informaci&oacute;n privada al servidor en un formulario, alguien m&aacute;s lo puede estar viendo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Finalmente, existen tres tipos de riesgo:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><b>1. Fallos o problemas de mala configuraci&oacute;n en los servidores WEB que permiten el acceso no autorizado de usuarios remotos a:</b></P>
<P ALIGN="JUSTIFY"></P>
<ul>
<li>Robar documentaci&oacute;n confidencial 
no puesta all&iacute; para ellos.</li>
<li><P ALIGN="JUSTIFY">Ejecutar comandos en la m&aacute;quina del servidor 
y con ello modificar el sistema.</li>
<li><P ALIGN="JUSTIFY">Obtener informaci&oacute;n acerca del 
ordenador servidor que permita entrar al sistema.</li>
<li><P ALIGN="JUSTIFY">Lanzar ataques de bloqueo que dejan 
la m&aacute;quina temporalmente in&uacute;til.</li>
</ul>
<P ALIGN="JUSTIFY"><b>2. Riesgos en los navegadores:</b></P>
<P ALIGN="JUSTIFY"></P>
<UL>
<LI><P ALIGN="JUSTIFY">Contenido activo que da&ntilde;a al navegador y al sistema del usuario, abre una brecha en la privacidad del usuario o simplemente crea muchas molestias.</LI>
<LI><P ALIGN="JUSTIFY">El mal uso de informaci&oacute;n personal intencionada o inintencionadamente proporcionada por el usuario final.</LI></UL>
<b><P ALIGN="JUSTIFY">3. Intercepci&oacute;n de datos enviados desde el navegador al servidor o viceversa mediante una intromisi&oacute;n en la red. Las intromisiones pueden darse en cualquier parte de la ruta entre el navegador y el servidor, incluyendo:</b> </P>
<P ALIGN="JUSTIFY"></P>
<ul><li><P ALIGN="JUSTIFY">La red donde se encuentra el navegador.</li>
<li>La red donde se encuentra el servidor (incluidas las intranets)</li>
<li><P ALIGN="JUSTIFY">El proveedor de Internet del usuario final.</li>
<li><P ALIGN="JUSTIFY">El proveedor de nuestro proveeedor.</li>
<li><P ALIGN="JUSTIFY">Cualquiera de los proveedores regionales de acceso.</li>
</ul>
<P ALIGN="JUSTIFY">Hay que hacer notar que los navegadores "seguros" y los servidores "seguros" est&aacute;n dise&ntilde;ados solamentepara proteger la informaci&oacute;n confidencial contra las intromisiones en la red. Son los sistemas de seguridad en ambas partes, los documentos confidenciales son vulnerables de ser interceptados.</P>
<br><br><B><FONT FACE="Arial" SIZE=1><P ALIGN="CENTER">(Extra&iacute;do de "The World Wide Web Security FAQ". http://www.w3.org/Security/Faq/wwwsf1.html del WWW Consortium)</P>
</B>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetc.htm"><font FACE="ARIAL"><B>[Internet Básico]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

