<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>S</B></font><FONT color="#000000" size=2 face="arial"><B>eguridad</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>FAQ PGP 5.5i ver:1.1.
</H3>
<P ALIGN=justify>
Esta FAQ incluye nociones b&aacute;sicas, instalaci&oacute;n y utilizaci&oacute;n. Este documento puede copiarse cuantas veces se quiera sin modificaciones y para fines no comerciales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">FAQ realizada por Antonio Montesinos (a.monte@jet.es).  Para adiciones o sugerencias utilizar la direcci&oacute;n e-mail.</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">¿Qu&eacute; es PGP?</LI>
<LI><p align="justify">¿Qu&eacute; utilidad tiene PGP?</LI>
<LI><p align="justify">¿Es fiable PGP?</LI>
<LI><p align="justify">¿Cu&aacute;nto cuesta el programa?</LI>
<LI><p align="justify">¿D&oacute;nde se puede conseguir?</LI>
<LI><p align="justify">¿C&oacute;mo funciona?</LI>
<LI><p align="justify">¿Qu&eacute; peligro existe de que alguien intercepte mi clave p&uacute;blica?</LI>
<LI><p align="justify">¿Qu&eacute; ocurre si alguien intercepta el mensaje PGP que me env&iacute;a otra persona?</LI>
<LI><p align="justify">¿Qu&eacute; ocurre si alguien intercepta el mensaje PGP que yo env&iacute;o a otra persona?</LI>
<LI><p align="justify">¿Qu&eacute; necesito para mandar un mensaje cifrado a otra persona?</LI>
<LI><p align="justify">¿C&oacute;mo se instala el programa?</LI>
<LI><p align="justify">¿Una vez instalado, qu&eacute;?</LI>
<LI><p align="justify">¿Con qu&eacute; programas de correo electr&oacute;nico se puede utilizar?</LI>
<LI><p align="justify">¿C&oacute;mo enviar un mensaje encriptado?</LI>
<LI><p align="justify">¿C&oacute;mo desencriptar un mensaje que me han enviado?</LI>
<LI><p align="justify">¿Qu&eacute; otros archivos se pueden codificar aparte de archivos de texto?</LI>
<LI><p align="justify">¿Puedo mandar un archivo codificado como adjunto en un mensaje de e-mail?</LI>
<LI><p align="justify">¿C&oacute;mo?</LI>
<LI><p align="justify">¿C&oacute;mo desencriptar un archivo adjunto que nos llegue por e-mail?</LI>
<LI><p align="justify">¿Qu&eacute; son las firmas digitales?</LI></UL>

<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; ES PGP?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">PGP (Pretty Good Privacy) es un programa que encripta la informaci&oacute;n digital (textos o cualquier otro tipo de archivo) y luego permite desencriptarla. Por ejemplo, un texto que diga "Hola, soy yo" quedar&iacute;a convertido en algo parecido a "DXCfg%/yfggER$%"</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; UTILIDAD TIENE PGP?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La principal es esconder informaci&oacute;n a ojos de otras personas que quieran tener acceso a ella. Su uso m&aacute;s com&uacute;n es con el correo electr&oacute;nico. Cuando se env&iacute;a un mensaje de correo electr&oacute;nico, ese mensaje pasa por muchos ordenadores antes de llegar a su destinatario.   Cualquier persona con acceso a esos ordenadores y con malas intenciones  podr&iacute;a tener acceso a los mensajes. Usando PGP los mensajes no viajan tal como se escribieron, sino que van codificados, decodific&aacute;ndose &uacute;nicamente en su destino.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿ES FIABLE PGP?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Actualmente es el sistema de encriptaci&oacute;n m&aacute;s utilizado. Miles de usuarios lo usan d&iacute;a a d&iacute;a para sus comunicaciones. Con respecto a su seguridad a&uacute;n no hay noticias fiables de que se haya conseguido romper una clave PGP. De hecho, se han realizado experimentos por parte de   conocidos cript&oacute;grafos para intentarlo con resultados negativos. De todas formas, cualquiera que lo consiga obtendr&aacute; una fama bastante sonada y la noticia correr&aacute; como la p&oacute;lvora entre los miles de usuarios que continuamente est&aacute;n al d&iacute;a de todo lo relacionado con PGP y la criptograf&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿CUANTO CUESTA EL PROGRAMA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">PGP es gratuito para usos no comerciales.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿D&Oacute;NDE SE PUEDE CONSEGUIR?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay montones de sitios en Internet para descargar PGP. En espa&ntilde;ol existe una de las mejores p&aacute;ginas sobre criptograf&iacute;a desde donde se enlaza con las p&aacute;ginas internacionales de descarga, aparte de contener gran cantidad de informaci&oacute;n. <FONT FACE="Courier">http:// <A HREF="http://www.kriptopolis.com/">>www.kriptopolis.com</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO FUNCIONA PGP?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">PGP funciona a trav&eacute;s de claves. Cada usuario tiene una clave propia y &uacute;nica que genera el propio programa. Esta clave est&aacute; partida en dos, una p&uacute;blica y otra privada. La clave p&uacute;blica, como su propio nombre indica, se puede hacer p&uacute;blica y hay que entregarla A AQUELLOS QUE NOS VAYAN A ENVIAR MENSAJES CIFRADOS. La clave privada hay que mantenerla en secreto y conviene sacarle copias de seguridad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando alguien nos vaya a enviar un mensaje cifrado con PGP tendr&aacute; que encriptarlo CON NUESTRA CLAVE P&Uacute;BLICA que le habremos proporcionado previamente por correo electr&oacute;nico o de otra forma.  </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; PELIGRO EXISTE DE QUE ALGUIEN INTERCEPTE MI CLAVE P&Uacute;BLICA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ninguno, ya que la clave p&uacute;blica no es nada sin la privada a efectos de desencriptar los mensajes.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; OCURRE SI ALGUIEN INTERCEPTA EL MENSAJE PGP QUE ME ENV&Iacute;A OTRA  PERSONA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nada. Lo &uacute;nico que obtendr&aacute; es un conjunto de caracteres extra&ntilde;os sin pies ni cabeza que no podr&aacute; desencriptar, ya que no posee la clave privada que es la pieza necesaria para poder convertir el mensaje a su forma original. S&oacute;lo cuando el mensaje llegue a su destino final podr&aacute;   ser desencriptado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; OCURRE SI ALGUIEN INTERCEPTA EL MENSAJE PGP QUE YO ENV&Iacute;O OTRA PERSONA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Absolutamente lo mismo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; NECESITO PARA MANDAR UN MENSAJE CIFRADO A OTRA PERSONA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El programa PGP y la clave p&uacute;blica de esa persona.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO SE INSTALA?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez el archivo de instalaci&oacute;n en nuestra m&aacute;quina hay que ejecutarlo. Siguiendo las instrucciones que aparecen en pantalla, el programa genera nuestras claves p&uacute;blica y privada durante el proceso de  instalaci&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando se generan las claves, PGP nos pide un password, de al menos 8 caracteres, para poder utilizarlas. Es conveniente recordar este password para poder luego desencriptar informaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿UNA VEZ INSTALADO, QU&Eacute;?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estaremos dispuestos para utilizar PGP. Lo primero es crear una copia de nuestras claves p&uacute;blica y privada. Estas claves est&aacute;n ubicadas en la carpeta del programa, que por defecto es:</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>
<DIR>
<DIR>

</FONT><FONT FACE="Courier" SIZE=2><P ALIGN="JUSTIFY">c:\Program Files\PGP\PGP55i</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Clave p&uacute;blica: pubring.pkr</P>
<P ALIGN="JUSTIFY">Clave privada: secring.skr</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P></DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="JUSTIFY">De todas formas, al cerrar el programa PGP se nos invita a crear una copia de seguridad de las claves.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seguidamente exportaremos nuestra clave p&uacute;blica para poder entregarla adecuadamente a aquellos que nos vayan a enviar mensajes codificados. Para ello hay que abrir el programa PGP Keys, que est&aacute; en  </FONT><FONT FACE="Courier" SIZE=2>INICIO/PROGRAMS/PGP/PGP Keys</FONT><FONT FACE="Arial" SIZE=2>. Este programa es el que contiene las   claves de las personas a las que enviamos normalmente correo cifrado, lo que ocurre es que PGP incluye una serie de claves de ejemplo de unos se&ntilde;ores que no conocemos de nada y que se pueden borrar. Dentro de esa relaci&oacute;n aparecer&aacute; la nuestra. Se selecciona nuestra clave y se pulsa  en KEYS/EXPORT, en ese momento aparece un cuadro de di&aacute;logo pidi&eacute;ndonos donde guardar la clave. Ese archivo es el que deberemos enviar como nuestra clave p&uacute;blica.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿CON QU&Eacute; PROGRAMAS DE CORREO ELECTR&Oacute;NICO SE PUEDE UTILIZAR?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">PGP incorpora plug-ins para ser utilizado con Eudora, Exchange y Outlook, pero utilizando la opci&oacute;n "encriptar portapapeles" se puede utilizar con cualquier programa de correo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO ENVIAR UN MENSAJE ENCRIPTADO?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo primero que hay que hacer es obtener la clave p&uacute;blica de la persona a qui&eacute;n vamos a enviar el mensaje. Para ello se la podemos pedir directamente por e-mail o la podemos extraer de su   p&aacute;gina WEB si la tiene all&iacute; publicada. Una vez con su archivo de clave p&uacute;blica en nuestro ordenador hay que importarlo a PGP Keys. Para ello:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Colocaremos el archivo en una carpeta (por ejemplo la del PGP), </LI>
<LI><p align="justify">Abrimos PGP Keys (</FONT><FONT FACE="Courier" SIZE=2>INICIO/PROGRAMS/PGP/PGP Keys</FONT><FONT FACE="Arial" SIZE=2>)</LI>
<LI><p align="justify">Pulsamos </FONT><FONT FACE="Courier" SIZE=2>KEYS/IMPORT</LI>
</FONT><FONT FACE="Arial" SIZE=2><LI><p align="justify">En la ventana de di&aacute;logo se selecciona el tipo de archivo de la clave </FONT><FONT FACE="Courier" SIZE=2>(.txt/asc/pkr/skr...</FONT><FONT FACE="Arial" SIZE=2>) y se importa.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este proceso no tendremos que repetirlo m&aacute;s veces y su clave p&uacute;blica quedar&aacute; incorporada a nuestra relaci&oacute;n de claves.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estamos listos para enviar correo encriptado. Vamos a utilizar un programa que no est&eacute; soportado por PGP y lo haremos a trav&eacute;s del portapapeles, que es la forma m&aacute;s est&aacute;ndar y compatible de hacerlo y vale para todos los programas. </P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Lo primero es abrir el programa de correo (supongamos que es Netscape Messenger). Compondremos el mensaje normalmente, poniendo la direcci&oacute;n electr&oacute;nica y el asunto en su sitio y el texto en el  cuerpo del mensaje. </LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Una vez el texto acabado se selecciona y con las teclas </FONT><FONT FACE="Courier" SIZE=2>CONTROL+X</FONT><FONT FACE="Arial" SIZE=2> se corta al portapapeles. </LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Seguidamente pulsaremos en el icono que est&aacute; junto al reloj de Windows, en la barra de tareas (un icono con un sobre blanco en el centro). Si no tenemos ese icono, lo podemos activar pulsando en </FONT><FONT FACE="Courier" SIZE=2>INICIO/PROGRAMS/PGP/PGPtray</FONT><FONT FACE="Arial" SIZE=2>. </LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Del men&uacute; emergente habremos de pulsar en "Encrypt Clipboard". </LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">En ese momento se nos pregunta con qu&eacute; clave habremos de encriptar el texto. Selecionaremos la clave de la persona a la que vamos a enviar el mensaje haciendo doble click sobre ella. Seguidamente se pulsa en OK. En ese momento el contenido del portapapeles queda encriptado.</LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Pulsamos de nuevo en el cuerpo del mensaje, que estar&aacute; en blanco, y con las teclas </FONT><FONT FACE="Courier" SIZE=2>CONTROL+V</FONT><FONT FACE="Arial" SIZE=2> pegaremos el contenido del portapapeles al cuerpo del mensaje. Observaremos que el mensaje ahora es una serie de caracteres sin ning&uacute;n sentido.</LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Procederemos entonces a enviar el mensaje normalmente via e-mail.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO DESENCRIPTAR UN MENSAJE QUE ME HAN ENVIADO?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez abrimos el correo y vemos que tiene un mensaje encriptado procedemos a copiarlo &iacute;ntegro al portapapeles: </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Courier" SIZE=1>
-----BEGIN PGP MESSAGE-----<BR>
Version: PGPfreeware 5.5.3i for non-commercial use <BR>
&lt;http://www.pgpi.com&gt;<BR>
<BR>
qANQR1DBwU4DhZrHKiEmOtwQCACKcH+Cw1r2zcCaN6PAH5sK1ZjX5J4C1GjU8Q9G<BR>
ajMEhvbHEB9tpbjfBD3UO5oZ8QFBvCaWIgZtg9cF317OfA5UaIhArInzPMRxgmPD<BR>
cHpciZS+83EMkZGcMjFAZfqMgCQgb0+Is1Ng6rCtRqdRAZlpmr7ABCIe1QeEG+6P<BR>
P79vzE3yf0JihVjSWz6dfAQ9nmyHDkRSA9p8VCdBKOXK9xPZMufjnHTSBRdxHCHz<BR>
Y55iZVrwEy4uRDHto3vHLet0fDWDDfqQ2CFL3xLW+EB9N2UVmquOhBjcSQu/pouA<BR>
NR308f+ra0xGa0xLpXY4gaibx9TEQittfP1qgbHGQJOgZF+tCADzVFI8N4S6p04E<BR>
rIC/dmNaxBES8jnWyAcuqlmjV1vZdg0Nhv7ZeraPewG4Dsdzj0kqnBBhxYGOzboX<BR>
xTgicgZZIq30O23w910zvjyNuYXolUY/mwQIbrEzFDF42+M+CSd9C4dnb+GHmYU8<BR>
sbhazvlFfhSAweWSbpDsd0sNHz8VFQnzj8exWN7UDF0tUPhkl2ceL7aLRDaPW4Ea<BR>
jRcoMORlZpoUYQcpHhtRskFDL3qT+SsTpy3K72BRGX32CD8DtSEeah1hbJaj2HMj<BR>
EyRGmYIM1HrmFc+ZXQDBJy84X0VwnPazIlLjaJnpHd9OExvGIcer5LHE66Gu2WTP<BR>
UAnMw08QySNLgg6n2Uph+lKroCFvuG/W2toIWbGG+1TtbCxaA10IO7o7SQ==<BR>
=xtLd<BR>
-----END PGP MESSAGE-----<BR>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Incluyendo las l&iacute;neas:</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Courier" SIZE=1><P>-----BEGIN PGP MESSAGE-----<BR>
.<BR>
.<BR>
.<BR>
-----END PGP MESSAGE-----</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seguidamente pulsamos en el icono PGPtray y seleccionamos la opci&oacute;n "</FONT><FONT FACE="Courier" SIZE=2>Decrypt/Verify Clipboard</FONT><FONT FACE="Arial" SIZE=2>". En ese momento se nos solicita el password para poder utilizar nuestra clave. Al introducirlo veremos en pantalla el texto original.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; OTROS ARCHIVOS SE PUEDEN CODIFICAR APARTE DE ARCHIVOS DE TEXTO?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cualquier tipo de archivos.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿PUEDO MANDAR UN ARCHIVO CODIFICADO COMO ADJUNTO EN UN MENSAJE DE E-MAIL?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se puede y se recomienda si es informaci&oacute;n importante.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo primero es codificar el archivo y despu&eacute;s enviarlo normalmente como adjunto en un e-mail. Para ello PGP ha incluido su funci&oacute;n de codificaci&oacute;n en el men&uacute; emergente al utilizar el bot&oacute;n derecho del rat&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Localizar el archivo en la carpeta donde se encuentre.</LI>
<LI><p align="justify">Pulsar sobre &eacute;l con el bot&oacute;n derecho del rat&oacute;n.</LI>
<LI><p align="justify">Seleccionar "PGP"</LI>
<LI><p align="justify">Seleccionar "Encrypt"</LI>
<LI><p align="justify">Seleccionar la clave de la persona a la que se lo vamos a enviar haciendo doble click sobre ella.</LI>
<LI><p align="justify">Pulsar OK</LI>
<LI><p align="justify">En ese momento se crear&aacute; un archivo nuevo ya encriptado con la extensi&oacute;n PGP. Por ejemplo, si el archivo original se llamaba informe.xls, el nuevo archivo resultante quedar&aacute; como informe.xls.pgp. Ese es el archivo que deberemos enviar como adjunto.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿C&Oacute;MO DESENCRIPTAR UN ARCHIVO QUE NOS LLEGUE POR E-MAIL?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez el archivo en el disco duro hay que hacer doble click sobre &eacute;l y aparecer&aacute; el cuadro de di&aacute;logo para introducir nuestro password para usar la clave privada. Al hacerlo el archivo quedar&aacute; desencriptado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">¿QU&Eacute; SON LAS FIRMAS DIGITALES?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra funci&oacute;n de PGP que permite autentificar los documetos para garantizar que realmente proceden de la persona que lo env&iacute;a y no un falsificador que pueda haberlos modificado. La firma digital se activa igual que la encriptaci&oacute;n pero usando la opci&oacute;n "Sign". Incluso se pueden usar simult&aacute;neamente son "Encrypt &amp; Sign".</P></FONT></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetd.htm"><font FACE="ARIAL"><B>[Seguridad]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

