<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>



<H3>La presencia de los Fanzines en Internet: el caso español
</H3>
<P ALIGN=justify>
La presente comunicaci&oacute;n trata sobre la presencia en Espa&ntilde;a de los digizines en Internet, de esos que algunos te&oacute;ricos denominan medios de comunicaci&oacute;n alternativos.</P>
<P ALIGN="JUSTIFY">Mi intenci&oacute;n no es hablar de esas publicaciones situadas al margen del sistema comunicativo establecido, asociadas generalmente al t&eacute;rmino fanzine, sino de su presencia en Internet, de c&oacute;mo algunas de ellas han sabido aprovecharse de las nuevas tecnolog&iacute;as para salir de ese espacio marginal que ocupan y hacer llegar a sectores m&aacute;s amplios de la sociedad su b&uacute;squeda y estudio de formas diferentes de enfocar el mundo de la informaci&oacute;n.</P>
<h4><P ALIGN="JUSTIFY">Definición del concepto de fanzine</h4></P>
<P ALIGN="JUSTIFY">Desde el comienzo me asalt&oacute; una duda. ¿Qu&eacute; se entiende por fanzine? Se puede afirmar, sin miedo a equivocarnos, que existen tantas definiciones como personas traten de concretar su significado.</P>
<P ALIGN="JUSTIFY">Fanzine es una revista, tanto en papel como en disco o incluso en lenguaje HTML, que est&aacute; hecha por y para aficionados con precarios m&eacute;todos de trabajo y entre escasos ratos libres con la colaboraci&oacute;n, a veces, de los que la reciben. No son revistas profesionales y no pretenden competir con ellas, porque tratan con un n&uacute;mero muy limitado de receptores.</P>
<P ALIGN="JUSTIFY">En una l&iacute;nea similar se expresan los procursores de la publicaci&oacute;n <I>Bajo Tierra</I> "La idea de crear un fanzine nace del deseo de expresarse, de manifestarse y comunicarse con el objeto de recibir una respuesta. Nuestra intenci&oacute;n es servir de puerta de expresi&oacute;n escrita a los pensamientos y sentimientos de toda la juventud".</P>
<P ALIGN="JUSTIFY">Algo m&aacute;s te&oacute;rica ser&iacute;a la definici&oacute;n de Carlos Egia y Javier Bay&oacute;n: "Estas publicaciones se centran en la profundizaci&oacute;n del debate, an&aacute;lisis y reflexi&oacute;n en torno a diferentes cuestiones de inter&eacute;s pol&iacute;tico y social. Secundariamente, introducen tambi&eacute;n otro tipo de contenidos (m&uacute;sica, literatura, comics, etc.). Se podr&iacute;a decir, de alguna manera, que son la traslaci&oacute;n al &aacute;mbito contrainformativo de las revistas de informaci&oacute;n general que se pueden encontrar en los kioskos".</P>
<P ALIGN="JUSTIFY">Su esp&iacute;ritu s&iacute; se puede concretar un poco m&aacute;s. Tal y como se&ntilde;alan Carlos Egia y Javier Bay&oacute;n: "Estas experiencias comunicativas se empe&ntilde;an en enfrentar su dial&eacute;ctica a la del orden establecido, creando unos cauces de expresi&oacute;n propios. No s&oacute;lo son verdaderos &oacute;rganos de expresi&oacute;n y comunicaci&oacute;n de todos aquellos colectivos (formalizados como tales o no) que ven c&oacute;mo los grandes y peque&ntilde;os medios ocultan y vetan sistem&aacute;ticamente toda una gran parte de la realidad y del pensamiento social, sino que tambi&eacute;n el medio mismo se configura como alternativo en su estructura y funcionamiento".</P>
<h4><P ALIGN="JUSTIFY">Desarrollo de los fanzines en internet</P>
</h4>
<P ALIGN="JUSTIFY">En Espa&ntilde;a, el desarrollo del periodismo electr&oacute;nico, aunque comenz&oacute; en 1994 (a&ntilde;o en el que la revista cultural <I>El Temps</I> de Valencia se puso primero en Servicom y luego en Internet), no ha sido tan espectacular como en el resto de Europa, y dista bastante del auge que ha conocido en EEUU. Entre los factores que han influido en ello, cabe mencionar, a mi entender, el diferente nivel de h&aacute;bito de uso de los ordenadores y de las posibilidades de las conexiones telem&aacute;ticas. "Obviamente, estos h&aacute;bitos, muy relacionados con el parque de ordenadores de que dispone cada pa&iacute;s, y de la introducci&oacute;n de la inform&aacute;tica en la vida cotidiana, son diferentes de un pa&iacute;s a otro".</P>
<P ALIGN="JUSTIFY">Podr&iacute;amos discutir si la pantalla de un ordenador, con sus desventajas en lo que respecta a la legibilidad y la costumbre de los lectores frente al papel, y las l&iacute;neas telem&aacute;ticas, a&uacute;n de velocidad y capacidad muy limitadas, suponen una verdadera alternativa a los medios escritos y audiovisuales.</P>
<P ALIGN="JUSTIFY">Sin embargo, y tal y como queda reflejado en el t&iacute;tulo de la presente comunicaci&oacute;n, me gustar&iacute;a centrarme &uacute;nica y exclusivamente en un campo, dentro del periodismo electr&oacute;nico, cuyo desarrollo, por razones muy diversas, ha sido muy notable en lo que a la incorporaci&oacute;n a las nuevas formas del periodismo electr&oacute;nico interactivo se refiere. Si hasta ahora se ha hablado sobre todo de los servicios de informaci&oacute;n general (dependientes en su mayor&iacute;a de las principales empresas editoras de diarios) y servicios de informaci&oacute;n econ&oacute;mica (&uacute;nico campo informativo cuyo mercado presente y cuya rentabilidad son una realidad palpable), he de citar tambi&eacute;n el campo m&aacute;s <I>amateur</I>, las iniciativas m&aacute;s espont&aacute;neas de los fanzines (llamados en su versi&oacute;n electr&oacute;nica <I>digizines</I>).</P>
<P ALIGN="JUSTIFY">Resulta dif&iacute;cil saber qui&eacute;n fue el pionero de los fanzines espa&ntilde;oles en las redes telem&aacute;ticas hasta dibujar el panorama actual. Los primeros datan de 1996, mientras que los &uacute;ltimos en aparecer lo han hecho hace escasos dos meses.</P>
<P ALIGN="JUSTIFY">Ahora bien, todos ellos coinciden a la hora de corroborar que no se pod&iacute;a obviar que Internet, o la red de redes que agrupa de forma creciente a millones de ordenadores en todo el mundo, representaba un medio de comunicaci&oacute;n cuyo impacto global estaba siendo enorme. Esta fue una de las primeras razones que animaron a los fanzines a estar presente en la WWW (World Wide Web). Para Aitor Collado, responsable de la publicaci&oacute;n <I>Hip Hop A2Velas</I> ,"Internet pronto se convirti&oacute; en un instrumento con el que contactar con gente mucho m&aacute;s c&oacute;modo y r&aacute;pido que utilizando otros m&eacute;todos".</P>
<P ALIGN="JUSTIFY">Sin embargo, poco a poco fueron apareciendo otras poderosas razones que invitaban a hacer uso de Internet. As&iacute;, merecen una atenci&oacute;n especial las afirmaciones generalizadas de quienes opinaban que la utilizaci&oacute;n del ciberespacio pod&iacute;a suponer una forma &aacute;gil, barata y efectiva de comunicaci&oacute;n, coordinaci&oacute;n y lucha para diferentes grupos sociales que pretend&iacute;an un cambio social. Se suele dar como ejemplo de esta teor&iacute;a el caso del Ej&eacute;rcito Zapatista, cuyo mensaje se extendi&oacute; a los cinco continentes, posibilitando la denuncia y la movilizaci&oacute;n a nivel mundial.</P>
<P ALIGN="JUSTIFY">Por norma, y en un primer momento, la mayor&iacute;a de estas publicaciones en Internet tan s&oacute;lo constituyeron un «volcado» de los contenidos que aparec&iacute;an en la edici&oacute;n impresa de los mismos. Tal y como se&ntilde;alan desde el fanzine <I>NEO2</I>: "Nuestro medio real es el impreso en papel. Internet lo utilizamos como una herramienta de apoyo y para mantener viva nuestra publicaci&oacute;n, ya que la periodicidad impresa era demasiado irregular". Una idea tambi&eacute;n compartida desde la p&aacute;gina web de <I>Kastello</I> :"Nos decidimos por Internet para complementar la edici&oacute;n en papel en dos vertientes: promoci&oacute;n y comunicaci&oacute;n con lectores, colaboradores y otros fanzines".</P>
<P ALIGN="JUSTIFY">El tema de la eficacia y los bajos costes es, sin embargo, una de las razones m&aacute;s extendidas. As&iacute;, para los encargados del mantenimiento de la p&aacute;gina web de <I>PointBlank Magazine</I> :"Es el futuro y pr&aacute;cticamente el presente: r&aacute;pido, eficaz, inmediato, sin intermediarios ni grandes costes". Una opini&oacute;n compartida tambi&eacute;n desde <I>Miracles For Sale </I>: "Hac&iacute;amos el fanzine en papel (fotocopiado), pero creo que Internet es una forma m&aacute;s r&aacute;pida, f&aacute;cil y barata de publicarlo. Adem&aacute;s creemos que tiene un futuro tan interesante que no pod&iacute;amos quedarnos retrasados".</P>
<P ALIGN="JUSTIFY">El hecho es que en la actualidad son bastantes los grupos y movimientos sociales en Espa&ntilde;a que se han hecho un hueco en Internet, incorpor&aacute;ndose a este ciberespacio para utilizarlo, entre otras cosas, como una plataforma de difusi&oacute;n de sus ideas, planteamientos, teor&iacute;as o contenidos a trav&eacute;s de la WWW, sin olvidar, claro, sus or&iacute;genes y manteniendo las versiones impresas de sus fanzines. De cualquier manera, tambi&eacute;n se dio la aparici&oacute;n de estos medios de comunicaci&oacute;n alternativos que acabaron prescindiendo del soporte papel en la mayor&iacute;a de los casos.</P>
<P ALIGN="JUSTIFY">Al igual que en el caso de los fanzines en papel (impresos, fotocopiados o reproducidos de cualquir manera), los digizines o fanzines digitales, suelen ser obra de un solo individuo, o de un grupo reducido de individuos, fan&aacute;ticos (de ah&iacute; el nombre, que combina las raices «fan» y «[maga]zine») de una determinada forma de expresi&oacute;n cultural (cine, m&uacute;sica, comics, etc.), que editan, vali&eacute;ndose de medios al alcance de cualquiera, unas revistas sobre estos temas, que carecen de la formalidad, la distribuci&oacute;n y los recursos de las revistas producidas de forma profesional o industrial, pero que han resultado muy beneficiadas por la revoluci&oacute;n inform&aacute;tica. En primer lugar porque el abaratamiento y la popularizaci&oacute;n de las herramientas inform&aacute;ticas les permitieron, con un simple ordenador y un programa de autoedici&oacute;n, confeccionar una revista y dotarla de un aspecto que hasta ese momento s&oacute;lo se pod&iacute;an permitir los grandes medios, y evitarse adem&aacute;s los costes de dise&ntilde;o y maquetaci&oacute;n. Lo que hasta entonces era un proceso en la mayor parte de los casos manual, alcanz&oacute; con el auge de los ordenadores personales un nivel que muy pocos se aventuraban a pensar s&oacute;lo unos a&ntilde;os antes.</P>
<P ALIGN="JUSTIFY">Pero con eso s&oacute;lo se obten&iacute;a un original de calidad. Despu&eacute;s hab&iacute;a que hacer copias, impresas o multicopiadas, y luego hab&iacute;a que distribuirlas f&iacute;sicamente, lo cual, obviamente, complicaba el proceso y encarec&iacute;a los costes. Ese problema se soslaya con la posibilidad de transmitirlas mediante las redes telem&aacute;ticas, sobre todo a trav&eacute;s de Internet.</P>
<P ALIGN="JUSTIFY">La pr&aacute;ctica totalidad de los precursores de este tipo de publicaciones buscaron dar una nueva dimensi&oacute;n a sus fanzines. Orginalmente, estaban organizadas por grupos e individuos (miembros o no de una organizaci&oacute;n) que generaban res&uacute;menes de noticias de sus localidades -de forma breve y f&aacute;cil de traducir- para hacerlos llegar hasta otros grupos, logrando as&iacute; contactar m&aacute;s f&aacute;cilmente y difundir m&aacute;s eficientemente la informaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Sin embargo, pronto se dio el deseo de dar la bienvenida a nuevos lectores, nuevas contribuciones, que reflejaran puntos de vista similares a los que promulgaba la publicaci&oacute;n.</P>
<P ALIGN="JUSTIFY">La WWW supuso un cambio radical e importante ya que permiti&oacute; que los creadores de estos fanzines se aprovecharan de la difusi&oacute;n electr&oacute;nica que ofrec&iacute;a la gran ventaja de la rapidez y de su universalidad: un &uacute;nico ejemplar introducido en un servidor permit&iacute;a que todos los usuarios que lo desearan o tuvieran permiso pudieran acceder a &eacute;l. Adem&aacute;s contaba con la ventaja de no tener que preocuparse por los costes de impresi&oacute;n y distribuci&oacute;n.</P>
<P ALIGN="JUSTIFY">No obstante, a&uacute;n falta un largo camino para que la edici&oacute;n electr&oacute;nica y la transmisi&oacute;n en l&iacute;nea sustituyan de forma completa al papel. Por el momento, el porcentaje de fanzines que se producen &uacute;nica o principalmente en formato electr&oacute;nico es muy reducido. Ahora bien, las iniciativas que se han decidido por un servicio electr&oacute;nico complementario son muchas, y cada d&iacute;a m&aacute;s.</P>
<h4>
<P ALIGN="JUSTIFY">Análisis de los fanzines españoles presentes en internet</P>
</h4><P ALIGN="JUSTIFY">A riesgo de olvidarme de alguna publicaci&oacute;n, y a pesar de ser consciente de que, probablemente, a la hora de escribir estas l&iacute;neas algunos de los 57 t&iacute;tulos que han sido analizados hayan desaparecido o cambiado de forma y contenidos, y otros muchos, en cambio, hayan aparecido en el &iacute;nterin, he tratado de realizar un an&aacute;lisis lo m&aacute;s fiel posible del desarrollo que han conocido los fanzines dentro del periodimo electr&oacute;nico multimedia espa&ntilde;ol y de las caracter&iacute;sticas que presentan.</P>
<B><P ALIGN="JUSTIFY">1. Estructura organizativa</P>
</B><P ALIGN="JUSTIFY">La regla general en los fanzines es la ausencia de una estructura jer&aacute;rquica organizativa, caracter&iacute;stica de los medios de masas. Por norma general, no existe la figura del director, ni del redactor-jefe u otros cargos similares. Ello es debido, en gran medida, a la no profesionalidad de los miembros de la publicaci&oacute;n. Incluso en muchos de los casos, los componentes del equipo redaccional de estos fanzines son estudiantes (tanto de Institutos como de Universidades) que &uacute;nicamente le pueden dedicar a la publicaci&oacute;n el tiempo que sus otras obligaciones les permiten.</P>
<P ALIGN="JUSTIFY">Lo que si se da, en todo caso, es la existencia de individuos cuya competencia es reconocida por el resto del colectivo. Es el caso de aquellos miembros m&aacute;s formados y especializados que el resto en lo que se refiere al manejo de los nuevos recursos t&eacute;cnicos (creaci&oacute;n de la p&aacute;gina web, manejo del lenguaje HTML, etc.) o de otros &aacute;mbitos de conocimiento.</P>

<B><P ALIGN="JUSTIFY">2. Elementos del proceso redaccional y productivo</P>
<P ALIGN="JUSTIFY">2.1. El uso del lenguaje</P>
</B><P ALIGN="JUSTIFY">Sin entrar a valorar los contenidos, y d&aacute;ndonos una r&aacute;pida vuelta por las p&aacute;ginas webs iniciales de estos fanzines, se observa que existen una serie de elementos utilizados en la redacci&oacute;n de los textos que pueden ser considerados alternativos, en la medida en que no se encuentran en los medios oficiales. Un claro ejemplo de ello es el uso de la tan conocida @, que es empleada en lugar de los g&eacute;neros masculino y femenino.</P>
<P ALIGN="JUSTIFY">Dejando de lado las faltas de ortograf&iacute;a y de puntuaci&oacute;n, existen determinadas formas escritas que constituyen verdaderos mecanismos est&eacute;ticos, cuyo empleo se explica como el componente gr&aacute;fico que acompa&ntilde;a a un texto de naturaleza contestataria, en la mayor&iacute;a de las ocasiones. En algunos de los fanzines que cuentan con presencia en Internet, ello es patente en la propia cabecera. Como Ejemplos: <I>The Sorden,</I> <I>Corpore Insepulto</I>, <I>Margen</I>, <I>Kasa de la Muntanya</I>, <I>Dinamita Krisis</I>, <I>Aktivitat On-line</I>, etc.</P>
<P ALIGN="JUSTIFY">Cabe se&ntilde;alar que en ocasiones los propios nombres de los fanzines tratan de huir de la vulgaridad, de lo com&uacute;n, buscando un sello propio.</P>
<B>
<P ALIGN="JUSTIFY">2.2. El uso del idioma</P>
</B><P ALIGN="JUSTIFY">Es indudable que el castellano tiene una inclusi&oacute;n importante en muchos de estos fanzines, siendo la presencia de otros idiomas (catal&aacute;n, ingl&eacute;s, etc.) puramente testimonial. Esta actitud se explica en la medida en que la practica totalidad de estas publicaciones tienen difusi&oacute;n tambi&eacute;n en toda Espa&ntilde;a, no limit&aacute;ndose a una sola &aacute;rea geogr&aacute;fica.</P>
<P ALIGN="JUSTIFY">No faltan aquellos fanzines cuyo primer n&uacute;mero se hizo en m&aacute;s de una lengua, pero debido a la demanda, a partir del segundo ejemplar se limit&oacute; s&oacute;lo al castellano, en un deseo de llegar a m&aacute;s gente. No obstante, estas publicaciones no descartan que en un futuro inmediato se vuelva al empleo de m&aacute;s de un idioma en sus p&aacute;ginas webs.</P>
<P ALIGN="JUSTIFY">Por lo que respecta al uso del ingl&eacute;s, parece ser que s&oacute;lo un n&uacute;mero reducido de estos fanzines han contemplado la posibilidad de que sus contenidos interesen y sean visionados m&aacute;s all&aacute; de nuestras fronteras gracias a la universalidad que les ofrece Internet. De esa manera, huyen de una vocaci&oacute;n localista, aspirando inequ&iacute;vocamente a ser una publicaci&oacute;n internacional.</P>
<P ALIGN="JUSTIFY">De cualquier manera, tampoco faltan los fanzines en Internet que respetan el idioma originario en el que esos textos han sido remitidos a la revista, y donde es posible, se ofrecen en m&aacute;s de un idioma.</P>
<P ALIGN="JUSTIFY">Un caso destacable es el de <I>Crica: Aragonesismo alternatibo</I>, quien presenta la pr&aacute;ctica totalidad de sus contenidos en aragon&eacute;s.</P>
<B>
<P ALIGN="JUSTIFY">2.3. Las fuentes</P>
</B><P ALIGN="JUSTIFY">Las fuentes de los fanzines son, en un principio, todos aquellos puntos desde los que surge el proceso comunicativo. As&iacute;, est&aacute;n las aportaciones particulares, las de los grupos y movimientos sociales que remiten sus trabajos, y tambi&eacute;n las de los propios integrantes del equipo de redacci&oacute;n de la publicaci&oacute;n.</P>
<P ALIGN="JUSTIFY">En este tipo de publicaciones todos pueden participar expresando sus opiniones con total libertad y escribiendo art&iacute;culos interesantes sobre determinados temas que interesan a otras personas, como &eacute;l, de ese mundillo.</P>
<P ALIGN="JUSTIFY">Por norma, la forma en que se establece la relaci&oacute;n de las fuentes con el medio es la colaboraci&oacute;n espont&aacute;nea o la invitaci&oacute;n que el medio hace a personas o colectivos para que participen. A modo de ejemplo, en la p&aacute;gina web del fanzine <I>Ska Ska Ska</I> se puede leer: "Hemos dedicido titular as&iacute; la p&aacute;gina, pero en realidad queremos ir mucho m&aacute;s all&aacute;, pero eso depende tambi&eacute;n de vosotros. S&iacute;, necesitamos que nos ayudeis a mantener esta «page» al d&iacute;a, mandadme midis, fotos, art&iacute;culos, noticias, todo lo que querais, ya sea vuestro o que lo habeis encontrado por el ciberespacio. Bueno, mandadme cosillas, en cuanto tenga algo me pongo manos a la obra. La haremos entre tod@s".</P>
<P ALIGN="JUSTIFY">Tal y como se observa, la pr&aacute;ctica de recoger contenidos de otras publicaciones es com&uacute;n en su proceso comunicativo, convirti&eacute;ndose los propios fanzines en fuentes comunicativas entre ellas mismas.</P>
<P ALIGN="JUSTIFY">Por tanto, y gracias a la universalizaci&oacute;n del propio Internet, el contacto se da tanto a nivel local como nacional o internacional, estando en &eacute;l implicadas las propias publicaciones.</P>

<B><P ALIGN="JUSTIFY">2.4. La propiedad de los contenidos</P>
</B><P ALIGN="JUSTIFY">En la pr&aacute;ctica totalidad de este tipo de publicaciones, la propiedad intelectual de los contenidos a los que se tienen acceso no se respetan. En este sentido, lo que se puede leer en las p&aacute;ginas webs iniciales de estos fanzines es m&aacute;s bien una renuncia a la propiedad sobre los contenidos que se difunden, si bien se pide un reconocimiento hacia el origen del mensaje. Basta como ejemplo lo que se cita en la p&aacute;gina web del fanzine <I>Ekintza Zuzena</I>: "Todos los contenidos de esta p&aacute;gina carecen de copyright, y pueden ser libremente reproducidos, a ser posible citando su procedencia". Lo cual no es sino ejercer los derechos morales del autor, irrenunciables por otro lado.</P>

<B><P ALIGN="JUSTIFY">2.5. La est&eacute;tica</P>
</B><P ALIGN="JUSTIFY">Est&eacute;ticamente, la presencia de los fanzines en Internet se caracterizan por un acabado m&aacute;s o menos convencional, cercano a los c&aacute;nones que definen a otras publicaciones m&aacute;s de masas. Ello contrasta con lo que se podr&iacute;a definir como una est&eacute;tica «m&aacute;s ca&oacute;tica» que se refleja en las ediciones impresas de estos medios y que tiene una relaci&oacute;n m&aacute;s directa con la producci&oacute;n artesanal de la publicaci&oacute;n y con la no existencia de norma alguna a seguir en la maquetaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Ese acabado convencional es debido, en gran medida, al escaso margen de maniobrabilidad que deja Internet para realizar verdaderos dise&ntilde;os mas llamativos, teni&eacute;ndose que conformar, en muchas de las ocasiones, con limitados recursos t&eacute;cnicos. De hecho, &eacute;stos suelen ser propiedad de algunos de los integrantes del colectivo, o bien tiene acceso a ellos. Lo m&aacute;s corriente suele ser un ordenador y una impresora, si bien progresivamente se han incorporado nuevos elementos (escaners, etc.) y programas, lo que supone una cierta ruptura con la maquetaci&oacute;n manual o artesanal.</P>
<P ALIGN="JUSTIFY">De cualquier manera, un simple vistazo a las p&aacute;ginas webs de estos fanzines nos muestran tres elementos, cuyo uso, a&uacute;n limitado por la ralentizaci&oacute;n que suponen en la llegada de la informaci&oacute;n hasta el ordenador de quien las visita, est&aacute; vigente: la fotograf&iacute;a, ilustrativa y no informativa (que en ocasiones no son propiedad del fanzine, tom&aacute;ndola «prestada» de otras publicaciones); los dibujos; y los comics (cuyo uso como elemento gr&aacute;fico est&aacute; muy extendido).</P>

<B><P ALIGN="JUSTIFY">2.6. Las secciones</P>
</B><P ALIGN="JUSTIFY">La organizaci&oacute;n de los contenidos en los fanzines con presencia en Internet s&iacute; responde a una estructura de secciones m&aacute;s o menos definida, lo que les diferencia de las ediciones impresas de este tipo de publicaciones, en donde los art&iacute;culos se suceden sin que sea necesaria la existencia de un distintivo tem&aacute;tico orientativo.</P>
<P ALIGN="JUSTIFY">Ahora bien, hay que mencionar tambi&eacute;n la presencia en las redes telem&aacute;ticas de fanzines en los que no existe ese ordenamiento de los contenidos.</P>
<P ALIGN="JUSTIFY">Por norma, la distribuci&oacute;n «geogr&aacute;fica» de los temas que se tratan en los fanzines electr&oacute;nicos se asemeja bastante a la que se puede observar en cualquier otro tipo de publicaci&oacute;n electr&oacute;nica (diario, revista, etc.), con la existencia de secciones fijas: agenda, noticias, otros links, hemeroteca, etc.</P>

<B><P ALIGN="JUSTIFY">2.7. La periodicidad</P>
</B><P ALIGN="JUSTIFY">La periodicidad estricta no es algo fundamental en este tipo de publicaciones. De hecho, el concepto de "peri&oacute;dicas" ha comenzado a entrar en crisis con la expansi&oacute;n de la inform&aacute;tica y las redes telem&aacute;ticas. En efecto, la t&eacute;cnica no es ya obst&aacute;culo para que pudieran transmitirse, de forma pr&aacute;cticamente, instant&aacute;nea, noticias muy recientes y continuamente actualizadas. De hecho, un n&uacute;mero muy elevado de los fanzines analizados renuevan los contenidos constantemente en un deseo de responder y participar en las din&aacute;micas de las calles, de los movimientos sociales o abrirse a enfoques y temas nuevos. Valga como ejemplo la definici&oacute;n que de s&iacute; misma da la revista <I>Ezztanda</I>. "Atemporal y situada en este preciso momento. Somos conscientes de la importancia de la inmediatez dentro de la contra informaci&oacute;n, pero debido a lo ef&iacute;mero de nuestro trabajo amilitante hacemos lo que podemos y creemos que sigue mereciendo la pena".</P>
<P ALIGN="JUSTIFY">En ese sentido, no resulta del todo dif&iacute;cil pensar que para un colectivo con escasos medios y cuyo trabajo se basa en el voluntarismo no es f&aacute;cil salir a la calle en un espacio de tiempo corto y regular.</P>

<B><P ALIGN="JUSTIFY">3. Tem&aacute;tica y contenidos</P>
</B><P ALIGN="JUSTIFY">Normalmente, la mayor&iacute;a de estos fanzines que cuentan con una presencia en Internet tratan temas de todo tipo, si bien suelen estar muy espacializados. Tem&aacute;ticas hay muchas, pueden ir desde la cultura, la m&uacute;sica, el Rol, el Manga, los ordenadores, los juegos, etc. hasta los toros. No obstante, los hay tambi&eacute;n que abarcan bastantes temas, en un deseo por llegar a m&aacute;s lectores.</P>
<P ALIGN="JUSTIFY">Se entender&aacute; aqu&iacute; por cultura cualquier tipo de manifestaci&oacute;n cultural o art&iacute;stica: literatura, m&uacute;sica, poes&iacute;a, etc. Pero entendida, eso s&iacute;, como un tipo de cultura alternativa, que no tiene cabida en el resto de medios de comunicaci&oacute;n m&aacute;s convencionales o gen&eacute;ricos.</P>
<P ALIGN="JUSTIFY">La expresi&oacute;n cultural m&aacute;s presente en los fanzines analizados es la m&uacute;sica. Se trata de una tipo de m&uacute;sica alejada de los circuitos comerciales (punk, Hard Core, metal, etc.).</P>
<P ALIGN="JUSTIFY">Ahora bien, pese a ser el elemento cultural m&aacute;s presente en este tipo de publicaciones, no es el &uacute;nico, ya que la literatura, los comics, etc. cuentan tambi&eacute;n con su espacio.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n se pueden encontrar fanzines orientados hacia un determinado mensaje pol&iacute;tico o ideol&oacute;gico.</P>
<P ALIGN="JUSTIFY">Ahora bien, es necesario se&ntilde;alar que hay tambi&eacute;n otra serie de temas a los que se les presta tambi&eacute;n una atenci&oacute;n especial: los juegos de Rol y el Manga.</P>
<P ALIGN="JUSTIFY">Para concluir con este apartado, otro tipo de tem&aacute;ticas tienen una presencia m&aacute;s testimonial: juegos de Rol, el manga, ordenadores, toros, etc. respondiendo su existencia quiz&aacute; a un deseo de promocionar los temas abordados alej&aacute;ndose de los m&eacute;todos m&aacute;s convencionales y no cercanos al en torno en el que se generan estos fanzines.</P>
<P ALIGN="JUSTIFY">Una nota com&uacute;n en todos ellos es el humor, quiz&aacute; uno de los elementos definitorios de los fanzines, ya que se considera un instrumento muy valioso de cr&iacute;tica social.</P>

<B><P ALIGN="JUSTIFY">La procedencia y el p&uacute;blico</P>
</B><P ALIGN="JUSTIFY">La Comunidad de Madrid es la que m&aacute;s fanzines aporta a este estudio seguida de Catalu&ntilde;a, Arag&oacute;n, Andaluc&iacute;a y las Islas Baleares. Ahora bien, se puede confirmar la presencia de casi todas las comunidades aut&oacute;nomas, salvo alguna excepci&oacute;n.</P>
<P ALIGN="JUSTIFY">Por lo que hace referencia al p&uacute;blico de los fanzines, &eacute;ste es m&aacute;s bien «minoritario». Tal y como recuerdan Carlos Egia y Javier Bay&oacute;n: "M&aacute;s que minoritario, el p&uacute;blico de los medios alternativos se puede considerar, cuantitativamente, como marginal e, incluso, residual".</P>
<P ALIGN="JUSTIFY">Socialmente, el «lector» que accede a las p&aacute;ginas webs de estos fanzines se trata de una persona generalmente organizada en torno a grupos o que fuera de ellos mantiene un elevado grado de sensibilizaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Ahora bien, la implicaci&oacute;n de este p&uacute;blico no se limita s&oacute;lo a la mera compra del fanzine en su punto de venta habitual, ni a visitar la p&aacute;gina web de la que dispone en Internet, sino que en ocasiones, y como ya se ha mencionado con anterioridad, llega a participar en un proceso tan importante para las publicaciones con unas caracter&iacute;sticas como las que poseen los fanzines como es el de la b&uacute;squeda de noticias, redacci&oacute;n de las mismas, convirti&eacute;ndose en una especie de corresponsal.</P>

<B><P ALIGN="JUSTIFY">4. La financiaci&oacute;n</P>
</B><P ALIGN="JUSTIFY">La mayor&iacute;a de los fanzines se mantienen fieles a su filosof&iacute;a, y no buscan la rentabilidad econ&oacute;mica y, por tanto, su din&aacute;mica no va orientada en esa direcci&oacute;n. Desde <I>El Aficionado</I> se trata de definir mejor esta pol&iacute;tica: "No queremos llevar publicidad. Pensamos que en ello est&aacute; un poco la independencia". Ahora bien, todo ello trae como consecuencia m&aacute;s directa la precariedad econ&oacute;mica en la que se suelen mover habitualmente este tipo de publicaciones.</P>
<P ALIGN="JUSTIFY">En esa misma l&iacute;nea se mueve <I>Ekintza Zuzena</I> que se configura "una publicaci&oacute;n colectiva, no comercial, que rechaza la inclusi&oacute;n de publicidad y no cuenta con subvenciones". La financiaci&oacute;n se realiza con las propias suscripciones de la versi&oacute;n impresa, ventas, aportaciones personales, conciertos, venta de diverso material, etc.</P>
<P ALIGN="JUSTIFY">As&iacute; pues, la publicidad como tal no existe. Ahora bien, s&iacute; es cierto que existe una tendencia generalizada a nombrar aquellos establecimientos (tabernas, tiendas, etc.) que ayudan a la venta de los fanzines, o de entradas para aquellos eventos que organizan los promotores de este tipo de publicaciones, si bien, en ning&uacute;n momento son considerados a nivel de «sponsors», y no pagan nada.</P>
<P ALIGN="JUSTIFY">Por norma, la publicidad, rechazada de plano por este tipo de publicaciones, estaba ausente de la totalidad de las p&aacute;ginas web de estos fanzines visitadas, si bien no faltaba la que invitaba a insertar en las mismas anuncios.</P>
<P ALIGN="JUSTIFY">Entonces alguien se preguntar&aacute;, ¿y c&oacute;mo es posible que dispongan de medios econ&oacute;micos para poder estar presentes en la red telem&aacute;tica?</P>
<P ALIGN="JUSTIFY">La b&uacute;squeda de canales alternativos y econ&oacute;micos para la distribuci&oacute;n de estos fanzines no ya s&oacute;lo en su &aacute;rea de influencia sino en el resto de Espa&ntilde;a y m&aacute;s all&aacute; de sus fronteras, ha llevado a muchos de ellos a recurrir a servidores que les proporcionan espacio gratuito en la red de Internet y correo electr&oacute;nico (Ejemplo: Geocities). Ahora bien, tambi&eacute;n hay quienes se aprovechan de los medios que les brindan otros para poder estar en Internet. Es el caso del fanzine <I>Psycho/Rockabilly Hispano II</I>, cuyo responsable, Pedro Ferriol dispuso de los medios (ordenador, conexi&oacute;n, etc.) a trav&eacute;s de la Universidad, para que no le supusiera gasto alguno.</P>

<h4><P ALIGN="JUSTIFY">Conclusiones / ventajas:</P>
</h4><P ALIGN="JUSTIFY">Las p&aacute;ginas precedentes han servido para trazar un sucinto panorama de lo que hoy es la presencia de los fanzines en Internet en Espa&ntilde;a. Se ha tratado de describir cu&aacute;les son las caracter&iacute;sticas fundamentales de ese nueva forma de periodismo del ciberespacio que algunos auguran ser&aacute; una verdadera revoluci&oacute;n de la comunicaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Pero ¿es en realidad tan nueva esta forma de periodismo, o son s&oacute;lo los mismos productos con una apariencia nueva? ¿Se est&aacute;n abriendo nuevos caminos que conduzcan a nuevas maneras de hacer periodismo, o s&oacute;lo se ha producido un paso del papel a la pantalla, sin que difiera en nada el mensaje ni el contenido?</P>
<P ALIGN="JUSTIFY">Cu&aacute;les ser&aacute;n los caminos que el panorama de los fanzines presentes en Internet tomar&aacute; en el futuro es dif&iacute;cil de determinar, aunque ya se pueden aventurar una serie de ventajas</P>
<P ALIGN="JUSTIFY">1. Se puede acceder a los contenidos con mucha mayor rapidez, sin tener que esperar a que la edici&oacute;n impresa llegue a su lugar de suscripci&oacute;n, lo que en algunos casos, puede suponer algunos d&iacute;as de retraso.</P>
<P ALIGN="JUSTIFY">2. Cualquier puede acceder a estas p&aacute;ginas webs en las que se ofrece un primer men&uacute; en el que cada uno de los items es un enlace hipertexto que remite a una informaci&oacute;n m&aacute;s extensa. Adem&aacute;s, el p&uacute;blico objetivo for&aacute;neo al que va dirigido, muy espec&iacute;fico, no tendr&iacute;a la dificultad de acceder a los contenidos, algo que se le plantea en el caso de querer obtener una hipot&eacute;tica versi&oacute;n impresa. Es decir, no tiene fronteras.</P>
<P ALIGN="JUSTIFY">3. Gracias a Internet, los creadores de los fanzines pueden estar m&aacute;s cerca del aficionado, actualizar/modificar los contenidos constantemente (cosa que no se puede hacer desde la edici&oacute;n impresa), informar de todo lo que se est&aacute; preparando y ponerse en contacto con ellos a trav&eacute;s del correo electr&oacute;nico.</P>
<P ALIGN="JUSTIFY">4. Por norma general, la pr&aacute;ctica totalidad de los fanzines electr&oacute;nicos ofrecen otros servicios que no se hallan en la edici&oacute;n en papel: otros enlaces, la posibilidad de visionar los n&uacute;meros anteriores de la publicaci&oacute;n, b&uacute;squedas espec&iacute;ficas, contactar con el autor del texto o con el responsable de la p&aacute;gina, etc.</P>
<P ALIGN="JUSTIFY">5. Hoy en d&iacute;a, la inmensa mayor&iacute;a de estos fanzines hacen uso del ordenador para confeccionar la publicaci&oacute;n impresa (si bien a&uacute;n hay excepciones y hay quien realiza esa labor de manera totalmente manual), lo que posibilita que el tr&aacute;s el proceso de maquetaci&oacute;n y digitalizaci&oacute;n se permita colocarlo en la red telem&aacute;tica pr&aacute;cticamente en el acto y de manera autom&aacute;tica.</P>
<P ALIGN="JUSTIFY">6. Es un medio mucho m&aacute;s barato que la edici&oacute;n impresa, no plantea problemas de distribuci&oacute;n y efectivo. Gracias a &eacute;l se puede tratar cualquier tema, siendo el &uacute;nico l&iacute;mite creativo la propia imaginaci&oacute;n. Adem&aacute;s, puede ser utilizado como herramienta fundamental de comunicaci&oacute;n entre aquellos a los que va dirigido.</P>
<P ALIGN="JUSTIFY">7. Esa misma informaci&oacute;n de la pantalla puede imprimirse para una lectura m&aacute;s c&oacute;moda sobre el papel, o salvarse en soporte inform&aacute;tico (disquete o disco duro).</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

