<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet Básico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pipenu@emtelsa.multi.net.co">Felipe Ramirez</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>



<H3>Internet. En tres palabras.
</H3>
<P ALIGN=justify>
<P ALIGN=JUSTIFY>
<h4>¿Qu&eacute; es internet?</h4>

<P ALIGN="JUSTIFY">Es una Interconexi&oacute;n de redes inform&aacute;ticas que permite a las computadoras conectadas comunicarse directamente. Consiguiendo as&iacute; una variada gama de informaci&oacute;n de todo tipo, esto es accesible a todo p&uacute;blico que tengan un cierto tipo de programas y elementos. Pero para saber como funciona se necesita saber como naci&oacute;.</P>
<h4><P ALIGN="JUSTIFY">Historia de Internet :</P>
</h4><P ALIGN="JUSTIFY">Internet se deriv&oacute; inicialmente de la <B>Arpanet</B>, en inform&aacute;tica, una red formada por unos 60.000 ordenadores en la d&eacute;cada de los 60, desarrollada por la <B>Advanced</B> <B>Research</B> <B>Projects</B> <B>Agency</B> (ARPA) del Departamento de Defensa de Estados Unidos. Su origen est&aacute; en la guerra fr&iacute;a. Se tem&iacute;a que, en caso de ataque, se destruyeran las centrales telef&oacute;nicas, por lo que se intent&oacute; crear un sistema de conmutaci&oacute;n de datos totalmente descentralizado. Los protocolos de comunicaci&oacute;n que se desarrollaron dieron origen a la actual Internet. En 1990, ARPANET fue sustituida por la Red de la Fundaci&oacute;n Nacional para la Ciencia (<B>NSFNET</B>, acr&oacute;nimo en ingl&eacute;s) para conectar sus supercomputadoras con las redes regionales. En la actualidad, la <B>NSFNET</B> funciona como el n&uacute;cleo de alta velocidad de Internet y como resultado esto que esta leyendo es el resultado de a&ntilde;os de investigaci&oacute;n tecnol&oacute;gica la cual imaginada hace unos 20 a&ntilde;os parecer&iacute;a algo de locos!.</P>
<h4><P ALIGN="JUSTIFY">Como funciona internet:</P>
</h4><P ALIGN="JUSTIFY">Funciona inicialmente con algo llamado: Protocolo de Internet (<B>IP</B>) el cual es el soporte l&oacute;gico b&aacute;sico empleado para controlar el sistema de redes. Este protocolo especifica c&oacute;mo las computadoras de origen encaminan la informaci&oacute;n desde el ordenador emisor hasta el ordenador receptor. Otro protocolo denominado Protocolo de Control de Transmisi&oacute;n (<B>TCP</B>) comprueba si la informaci&oacute;n ha llegado al ordenador de destino y, en caso contrario, hace que se vuelva a enviar. <BR>
El Protocolo de Internet (IP) y el Protocolo de Control de Transmisi&oacute;n (TCP) fueron desarrollados inicialmente en 1973 por el inform&aacute;tico estadounidense <B>Vinton</B> <B>Cerf</B> como parte de un proyecto dirigido por el ingeniero norteamericano <B>Robert</B> <B>Kahn</B> y patrocinado por la Agencia de Programas Avanzados de Investigaci&oacute;n (ARPA, siglas en ingl&eacute;s) del Departamento Estadounidense de Defensa. Internet comenz&oacute; siendo una red inform&aacute;tica de ARPA (llamada ARPAnet) que conectaba redes de ordenadores de varias universidades y laboratorios de investigaci&oacute;n en Estados Unidos. <B>World</B> <B>Wide</B> Web se desarroll&oacute; en 1989 por el inform&aacute;tico brit&aacute;nico <B>Timothy</B> <B>Berners</B>-<B>Lee</B> para el Consejo Europeo de Investigaci&oacute;n Nuclear (<B>CERN</B>, siglas en franc&eacute;s).</P>
<h4><P ALIGN="JUSTIFY">Que se necesita para internet:</P>
</h4><P ALIGN="JUSTIFY">Para navegar primero se necesita un <B>m&oacute;dem,</B> el cual, es un equipo utilizado para la comunicaci&oacute;n de computadoras a trav&eacute;s de l&iacute;neas anal&oacute;gicas de transmisi&oacute;n de datos. El m&oacute;dem convierte las se&ntilde;ales digitales del emisor en otras anal&oacute;gicas susceptibles de ser enviadas por tel&eacute;fono. Cuando la se&ntilde;al llega a su destino, otro m&oacute;dem se encarga de reconstruir la se&ntilde;al digital primitiva, de cuyo proceso se encarga la computadora receptora. En el caso de que ambos m&oacute;dems puedan estar transmitiendo datos simult&aacute;neamente, se dice que operan en modo <B>full</B>-<B>duplex</B>; si s&oacute;lo puede transmitir uno de ellos, el  odo de operaci&oacute;n se denomina <B>half</B>-<B>duplex</B>. Para convertir una se&ntilde;al digital en otra anal&oacute;gica, el m&oacute;dem genera una onda portadora y la modula en funci&oacute;n de la se&ntilde;al digital. </P>
<P ALIGN="JUSTIFY">El tipo de  ondulaci&oacute;n depende de la aplicaci&oacute;n y de la velocidad de transmisi&oacute;n del m&oacute;dem. Los m&oacute;dems de alta velocidad, por ejemplo, utilizan una combinaci&oacute;n de modulaci&oacute;n en amplitud y de modulaci&oacute;n en fase, en la que la fase de la portadora se var&iacute;a para codificar la informaci&oacute;n digital. El proceso de recepci&oacute;n de la se&ntilde;al anal&oacute;gica y su reconversi&oacute;n en digital se denomina demodulaci&oacute;n. La palabra m&oacute;dem es una contracci&oacute;n de las dos funciones b&aacute;sicas: modulaci&oacute;n y demodulaci&oacute;n. Los primeros m&oacute;dems eran muy aparatosos y s&oacute;lo pod&iacute;an transmitir datos a unos 100 bits por segundo. Los m&aacute;s utilizados en la actualidad en los ordenadores personales transmiten la informaci&oacute;n a m&aacute;s de 33 kilobits por segundo. Pueden incluir funciones de fax y de contestador autom&aacute;tico de voz. </P>
<P ALIGN="JUSTIFY">Despues se necesita un explorer: Este es un programa el cual sirve para transferir los hipertextos (http), o los texto. Estos a su vez pasan a traducir im&aacute;genes, java, javascript, etc.</P>
<P ALIGN="JUSTIFY"><BR>
<BR>
<h4>Algo distinto. Servicios de Internet:</h4>
<P ALIGN="JUSTIFY">Los sistemas de redes como Internet permiten intercambiar informaci&oacute;n entre computadoras, y ya se han creado numerosos servicios que aprovechan esta funci&oacute;n. Entre ellos est&aacute;n: <BR>
Conectarse a un ordenador desde otro lugar (<B>telnet</B>); transferir ficheros entre una computadora local y una computadora remota (protocolo de transferencia de ficheros, o <B>FTP</B>) y leer e interpretar ficheros de ordenadores remotos (<B>gopher</B>). El servicio de Internet m&aacute;s reciente e importante es el protocolo de transferencia de <B>hipertexto</B> (http), un descendiente del servicio de gopher. El http puede leer e interpretar ficheros de una m&aacute;quina remota: no s&oacute;lo texto sino im&aacute;genes, sonidos o secuencias de v&iacute;deo. El http es el protocolo de transferencia de informaci&oacute;n que forma la base de la colecci&oacute;n de informaci&oacute;n distribuida denominada <B>World</B> <B>Wide</B> <B>Web</B>.</P>
<P ALIGN="JUSTIFY">La diferencia: La World Wide Web (tambi&eacute;n conocida como Web o WWW) es una colecci&oacute;n de ficheros, denominados lugares de Web o p&aacute;ginas de Web, que incluyen informaci&oacute;n en forma de textos, gr&aacute;ficos, sonidos y v&iacute;deos, adem&aacute;s de v&iacute;nculos con otros ficheros. Los ficheros son identificados por un localizador universal de recursos (<B>URL</B>, siglas en ingl&eacute;s) que especifica el protocolo de transferencia, la direcci&oacute;n de Internet de la m&aacute;quina y el nombre del fichero. Por ejemplo, un URL podr&iacute;a ser http://www.ciudafutura.com/ Los programas inform&aacute;ticos denominados exploradores -como Navigator, de Netscape, o Internet Explorer, de Microsoft- utilizan el protocolo http para recuperar esos ficheros. Continuamente se desarrollan nuevos tipos de ficheros para la WWW, que contienen por ejemplo animaci&oacute;n o realidad virtual  <B>VRML</B>). Hasta hace poco hab&iacute;a que programar especialmente los lectores para manejar cada nuevo tipo de archivo. Los nuevos lenguajes de programaci&oacute;n (como Java) permiten que los exploradores puedan cargar programas de ayuda capaces de manipular esos nuevos tipos de informaci&oacute;n.</P>
<P ALIGN="JUSTIFY"><h4>&quot;Bajarse&quot; un programa:</P>
</h4><P ALIGN="JUSTIFY">Esto es principalmente traer a trav&eacute;s de un protocolo un programa de un ordenador lejano al nuestro, se reconoce principalmente con la palabra "download" la cual inicia la transferencia de datos seleccionando primero una carpeta para guardarlo, y al terminar se le da doble click para que se instale. </P>
<h4><P ALIGN="JUSTIFY">Terminología basica:</h4></P>

<UL>
<LI><B><P ALIGN="JUSTIFY">Gateway</B>: conjunto de hardware y software que conecta redes que utilizan protocolos de comunicaci&oacute;n diferentes, o que transmite datos por una red entre dos aplicaciones no compatibles. El gateway cambia el formato de los datos de manera que los pueda entender la aplicaci&oacute;n que los recibe. El t&eacute;rmino se suele usar para describir cualquier computadora que transmite datos de una red a otra, pero esta acepci&oacute;n, t&eacute;cnicamente, no es correcta. </LI></P>
<LI><B><P ALIGN="JUSTIFY">TCP/IP</B>: Es el Acr&oacute;nimo de Transmission Control Protocol/Internet Protocol, protocolos usados para el control de la transmisi&oacute;n en Internet.el cual Permite que diferentes tipos de computadoras se comuniquen a trav&eacute;s de redes heterog&eacute;neas. El sistema operativo. TCP define distintos par&aacute;metros de transmisi&oacute;n de datos. IP define el modo en que los datos se dividen en bloques, denominados paquetes, y establece el camino que recorre cada paquete hasta su destino. En resumen: es el protocolo de transmisi&oacute;n de datos. Si no has<BR>
entendido: bajarse un programa de la red.</LI></P></UL>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetc.htm"><font FACE="ARIAL"><B>[Internet Básico]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

