<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet Básico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:tecnilin@arrakis.es">Alejandro Ibáñez</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
<FONT color="#000000" face="arial">
Internet; red de redes.
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">

Si dijera que Internet es una red compuesta por otras redes poco dejar&iacute;a en claro. ¿Y si dijese que es una serie de ordenadores conectados entre s&iacute; que se intercambian informaci&oacute;n que posteriormente el software del ordenador interpreta?. Me parece que a&uacute;n peor. La verdad es que es dif&iacute;cil explicar claramente y en pocas palabras lo que es esta famos&iacute;sima red pero como dispongo de mucho espacio intentar&eacute; dejar por lo menos algunos conceptos claros incluso para el m&aacute;s profano en la materia.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde un punto de vista abstracto, Internet es una serie de servicios en los que puedes hacer de todo. Desde charlar con cientos de personas a la vez (IRC) hasta navegar por la red viendo las p&aacute;ginas repletas de informaci&oacute;n de todo tipo y con una presentaci&oacute;n gr&aacute;fica inmejorable (WWW).</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Pero... ¿qu&eacute; son esas tres W?, ¿y qu&eacute; es eso de navegar?, ¿se necesita un barco adem&aacute;s de un ordenador?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Uff, me parece que he ido demasiado r&aacute;pido... Empezar&eacute; por el servicio m&aacute;s importante que nos ofrece esta gran red.</P>
<h4><P ALIGN="JUSTIFY">La World Wide Web</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es sin lugar a dudas la cara bonita de Internet y la principal causante del &eacute;xito que tiene. Son p&aacute;ginas llenas de informaci&oacute;n, repletas de im&aacute;genes que acompa&ntilde;an al texto incluso con programaci&oacute;n en JAVA dando un aspecto visual muy conseguido. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A este sistema de p&aacute;ginas tambi&eacute;n se le llama telara&ntilde;a ya que &eacute;stas est&aacute;n comunicadas unas con otras como si de una construcci&oacute;n ar&aacute;cnida se tratase.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cualquiera que tenga un ordenador, un m&oacute;dem, l&iacute;nea telef&oacute;nica y una buena cuenta en un servidor puede adem&aacute;s de navegar por la red, publicar una p&aacute;gina. S&oacute;lo tienes que escoger un tema y dise&ntilde;arla. Es por esta raz&oacute;n por la que el n&uacute;mero de p&aacute;ginas existentes es casi incalculable.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como en todo hay p&aacute;ginas buenas y p&aacute;ginas malas, s&oacute;lo es cuesti&oacute;n de saber navegar por esta inmensa red. Se puede encontrar desde unas con un dise&ntilde;o realmente espectacular hasta otras con simple texto abandonadas al paso del tiempo...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cualquier informaci&oacute;n que se desee se puede encontrar en este servicio. Supongamos que queremos saber todo sobre algo raro, pongamos a prueba a Internet. Veamos...algo raro... ¿? ...¡Ya est&aacute;! Lo tengo. Busquemos informaci&oacute;n sobre Chris Elliot, el actor que protagoniza esa serie con la que me he re&iacute;do como nunca, 'B&uacute;scate la Vida'.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo primero es navegar hasta alg&uacute;n buscador para que &eacute;ste nos haga el trabajo sucio. Estos sitios saben mucho de la red y nos conducir&aacute;n y guiar&aacute;n a donde queramos. Uno de los mejores se llama 'Altavista' as&iacute; que ya tenemos los medios para ir a la cuesti&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez en Altavista s&oacute;lo nos queda decirle que nos de todo lo que tenga sobre Chris. Esto es tan f&aacute;cil como escribir en una cajita blanca que aparece en la parte superior de la hoja <B>chris</B>&amp;<B>elliot</B> en min&uacute;sculas y con el AND. El porqu&eacute; de las min&uacute;sculas y del ‘&amp;’ es otra cosa, algo m&aacute;s extensa de explicar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez indicado esto, Altavista nos dir&aacute; que ha encontrado unas 30.000 p&aacute;ginas sobre el tema 'Chris Elliot'. Casi nada... As&iacute; que s&oacute;lo queda pasar horas y horas delante del ordenador absorbiendo informaci&oacute;n hasta llegar a saber m&aacute;s sobre Chris que &eacute;l mismo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esto se puede hacer con cualquier tema que se te ocurra: cine, deportes, ense&ntilde;anza, cursos, ocio en general...etc. La capacidad de informar de Internet no tiene l&iacute;mites.</P>
<h4><P ALIGN="JUSTIFY">IRC (Internet Relay Chat)</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro servicio de Internet es el del IRC con el que podremos comunicarnos con cientos y cientos de personas a la vez...</P>
<P ALIGN="JUSTIFY"></P>
<b><P ALIGN="JUSTIFY">¿Cientos de personas a la vez? Pues qu&eacute; l&iacute;o, tanta gente hablando al mismo tiempo... no se entender&aacute; nada...</P>
</b><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Que no hombre, que no. La comunicaci&oacute;n es tecleando lo que se quiere decir y no hablando. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este es el servicio m&aacute;s divertido de la red. Para acceder a &eacute;l s&oacute;lo se necesita el acceso a una l&iacute;nea de tel&eacute;fono com&uacute;n, un m&oacute;dem  y un programa adecuado como el 'mIRC'. En este caso no se necesita una cuenta en alg&uacute;n servidor ya que es un servicio gratuito.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez conectados aparece una lista de nombres, llamados canales, con sus descripciones correspondientes. Son como habitaciones separadas en las que se habla de un tema en concreto o se intercambian cosas espec&iacute;ficas (casi se me olvida decir que no s&oacute;lo se puede hablar, tambi&eacute;n se puede intercambiar cualquier cosa). Hay algunos canales en los que puedes hablar del tema que te apetezca en ese momento. Suelen llamarse caf&eacute;s.</P>
<h4><P ALIGN="JUSTIFY">E-Mail (correo electr&oacute;nico)</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como si de correo normal de tratara, el mail aporta muchas ventajas al tradicional. Desde la rapidez de llegada (casi instant&aacute;neo) hasta no tener que comprar sellos y sobres, eliminando as&iacute; la pereza de 'tener que escribir'.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cada uno que tenga una cuenta en un servidor tiene una direcci&oacute;n propia. A la hora de escribir s&oacute;lo se necesita poner la direcci&oacute;n del destinatario.</P>
<h4><P ALIGN="JUSTIFY">News (noticias)</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra de las capacidades de Internet son los grupos de noticias, las news. De nuevo la variedad de temas es la principal caracter&iacute;stica. Cientos de conjuntos de noticias de cualquier tema que se nos ocurra.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">S&oacute;lo hace falta mirar entre todos los grupos de un servidor, elegir el del tema que te interese y suscribirte. La suscripci&oacute;n es gratuita. Desde ese momento recibes cientos de comentarios, preguntas y respuestas relacionadas.</P>
<h4><P ALIGN="JUSTIFY">Otros...</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Son muchos m&aacute;s los servicios que ofrece Internet. Por ejemplo el FTP (File Transfer Protocol) que es una simple pero &uacute;til transferencia de ficheros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Worlds Chat es similar al IRC pero en un espacio virtual en donde manejas un personaje y en donde ves a los dem&aacute;s a la vez que escuchas sonidos y m&uacute;sica ambiental.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Algo que promete ser est&aacute;ndar pero que todav&iacute;a est&aacute; desarroll&aacute;ndose son las conferencias  visuales por el precio de una llamada local. Comunicaci&oacute;n por voz e im&aacute;genes que proporciona una c&aacute;mara en cada ordenador. La situaci&oacute;n de las l&iacute;neas de tel&eacute;fono comunes frenan el desarrollo de este sistema que tarde o temprano se impondr&aacute; en todos los ordenadores que est&eacute;n conectados.</P>
<h4><P ALIGN="JUSTIFY">El Futuro</P>
</h4><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La verdad es que Internet se ha ido desarrollando a una velocidad incre&iacute;ble. Lo que ahora es una novedad en poco tiempo ser&aacute; algo muy com&uacute;n, incluso algo desfasado. Importantes estudios dicen que un a&ntilde;o real equivale a 5 en Internet. La evoluci&oacute;n es 5 veces m&aacute;s r&aacute;pida.  Y todo esto a pesar de la limitaci&oacute;n de las l&iacute;neas telef&oacute;nicas comunes. Finalmente se generalizar&aacute; el uso de cable que permite unas velocidades realmente superiores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo lo explicado en este art&iacute;culo es lo actual, lo com&uacute;n pero lo actual de Septiembre de 1998 porque el a&ntilde;o que viene puede ser distinto, todo mucho m&aacute;s nuevo y potente. Por ejemplo, el Worlds Chat ser&aacute; algo tan usado como el IRC siendo que ahora es minoritario y por muchos desconocido, las Webs ser&aacute;n cien veces m&aacute;s espectaculares, la velocidad de los modems y de las l&iacute;neas ser&aacute;n mucho m&aacute;s r&aacute;pidas y quien sabe, igual se sabr&aacute; quien ha ganado la guerra, el Netscape o el Explorer...</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetc.htm"><font FACE="ARIAL"><B>[Internet Básico]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

