<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet Básico</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
¿Qué riesgos tiene el World Wide Web?
</H3>
<P ALIGN=justify>

<H3>Breve historia de USENET.
</H3>
<P ALIGN=justify>

USENET fue desarrollada en 1979 por tres estudiantes: Tom Truscott, Jim Ellis (ambos de la Universidad de Duke) y Steve Bellovin (Universidad de Carolina del Norte -UNC-). La idea era crear una red para dirigir mensajes (denominados en USENET art&iacute;culos) a una especie de tablones de anuncios donde estos quedaban depositados y otras personas pod&iacute;an leerlos con posteroridad. El sistema de transporte se basaba en el protocolo UUCP (Unix-to-Unix Copy Protocol) implementado en la nueva versi&oacute;n de UNIX que circulaba por aquellos entonces. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En principio exist&iacute;an tan solo dos jerarqu&iacute;as principales deniminadas mod y net. La primera para grupos moderados (con filtraje previo a la publicaci&oacute;n de los art&iacute;culos) y la segunda albergando al resto. A finales de 1980, con la conexi&oacute;n de la Universidad de California en Berkeley se crea la primera pasarela (gateway) entre USENET y ARPANET. Posteriormente se a&ntilde;adieron a las jerarqu&iacute;as existentes otra llamada fa y varias de car&aacute;cter local. En Julio de 1986 se reorganizan las jerarqu&iacute;as creando las 8 grandes jerarqu&iacute;as de primer nivel (comp -sobre ordenadores y todo lo relacionado con ellos-, sci -ciencia e ingenier&iacute;a-, rec -temas de car&aacute;cter recreativo-, talk -temas pol&eacute;micos-, news -sobre la propia red USENET-, humanities -discusiones acad&eacute;micas de car&aacute;cter no cient&iacute;fico-, misc -temas generales sin cabida en otros grupos- y soc -para grupos sociales-). Poco despu&eacute;s de la creaci&oacute;n de esta estructura, se propone la creaci&oacute;n de los grupos rec.sex y rec.drugs (discusi&oacute;n sobre sexo y drogas,  respectivamente), lo que dio lugar a que los administradores de ciertos sistemas inform&aacute;ticos de USENET decidieran boicotearlos. Producto de esta tensi&oacute;n, un grupo de administradores decidi&oacute; dar de alta estos grupos bajo una nueva jerarqu&iacute;a denominada alt (alternativa). As&iacute;, se crearon r&aacute;pidamente dentro de esta jerarqu&iacute;a los grupos alt.sex, alt.drugs y alt.rock-n-roll. A los pocos meses, los administradores que negaron la difusi&oacute;n de los grupos tuvieron que ceder a la incorporaci&oacute;n de la jerarqu&iacute;a alt y poner as&iacute; en evidencia que la libertad de expresi&oacute;n ser&iacute;a una de las condiciones principales en el desarrollo del trabajo en red.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En Febrero de 1986 aparece el est&aacute;ndar para la transmisi&oacute;n de grupos de noticias utilizando protocolos TCP/IP. Desde entonces el protocolo UUCP empieza a caer en desuso hasta casi su desaparici&oacute;n.</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetc.htm"><font FACE="ARIAL"><B>[Internet Básico]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

