<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>


<FONT color="#000000"><br><br><br>
<H3>De viaje con Internet
</H3>
<P ALIGN=justify>

La llegada del verano se presenta como el momento m&aacute;s propicio para iniciar el preparativo de ese viaje estival a la playa o a la monta&ntilde;a que se ha so&ntilde;ado durante el largo y tedioso invierno. Durante los pr&oacute;ximos d&iacute;as, la gente dedicar&aacute; parte de su tiempo a discutir, decidir y planificar sus m&aacute;s que inminentes vacaciones.</P>
<P ALIGN="JUSTIFY">Y he ah&iacute; donde aparece Internet, una ventana abierta al mundo en la pantalla del ordenador. Como era de esperar, la Red de redes se convierte en un inabarcable caudal de informaci&oacute;n -y entretenimiento- para el trotamundos «devorador» de kil&oacute;metros y para el viajero sosegado, que prefiere «recorrer» el mundo sin moverse del sal&oacute;n de su casa.</P>
<P ALIGN="JUSTIFY">Tanto para unos como para otros, Internet constituye una fabulosa gu&iacute;a tur&iacute;stica repleta de ideas para descubrir las rutas m&aacute;s ins&oacute;litas, un inmenso manadero de recursos de informaci&oacute;n que facilita la preparaci&oacute;n de un viaje a conciencia y, en ocasiones, incluso hacer reservas online, tanto de transporte como de alojamiento.</P>
<P ALIGN="JUSTIFY">El itinerario por las webs de los lugares que se van a visitar puede llegar, incluso, a ser tan apasionante como el propio viaje. En Internet est&aacute;n reflejados la pr&aacute;ctica totalidad de sonidos e im&aacute;genes del planeta, y es tan sencillo acceder a la informaci&oacute;n del pueblo de al lado como a la de Australia o Chile.</P>
<P ALIGN="JUSTIFY">En este impresionante «caj&oacute;n de sastre» cabe cualquier cosa. ¿C&oacute;mo puedo preparar mi viaje hasta Argentina, para disfrutar a tope de uno de los parajes m&aacute;s bellos del Cono Sur del continenete americano? No hay problema: <a href="http://www.teleline.es/personal/eagmoy" target="_new">http://www.teleline.es/personal/eagmoy</a>. Si se dispone de tiempo y paciencia, la Red facilitar&aacute; la respuesta adecuada a cualquier pregunta, por ins&oacute;lita o extravagante que esta sea. ¿Es posible realizar la traves&iacute;a bereber en dromedario por el Desierto del Sahara? ¿Y una expedici&oacute;n al reino de Saba (Yemen)?</P>
<P ALIGN="JUSTIFY">Gracias a su car&aacute;cter universal, Internet es capaz de acoger en sus seno todo tipo de iniciativas, incluso la posibilidad de organizar safaris en el Este de Africa, algo que te organizan desde Utalii Tours and Safaris Ltd (<a href="http://www.arrakis.es/~vastray" target="_new">http://www.arrakis.es/~vastray</a>).</P>
<P ALIGN="JUSTIFY">Y es que en Internet hay todo lo necesario para preparar viajes naturistas, en velero, culturales, religiosos, de aventura, etc. En la Red se pueden encontrar conversores de moneda, informaci&oacute;n sobre el lugar de destino, todo tipo de datos econ&oacute;micos y culturales. Tambi&eacute;n hay mapas, gu&iacute;as de viajes, de restaurantes, de museos, oficinas de turismo, albergues y campings, etc.</P>
<P ALIGN="JUSTIFY">Ante todo, conviene empezar d&aacute;ndose una vuelta por SpaTour (<a href="http://www.spatour.com">http://www.spatour.com</a>), sin duda alguna, el m&aacute;s potente servidor tur&iacute;stico de Espa&ntilde;a. Sus m&aacute;s de 100.000 entradas incluyen la pr&aacute;ctica totalidad de establecimientos tir&iacute;sticos del pa&iacute;s, entre hoteles, apartamentos, restaurantes, campings, y una gran diversidad de servicios. Todo ello en permanente actualizaci&oacute;n. Estos establecimientos se pueden localizar desde los buscadores distribuidos entre sus p&aacute;ginas, o bien acceder a ellos desde cada poblaci&oacute;n en concreto.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Agencias virtuales y c&oacute;mo viajar</h4>
<P ALIGN="JUSTIFY">Internet consigue, en gran medida, eliminar  la que es, en ocasiones, la parte m&aacute;s tediosa de las vacaciones: recolectar informaci&oacute;n, efectuar las llamadas, acercarse a las agencias, etc. No se trata s&oacute;lo de consultar horarios y trayectos, sino de comprar, pagar y recibir billetes de avi&oacute;n, buscar las m&aacute;s apetecibles ofertas, escoger los mejores hoteles, alquilar el coche adecuado...</P>
<P ALIGN="JUSTIFY">En la actualidad, existe ya una s&oacute;lida e importante oferta de agencias capaces de poner un billete encargado a trav&eacute;s de un servidor en la puerta de nuestra casa. Cyber World Travel (www.cyberworld-travel.com) ya lo hace. Esta compa&ntilde;&iacute;a nace con la idea de ser una agencia de viajes total en Internet que sin prescindir de la idea de aldea global pretende ser una agencia cercana al usuario, con el consiguiente aumento de confianza a la hora de resolver cualquier incidente. A trav&eacute;s de la Red se puede solicitar cualquier servicio que podamos necesitar de una agencia de viajes: billetes de avi&oacute;n, tren o autob&uacute;s, alquiler de coches, etc., que Cyber World Travel nos lo proporciona sin movernos de nuestras casas, a precios especiales y sin ning&uacute;n coste adicional.</P>
<P ALIGN="JUSTIFY">De cualquier manera, pueden existir exc&eacute;pticos que desconf&iacute;en de Internet a la hora de realizar cualquier operaci&oacute;n financiera a trav&eacute;s de la Red. Para ellos, la mayor&iacute;a de las agencias garantizan seguridad total en la adquisici&oacute;n de servicios a trav&eacute;s de sus webs, y algunas hasta tienen contratadas p&oacute;lizas de seguros, con lo que a una compra segura se le une una compra asegurada.</P>
<P ALIGN="JUSTIFY">Armado de mapas, y con la informaci&oacute;n b&aacute;sica sobre el lugar al que se desea viajar, el internauta puede dirigirse a alguna de las agencias de viajes «electr&oacute;nicas» para comprar los billetes y hacer las reservas del hotel. Mercatour, la mayor base tur&iacute;stica de Espa&ntilde;a (<a href="http://www.mercatour.com" target="_new">http://www.mercatour.com</a>), concentra casi el 100% de la oferta tur&iacute;stica espa&ntilde;ola, siempre con la garant&iacute;a de las agencias de viajes asociadas. Desde sus p&aacute;ginas, el internauta puede conectarse y reservar en casi 6.000 agencias de viajes, encontrar ofertas de 400 mayoristas, 10.000 alojamientos, l&iacute;neas a&eacute;reas y todo lo necesario para hacer que nuestras vacaciones sean todo un &eacute;xito.</P>
<P ALIGN="JUSTIFY">Zeppelin (<a href="http://www.v-zeppelin.es" target="_new">http://www.v-zeppelin.es</a>), por ejemplo, ofrece billetes de &uacute;ltima hora, esos que tienen un precio m&aacute;s reducido para los viajeros a los que no les importa estar esperando unos d&iacute;as con la maleta hecha. Es posible realizar la reserva inmediatamente, aunque por si acaso, tambi&eacute;n tiene una lista con su red de oficinas f&iacute;sicas.</P>
<P ALIGN="JUSTIFY">Marsans (<a href="http://www.marsans.es">http://www.marsans.es</a>) opt&oacute; por presentar una p&aacute;gina web menos interactiva, en la que ofrece informaci&oacute;n de docenas de vuelos a todo tipo de destinos y de las promociones existentes. Actualmente, la &uacute;nica posibilidad de realizar reservas se ofrece en los viajes para estudiantes. Mientras tanto, tambi&eacute;n ofrece una gu&iacute;a de oficinas, lo que no deja de resultar &uacute;til, algo que tambi&eacute;n brinda Halc&oacute;n Viajes (<a href="http://www.halconviajes.com" target="_new">http://www.halconviajes.com</a>). Ahora bien, desde la p&aacute;gina web de esta agencia, se ofrece la posibilidad de escoger nuestras preferencias y entrar en su plan de personalizaci&oacute;n de Internet. Basta con hacernos miembros de su Club de Viajeros y dispondremos de nuestro porpio &iacute;ndice personal de productos especiales, de la posibilidad de recibir las ofertas que m&aacute;s deseamos en nuestro buz&oacute;n y con la frecuencia que elijamos, y de la posibilidad de poder visualizar sus ofertas de &uacute;ltimo momento. Y todo ello sin ning&uacute;n compromiso.</P>
<P ALIGN="JUSTIFY">Por su originalidad destaca la p&aacute;gina de Barcel&oacute; (<a href="http://www.barcelo-viajes.es" target="_new">http://www.barcelo-viajes.es</a>) la cual cuenta con una secci&oacute;n denominada el Viajero Virtual, donde la gente comenta sus experiencias y plantea cuestiones que luego otros se encargan de responder. Asimismo, tambi&eacute;n dispone del servicio de Destinos, muy eficaz. En primer lugar se selecciona el lugar al que se quiere viajar. Entonces, la p&aacute;gina web informa sobre el lugar y pregunta los d&iacute;as que se desean permanecer, tipo de alojamiento, presupuesto y fechas. Con las respuestas, se presentan varias ofertas. Es el momento de elegir una.</P>
<P ALIGN="JUSTIFY">Una opci&oacute;n diferente la constituye Turism&uacute;sica (<a href="http://www.ctv.es/USERS/turismus">http://www.ctv.es/USERS/turismus</a>), que organiza las vacaciones para los mel&oacute;manos que desean hacer turismo, pero sobre todo viajar al encuentro de la m&uacute;sica. Para &eacute;stos, al placer mismo del viajes se les une la «cita» con la orquesta predilecta, el int&eacute;rprete admirado o el festival anhelado. Diariamente, actualizan en su base de datos los programas de los principales teatros l&iacute;ricos, salas de conciertos y festivales del mundo. Su equipo de asesores musicales seleccionan aquellos eventos que se yerguen como &uacute;nicos y los aderezan con selectos servicios tur&iacute;sticos.</P>
<P ALIGN="JUSTIFY">Por otra parte, una gran cantidad de compa&ntilde;&iacute;as a&eacute;reas venden sus billetes a trav&eacute;s de la Red. Ahora bien, tambi&eacute;n hay excepciones, como Iberia (<a href="http://www.iberia.com" target="_new">http://www.iberia.com</a>) que s&oacute;lo vende billetes online en clase Business -aunque facilita la consulta de disponibilidad de plazas para los destinos y fechas deseadas-, y Spanair (<a href="http://www.spanair.com" target="_new">http://www.spanair.com</a>) que anuncia ofertas que se pueden adquirir por tel&eacute;fono. Esta compa&ntilde;&iacute;a recientemente ha estrenado un sistema de reservas online para el cual es necesario registrarse.</P>
<P ALIGN="JUSTIFY">Los que se decantan por el tren tambi&eacute;n tienen la oportunidad de utilizar Internet. Renfe (<a href="http://www.renfe.es">http://www.renfe.es</a>) permite consultar los horarios y tiene previsto ofrecer reservas online despu&eacute;s de pasado el verano.</P>
<P ALIGN="JUSTIFY">En principio, la tarjeta Interrail parece un buen procedimiento para ahorrar en la compra de billetes ferroviarios. Hay dos modalidades, seg&uacute;n el viajero tenga menos o m&aacute;s de 26 a&ntilde;os, pero ambas dividen Europa en siete zonas. De cualquier manera, las condiciones y precios de este sistema pueden ser consultados en el web de Renfe.</P>
<P ALIGN="JUSTIFY">Por su puesto, el autob&uacute;s tambi&eacute;n tiene su hueco en Internet, gracias a Eurolines (<a href="http://www.eurolines.com">http://www.eurolines.com</a>), que ofrece rutas por toda Europa a precios econ&oacute;micos.</P>
<P ALIGN="JUSTIFY">Para los defensores del autostop como forma de viajar, AAutostop-Mitfahrzentrale (www.maximreclam.es/MacGiver/AAutostop.htm), un directorio de base de datos gratis y de empresas que organizan viajes en autostop Alemania-Espa&ntilde;a.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Hoteles</h4>
<P ALIGN="JUSTIFY">Con el billete en el bolsillo y la maleta preparada, s&oacute;lo queda reservar el alojamiento. Por supuesto, la Red tambi&eacute;n abre sus puertas a m&aacute;s de catorce mil hoteles espa&ntilde;oles (<a href="http://www.abchoteles.com" target="_new">http://www.abchoteles.com</a>). A trav&eacute;s de este web, el usuario puede seleccionar su b&uacute;squeda a partir del precio, la categor&iacute;a, el lugar o la cadena a la que pertenezca el establecimiento hotelero, as&iacute; como paradores, moteles, apartamentos, aparthoteles, hostales, pensiones, casas rurales, posadas y campings.</P>
<P ALIGN="JUSTIFY">Del mismo modo, todos aquellos internautas que se decidan a echar un vistazo en <a href="http://www.spaindata.com/data/1hotelfind.shtml" target="_new">http://www.spaindata.com/data/1hotelfind.shtml</a>, adem&aacute;s de poder hacer reservas en cualquier momento del a&ntilde;o -dejando de lado los malos ratos que provoca la improvisaci&oacute;n-, lo que es muy importante en estas &eacute;pocas de gran demanda, esta p&aacute;gina nos ofrece una gu&iacute;a de hoteles en los parajes naturales m&aacute;s representativos de la Pen&iacute;nsula Ib&eacute;rica. Se trata de una base de datos en la que se registran a diario establecimientos hosteleros en toda Espa&ntilde;a. Permite la b&uacute;squeda geogr&aacute;fica, por caracter&iacute;sticas y por precios.</P>
<P ALIGN="JUSTIFY">HotelSearch (<a href="http://www.hotelsearch.com/2/" target="_new">http://www.hotelsearch.com/2/</a>), por su parte, ofrece una serie de destinos en los que se pueden encontrar una amplia selecci&oacute;n de bungalows, apartamentos, hoteles, etc., y todos los servicios necesarios para hacer que nuestras vacaciones sean esa parte inolvidable del a&ntilde;o. En su base de datos hay informaci&oacute;n de m&aacute;s de 10.000 alojamientos, por categor&iacute;as, por precios, por la ubicaci&oacute;n geogr&aacute;fica, por la cadena de hoteles a la que pertenecen, etc.</P>
<P ALIGN="JUSTIFY">La cadena hotelera Sol Meli&aacute; (<a href="http://www.solmelia.es" target="_new">http://www.solmelia.es</a>) ofrece diversas ofertas en su p&aacute;gina web. Pero si por algo destaca tambi&eacute;n es por las numerosas utilidades que incorpora: desde este «web site» se puede, por ejemplo, enviar un mensaje a cualquier alojado de Sol Meli&aacute;.</P>
<P ALIGN="JUSTIFY">Pero a&uacute;n hay una opci&oacute;n m&aacute;s, la que se ofrece desde Belair: la multipropiedad (<a href="http://www.nemo.es/belair/multi.htm" target="_new">http://www.nemo.es/belair/multi.htm</a>). Desde estas p&aacute;ginas webs se anima a escoger un modelo de vacaciones moderno, eficaz y econ&oacute;mico. ¿Por qu&eacute; comprarse un apartamento, con los inconvenientes que acarrean el utilizarlo s&oacute;lo unas pocas semanas al a&ntilde;o, y renunciar a conocer otros lugares?.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Arte, historia, costumbres</h4>
<P ALIGN="JUSTIFY">Ahora bien, tambi&eacute;n se brinda la oportunidad a aquellos que invaden rincones de nuestra extensa geograf&iacute;a cargados de historia, arte y ricas costumbres. Si lo que se desea es visitar monumentos hist&oacute;ricos, la soluci&oacute;n es ir al men&uacute; prinicpal para recabar datos de cualquier zona de la extensa geograf&iacute;a espa&ntilde;ola. ¿Que se quiere visitar un pueblo enteramente encerrado por su muralla medieval? Pues se tiene en la p&aacute;gina web que contiene la Gu&iacute;a de Castillos de Guadalajara (<a href="http://www.ciberia.com/guadalajara/provincia/index.htm" target="_new">http://www.ciberia.com/guadalajara/provincia/index.htm</a>).</P>
<P ALIGN="JUSTIFY">En el supuesto de que se quiera visitar Lanzarote, su p&aacute;gina en Internet (<a href="http://www.intercom.es/agendagc/lanzarote">http://www.intercom.es/agendagc/lanzarote</a>) se hace imprescindible para planear mejor nuestra estancia en esta hermosa isla canaria: desde los lugares m&aacute;s interesantes a recetas de la cocina t&iacute;pica. Adem&aacute;s, tambi&eacute;n hay un vocabulario con las expresiones y modismos m&aacute;s usados, para saber si los isle&ntilde;os nos est&aacute;n saludando o insultando.</P>
<P ALIGN="JUSTIFY">En 1998 y tras una larga espera para muchos, se tiene una cita obligada en Lisboa con la Expo (<a href="http://www.expo98.pt" target="_new">http://www.expo98.pt</a>). Seis a&ntilde;os han pasado ya desde la Expo de Sevilla, pero por fin hay otro evento de caracter&iacute;sticas similares. Y en la cerquita Portugal. La Exposici&oacute;n Universal de Lisboa, que tiene como lema "<I>Los oc&eacute;anos, una herencia para el futuro</I>", abri&oacute; recientemente sus puertas, y para saber m&aacute;s sobre lo que puede esperarle al viajero, un buen sitio es su p&aacute;gina web, donde se puede realizar un paseo virtual por el recinto ferial. Tambi&eacute;n se podr&aacute;n visitar los pabellones tem&aacute;ticos y enterarse de las actividades culturales y l&uacute;dicas que se est&aacute;n preparando, y todo ello en tres idiomas: espa&ntilde;ol, portugu&eacute;s e ingl&eacute;s.</P>
<P ALIGN="JUSTIFY">Ultimamente, el denominado turismo religioso tambi&eacute;n tiene su hueco en Internet. Una de las opciones que m&aacute;s p&aacute;ginas tiene es la del Camino de Santiago, y unida a &eacute;sta, la del Xacobeo (<a href="http://www.xacobeo.es" target="_new">http://www.xacobeo.es</a>).</P>
<P ALIGN="JUSTIFY">De cualquier manera, a&uacute;n quedan bastantes webs en la Red que nos mantienen informados sobre la Semana Santa (con historia de las Hermandades, pasos y procesiones) en diferentes localidades espa&ntilde;olas: en Oliva de la Frontera, en la provincia de Badajoz (<a href="http://personal.redestb.es/pplaza" target="_new">http://personal.redestb.es/pplaza</a>) o en Cuenca (<a href="http://www.usuarios.com/ib305743/index.htm" target="_new">http://www.usuarios.com/ib305743/index.htm</a>), entre otros sitios.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Recursos limitados</h4>
<P ALIGN="JUSTIFY">No hay que olvidar que son muchos los individuos que planean sus vacaciones sin contar con muchos recursos econ&oacute;micos. M&aacute;s bien todo lo contrario. Una extensa caterva de j&oacute;venes, quienes constituyen una parte importante del turismo que se mueve por ah&iacute;, se desplaza sin pr&aacute;cticamente un duro en el bolsillo -limitados por la econom&iacute;a de su edad- y empujados por la necesidad de viajar, sin saber muy bien el destino final.</P>
<P ALIGN="JUSTIFY">Una de las opciones m&aacute;s empleada es la de los campings, y en este sentido, Internet tambi&eacute;n facilita un extenso listado con informaci&oacute;n sobre esta opci&oacute;n para estar en contacto m&aacute;s directo con la Naturaleza.</P>
<P ALIGN="JUSTIFY">Sin embargo, tambi&eacute;n los hay quienes prefieren un ambiente m&aacute;s informal, que realizan vacaciones en grupo, o que desean pasar los d&iacute;as en alta monta&ntilde;a cerca de la altura de las cumbres de los parques nacionales que hay repartidos por la geograf&iacute;a espa&ntilde;ola. Para ellos, los albergues constituyen una buena alternativa. Por que, ¿qui&eacute;n no ha so&ntilde;ado nunca con poder pasar unas vacaciones en un antiguo poblado abandonado, rodeado de bosques y barrancos? En plena Hoz del r&iacute;o J&uacute;car se encuentra El Molinar (<a href="http://personales.mundivia.es/jfortuno/el_molinar.htm" target="_new">http://personales.mundivia.es/jfortuno/el_molinar.htm</a>), a orillas del embalse del mismo nombre, y en cuya p&aacute;gina web se puede recabar informaci&oacute;n sobre este lugar, id&oacute;neo para la pr&aacute;ctica de m&uacute;ltiples deportes de monta&ntilde;a, para la realizaci&oacute;n de campamentos juveniles, o simplemente para el paseo y el contacto directo con la Naturaleza.</P>
<P ALIGN="JUSTIFY">Junto a todo &eacute;sto, la Red tambi&eacute;n da la opci&oacute;n de poder dormir en la monta&ntilde;a palentina, pasar unos d&iacute;as  de ensue&ntilde;o en una casa-palacio en Beire (Navarra), o alojarse en el parque natural de la Font Roja de Alcoy (Alicante), y todo ello sin que suponga un desembolso importante por parte del turista.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Agroturismo</h4>
<P ALIGN="JUSTIFY">Cada d&iacute;a son m&aacute;s las personas que buscan nuevas formas de «montarse» sus vacaciones. Los hay quienes s&oacute;lo persiguen pasar su periodo de asueto en alojamientos plenamente integrados dentro de cada espec&iacute;fico entorno geogr&aacute;fico, integraci&oacute;n que complementan el cordial ambiente de acogida y comunicaci&oacute;n, el disfrute del conservacionismo y no agresivo del paisaje y el contacto directo con la Naturaleza. Para ellos, el Agroturismo se ha convertido en un nuevo, activo y creativo concepto de lo que se conoce como «vacaciones». Pero, ¿qu&eacute; se entiende por Agroturismo? Desde Agroturisme (<a href="http://www.svt.es/unio/agroturisme" target="_new">http://www.svt.es/unio/agroturisme</a>) se da una definici&oacute;n bastante detallada de los que se conoce por Agroturismo: "Turismo que se hace en las casas de labranza. Es una actividad complementaria que hacemos los agricultores en nuestras explotaciones agr&iacute;colas, ganaderas y forestales. Es una oportunidad para hacer un turismo diferente y a la vez conocer la vida de cada d&iacute;a, el trabajo de nuestros agricultores y, c&oacute;mo no, degustar los productos hogare&ntilde;os". En t&eacute;rminos parecidos se expresan los promotores de la p&aacute;gina web de Agroturismo/Turismo Rural en el Pa&iacute;s Vasco (<a href="http://www.encomix.es/nekazal/index.htm" target="_new">http://www.encomix.es/nekazal/index.htm</a>): "El Agroturismo consiste en la presentaci&oacute;n de servicios tur&iacute;sticos de alojamientos y restauraci&oacute;n por parte de agricultores y ganaderos en sus propias granjas y caser&iacute;os (...) Ello permite disfrutar de unas vacaciones tranquilas, sin aglomeraciones, recibiendo un trato familiar y en contacto directo con el mundo rural y la Naturaleza".</P>
<P ALIGN="JUSTIFY">Son muchos los lugares dentro de la Red en los que se ofrece una selecci&oacute;n de los mejores alojamientos rurales, tanto casas como hoteles ubicados en los m&aacute;s bellos parajes de nuestra geograf&iacute;a. Desde Internet se nos abren las puertas de esos cerca de 2.800 establecimientos repartidos por toda la geograf&iacute;a espa&ntilde;ola, y que en la mayor&iacute;a de las ocasiones constituyen lugares ideales para el descanso y el disfrute de la Naturaleza. Y siempre con el &uacute;nico objetivo que podamos disfrutar de nuestro tiempo libre, descubriendo las riquezas paisaj&iacute;sticas, gastron&oacute;micas y culturales que ofrece cada rinc&oacute;n de nuestro entorno rural. Sobresale, por su trascendencia, Infonatura (<a href="http://www.agd.es/infonatura" target="_new">http://www.agd.es/infonatura</a>), donde tambi&eacute;n es posible recopilar informaci&oacute;n sobre actividades en la naturaleza: senderismo, bicicleta, paseos a caballo, puenting, descenso de ca&ntilde;ones, etc., todo aquellos que se realice en contacto directo con esa natiraleza y que entra a formar parte del ocio alternativo.</P>
<P ALIGN="JUSTIFY">En la mayor&iacute;a de las ocasiones, alguna de estas actividades se realizan en una zona cercana a las casas rurales. Otras veces, los propietarios de los establecimientos y las empresas de deportes de aventura crean asociaciones para gestionar e informar sobre las actividades que se pueden desarrollar. Incluso hay algunos due&ntilde;os de alojamientos rurales que se dedican tambi&eacute;n a preparar las salidas para practicar el deporte elegido.</P>
<P ALIGN="JUSTIFY">Sin embargo, y a pesar del auge adquirido por el turismo rural, lo cierto es que todav&iacute;a queda mucho por hacer, y por ello estas empresas deben echar mano de todo lo que est&aacute; a su alcance para promocionarse. Y es aqu&iacute; donde Internet entra en escena, convierti&eacute;ndose en el comunicador m&aacute;s eficiente de las caracter&iacute;sticas del turismo rural en Espa&ntilde;a. Este es el instrumento utilizado por Actur, central de reservas del Valle de Ar&aacute;n (<a href="http://www.actur.com/casas.htm" target="_new">http://www.actur.com/casas.htm</a>), que comenz&oacute; con una web de 14 p&aacute;ginas en 1995 y en la actualidad dispone de 500. En ellas se informa sobre las casas rurales del valle y sus pueblos, gastronom&iacute;a, deportes o arte.</P>
<P ALIGN="JUSTIFY">Existen tambi&eacute;n webs en Internet de Aulas de Naturaleza que integran proyectos que desarrollan un conjunto de medidas de educaci&oacute;n y formaci&oacute;n ambiental, que ofrecen servicios a turistas y que promueven acciones de conservaci&oacute;n de la Naturaleza, con el objetivo de contribuir al desarrollo sostenible de las diferentes zonas de la geograf&iacute;a espa&ntilde;ola. Entre ellas, se distingue el Aula de Naturaleza de Monfrag&uuml;e (<a href="http://www.bme.es/aulamonfra" target="_new">http://www.bme.es/aulamonfra</a>), en Torrej&oacute;n el Rubio (C&aacute;ceres).</P>
<P ALIGN="JUSTIFY"></P>
<h4>Turismo de aventura</h4>
<P ALIGN="JUSTIFY">Evidentemente, &eacute;stas son s&oacute;lo algunas de las miles de sugerencias que contiene Internet, una gigantesca Red que est&aacute; salpicada de p&aacute;ginas realmente ins&oacute;litas. Sin embargo, hay tambi&eacute;n m&uacute;ltiples opciones para aquellos que buscan una manera realmente alternativa y enriquecedora de pasar sus vacaciones, un modo de turismo que les posibilite un mayor contacto con el entorno y disfrutar cada minuto del viaje.</P>
<P ALIGN="JUSTIFY">Son muchas las p&aacute;ginas webs en las que se nos ofrecen unas vacaciones realmente distintas, que huyen del concepto tradicional mismo de lo que se entiende por vacaciones, y en las que se combinan turismo, deporte y gastronom&iacute;a.</P>
<P ALIGN="JUSTIFY">Destaca, por su singularidad, la posibilidad de recorrer los caminos del Valle del Ambroz subidos en carros y atravesar a su ritmo ca&ntilde;adas, caminos y veredas, con la posibilidad de hacerlo tambi&eacute;n sobre un burro, o sobre una bicicleta, o simplemente a pie. Es lo que ofrece Excarro (<a href="http://www.bme.es/excarro/index.html" target="_new">http://www.bme.es/excarro/index.html</a>) en este original recorrido que une las mejores posibilidades del turismo rural y del ecoturismo.</P>
<P ALIGN="JUSTIFY">La pirag&uuml;a se convierte en la actualidad en una opci&oacute;n de deporte y turismo donde la emoci&oacute;n se une a los viajes m&aacute;s atractivos, surcando escenarios que s&oacute;lo en es este medio se pueden vivir. Desde los emocionantes descensos en pirag&uuml;a, a las tumultuosas bajadas en rafting, compartiendo con un equipo de personas las emociones que los r&iacute;os alpinos nos ofrecen. Son muchas y muy variadas las p&aacute;ginas webs que nos ofertan navegar por r&iacute;os de monta&ntilde;as, entre turbulentas aguas y rodeados de paisajes alpinos: Aneto (<a href="http://www.aneto.com/actividad/aguabrav.htm" target="_new">http://www.aneto.com/actividad/aguabrav.htm</a>), Aguas Blancas (http://staragon.com/aguasblancas), Avenatour (http://www.staragon.com/avenatour), etc. La mayor&iacute;a de ellas, centradas en los Pirineos.</P>
<P ALIGN="JUSTIFY">En la misma l&iacute;nea nos encontramos Vacations &amp; Sport (<a href="http://www.ogc.net/Pages/Pag.S.Inicio.html" target="_new">http://www.ogc.net/Pages/Pag.S.Inicio.html</a>), que da la posibilidad, totalmente gratuita, de ser informados peri&oacute;dicamente por e-mail sobre sus ofertas especiales, nuevos paquetes tur&iacute;stico-deportivos o sobre sus actividades que desarrollan en Espa&ntilde;a.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Animaci&oacute;n tur&iacute;stica</h4>
<P ALIGN="JUSTIFY">Internet brinda tambi&eacute;n la oportunidad de poder visitar, si quiera virtualmente, un gran n&uacute;mero de p&aacute;ginas webs a trav&eacute;s de las cuales se dan a conocer las fiestas que durante el periodo estival se celebran en una gran cantidad de localidades espa&ntilde;olas. En la mayor&iacute;a de las ocasiones, los contenidos que se ofrecen en todas ellas intentan trasladar una peque&ntilde;a idea de la personalidad y la magia de esas fiestas, introduciendo el deseo de conocerlas, caso de que a&uacute;n no se haya hecho, en toda su intensidad.</P>
<P ALIGN="JUSTIFY">A trav&eacute;s de la Red, se brindan contenidos para el propio part&iacute;cipe de las fiestas, para el que apenas las conoce y tambi&eacute;n para aquel que desee profundizar en supasado y en su historia. Todos ellos constituyen elementos que en su conjunci&oacute;n complementan los perfiles de celebraciones entra&ntilde;ables, que invitan a vivir las fiestas. A modo de ejemplo, la web que informa sobre las Hogueras de San Juan en Alicante</P>
<P ALIGN="JUSTIFY">(<a href="http://www.alc.es/hogueras98/home.htm" target="_new">http://www.alc.es/hogueras98/home.htm</a>).</P>
<P ALIGN="JUSTIFY"></P>
<h4>Publicaciones</h4>
<P ALIGN="JUSTIFY">Internet no ha pasado tampoco desapercibido para aquellas publicaciones que, desde su versi&oacute;n impresa, tratan de aconsejar nos en nuestra decisi&oacute;n final de a d&oacute;nde acudir las pr&oacute;ximas vacaciones. <I>Escapada</I> (<a href="http://bpenet.bpe.es/escapada" target="_new">http://bpenet.bpe.es/escapada</a>) es una de ellas. Constituye una extensa publicaci&oacute;n que ofrece una selecci&oacute;n de los lugares de la Red m&aacute;s recomendables para terminar de preparar nuestro viaje. Y aunque la informaci&oacute;n que se puede encontrar en la revista es siempre la m&aacute;s completa, a trav&eacute;s de Internet se pueden consultar los horarios y precios de aviones, trenes, barcos, etc., agencias de viajes, hoteles, rutas lugares, y hasta el tiempo que har&aacute; los pr&oacute;ximos d&iacute;as.</P>
<I><P ALIGN="JUSTIFY">Ulises</I> (<a href="http://www.ulises.com" target="_new">http://www.ulises.com</a>) ha sido hasta ahora otra interesant&iacute;sima revista donde la gente explicaba sus experiencias viajeras. Habia tambi&eacute;n quien quer&iacute;a recabar informaci&oacute;n para irse hasta Madagascar, o que deseaba pasar sus vacaciones en Praga o atravesando Ruman&iacute;a en bicicleta. Se pod&iacute;an establecer contactos y preguntar antes de iniciar un viaje, ya que siempre hab&iacute;a alguien en la Red dispuesto a echar una mano. Sin embargo, las escas&iacute;simas colaboraciones que recib&iacute;an han hecho que <I>Ulises</I> se vea obligado a cerrar, ya que a sus promotores les resulta imposible mantener estas p&aacute;ginas en Internet. L&aacute;stima, ya que ha sido una bonita experiencia mientras ha durado. Igual todav&iacute;a se tiene la oportunidad de visitar esta p&aacute;gina web. La verdad es que merece la pena.</P>
<P ALIGN="JUSTIFY">Asimismo, es posible acceder a gu&iacute;as muy detalladas acerca de una infinidad de ciudades y municipios espa&ntilde;oles en las que al margen de informaci&oacute;n propiamente dicha sobre esas localidades tambi&eacute;n se recogen testimonios sobre el entorno geogr&aacute;fico y socio-cultural. De esa manera, se puede conocer mejor el Concejo de Goz&oacute;n, en el Norte del Principado de Asturias (<a href="http://w3.sistelcom.com/gozon" target="_new">http://w3.sistelcom.com/gozon</a>), Estepona (<a href="http://wwwpgb.es/estepona/html/estepon.htm" target="_new">http://wwwpgb.es/estepona/html/estepon.htm</a>), Cogolludo y la Sierra de Guadalajara (<a href="http://guadalajara.interactiva.org/provincia/ruta5.htm" target="_new">http://guadalajara.interactiva.org/provincia/ruta5.htm</a>), o incluso Donostia (<a href="http://www.san-sebastian.com" target="_new">http://www.san-sebastian.com</a>)</P>
<B><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">En resumidas cuentas, ya no nos vale ninguna excusa para que las pr&oacute;ximas vacaciones nos quedemos en nuestros hogares. Basta con echarle un vistazo a Internet para recabar toda la informaci&oacute;n sobre ese lugar deseado o esa forma de veraneo que m&aacute;s nos atrae. Y si a alguien le toca quedarse en su pueblo «cuid&aacute;ndolo» o «haciendo de Rodr&iacute;guez», siempre le queda el consuelo de unas vacaciones «virtuales» a trav&eacute;s de la Red. ¡Sed buenos y disfrutad!</P></FONT></BODY>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

