<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>V</B></font><FONT color="#000000" size=2 face="arial"><B>iviendo en la Red</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:gustavo_herrera@yahoo.com">Gustavo Herrera</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>




<H3>Cybercafés, con aroma virtual</H3>
<P ALIGN=justify>
Lucy estudia Filosof&iacute;a y Letras en la UNAM. 
<br>En la escuela s&oacute;lo puede disponer de una computadora conectada a Internet una vez a la semana por 50 minutos. Al principio esto le bastaba, pero ahora, con tantas cosas que hacer en la red, ella necesita navegar &quot;por fuera&quot; por lo menos otras dos veces a la semana. 
<br>Para Lucy, los Cybercaf&eacute;s se han convertido en una opci&oacute;n que resuelve sus necesidades de interacci&oacute;n con la red. Pero ¿qu&eacute; es un Cybercaf&eacute;?... 
<br><br>
De todas las definiciones que encontr&eacute; la m&aacute;s sencilla y acertada es esta: Un Cybercaf&eacute; es Caf&eacute; m&aacute;s Internet.  
<br>B&aacute;sicamente un Cybercaf&eacute; nos ofrece todo lo necesario para una navegaci&oacute;n placentera por la red,  aunada a los distintos servicios que nos brinda un bar, cafeter&iacute;a, cervecer&iacute;a o restaurante. Una f&oacute;rmula que los &uacute;ltimos a&ntilde;os ha cobrado m&aacute;s y m&aacute;s fuerza. Su historia se remonta al a&ntilde;o de 1984, con la inauguraci&oacute;n en Santa M&oacute;nica, California, USA, del <A HREF="http://www.ecafe.com/"> Electronic Cafe International</A> desde luego que en aquellos a&ntilde;os no exist&iacute;a lo que conocemos hoy como Internet. Pero el lugar fue evolucionando, junto con las conexiones virtuales. En este sitio se conjugan la realidad f&iacute;sica del lugar, con su realidad virtual, ofreci&eacute;ndose encuentros comunes a trav&eacute;s de la videoconferencia, fiestas amenizadas con DJ y encuentros con todo tipo de temas. Otros Cybercaf&eacute;s pioneros son:</P>
<P ALIGN="JUSTIFY"></P>
<font color="#000000"><A HREF="http://www.linkoping.se/berzelius/projekt/cybercafe/itcatxt.htm">BerZyber</A> en Suecia</P>
<A HREF="http://www.peakcafe.demon.co.uk/">Peak Art Cyber Caf&eacute;</A> de Inglaterra</P>
<A HREF="http://www.well.com/user/tcircus/Icon/icon2.html">ICON-Byte Bar&amp;Grill</A> es San Francisco, California</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Posteriormente, el fen&oacute;meno se disemin&oacute; por casi todos los confines del planeta. Con sus variantes, dependiendo del lugar, podemos encontrar en un Cybercaf&eacute; los siguientes servicios de Internet: Navegaci&oacute;n, Chat, Correo electr&oacute;nico, FTP: transferir o enviar ficheros con informaci&oacute;n, Noticias: Grupos de conversaci&oacute;n, consulta y noticias sobre temas espec&iacute;ficos, Telnet: Conexi&oacute;n real del equipo con un servidor externo. Teleconferencia: Charla en tiempo real. Videoconferencia: conversaci&oacute;n en tiempo real, asistidos por una videocamara, Dise&ntilde;o de p&aacute;ginas personales, alojamiento de p&aacute;ginas personales en el servidor del cybercaf&eacute;, conexi&oacute;n individual a Internet,  Juegos diversos en la Red e impresi&oacute;n de documentos. 
<br><br>
En el Distrito Federal, (M&eacute;xico) los precios por hora de conexi&oacute;n oscilan entre los 30 a los 60 pesos ( 3 a 6 USD). 
<br>Si se tratara de clasificar los distintos lugares que ofrecen este servicio, tendr&iacute;amos que considerar que cada uno, adem&aacute;s de los servicios descritos de Internet, ofrecen su particular filosof&iacute;a comercial de negocio. Para muchos, los cybercaf&eacute;s son el primer punto de contacto de quien est&aacute; interesado en conocer Internet. En ellos se puede leer un peri&oacute;dico, navegar por las p&aacute;ginas web, enviar un correo a un amigo, chatear, mientras se toma una cerveza bien fr&iacute;a o alg&uacute;n bocadillo especial. La gente que concurre a ellos tambi&eacute;n proviene de distintos or&iacute;genes: Profesionistas, estudiantes, curiosos, snobs, feministas, actores, parejas de novios y toda suerte de gente atra&iacute;da por un tema: Internet. 
<br><br>
Con respecto a la infraestructura tecnol&oacute;gica que requiere un cybercaf&eacute;, tambi&eacute;n con sus variantes, cuando menos debe considerarse, un acceso dedicado a Internet, un servidor web y las computadoras necesarias seg&uacute;n el tama&ntilde;o del lugar. 
<br><br>En algunos lugares se proporcionan, adicionalmente, cursos, conferencias y eventos especiales. Un cybercaf&eacute; nos da la oportunidad no solo de interactuar con los parroquianos del lugar, sino tambi&eacute;n es un perfecto escaparate para convivir con la amplia comunidad virtual. 
<br><br>Sin duda, el futuro de los cybercaf&eacute;s es incierto. A medida que se generalice el uso de las computadoras, cuando todas las familias dispongan de un acceso a Internet, seguramente los cybercaf&eacute;s experimentaran algunas transformaciones. Como sabemos, el futuro de Internet est&aacute; directamente asociado a la evoluci&oacute;n y desarrollo de las telecomunicaciones. 
<br>Internet s&oacute;lo acaba de nacer. Y los Cybercaf&eacute;s navegan a su lado. Hoy por hoy, el cybercaf&eacute; es una opci&oacute;n para deleitarse de un buen capuchino con delicioso aroma virtual.</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="inetb.htm"><font FACE="ARIAL"><B>[Viviendo en la Red]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

