<HTML>
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>
<A HREF="mailto:PTS@arrakis.es">José Antonio Albero "PTS".</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Entrevista a Nacho García.
</FONT>
</H3>

<p align=justify>

<FONT color="#000000" size=2 face="arial" >        
<P align="justify">
<P ALIGN="JUSTIFY">Desde Macedonia queremos apoyar y dar a conocer a aquellos grupos que desarrollan videojuegos en Espa&ntilde;a, que con presupuestos modest&iacute;simos y escasos medios t&eacute;cnicos se quieren hacer un hueco dentro de esta industria.</P>
<P ALIGN="JUSTIFY">Este mes le ha tocado el turno a MIXT DIMENSION. Nacho Garc&iacute;a, programador de este grupo tiene muchas cosas interesantes que contarnos.</P>
<hr>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>Macedonia Magazine.- </b></font><font size=2><i>¿Cu&aacute;nta gente forma parte de MIXT DIMENSION?</i></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>Nacho García.- </b></font><font size=2>Somos tres programadores, un grafista y un m&uacute;sico. En estos momentos el ser m&aacute;s causar&iacute;a mas descoordinaci&oacute;n que beneficios; Para pr&oacute;ximos proyectos buscaremos a m&aacute;s componentes; Eso s&iacute;, somos pocos pero todos con mucha experiencia en el mundillo. Eso ayuda mucho.</p>
<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY">
<table align = left>
<td><img src="gif/mixt2.gif" border=1></td>
<tr><td><center>
<FONT color="#000000" size=1 face=arial ><b>The Ghost</b>
</center></td></center>
</table>
<p align=justify>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>
¿Crees que con tan pocos componentes se pueden desarrollar videojuegos competitivos a nivel nacional e internacional?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Bueno, hacer puedes hacer lo mismo que cualquier compa&ntilde;&iacute;a grande, pero tardas m&aacute;s (risas). Realmente 5 personas como es nuestro caso es un n&uacute;mero suficiente para hacer cualquier juego comercial, aunque por supuesto el esfuerzo es mucho mayor. Tambi&eacute;n es importante realizar proyectos asequibles a la capacidad tanto humana como t&eacute;cnica del grupo; Es mucho mejor un peque&ntilde;o juego publicado que un gran juego sin acabar en el caj&oacute;n. Hay que ser conscientes de nuestras limitaciones; Con el tiempo iremos mejorando.</P>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>¿Ten&eacute;is alg&uacute;n sitio espec&iacute;fico donde desarroll&eacute;is los juegos?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Cada uno en su casa. La gente con preparaci&oacute;n y experiencia, que ha tenido un aprendizaje autodidacta y ha sacado adelante en solitario sus propios juegos, no necesita tener a un jefe constantemente encima suyo; Soy un firme defensor del teletrabajo, m&aacute;xime en una profesi&oacute;n como la nuestra. A trav&eacute;s de Internet se coordina el grupo, pero cada uno tiene que saber exactamente su tarea. </P>
<P ALIGN="JUSTIFY">El rendimiento de un programador aumenta much&iacute;simo cuando esta tranquilamente en su habitaci&oacute;n, en zapatillas con su caf&eacute; y en su &quot;h&aacute;bitat natural&quot;, al horario donde el vea que mejor se concentra. A esa conclusi&oacute;n llegan cada vez m&aacute;s muchas compa&ntilde;&iacute;as en todo el mundo, aunque hay quien sigue con esquemas laborales m&aacute;s propios del siglo XIX.</P>
<P ALIGN="JUSTIFY">Personalmente, me parecer&iacute;a un tanto absurdo que una editorial tuviese a sus escritores haciendo novelas en una oficina, entrando a las 8:00 y saliendo a las 16:00. En el caso de la programaci&oacute;n de videojuegos es similar. Cada uno ha de ser suficientemente profesional y responsable como para saber su cometido en el engranaje.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>¿Ten&eacute;is experiencia en este campo?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Como te he dicho antes, todos llevamos mucho tiempo programando, y hemos llevado a cabo proyectos de forma individual. Yo personalmente empec&eacute; a programar hace 16 a&ntilde;os y publique un juego (junto con el actual grafista de Mixt Dimension) hace ocho a&ntilde;os. No obstante aun nos queda por obtener much&iacute;sima experiencia, sobre todo en el campo comercial. Nunca se acaba de aprender en esta profesi&oacute;n, y esa es una de las cosas m&aacute;s bonitas que tiene.</P>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Muchos de los &uacute;ltimos videojuegos programados son t&eacute;cnicamente muy buenos pero pecan de falta de originalidad o de una adicci&oacute;n muy baja, ¿vosotros tambi&eacute;n le dais m&aacute;s importancia al aspecto t&eacute;cnico que a la parte adictiva del juego?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>La t&eacute;cnica es necesaria, pero nunca ha de ser un fin en s&iacute; misma. Hacemos juegos, no demos. Un juego debe de ser en primer lugar, entretenido, y despu&eacute;s, ser cauce de expresi&oacute;n art&iacute;stica y ser capaz de transmitir ideas y emociones al jugador. La t&eacute;cnica est&aacute; ah&iacute; para ayudar a conseguir todo eso. Eso no quiere decir que descuidemos el apartado t&eacute;cnico, pero siempre sin perder de vista esos valores esenciales.</P>
<P ALIGN="JUSTIFY">En cuanto a la falta de originalidad de los actuales videojuegos, es un problema de los editores y no de los desarolladores; Hay mucho miedo en el mercado a arriesgar dinero realizando algo nuevo, es mucho m&aacute;s f&aacute;cil apostar a lo que la gente ya conoce y se vende seguro. Quiz&aacute;s a medio plazo eso funcione, pero a la larga el p&uacute;blico se satura y busca algo distinto. Nosotros intentaremos desarrollar productos que aporten algo lo suficientemente novedoso como para romper el hast&iacute;o del p&uacute;blico, y a la vez no tan distinto como para que ning&uacute;n editor se atreva a publicarlo. Es un equilibrio delicado que solo pueden romper aquellos con capacidad de presi&oacute;n sobre las distribuidoras. Obviamente no es nuestro caso de momento, aunque no renunciamos a ello (risas).</P>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Cuando antes me has hablado de los integrantes de MIXT DIMENSION, no me has dicho que exista ninguna persona encargada de dise&ntilde;ar el juego. ¿No crees que el contar con alguien especializado en esta materia le har&iacute;a subir muchos puntos al juego?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Por supuesto. El futuro est&aacute; en la especializaci&oacute;n en tareas espec&iacute;ficas, y llegar&aacute; un momento en el que la diversidad de tareas y especialistas en un juego sea similar a las del cine. Por ahora en nuestro caso es principalmente el grafista quien marca las l&iacute;neas esenciales del proyecto, pues aceptamos que es &eacute;l quien tiene mas imaginaci&oacute;n (los programadores somos mucho menos imaginativos). Pero no descarto incorporar al grupo a alguien con rodaje en guiones, por ejemplo. Me parece esencial.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Creo que ya va siendo hora de que me hables sobre vuestros proyectos, juegos publicados, expectativas de futuro... . </P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>A los tres miembros iniciales de Mixt Dimension (El m&uacute;sico, el grafista y yo), que hicimos varios juegos para Spectrum y PC (Ares, Necrolomicom, TheGhost-MSDOS,..), se unieron Daniel Iborra (autor de PingPong, publicado por StRAtOS) y Carlos Candela. As&iacute; constituido Mixt Dimension actualmente, en breve saldr&aacute; al mercado The Ghost para Windows (con StRAtOS), que es un arcade/inteligencia filmation, bastante original. Tambi&eacute;n saldr&aacute;n Floid, que es un arcade ligero y muy divertido para jugar por red (con sabor a bubble-bubble) y Day Dreamer, un arcade/aventura parallax con una t&eacute;cnica y un desarrollo que dejara el list&oacute;n muy alto en los juegos en 2D y ser&aacute; adem&aacute;s, nuestra despedida de estas t&eacute;cnicas.</P>
<P ALIGN="JUSTIFY">Adem&aacute;s tenemos una herramienta de programaci&oacute;n para Windows a punto de salir como shareware y que espero dar&aacute; mucho que hablar, pues se trata de un kit completo que simplificar&aacute; enormemente la realizaci&oacute;n de juegos para Windows, por el momento solo en 2D.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n hay alguna colaboraci&oacute;n con otros grupos, como la versi&oacute;n Windows de &quot;El Sulfato At&oacute;mico&quot; mano a mano con nuestros colegas de Alcachofa Soft.</P>

<P ALIGN="JUSTIFY">Pero todo esto no es m&aacute;s que la terminaci&oacute;n conjunta de proyectos que ven&iacute;amos realizando independientemente y no aun el resultado de Mixt Dimension como tal, que tiene proyectos muchos mas ambiciosos. Nuestro pr&oacute;ximo trabajo conjunto ser&aacute; una aventura 3D, donde pondremos en pr&aacute;ctica muchas ideas tanto t&eacute;cnicas como de desarrollo que no se han utilizado hasta ahora. Ah&iacute; es donde definitivamente Mixt Dimension se posicionar&aacute; en el mercado con nuestra personalidad propia realizando juegos, y que desde luego, no tendr&aacute; nada que ver con lo realizado hasta ahora. Aun es pronto para detallarte en que consistir&aacute; este juego, pero ser&eacute; muy feliz el d&iacute;a que me hagas una entrevista hablando exclusivamente de &eacute;l... que ser&aacute; cuando lo tengamos suficientemente avanzado como para que nadie nos &quot;lo pise&quot;. Si, yo tambi&eacute;n odio el secretismo, pero que le vamos a hacer.</P>
<P ALIGN="JUSTIFY">
<center><table>
<td><img src="gif/mixt3.gif" border=1></td>
<tr><td><center>
<FONT color="#000000" size=1 face=arial ><b>The Ghost</b>
</center></td></center>
</table></center>
<p align=justify>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>¿Qu&eacute; pasos segu&iacute;s a la hora de realizar un videojuego?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Primero hay que saber que se quiere hacer, y que objetivos se pretenden. Esto ha de estudiarse atendiendo a m&uacute;ltiples factores, como la situaci&oacute;n previsible del mercado que se dar&aacute; en el momento de su publicaci&oacute;n. Una vez determinado el tipo de juego, el grafista-guionista dise&ntilde;a un embri&oacute;n consultando la viabilidad con el equipo de programaci&oacute;n, a lo que no se suelen poner demasiadas pegas, y se determina la t&eacute;cnica necesaria para dar salida al juego que se pretende. Despu&eacute;s de muchas vueltas y generalmente varios recortes hasta ajustarlo a algo que se pueda hacer en un tiempo prudencial, se dise&ntilde;a claramente todo lo que hay que realizar y se divide como una tarta entre los miembros del grupo, asignando tareas.</P>
<P ALIGN="JUSTIFY">Tras varios meses de trabajo y los inevitables retoques, todo va encajando, y tras el horrible programa de betas y testeos el juego finalmente ve la luz. Es el momento de los abrazos, el champ&aacute;n y las felicitaciones, y luego todo vuelve a empezar.</P>
<P ALIGN="JUSTIFY">Supongo que no hay recetas m&aacute;gicas para hacer un juego; Es un trabajo duro y la tentativa de mandarlo todo al garate y dedicarse a algo que de menos dolores de cabeza siempre est&aacute; presente. Pero a pesar de todo nos gusta ¿qu&eacute; otra cosa podr&iacute;amos hacer en la vida? (risas)</P>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>He visto que est&aacute;is utilizando las DIRECT3D en vuestro &uacute;ltimo proyecto, pero existen otras librer&iacute;as alternativas, como son las OpenGL y las GLIDE. ¿Qu&eacute; ha sido determinante en vuestra elecci&oacute;n?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>GLIDE nunca lo hemos considerado porque se trata de una librer&iacute;a espec&iacute;fica para 3DFX y este chipset no es el &uacute;nico del mercado y es mas, su cuota esta descendiendo paulatinamente. Ya no es ni mucho menos el mejor, tarjetas como las basadas en Riva TNT lo superan ampliamente. Con el tiempo, y no mucho, 3DFX desaparecer&aacute; y con &eacute;l la librer&iacute;a GLIDE. Apostar por un 3DFX en decadencia para un juego que tardar&aacute; aun m&aacute;s de un a&ntilde;o en ver la luz ser&iacute;a una locura.</P>
<P ALIGN="JUSTIFY">En cuanto a OpenGL, es realmente una buena librer&iacute;a con amplias posibilidades, pero pensada para programas de rendering y no para tiempo real. El coste del hardware OpenGL es elevado y el mercado de consumo no se dirige hacia el, pues es una plataforma claramente orientada hacia NT y el segmento profesional. Lo mejor no tiene porque ser siempre lo mas adecuado para el mercado al que nos dirigimos, a nosotros nos gustar&iacute;a hacer un juegazo con IrixGL y para Silicon Graphics pero no vender&iacute;amos mucho.</P>
<P ALIGN="JUSTIFY">Por tanto, solo nos queda Direct3D. Claramente todo el hardware 3D dom&eacute;stico se dise&ntilde;a para Direct3D y as&iacute; seguir&aacute; siendo en el futuro. Quiz&aacute;s no sea el API de nuestros sue&ntilde;os pero es una apuesta segura por la compatibilidad y la permanencia, cuenta con el apoyo de Microsoft y eso ya dice mucho. Eh, no es que tengamos simpat&iacute;as por Microsoft, es que no hace falta ser muy brillante para darse cuenta de que en el mercado dom&eacute;stico de PC se hace lo que Microsoft diga. </P>

<P ALIGN="JUSTIFY">Por tanto, asumimos como inevitable usar Direct3D para conseguir llegar al m&aacute;ximo numero de usuarios posibles. Pero no es algo que nos preocupe, solo es un hecho que aceptamos (como aceptamos hacerlo para Windows, por ejemplo) sin mayores traumas. Vamos a centrarnos en el juego en s&iacute; y como tal ser&iacute;a igualmente bueno en Glide, OpenGL o para Play Station. No le demos al API 3D m&aacute;s importancia de la que tiene...</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>¿Crees que en el mundo de las 2D est&aacute; ya todo inventado y por eso  todas las compa&ntilde;&iacute;as desarrolladoras de juegos se han pasado a las 3D? </P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Se pueden hacer grandes juegos en dos dimensiones y no tengo nada en su contra mientras sean entretenidos y aporten algo. Nosotros no creemos que en 2D este todo inventado ni mucho menos, y tambi&eacute;n deploramos que un juego 3D tenga como &uacute;nico valor ser en tres dimensiones.</P>
<table align = right>
<td><img src="gif/mixt4.gif" border=1></td>
<tr><td><center>
<FONT color="#000000" size=1 face=arial ><b>The Ghost</b>
</center></td></center>
</table>
<p align=justify>

<P ALIGN="JUSTIFY">Pero en nuestro caso, sencillamente, las 2D se nos han quedado cortas. Las 3D admiten muchas mas posibilidades, por ejemplo, si queremos (que queremos) hacer un juego donde en cada momento la c&aacute;mara tome el plano mas adecuado a la acci&oacute;n, eso solo se puede hacer con t&eacute;cnicas de tres dimensiones, o de otra manera ser&iacute;a una cantidad imposible de RAM, y hasta mas trabajo. Tambi&eacute;n las t&eacute;cnicas 3D permiten mucha mas variedad de animaci&oacute;n y con mas suavidad sin un gasto excesivo de RAM, y es casi imposible hacer una iluminaci&oacute;n din&aacute;mica y adecuada con t&eacute;cnicas 2D. </P>
<P ALIGN="JUSTIFY">Por tanto en nuestro caso el pr&oacute;ximo proyecto ser&aacute; en tres dimensiones simplemente porque lo que pretendemos ser&iacute;a imposible hacerlo en dos. Como te he comentado antes, la t&eacute;cnica siempre ha de ajustarse al juego que se quiere hacer y no a la inversa.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Una vez finalizados los juegos, ¿qui&eacute;n os los va a distribuir?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>Al menos para los actuales proyectos, es StRAtOS quien se encarga de buscarles una salida. No puedo decirte, con seguridad, si saldr&aacute; con tal o cual distribuidora. Los grupos peque&ntilde;os como nosotros no tenemos ninguna fuerza ah&iacute; arriba. El mercado manda.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>¿Hab&eacute;is recibido ofertas de alguna compa&ntilde;&iacute;a importante?</P>
</I>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>N. G.- </b></font><font size=2>No, porque nuestros juegos no son importantes (risas). Con el pr&oacute;ximo proyecto 3D si esperamos llamar la atenci&oacute;n de alg&uacute;n pez gordo, y nuestros proyectos actuales ir&aacute;n allanando el camino para ese salto cualitativo. Esperamos que eso sea as&iacute;. </P></FONT>
<BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR><hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
