<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Mamá, en la escuela me dicen cyberpunky
</FONT>
</H3>

<P ALIGN=justify>

<FONT color="#000000" face="arial" size=2>        
no de los muchos defectos de nuestra sociedad, cada vez m&aacute;s unificada y global y, al mismo tiempo, dividida, parcelada, segmentada y etiquetada es,  precisamente, esa tendencia injusta de poner nombre a todo. De poner t&iacute;tulos, a la primera, de cambio a cada conjunto social, tendencia, costumbre o forma de moverse. A la que te descuidas ya hay un listo que dice de ti que eres ciber-yo-que-s&eacute;, neo-esto o mega-lo-otro. Si bien es cierto que los tiempos cambian y con ellos surgen nuevas tendencias, eso no da pie a que se piense que una serie de individuos, por tener aparentemente ciertos aspectos en com&uacute;n, compartan una denominaci&oacute;n inventada por el novelista de moda o el periodismo "de vanguardia" de nuestro pa&iacute;s y que, seguramente, se copi&oacute; del "New York Times" o de la novela que m&aacute;s vendi&oacute; en USA la temporada pasada. Adem&aacute;s, aqu&iacute; nos los venden en versi&oacute;n original, sin subt&iacute;tulos: cyberpunks, hackers, crackers y yo que s&eacute; que m&aacute;s palabros en guiri.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seg&uacute;n la prensa, el perfil del joven de hoy es algo conservador, comprometido con la naturaleza, apol&iacute;tico, cibern&eacute;tico y alcoh&oacute;lico. Pues muy bien. No me lo creo. Yo soy joven y quiz&aacute;s me identifique con parte de eso, pero considero injusto ser metido en un mismo saco con una misma etiqueta para todos. Simplemente porque todos somos diferentes. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tengo ordenador, estoy conectado a INTERNET y paso varias horas a la semana navegando por la RED. Es m&aacute;s, mi trabajo est&aacute; muy relacionado con eso. Considero INTERNET uno de los inventos m&aacute;s &uacute;tiles y provechosos de la modernidad para el individuo de a pie. Algunos d&iacute;as he pasado m&aacute;s de cinco horas delante del ordenador, mantengo en activo dos p&aacute;ginas WEB y colaboro en una tercera (esta), mantengo correspondencia electr&oacute;nica habitual con gente de este y otros pa&iacute;ses, alguna vez he pasado bastantes horas diciendo chorreces en el chat, tengo en mi disco duro im&aacute;genes de t&iacute;as en bolas y hay noches en las que sue&ntilde;o en HTML. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero no soy un antisocial, me gusta la poes&iacute;a y la m&uacute;sica de los m&aacute;s variados estilos, veo muy poco la tele, voy al cine a menudo, no tengo ni idea de lo que es un cyberpunk, considero que puedo mantener una conversaci&oacute;n coherente sobre cualquier tema dentro de mis limitados conocimientos, me gusta dibujar, no cambiar&iacute;a jam&aacute;s una comida con mis amigos por una sesi&oacute;n de ordenador, me interesa la pol&iacute;tica tanto como el f&uacute;tbol, leo la prensa semanalmente, viajo cuanto puedo, me gustan mucho las mujeres, mi dinero me lo gasto en copas, CD's, libros, revistas y ropa. Me he librado de la mili, abandon&eacute; la carrera de inform&aacute;tica porque al empezarla tuve la suerte de encontrar trabajo y hoy el ordenador me da para vivir. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este soy yo. Estos renglones, m&aacute;s un pu&ntilde;ado de caracter&iacute;sticas m&aacute;s definen mi persona. Y al igual que yo, todos los de mi generaci&oacute;n somos distintos, aunque algunos compartamos ciertas costumbres. La supuesta alienaci&oacute;n de los j&oacute;venes de hoy es en gran parte fruto de los que nos quieren crear as&iacute;. Buenos, malos, feos, guapos, amigables, solitarios, conservadores, progresistas, simp&aacute;ticos, aburridos... Como la vida misma: simplemente diferentes.</P></FONT></BODY>

<BR>
</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

