<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
A buen entendedor...
</FONT>
</H3>

<P ALIGN=justify>

<FONT color="#000000" face="arial" size=2>        
o hay mal que cien a&ntilde;os dure. Esta es una de las muchas frases del saber popular que pone de manifiesto uno de los principios filos&oacute;ficos m&aacute;s repetidos de todos los tiempos: el concepto del cambio, el movimiento cont&iacute;nuo de las cosas. Lo que hoy es blanco seguramente ayer fuera negro o de cualquier otro color. Cuando apenas nos acostumbramos a una forma de actuar ya est&aacute; sembrada la semilla de nuevas tendencias y procesos y, al poco tiempo, nos encontramos inmersos en una din&aacute;mica totalmente distinta a la anterior. Es la vida.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los modelos sociales y econ&oacute;micos actuales son el resultado del cambio y evoluci&oacute;n del hombre con el transcurso de los a&ntilde;os. Esto nos hace pensar que la forma en que nos relacion&aacute;bamos y gestion&aacute;bamos nuestra riqueza hace siglos hoy sea considerada obsoleta, poco &uacute;til e incluso rid&iacute;cula. Motivo m&aacute;s que suficiente para, utilizando m&iacute;nimamente el sentido com&uacute;n, deducir que no estamos en la cima de los tiempos y que los modelos, roles y estructuras del presente, en breve, caer&aacute;n sustituidos por otros considerados simplemente mejores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Utilizando nuestra capacidad deductiva, imaginaci&oacute;n y, por qu&eacute; no decirlo, buenas intenciones, podemos vislumbrar el cansancio que producen hoy en ciertos c&iacute;rculos sociales, sobre todo entre los m&aacute;s j&oacute;venes, las estructuras que han sostenido la sociedad de finales de siglo: capitalismo apabullante, la econom&iacute;a como elemento de culto por encima de todo, la competencia feroz y sus consecuencias como forma de adquirir un estatus de prestigio basado en la acumulaci&oacute;n de riqueza, la cultura del todo vale con el prop&oacute;sito de la perpetuaci&oacute;n en el poder pol&iacute;tico y la cont&iacute;nua promoci&oacute;n, alabanza, defensa y sost&eacute;n de los modelos econ&oacute;micos actuales que lo &uacute;nico que est&aacute;n consiguiendo es la calidad de vida de unos pocos a costa del deterioro de la de cada vez mayor n&uacute;mero de personas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las nuevas generaciones, a&uacute;n no contaminadas por la sedimentaci&oacute;n de ideas que produce el paso de los a&ntilde;os, quiz&aacute;s vean con m&aacute;s claridad que los conceptos de competitividad, parcelaci&oacute;n y divisi&oacute;n en los que se asienta la sociedad actual no desembocar&aacute;n en buen puerto e instintivamente, porque cae por su propio peso y, porque no pod&iacute;a ser de otra manera, est&aacute;n desarrollando la simiente de lo que ser&aacute; la sociedad del futuro, que nadie sabe como funcionar&aacute; pero que s&iacute; sabemos como est&aacute; empezando a formarse.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La idea que me da pie a esta serie de consideraciones es la, cada vez m&aacute;s, constante presencia de la juventud en movimientos ecologistas, asociaciones humanitarias y de cooperaci&oacute;n de distinta naturaleza y, m&aacute;s que nada, por mi profesi&oacute;n y por el cont&iacute;nuo contacto que tengo con Internet, la serie de din&aacute;micas de trabajo que la RED est&aacute; generando y que son excusa m&aacute;s que justificada de estudios sociol&oacute;gicos de considerable importancia.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Internet es una plataforma de trabajo donde la colaboraci&oacute;n es indispensable para el beneficio del conjunto de la comunidad de usuarios. La posibilidad de poder establecer contacto real sin los l&iacute;mites de las fronteras espaciales ha abierto un campo para el trabajo en com&uacute;n que est&aacute; haciendo que miles de ciudadanos de las m&aacute;s distintas procedencias compartan proyectos utilizando los recursos de la propia red Internet y haciendo que el resultado de esos proyectos quede accesible, de manera libre y gratuita en muchos casos, al resto de usuarios para que estos puedan utilizarlos y volver a generar proyectos nuevos empezando de nuevo un ciclo donde el concepto compartir choca frontalmente con el de competir, al que estamos tan acostumbrados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Ejemplos concretos? La construcci&oacute;n de dos sistemas operativos, Freedows y Linux, se est&aacute;n desarrollando de manera altruista por miles de colaboradores an&oacute;nimos de todos los rincones del planeta con la intenci&oacute;n, de cuando est&eacute;n acabados dejarlos para su libre utilizaci&oacute;n. Gratis. Sin pagar. ¿Cu&aacute;ndo se ha visto un fen&oacute;meno parecido en otros &aacute;mbitos de la vida de una forma tan extendida? Bill Gates se ha hecho millonario vendiendo sistemas operativos para los que ha tenido que pagar a miles de operarios que han trabajado en ellos durante a&ntilde;os. Y ahora dos jovencitos est&aacute;n dirigiendo a miles de personas, que no cobran un duro, y que est&aacute;n haciendo sistemas operativos gratuitos que en much&iacute;simas facetas superan las caracter&iacute;sticas de Windows9x. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No podemos evitar buscar el gato encerrado por alguna parte. "Esto no puede ser, nadie da nada gratis, alguna trampa debe de haber" es la respuesta que he recibido en muchos de los cursos de Internet que he impartido cuando he hablado de esto. Pues de momento no hay trampa. ¿C&oacute;mo ha reaccionado la industria? A estas alturas uno de los grandes, Netscape, ha anunciado que har&aacute; p&uacute;blico y gratuito el c&oacute;digo fuente de su popular programa Navigator para que los usuarios lo modifiquen y trabajen en &eacute;l a su antojo. ¿Coincidencia? Ya saben... Si no puedes con ellos...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Basten estos dos ejemplos, cabeza de un iceberg que cada vez es m&aacute;s grande y que, sin duda, alcanzar&aacute; dimensiones importantes en los pr&oacute;ximos a&ntilde;os, para darse cuenta de que las cosas est&aacute;n cambiando. Muy lentamente, en este caso a unos niveles dif&iacute;cilmente detectables por el gran p&uacute;blico que no tiene acceso al mundo inform&aacute;tico, pero que son las pocas palabras que necesita un buen entendedor para saber que los tiempos se mueven, que nada es est&aacute;tico, y que lo que hoy tenemos como v&aacute;lido y aceptable delante de nuestras narices en a&ntilde;os, d&eacute;cadas o qui&eacute;n sabe cuando, puede ser muy distinto. En ello estamos.</P></FONT></BODY>

<BR>
</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

