<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Telefónica, hijo único.
</FONT>
</H3>

<p align=justify><FONT color="#000000" face="arial" size=2>        
Telef&oacute;nica ha sido durante muchos a&ntilde;os la &uacute;nica forma de tener tel&eacute;fono en Espa&ntilde;a. Una empresa estatal preocupada &uacute;nicamente de obtener beneficios a toda costa y de aumentar ingresos sin tener en cuenta para nada los intereses de los usuarios. Hace a&ntilde;os el servicio era penoso, todos recordamos los cruces de l&iacute;neas, fallos en el sistema y dem&aacute;s deficiencias de una red de tel&eacute;fonos que empez&oacute; a levantar un poco la cabeza con la llegada de los 80 y con la remontada de Espa&ntilde;a a nivel internacional. Esta situaci&oacute;n de privilegio hizo que "La primera multinacional espa&ntilde;ola" comprase parte de las infraestructuras de telecomunicaciones de pa&iacute;ses sudamericanos para sacar tambi&eacute;n tajada de nuestros vecinos en Am&eacute;rica. Era parte del orgullo espa&ntilde;ol.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aparte de imponer la tarificaci&oacute;n que les ven&iacute;a en gana gracias a la libertad de no tener competencia con la que luchar, el sistema de cobro por el servicio no ten&iacute;a desperdicio. Te facturaban por pasos, pagando siempre m&aacute;s de lo que has consumido y si tenemos en cuenta el tema de las cabinas, donde en muchas ocasiones se tragaban parte del cambio, el descaro es may&uacute;sculo. Y no s&oacute;lo eso, esto de lo que hablamos se circunscribe al &aacute;mbito del servicio general de llamadas. Telef&oacute;nica ofrece aparte servicios de transmisi&oacute;n de datos y telecomunicaciones a empresas de nivel medio-alto y alto, donde los beneficios son ping&uuml;es.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con la llegada del PP, Jos&eacute; Mar&iacute;a Aznar concede a su amigo de la infancia y compa&ntilde;ero de colegio, el Sr. Vilallonga, presidente de Telef&oacute;nica, la posibilidad de privatizar la empresa. Y all&aacute; va. Hoy telef&oacute;nica tiene intereses repartidos a los cuatro vientos, unos ingresos millonarios y participaci&oacute;n directa en los gustos e intereses de los ciudadanos con su entrada en grupos de control de medios de comunicaci&oacute;n. La situaci&oacute;n es inmejorable.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Llegan nuevos aires. Somos europeos y ya no se puede aguantar m&aacute;s la situaci&oacute;n, ser&iacute;a demasiado descarado. Para modernos nosotros, los espa&ntilde;oles, ¿hay que liberalizar el mercado de las telecomunicaciones?, no se hable m&aacute;s. Ya tenemos encima al segundo operador de telefon&iacute;a y en poco tiempo los que faltan por llegar. Aparece Retevisi&oacute;n cobrando por segundos y en Telef&oacute;nica se tiran de los pelos declarando que vaya descaro y falta de respeto haciendo competencia desleal. Sin palabras.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A todo esto Internet empieza a subir como la espuma (y lo que queda). Retevisi&oacute;n compra RedesTB y Servicom y se hace de una vez con los proveedores de acceso que mayor n&uacute;mero de usuarios aglutinan en Espa&ntilde;a. Los Telef&oacute;nicos andan locos para no quedarse atr&aacute;s y comerse las sobras. Mientras tanto, el operador alternativo a&uacute;n no tiene posibilidades de ofrecer servicio de llamadas locales (gran pedazo de la tarta) aunque prometen que llegar&aacute; pronto. El gobierno se luce con su &uacute;ltima oportunidad de subir las tarifas, los m&aacute;s perjudicados los usuarios de Internet, a quienes la subida les afecta en m&aacute;s del doble. Telef&oacute;nica dice que como la subida no ha sido cosa de ellos no les parece bien.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A estas alturas Telef&oacute;nica sigue presumiendo de ser una de las empresas punteras del pa&iacute;s y que su trabajo es comparable al de las grandes multinacionales internacionales del sector. En Estados Unidos, las grandes multinacionales del sector casi regalan las llamadas locales y a los usuarios de Internet les cobran 3.000 o 4.000 pesetas al mes para que se conecten el tiempo que les de la gana. Aqu&iacute; muy modernos en todo menos a la hora de sacar las pelas. El creciente n&uacute;mero de usuarios que dependen de Internet para su trabajo ha de pagar actualmente el tiempo de conexi&oacute;n a la red a unas tarifas elevadas y que se duplicar&aacute;n en poco tiempo. Esa fantas&iacute;a de la conexi&oacute;n total hoy es posible en nuestro pa&iacute;s a un precio desorbitado, empieza a sonar por algunos c&iacute;rculos oficiales el concepto de tarifa plana que se afirma y desmiente un d&iacute;a s&iacute; y otro tambi&eacute;n y mientras tanto, Internet, ese s&iacute;mbolo de modernidad del que cada vez hablan m&aacute;s pol&iacute;ticos e intelectuales, basti&oacute;n de libertades y piedrecita en el zapato que se puede convertir para muchos Estados est&aacute; al alcance s&oacute;lo de una minor&iacute;a con holgada capacidad y, si las cosas siguen as&iacute;, en vez de m&aacute;s cada vez seremos menos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; est&aacute;n las cosas. Seguimos siendo el pa&iacute;s del chollo. Del chollo de lo nuevo. Muy modernos en todo, muy vanguardistas, ciber-esto y tecno-lo-otro pero a la hora de la verdad si no hay pela no hay tela. Y Telef&oacute;nica, empresa que ha sido pagada por todos los espa&ntilde;oles y crecida bajo la tutela del Estado la primera beneficiaria. Nada nuevo bajo el sol.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay cosas m&aacute;s importantes de las que quejarse, por supuesto. Pero esto nos toca muy de cerca a cada vez m&aacute;s personas que dependemos este nuevo invento para vivir y somos nosotros los que vamos pagando la novatada. Telef&oacute;nica es actualmente la amargura del usuario de Internet, que ha de contar sus minutos de conexi&oacute;n y restringir sus posibilidades porque hay gente que se est&aacute; comiendo un pastel muy grande a costa de esta clase media trabajadora que ha encontrado en la tecnolog&iacute;a su forma de ganarse la vida.</P>
<P ALIGN="JUSTIFY"></P>
<FONT color="#000000" face="arial" size=2>        
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionc.htm"><font FACE="ARIAL"><B>[Opinión Internet]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

