<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nternet</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Lo que no se dice.
</FONT>
</H3>

<p align=justify>
<FONT color="#000000" face="arial" size=2>        
Como ocurre con todo lo que nos rodea, las cosas de La Red tienen (al menos) dos caras: una es la oficial; la que se dice, proclama y se vende, la que nos quieren hacer creer, la que sale en los peri&oacute;dicos, la que dicen los anuncios, de la que hablan los jefes con nosotros, la "&uacute;nica y verdadera", la "cara bonita", la que "nos beneficia a todos". La otra cara es la real, la que da forma a todo, de la que hablan los jefes entre ellos, la letra peque&ntilde;a, el "que no se entere nadie", el "se sobreentiende", la que funciona con n&uacute;meros, la menos divertida, la que todos creemos que es.</P>
<P ALIGN="JUSTIFY">No hace falta buscar para toparse con la cara p&uacute;blica de INTERNET, &eacute;sta viene a nosotros sin pedir permiso. Pero la &uacute;nica forma de conocer la cara escondida de lo que nos rodea es mediante la intuici&oacute;n, nuestra experiencia previa, aplicar la m&aacute;ximas de "nadie regala nada", "tan bonito no puede ser bueno" o "¿qu&eacute; har&iacute;a yo si fuera ellos?".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lejos de pensar mal de nadie y aplicando las reglas de la l&oacute;gica y el sentido com&uacute;n, uno se pregunta muy a menudo qu&eacute; es lo que est&aacute; detr&aacute;s de esto que se llama red de redes. Sabemos qu&eacute; es lo que nos dicen, pero ingoramos lo que nos ocultan. ¿Cu&aacute;l es la otra cara de INTERNET?. Por supuesto que aqu&iacute; no voy a dar respuestas (¡qui&eacute;n soy yo para ello!), pero s&iacute; puedo dar preguntas. Tantas como dedos de la mano, y m&aacute;s que se quedan por el camino:</P>
<OL type=1>
<li>
<P ALIGN="JUSTIFY">¿D&oacute;nde acaban los archivos logs (listados) que elaboran los proveedores con todos los sitios que hemos visitado sus clientes, el tiempo que hemos estado y dem&aacute;s huellas de nuestras visitas digitales? ¿Los borrar&aacute;n para siempre?</P>
</li>
<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; hay muchos proveedores que se empe&ntilde;an en anunciarse ensalzando en may&uacute;sculas las maravillas de sus enlaces a 34 megas por segundo cuando hay d&iacute;as en los que es imposible contactar con ellos?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Cu&aacute;les son los planes de la Internet Society y todas sus organizaciones afines con el desarrollo del nuevo est&aacute;ndar de direcciones IP, que har&aacute; posible que hasta las tostadoras de pan tengan una direcci&oacute;n dentro de la RED?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Ser&aacute; gratis leer "El Pa&iacute;s", "El Mundo", "ABC" o cualquier otro peri&oacute;dico en el WWW cuando INTERNET sea accesible de verdad al gran p&uacute;blico y cuando eso de decir "visite nuestra edici&oacute;n digital en la siguiente direcci&oacute;n...." no est&eacute; de moda?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; en muchos pa&iacute;ses est&aacute; prohibido el uso de la informaci&oacute;n encriptada?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; Bill Gates se ha gastado unos miles de millones de pesetas en comprarle a un espa&ntilde;ol un sistema de transmisi&oacute;n de audio y v&iacute;deo por INTERNET?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Qu&eacute; tienen pensado decir el Senado Americano y la Comunidad Econ&oacute;mica Europea cuando la transmisi&oacute;n de v&iacute;deo y voz por la red suponga una amenaza seria para las grandes compa&ntilde;&iacute;as de telecomunicaciones?</P>
</li>


<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; no se impone el sistema de transmisi&oacute;n de datos ADSL basado en los actuales m&oacute;dems y en la infraestructura telef&oacute;nica de toda la vida de hilos de cobre y que permite unas velocidades de conexi&oacute;n muy superiores a las que conocemos hoy?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; Telef&oacute;nica es "La Primera Multinacional Espa&ntilde;ola"?</P>
</li>

<li>
<P ALIGN="JUSTIFY">¿Por qu&eacute; para los medios de comunicaci&oacute;n INTERNET es un antro de pornograf&iacute;a infantil y delincuencia?</P>
</li>

</ol>


<P ALIGN="JUSTIFY">Estas son las preguntas que se me pasan por la cabeza en los momentos que transcurren desde que mi navegador me dice eso de "Sitio contactado, esperando respuesta...." hasta que la p&aacute;gina aparece en pantalla. Imagino que no ser&eacute; el &uacute;nico en preguntarme semejantes cosas, imagino tambi&eacute;n que mis respuestas coincidir&aacute;n con las de muchos de vosotros, e imagino que muchas de las respuestas coincidir&aacute;n con la cara real de INTERNET. Lo que s&iacute; s&eacute;, es que, aparte de lo que se mueve detr&aacute;s de INTERNET, lo que m&aacute;s me interesa de ella somos la gente que la componemos, el calor humano de todo este tinglado, los colores, olores, sentires y pareceres de la variopinta fauna de usuarios que d&iacute;a a d&iacute;a hacemos de la RED algo vivo, en cont&iacute;nua evoluci&oacute;n. A fin de cuentas, somos los protagonistas de este invento.</P>
<P ALIGN="JUSTIFY"></P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionc.htm"><font FACE="ARIAL"><B>[Opinión Internet]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>



<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

