<HTML>

<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Amenaza Multijugador.
</FONT>
</H3>

<P align="justify">
<FONT color="#000000" size =2 face="arial" >        
El maravilloso mundo que internet est&aacute; creando no s&oacute;lo abarca el tema del
acceso a ingentes cantidades de informaci&oacute;n, de la compra desde t&uacute; casa, o
de la comunicaci&oacute;n instant&aacute;nea. Internet tambi&eacute;n significa entretenimiento, y
las casas productoras de juegos del mundo del PC lo saben. Es mucho &quot;m&aacute;s divertido&quot;
enfrentarse con un jugador humano, que se encuentra a miles de kilómetros de
t&uacute; casa, que entablar combate con el m&aacute;s moderno sistema de inteligencia artificial
que incluyen o deber&iacute;an de incluir los &uacute;ltimos juegos en estrategia. 
<BR>
<BR>
Pues bien, toda esa aureola que se est&aacute; empezando a crear entorno a la diversi&oacute;n
que puede aportar una partida contra un contricante humano, en detrimento de
hacerlo con el ordenador, est&aacute; produciendo que las casas de software est&eacute;n
empezando a desarrollar productos dise&ntilde;ados en un principio para ser jugados
de modo m&uacute;ltiple dejando a un muy segundo plano, el dise&ntilde;o de lo que ser&iacute;a el
juego de una s&oacute;la persona. ¿Cu&aacute;l es la amenza?, pues est&aacute; claro, o nos ponemos
serios o corremos riesgo de que los proximos juegos (por no decir los m&aacute;s 
inmediatos), de estrategia (y si nos empezamos a descuidar de rol), comiencen
a exigir que para que sea posible jugar tengamos una conexi&oacute;n a internet o incluso
peor, que te lo vendan como un juego en el que es posible realizar una partida en solitario
y luego resulte que no vale para nada el sistema de inteligencia artificial (os suena lo que ha 
pasado con el Diablo).
<BR>
<BR>
Lo que quiero proponer a las casas de software es que no caigan en la tentaci&oacute;n de
producir juegos que sean para un s&oacute;lo jugador y para internet &quot;en la misma caja&quot;, lo
que deben de hacer es tratar a ambos productos de una forma totalmente distinta ya que
no todos los jugadores del mundo del PC deseamos que para que tengamos que 
divertirnos debamos de hacerlo de forma m&uacute;ltiple, yo me lo paso estupendamente jugando
a un juego de ROL en el que voy desarrollando una historia, o jugando al Civilization y
comprobando que el software me puede poner en serios apuros, etc. Es decir, juegos
para internet SÍ, pero SIN MEZCLARLOS con los juegos tradicionales para un s&oacute;lo
jugador, ambos productos deben de ser tratados de forma bien distina.
<BR>
<BR>
El ejemplo m&aacute;s claro en el que se han hecho las cosas correctamente es el del Ultima Online, de
Richard Garriot (Origin). Bien, como todos sab&eacute;is (o deber&iacute;ais de saber), la saga de Ultima, es
sin lugar a dudas, la m&aacute;s importante en el mundo del ROL de PC, en todos estos juegos, el control
recae en una s&oacute;la persona. Pues bi&eacute;n, cuando el se&ntilde;or Garriot ha querido hacer una especie de MUD (pero
a lo bestia) con su saga Ultima, no ha dise&ntilde;ado un programa para que funcione tanto para ser 
jugado por uno como por cientos de usuarios, sino que lo que ha hecho es hacer un dise&ntilde;o
ESPECIFICO para ser jugado por internet partiendo del hecho de que las filosof&iacute;as a seguir, 
dependiendo de si el juego es m&uacute;lti o monousuario son totalmente diferentes. 
<BR>
<BR>
El ejemplo contrario al del Ultima Online, lo tenemos en el Diablo, 
donde el desarrollo es m&aacute;s bien pat&eacute;tico, ya que desde
un principo el Diablo se dise&ntilde;o para ser jugado por internet y luego se ha
vendido &quot;a calzador&quot; a todos aquellos jugadores que no se pueden o no 
van a conectarse para jugar en Battlenet, como si fuera un rol tan aut&eacute;ntico como
un Ultima por ejemplo.
<BR>
<BR>
En conclusi&oacute;n, con internet ha nacido una nueva forma de dise&ntilde;ar juegos,
que es el modo multijugador a gran escala, pero esto 
no debe acabar con los jugadores que desean 
seguir desenvolvi&eacute;ndose por un mundo en el que el ordenador es el 
enemigo y en el que se puede seguir una historia, cosa imposible, por ahora,
en los juegos internet.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniond.htm"><font FACE="ARIAL"><B>[Opinión Juegos]</B></font></a> <BR>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
