<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rítica de Cine</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br>
<font face=arial>
<BR><BR><BR><BR><BR>
<font face=arial>
<H3>
The Mummy (La momia)
</H3>
<FONT color="#000000" face="arial">
<FONT color="#000000" size=2 face="arial">
<p align="justify">

<p align="justify">The Mummy (La Momia) es uno de esos filmes que uno va a ver con toda su esperanza inflada, y cuando sale del cine, la tiene pinchada. Si, la verdad que esos efectos son espectaculares, pero a veces no se sabe si le hacen bien o mal a la pel&iacute;cula.</P>
<center><img src="gif/mummy.gif"></center>
<h4>La historia</h4>
<P ALIGN="JUSTIFY"><font face=arial size=2>El film comienza 3000 a&ntilde;os atr&aacute;s, donde conocemos al sacerdote Imhotep (Arnold Vosloo) que luego de una noche de pasi&oacute;n con la amante del fara&oacute;n, es sepultado vivo. Luego el film se traslada al a&ntilde;o 1923, donde conoceremos al soldado ingles Rick O´Connell (Brendan Fraser), que luego de algunos altercados, ha sido encerrado en la c&aacute;rcel. Es rescatado de all&iacute; por la bibliotecaria Evelyn Carnavaron (Rachel Weisz) y su hermano Jonathan (John Hannah), quienes creen que el susodicho soldado conoce el camino a la ciudad perdida de Hamunaptra, donde se encontraban los tesoros de Egipto. Durante el trayecto de la pel&iacute;cula, encontramos a otros grupos de personas que parecen estar tambi&eacute;n interesados en la ciudad de los muertos (tal es Hamunaptra), un grupo de aventureros americanos, y unos misteriosos jinetes del desierto que se la pasan diciendo a los ingleses y americanos que abandonen el lugar.</P>
<P ALIGN="JUSTIFY">Los dos grupos de exploradores van por caminos separados, pero luego de un trecho llegan juntos a la ciudad perdida, donde, sin quererlo, liberan el esp&iacute;ritu maldito de Imhotep. Luego de que la bibliotecaria Evelyn leyera un antiguo conjuro por equivocaci&oacute;n, Imhotep es liberado y el solo quiere reconstruir su cuerpo, para poder llevar a cabo un ritual de resurrecci&oacute;n de la amante del fara&oacute;n a la que &eacute;l amaba. Durante el proceso de reconstrucci&oacute;n, Imhotep lanza sobre Egipto las diez plagas b&iacute;blicas, mata gente, etc. La tarea de los aventureros que quedan (porque los americanos ya han muerto todos) ser&aacute; intentar frenar a Imhotep para salvar al mundo.</P>
<h4>La opinión</h4>
<font face=arial size=2><P ALIGN="JUSTIFY">El marketing de la pel&iacute;cula ha cometido un serio error con la promoci&oacute;n; la pel&iacute;cula no es un film serio, al estilo Indiana Jones (si es que a eso se le puede llamar serio, pero bueno, vosotros me entend&eacute;is), sino que es mas bien una comedia con un poco de acci&oacute;n y aventura, y MUCHISIMOS efectos. Cuando la vayas a ver, si es que vas, no esperen un tremendo pelicul&oacute;n lleno de acci&oacute;n y violencia, sino mas bien algo que, aunque por momentos es electrizante y de acci&oacute;n r&aacute;pida, tiende mas a ser una comedia medianamente humor&iacute;stica.</P>
<center><img src="jpg/mummy.jpg"></center>
<h4>Los actores</h4>
<font face=arial size=2><P ALIGN="JUSTIFY">La mejor interpretaci&oacute;n de la pel&iacute;cula, sin duda, ha sido la de Brendan Fraser como el soldado O´Connell, cuyo papel parec&iacute;a adaptarse mucho a su manera de actuar. Adem&aacute;s, hace muy bien las escenas de acci&oacute;n, y como un critico americano dijo: "Hace de cuenta que esta en un film de John Woo, con pistolas en ambas manos y todo el show.". Weisz, la interprete de la bibliotecaria, tambi&eacute;n lo hace muy bien. El protag&oacute;nico con menos l&iacute;neas ha sido probablemente el de Arnold Vosloo, como el terror&iacute;fico sacerdote Imhotep. Habla poco, pero lo de terror&iacute;fico es definitivo!.</P>
<H4>Los efectos especiales</h4>
<font face=arial size=2><P ALIGN="JUSTIFY">Creo que, muy a pesar de lo que parecer&iacute;a, los efectos son DEMASIADOS en esta pel&iacute;cula. En algunos lugares y momentos son bien usados, pero hay partes donde la demas&iacute;a en efectos quita la atenci&oacute;n sobre el argumento, creando un ambiente mas bien molesto para el espectador. Quiz&aacute;s el mejor y mas necesario efecto haya sido el de la momia, con su reconstrucci&oacute;n poco a poco. El peor de los efectos, a mi modo de ver, ha sido el de los escarabajos, que se ve&iacute;a a a&ntilde;os luz que estaban hechos por computadora, y bastante mal.</P>
<P ALIGN="JUSTIFY">En resumen, la pel&iacute;cula es bastante divertida, no es la mejor del a&ntilde;o, ni podr&aacute; competir con The Matrix o Episodio 1, pero es algo interesante para ver. Escojan un cine barato, un horario diurno, compren unas palomitas y vayan a verla que se van a divertir un rato.</P>





<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioc.htm"><font FACE="ARIAL"><B>[Crítica de Cine]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


