<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>N</B></font><FONT color="#000000" size=2 face="arial"><B>oticias</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<font face=arial>
<br><br>
<h3>
Noticias del número 9.
</h3>
<font face=arial>


<FONT FACE="Arial"><h4>Impresionante engine 3D de Javier Maura.</h4>
</FONT><FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY"><b>Javier Maura</B> (del grupo independiente "</FONT><A HREF=" http://personal.redestb.es/jmaura"><B><FONT FACE="Arial" SIZE=2>Siempre Quise Ser Un Elfo</B></FONT></A><FONT FACE="Arial" SIZE=2>") ha desarrollado un sistema de partici&oacute;n del espacio que permite importar cualquier tipo de objeto que se desarrolle en el MAX, sin ninguna limitaci&oacute;n. Ello permite generar objetos org&aacute;nicos, mucho m&aacute;s complejos que los que aparecen en las fotos de "Quake III", y abre una nueva dimensi&oacute;n en el mundo de los videojuegos. Adem&aacute;s est&aacute; a punto de terminar el sistema de f&iacute;sicas, que ser&aacute; el m&aacute;s real visto hasta ahora, puesto que es capaz de calcular en tiempo real colisiones con curvas y superficies org&aacute;nicas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero para poder hacer una demostraci&oacute;n real del Engine, es necesaria la aportaci&oacute;n de unas escenas que sean realmente vistosas y permitan al Engine mostrar sus posibilidades, y aqu&iacute; es donde entran en juego el papel de los grafistas. Si alguien est&aacute; interesado en mover sus mundos en MAX en tiempo real, con explosiones y efectos de luces estrobosc&oacute;picos, desafiar con sus personajes los tiranos mundos medievales o simplemente recorrer con sus coches modelados paisajes de ensue&ntilde;o, ¡ y sabe hacerlo ! pues no tiene nada m&aacute;s que bajarse la documentaci&oacute;n necesaria para desarrollar escenas para el Engine en la secci&oacute;n de descargas de Stratos (</FONT><A HREF="http://www.stratos-ad.com/"><FONT FACE="Arial" SIZE=2>www.stratos-ad.com</FONT></A><FONT FACE="Arial" SIZE=2>). As&iacute; mismo, la "</FONT><A HREF="dhcmaura.htm"><FONT FACE="Arial" SIZE=2>Cr&oacute;nica de una creaci&oacute;n</FONT></A><FONT FACE="Arial" SIZE=2>" de este mes, recoge el manual de Javier.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Javier tambi&eacute;n nos ha comentado, al respecto de desarrollar un juego con el Engine, que "me gustar&iacute;a siempre que las personas involucradas dedicaran un tiempo suficiente al desarrollo de algo realmente espectacular. Todos conocemos de la calidad de los juegos del mercado, y de si alguien quiere hacer algo en este mundo, tiene que viajar a Madrid y permanecer all&iacute;. Yo intento evitarlo, me encanta vivir en Mallorca, y estoy seguro que debe haber grafistas en mi misma situaci&oacute;n. As&iacute; que escribidme y veremos lo que podemos hacer juntos. Por supuesto hago esto para GANAR dinero, porque ya llevo muchos a&ntilde;os haci&eacute;ndolo por amor al arte y ya merezco alguna peque&ntilde;a recompensa. As&iacute; que la gente que s&oacute;lo quiera "probar", por favor tenga en cuenta que tengo muy poco tiempo. Yo soy de la idea de que si hay que hacer algo de verdad, tiene que ser lo MEJOR".</P>
<P ALIGN="JUSTIFY"></P>
</FONT>
<FONT FACE="Arial"><h4>Celebrado el Fallas Party 99 </h4>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El fin de semana precedente a las Fallas, se celebr&oacute; en el Centro juvenil de Xirivella la Fallas Party 99. Una concentraci&oacute;n de toda clase de gente cuya &uacute;nica cosa en com&uacute;n era la pasi&oacute;n por los ordenadores. Aunque el motivo originario de esta clase de parties es la demoscene, ahora se han convertido tambi&eacute;n en un punto de encuentro de gente de todas partes de Espa&ntilde;a que se re&uacute;nen para pas&aacute;rselo bien. A&uacute;n as&iacute;, hubo los obligados concursos t&iacute;picos de esta clase de eventos.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><LI><P ALIGN="JUSTIFY">Concurso Fast Music:</FONT><FONT FACE="Arial" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2 COLOR="#008080">Ganador Awesome / Wild Bits</LI></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><LI><P ALIGN="JUSTIFY">Concurso Fast Graphics:</FONT><FONT FACE="Arial" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2 COLOR="#008080">Ganador Yakar&eacute; / Wild Bits</LI></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><LI><P ALIGN="JUSTIFY">Concurso Fast Intro:</FONT><FONT FACE="Arial" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2 COLOR="#008080">Ganador Grupo Savage</LI></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><LI><P ALIGN="JUSTIFY">Concurso Fast IA:</FONT><FONT FACE="Arial" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2 COLOR="#008080">Ganador Wing Extrem/Wild Bits</LI></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><LI><P ALIGN="JUSTIFY">Concurso Fast Programaci&oacute;n de Videojuegos:</FONT><FONT FACE="Arial" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2 COLOR="#008080">Ganador Grupo Wild Bits</LI></P>

</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">El evento tuvo mucho &eacute;xito y acogida. Se presentaron en &eacute;l gente de Barcelona, Madrid y otros lugares de nuestra geograf&iacute;a, y, se juntaron cerca de 50 ordenadores. Ahora, todos estamos impacientes por poder tener la oportunidad de reunirnos de nuevo. Si hay suerte, el a&ntilde;o que viene contaremos con mucha m&aacute;s publicidad y un local mucho m&aacute;s grande.</P></FONT></BODY>
<FONT FACE="Arial" SIZE=1><P ALIGN="JUSTIFY">Fuente Awesome</P></font>
<FONT FACE="Arial"><h4>Los hermanos Ru&iacute;z dejan Dinamic Multimedia</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No es que sea un rumor, es que es una realidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A principios de Abril los tres hermanos Ruiz (<B>Victor, Pablo y Nacho</B>) abandonaron <B>Dinamic</B>. Sus intenciones son las de montar su propia empresa. Parece ser que la causa radica en que la forma de manejar una empresa como Dinamic se entend&iacute;a de manera distinta por parte de los</P>
<P ALIGN="JUSTIFY">Ruiz y por parte del due&ntilde;o de <B>Hobby Press</B>, principal accionista de Dinamic. Pero todo fue resuelto con buenas maneras y civilizadamente, como debe hacerse, sin enfrentamientos y llegando a una soluci&oacute;n satisfactoria para todos. En cuanto a cu&aacute;l ser&aacute; la nueva empresa que monten los Ruiz, eso a&uacute;n se desconoce.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=1><P ALIGN="JUSTIFY">Fuente de consulta Stratos (</FONT><A HREF="www.stratos-ad.com"><FONT FACE="Arial" SIZE=1>www.stratos-ad.com</FONT></A><FONT FACE="Arial" SIZE=1>)</P></font>
</FONT><B><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&quot;El mundo del Spectrum&quot; cumple dos a&ntilde;os</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El fanzine creado por el miembro de Macedonia (y coordinador de la secci&oacute;n "</FONT><A HREF="index02.htm"><FONT FACE="Arial" SIZE=2>Recuerdos de 8 Bits</FONT></A><FONT FACE="Arial" SIZE=2>"), <B>Alejandro Ib&aacute;&ntilde;ez</B>, acaba de cumplir su segundo a&ntilde;o de existencia. Para celebrarlo, esta veterana revista dedicada al "Speccy" incorpora multitud de juegos en la zona de descarga as&iacute; como la posibilidad de obtener, en un archivo zip, todos los art&iacute;culos editados en "<b><a href="http:\\www.arrakis.es/~tecnilin">El Mundo del Spectrum</a></B>" dedicados a la historia la plataforma cl&aacute;sica por excelencia.</P>
<center><a href="http:\\www.arrakis.es/~tecnilin" border=0 target="_new"><img src="gif/emsc2.gif"></a></center>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Anexo para &quot;Commandos&quot;</B></P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya est&aacute; a la venta la expansi&oacute;n de Commandos. Con el nombre de <B>Commandos: M&aacute;s All&aacute; del Deber</B>, Pyro Studios pone broche final a su primera creaci&oacute;n. Quiz&aacute;s la novedad m&aacute;s curiosa de esta expansi&oacute;n, la constituya el hecho de que no ser&aacute; necesario tener el juego original para disfrutar de ella, ya que es un juego aut&oacute;nomo. Sin duda, una iniciativa original y realista que m&aacute;s de una compa&ntilde;&iacute;a seguro que comienza a poner en marcha.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este pack de expansi&oacute;n cuenta con un total de ocho misiones y tiene detalles nuevos como el hecho de que habr&aacute; un Commando femenino, podremos distraer a los soldados nazis, etc. <BR>
Las nuevas localizaciones abarcan las Islas del Canal, Holanda, Belgrado, Creta y Grecia, con mapas mucho m&aacute;s grandes y nuevas armas y objetos para utilizar en muestras misiones. Pueden jugar hasta cuatro jugadores sobre red o Internet a trav&eacute;s de TCP-IP.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Exelweiss cambia de direcci&oacute;n web</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P>El grupo independiente <B>Exelweiss</B> cambia la direcci&oacute;n web a </FONT><A HREF="http://exelweiss.ivinf.com/"><B><FONT FACE="Arial" SIZE=2>http://exelweiss.ivinf.com/</B></FONT></A></P>
<FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>A&uacute;pa Linux</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De Victor Vergara, "Awesome", nos ha llegado la noticia de que los estudiantes de la UPV, est&aacute;n organizando un concurso de camisetas para intentar difundir, lo m&aacute;ximo posible, el uso del Linux entre la comunidad. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Os ponemos, a continuaci&oacute;n, un par de gr&aacute;ficos presentados por Awesome.</P>
<center>
<table>
<td><img src="jpg/awlin1.jpg"></td>
<td><img src="jpg/awlin2.jpg"></td>
</table>
</center>

<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Péndulo necesita gente fija</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY"><b>P&eacute;ndulo Studios</B>  busca gente con talento y ganas de trabajar para ampliar su plantilla. Los trabajos no son en r&eacute;gimen de colaboraci&oacute;n, por lo que <B>es imprescindible residir en Madrid o alrededores.</b></P>
<P ALIGN="JUSTIFY"></P>


<B>GRAFISTA</B> con dominio de Photoshop, Animator, etc. Dise&ntilde;o de pantallas para aplicaciones multimedia.<br>
<B>PROGRAMADOR</B> lenguaje Lingo para Director.<br>
<B>PROGRAMADOR</B> Visual C con conocimientos de herramientas Direct X (2D).

<P ALIGN="JUSTIFY">Se ofrece contrato, Seguridad Social e incorporaci&oacute;n inmediata. Env&iacute;a tu curr&iacute;culum y</P>
<P ALIGN="JUSTIFY">muestras de trabajo a </FONT><A HREF="rlatiegui@jet.es"><B><FONT FACE="Arial" SIZE=2>rlatiegui@jet.es</B></FONT></A><FONT FACE="Arial" SIZE=2> o bien por correo a:</P>
<P ALIGN="JUSTIFY"></P>
PENDULO STUDIOS<br>
c/ Comercio 6<br>
28014 Madrid
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>12 Pantallas nuevas de Blade</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya se han hecho p&uacute;blicas otras 12 capturas de <B>Blade</B>. Esta vez, las capturas ofrecen a&uacute;n mayor espectacularidad gr&aacute;fica. El com&uacute;n denominador de todas ellas, es que pertenecen al primer nivel del juego el cual, ya se encuentra, al parecer, acabado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde la compa&ntilde;&iacute;a se asegura que el juego puede estar acabado y completado antes del verano. Pese a todas estas buenas noticias, preferimos no hacer caso a tal afirmaci&oacute;n y seguir esperando pacientemente... ¿para despu&eacute;s de Navidades?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Os dejamos un par de capturas de las nuevas. Son realmente soberbias. Si quer&eacute;is ver m&aacute;s, pod&eacute;is pasaros por la web de la compa&ntilde;&iacute;a </FONT><A HREF="www.rebelact.com"><B><FONT FACE="Arial" SIZE=2>www.rebelact.com</B></FONT></A></P>
<center>
<table>
<td><img src="jpg/12nblad1.jpg"></td>
<td><img src="jpg/12nblad2.jpg"></td>
</table>
</center>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegos]</B></font></a> <hR>
<A HREF="dhispan.htm"><font FACE="ARIAL"><B>[Noticias de números anteriores]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

