<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>N</B></font><FONT color="#000000" size=7 face="arial"><B>oticias Internas<hr>Número 10</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<hr>
<br><br>
<H4><font face="Arial">Macedonia cambia de equipo directivo.</font></H4>
<p align="justify"><font face="Arial"><font size=-1>El presente n&uacute;mero de Macedonia,
supone el fin de una etapa en lo que a equipo de direcci&oacute;n se refiere.
A partir de la salida del n&uacute;mero 10, es decir, ya mismo, la direcci&oacute;n
de la revista cambia. Este hecho es expresado, a continuaci&oacute;n, por
el, desde hoy, nuevo coordinador general de la revista para el pr&oacute;ximo
n&uacute;mero 11, <b><a href="mailto:cidcampeador@xoommail.com">David Isla</a></b>:</font></font>
<p align="justify"><font face="Arial"><font size=-1>"<font color="#008080">Es para mi un
honor y un placer redactar el primer documento oficial del - Consejo de
Macedonia Magazine -.</font></font></font>
<p align="justify"><font face="Arial"><font color="#008080"><font size=-1>Nuestro director,
<b><a href="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodr&iacute;guez</a></b>,
deja el equipo interno de Macedonia Magazine. Sale del grupo de personas
que d&iacute;a a d&iacute;a mantenemos esta gran publicaci&oacute;n. La
explicaci&oacute;n es muy simple, Fernando es una persona muy activa y
como todo el mundo, tiene muchas aspiraciones y trabajos por realizar,
imposible de compaginar con el cargo y las responsabilidades del puesto
de director. Es por ello, que todos los que formamos el equipo de Macedonia
queremos darle las gracias por los diez n&uacute;meros que nos ha dado
y desde aqu&iacute; le deseamos toda la suerte del mundo en sus futuros
proyectos.</font></font></font>
<p align="justify"><font face="Arial"><font color="#008080"><font size=-1>Y debido al hueco
que ha dejado la marcha de Fernando, se ha optado por un modelo de coordinaci&oacute;n
mas r&aacute;pido y concreto; un grupo de personas que compartan las tareas
de direcci&oacute;n en Macedonia, esto es el "<b>Consejo</b>". Desde el
mismo, se perseguir&aacute; actuar en varios frentes de la publicaci&oacute;n
de una forma m&aacute;s especializada.</font></font></font>
<p align="justify"><font face="Arial"><font color="#008080"><font size=-1>Este nuevo &oacute;rgano
de Macedonia, est&aacute; integrado por una serie de personas que, a&uacute;n
teniendo varias responsabilidades importantes en la revista, han decidido
donar a&uacute;n m&aacute;s tiempo para posibilitar la continuidad de Macedonia.
Cada uno de los miembros, tienen funciones definidas en funci&oacute;n
a su experiencia y el puesto que ocupan en la revista. A continuaci&oacute;n,
os presento a los miembros que forman parte, junto a mi, del consejo:</font></font></font>
<p align="justify"><font face="Arial"><font color="#008080"><font size=-1>Miembros del
Consejo: <b><a href="mailto:kilivor@geocities.com">Daniel C&aacute;rdenas</a></b>,
<b><a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes</a></b>,
<b><a href="mailto:gustavo_herrera@yahoo.com">Gustavo Herrera</a>, <a href="mailto:cidcampeador@xoommail.com">David
Isla</a>.</b></font></font></font>
<p align="justify"><font face="Arial"><font color="#008080"><font size=-1>En cada n&uacute;mero,
las responsabilidades en la direcci&oacute;n se ir&aacute; turnando. A
partir de la salida del n&uacute;mero 10, la persona que ostentar&aacute;
el cargo directivo ser&aacute; <b>David Isla </b>(un servidor).</font></font></font>
<p align="justify"><font face="Arial"><font size=-1><font color="#008080">Sin m&aacute;s,
queremos agradecer a todos los lectores el inter&eacute;s que demuestran
en cada n&uacute;mero por Macedonia, motivo por el cual nos encontramos
ahora aqu&iacute;, a las puertas del numero 11 de la publicaci&oacute;n;
un n&uacute;mero que marcar&aacute; una nueva &eacute;poca en la revista,
sin duda.</font>"</font></font>
<p align="justify"><font face="Arial"><font size=-1>Despu&eacute;s de estas palabras, s&oacute;lo
me queda desear la mayor suerte del mundo, como exdirector de la publicaci&oacute;n
y en nombre tambi&eacute;n del exsubdirector de la revista, <b><a href="mailto:oscarg@salleurl.edu">Oscar
Garc&iacute;a</a></b>, al nuevo equipo directivo. Desde luego, el n&uacute;mero
11 va a ser un nuevo nacimiento para Macedonia y espero que pronto todos
podamos disfrutar viendo el fenomenal trabajo de direcci&oacute;n de este
nuevo equipo. Tambi&eacute;n querr&iacute;a agradecer a todos los lectores
que desde el n&uacute;mero 1, confiaron en el trabajo que dos ilusionados
de este mundillo estaban haciendo. Ha pasado mucho tiempo desde entonces
y, por supuesto, han pasado muchas cosas tambi&eacute;n, algunas buenas
y otras no tanto. Lo mejor de todo es que tanto de los buenos como de los
malos momentos, todos hemos aprendido mucho y hemos sido capaces de tirar
para delante, dando una seguridad a la publicaci&oacute;n suficiente como
para no detenerse ante ning&uacute;n tipo de obst&aacute;culo. Gracias
por los emails de felicitaci&oacute;n enviados durante todo este tiempo
y gracias a todos, absolutamente a todos, los que alguna vez han colaborado
con Macedonia. Aunque luego, por desgracia, hayan tenido que dejar de hacerlo.
Un abrazo y hasta siempre equipo y lectores.</font></font>
<H4><font face="Arial">Habr&aacute; OFFLINE 2.</font></H4>
<p align="justify"><font face="Arial"><font size=-1>Tras la importancia que ha alcanzado
la creaci&oacute;n del <b>OFFLINE</b> <b>1</b>, donde muchos miembros del
equipo de Macedonia colaboraron para que naciera una criatura lo m&aacute;s
fiel posible a nuestra filosof&iacute;a, hemos decidido que en un futuro
pr&oacute;ximo va a ver la luz una nueva versi&oacute;n.</font></font>
<br><br>
<center><img src="jpg/moff2.jpg"></center>
<br><br>
<p align="justify"><font face="Arial"><font size=-1>Como en toda nueva versi&oacute;n de
un programa , se van a a&ntilde;adir un sinf&iacute;n m&aacute;s de caracter&iacute;sticas
que har&aacute; m&aacute;s sencilla la navegaci&oacute;n entre art&iacute;culos
y secciones, siempre respetando el dise&ntilde;o original de la versi&oacute;n
en Internet, pero aplicando las nuevas tecnolog&iacute;as de b&uacute;squeda
tales como:</font></font>
<ul>
<li>
<font face="Arial"><font size=-1><b>&Aacute;rbol de Directorio</b>: mediante
el cual se va a poder saltar inmediatamente de una secci&oacute;n a otra
permitiendo localizar inmediatamente lo que nos interesa.</font></font></li>

<li>
<font face="Arial"><font size=-1><b>&Aacute;rboles de Secciones</b>: que
permitir&aacute;n, dentro de una secci&oacute;n, seleccionar un curso o
tema que disponga de varios apartados.</font></font></li>
</ul>
<font face="Arial"><font size=-1>Estos dos medios de localizaci&oacute;n
permiten imprimir tanto en pantalla como en impresora, la estructura jer&aacute;rquica
de la revista al completo, lo que dar&aacute; una dimensi&oacute;n real
de los contenidos.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Junto a esto, se va a disponer de:</font></font>
<ul>
<li>
<font face="Arial"><font size=-1><b>M&eacute;todos indexados de b&uacute;squeda</b>,
es decir, de b&uacute;squedas seg&uacute;n criterios configurables como
por ejemplo, listar los art&iacute;culos que incluyan la palabra: OpenGL</font></font></li>

<li>
<font face="Arial"><font size=-1><b>Impresi&oacute;n directa</b> del art&iacute;culo
mostrado en un determinado momento, junto a la posibilidad de ver una "preview"
de impresi&oacute;n.</font></font></li>

<li>
<font face="Arial"><font size=-1><b>Mejoras en los dispositivos de audio</b>:
CDAudio y MP3, estando en estudio la posibilidad de desarrollar un "pluggin"
visual para el acompa&ntilde;amiento de la m&uacute;sica (basado en OpenGL)</font></font></li>

<li>
<font face="Arial"><font size=-1><b>Salvapantallas </b>de Macedonia, que
ser&aacute; configurable e instalable independientemente del programa,
para su uso y distribuci&oacute;n gratuitos.</font></font></li>

<li>
<font face="Arial"><font size=-1><b>Botones de navegaci&oacute;n propios</b>
del programa, desde los que acceder a las mismas funcionalidades que los
navegadores comerciales, junto a las opciones de b&uacute;squeda en todas
las p&aacute;ginas, &aacute;rboles de secciones y de directorio, impresi&oacute;n
y configuraciones...</font></font></li>
</ul>
<font face="Arial"><font size=-1>Un aspecto importante es que se va a tratar
de eliminar la necesidad de tener instalado el Internet Explorer 4.x, y
aunque en la versi&oacute;n anterior exist&iacute;a la posibilidad de ejecutar
el programa sin este requisito, los resultados visuales no eran los &oacute;ptimos.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Otro apartado importante va a ser la
opci&oacute;n especial (por ahora en estudio de viabilidad) de un visionado
especial de la nueva secci&oacute;n de Macedonia Magazine (a partir del
n&ordm; 10): El Rinc&oacute;n de las Historias.</font></font>
<p align="justify"><font face="Arial"><font size=-1>En un principio, las novelas y relatos
cortos ser&aacute;n presentadas de la forma m&aacute;s "art&iacute;stica"
posible, con gr&aacute;ficos, m&uacute;sica de ambientaci&oacute;n y efectos
especiales de transiciones.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Ser&aacute; un apartado excepcional
en el que pondremos todos nuestros conocimientos multimedia y art&iacute;sticos,
siendo su lanzamiento posterior al del OFFLINE 2, y que se constituir&aacute;
como un "plug-in" de &eacute;ste.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Por ahora, estas son las nuevas ideas
que se han planteado, estando el proyecto en fase de planificaci&oacute;n,
donde se optar&aacute;n por cambios o no de las diversas mejoras, y donde
se ampliar&aacute;n o reducir&aacute;n las diversas opciones, pero siempre
manteniendo la filosof&iacute;a de la versi&oacute;n anterior del Offline:
un reflejo de lo que un equipo de personas es capaz de hacer, manteniendo
la coherencia con su versi&oacute;n en Internet, y como un medio m&aacute;s
de conexi&oacute;n entre nosotros y nuestros lectores, puesto que para
ellos es este programa.</font></font>
<p align="justify"><font face="Arial"><font size=-1><b>Jos&eacute; Antonio Su&aacute;rez</b>
ser&aacute; el encargado, de nuevo, de llevar el peso de la creaci&oacute;n
del OFFLINE. Si ten&eacute;is alguna idea que cre&aacute;is que puede ser
muy &uacute;til de cara a la creaci&oacute;n del futuro OFFLINE, no dud&eacute;is
un instante en coment&aacute;rsela a Jos&eacute; en <a href="mailto:aradriel@geocities.com">aradriel@geocities.com</a>.</font></font>
<p align="justify"><H4><font face="Arial">Cambios de disposici&oacute;n de secciones en
Macedonia</font></H4>
<p align="justify"><font face="Arial"><font size=-1>En este n&uacute;mero hemos decidido
agrupar unas cuantas secciones que, o bien no crec&iacute;an mucho o bien
lo estaban haciendo de forma importante. Para empezar, la secci&oacute;n
<b>La Biblioteca</b>, que est&aacute; dedicada a comentar libros sobre
programaci&oacute;n o inform&aacute;tica en general, va a pasar a depender
de <b><a href="index03.htm">Aula Macedonia</a></b>. Creemos que es lo mejor
ya que su puntual crecimiento no le da suficiente peso como para ocupar
una "ranura" del men&uacute; principal. Por cierto, en esta edici&oacute;n
hay un nuevo art&iacute;culo.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Por otro lado, la secci&oacute;n que
antes estaba en Aula Macedonia, esto es, <b><a href="pjuegos.htm">Desarrollo
de Videojuegos</a></b>, se ha independizado y va a ocupar una ranura del
men&uacute; principal. Sin embargo, no va a estar sola pues se ha fusionado
con<b> Desarrollo Hispano</b>. Creemos que esto es lo mejor dado que las tem&aacute;ticas de ambas secciones
estaban &iacute;ntimamente relacionadas.</font></font>
<p align="justify"><H4><font face="Arial">&iquest;Ense&ntilde;a algo Aula Macedonia?</font></H4>
<p align="justify"><font face="Arial"><font size=-1>Recientemente nos lleg&oacute; este
email:</font></font>
<p align="justify"><font face="Arial"><font size=-1>"<font color="#008080">No es por despreciar
lo que hacen, yo se que es un arduo trabajo, pero creo que seria mas conveniente
si se centraran en solo unos cuantos temas y los terminaran a fondo, ya
que con el procedimiento que llevan ahora solo se termina aprendiendo casi
nada de todo que todo de algo, creo que deber&iacute;an ense&ntilde;ar
a programar en un lenguaje as&iacute; cuando sepamos ese pasan al otro,
seria mucho mejor</font>".</font></font>
<p align="justify"><font face="Arial"><font size=-1>La verdad es que este lector tiene
raz&oacute;n en parte. Est&aacute; claro y es un hecho, que en la secci&oacute;n
de Aula hay diversos cursos empezados y que se han abandonado. Pero es
injusto decir o insinuar que no hemos terminado a fondo ciertos temas.
En Aula hay bastantes cursos acabados y hay otros tantos que llevan un
n&uacute;mero elevado de art&iacute;culos publicados. Cursos como <b>OpenGL</b>,
<b>Delphi</b>, <b>Linux</b>, <b>VBA para Excel</b>, <b>C++</b>, <b>HTML</b>,
<b>Hacking</b>, <b>Programaci&oacute;n multimedia bajo DOS</b>, <b>Word
97</b>, <b>mIRC</b> o los nuevos que comienza en este n&uacute;mero, son
argumentos suficientes para demostrar que hay una cantidad muy grande de
cursos avanzados o ya terminados. No nos cansaremos de repetir que Macedonia
es una publicaci&oacute;n altruista, que la gente que est&aacute; metida
en este equipo es porque quiere y porque asume sus responsabilidades a
la hora de comenzar un curso. Es por esto, que la direcci&oacute;n ni la
coordinaci&oacute;n, puede controlar o "imponer" la finalizaci&oacute;n
de un curso ya empezado. Todo pasa a depender &uacute;nica y exclusivamente
de la persona que lo ha comenzado. A&uacute;n as&iacute;, volvemos a reiterar
que en Aula hay una cantidad inmensa de art&iacute;culos que dif&iacute;cilmente
se pueden encontrar en otra p&aacute;gina dedicada a la programaci&oacute;n
en general. Es probable, y esto ya es una idea que barajaba la direcci&oacute;n
antes de la llegada de este email, que todos aquellos cursos que han sido
abandonados como el de SQL o el de scripts CGI sean eliminados.</font></font>
<p align="justify"><H4><font face="Arial">Incorporaci&oacute;n de nuevos miembros a la revista</font></H4>
<p align="justify"><font face="Arial"><font size=-1>En la presente edici&oacute;n, tenemos
nuevos miembros dentro de nuestro equipo. Quiz&aacute;s, el m&aacute;s
importante, por su responsabilidad futura, sea <b>Juan B. Fern&aacute;ndez</b>.
Juan, va a ocupar el hueco que deja <b>Santiago Reinoso</b> como ilustrador
de Macedonia. Os podemos adelantar que ya no habr&aacute; m&aacute;s "Macedonio
bigotudo" en la portada. Creemos que es bueno que haya una renovaci&oacute;n
en varios frentes para poder constatar el cambio de etapa que comienza
desde ya en la revista. Antes de dejar este p&aacute;rrafo, dar las gracias
a Santi por todo el trabajo que ha hecho en Macedonia; por permitir a la
publicaci&oacute;n alcanzar un fuerte grado de personalidad a trav&eacute;s
de sus dibujos.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Otra de las incorporaciones importantes
es la de <b>Osiris Navarro</b> que ya en esta edici&oacute;n comienza un
nuevo curso en Aula Macedonia destinado al "HTML Avanzado". Por otro lado
y, sobre todo, de cara a la secci&oacute;n de Desarrollo de Videojuegos,
hay importantes incorporaciones. Por un lado tenemos a <b>Pedro Javier</b>,
fundador de <b>AGIDE</b>, nuevo miembro que va a ser clave para que dentro
de poco demos una sorpresa "programatoria"... Por &uacute;ltimo, una incorporaci&oacute;n
con nombre para este n&uacute;mero. Se trata de <b>Juan Antonio Medina</b>,
exmiembro de <b>Balance</b> y programador experto bajo plataforma Windows.
En este n&uacute;mero ya podemos ver un trabajo suyo dentro de Desarrollo
de Videojuegos. Bienvenidos a todos.</font></font>
<p align="justify"><H4><font face="Arial">Ponemos en pr&aacute;ctica el nuevo sistema de
puntuaci&oacute;n para videojuegos</font></H4>
<p align="justify"><font face="Arial"><font size=-1>Tal y como anunci&aacute;bamos en la
edici&oacute;n n&uacute;mero 10 de Macedonia, hemos puesto en marcha un
nuevo sistema de votaci&oacute;n para los juegos. Se ha intentado que todos
los redactores de la revista viertan sus puntuaciones de la forma m&aacute;s
proporcional posible, mediante una serie de "reglas" o criterios. Por supuesto,
se seguir&aacute;n respetando todos los art&iacute;culos que no lleven
puntuaci&oacute;n, as&iacute; que os podr&eacute;is encontrar an&aacute;lisis
puntuados y otros que no lo est&aacute;n. Para poder consultar los criterios
de puntuaci&oacute;n, pod&eacute;is visitar la portada de Zona de Juegos
(que, por cierto, ha sido modificada) o bien, pulsar <b><a href="critpunt.htm">aqu&iacute;</a></b></font></font>
<p align="justify"><H4><font face="Arial">Nueva secci&oacute;n en Zona de Simulaci&oacute;n:
Locos por el Asfalto</font></H4>
<p align="justify"><font face="Arial"><font size=-1>El sem&aacute;foro se pone verde tambi&eacute;n
en este n&uacute;mero para un nuevo apartado que llamaremos "<b>Locos por
el Asfalto</b>", ubicado dentro de <b><a href="simula.htm">Zona de Simulaci&oacute;n</a></b>.
En &eacute;l recogeremos todo tipo de art&iacute;culos relacionados con
el mundo del motor en los videojuegos que se salgan del puro y simple an&aacute;lisis
y comentario del juego en cuesti&oacute;n. Los aficionados a la simulaci&oacute;n
automovil&iacute;stica est&aacute;n de enhorabuena: t&eacute;cnicas de
conducci&oacute;n, an&aacute;lisis detallados de los circuitos y los veh&iacute;culos,
tiempos de vuelta r&aacute;pida, reglajes para obtener un rendimiento &oacute;ptimo…,
en definitiva, todo lo que pod&aacute;is imaginar sobre los mejores simuladores
de ordenador sobre asfalto. Para calentar motores os ofrecemos en este
n&uacute;mero varios art&iacute;culos dedicados al Need for Speed III:
Hot Pursuit. Si quer&eacute;is colaborar con la secci&oacute;n, no ten&eacute;is
m&aacute;s que mandar un email a <b>Miguel &Aacute;ngel Fern&aacute;ndez
</b>en <a href="mailto:mafer@ctv.es">mafer@ctv.es</a>, coordinador de Zona
de Simulaci&oacute;n, entre otras cosas, de la revista.</font></font>
<p align="justify"><H4><font face="Arial">"El Rinc&oacute;n de las Historias" se hace realidad</font></H4>
<p align="justify"><font face="Arial"><font size=-1>En este n&uacute;mero hace su aparici&oacute;n
una nueva secci&oacute;n en la que, todo aquel que quiera participar, puede
dejar volar su imaginaci&oacute;n dando vida a esas historias de fantas&iacute;a
y ficci&oacute;n que siempre le rondaban por la cabeza pero nunca se atrevi&oacute;
a plasmar en papel. "<b>El Rinc&oacute;n de las Historias</b>" nace con
la intenci&oacute;n de ser ese acogedor lugar de Macedonia, situado frente
al crepitante fuego de la chimenea, donde todos nos reuniremos en cada
n&uacute;mero para intercambiar esos relatos: historias de miedo y pesadilla,
la fantas&iacute;a m&aacute;s tradicional, la ciencia ficci&oacute;n en
todas sus variantes, todas ellas tienen cabida en este rinc&oacute;n de
<b><a href="index06.htm">Macedonia de Ocio</a></b> que esperamos tenga
tan buena acogida como el resto de las secciones habituales. En ello pondremos,
como siempre, todo nuestro empe&ntilde;o. Para romper el hielo, en este
n&uacute;mero comenzamos con algunas de las mejores historias de nuestros
colaboradores m&aacute;s "literarios", incluyendo la primera parte de la
sensacional novela corta de fantas&iacute;a "Serind&euml;l".</font></font>
<p align="justify"><font face="Arial"><font size=-1>"El Rinc&oacute;n de las Historias",
se encuentra coordinada por <b>Miguel Angel Fern&aacute;ndez</b>, as&iacute;
que si quieres ponerte en contacto con su impulsor, s&oacute;lo tienes
que mandarle un <b>email </b>a <a href="mailto:mafer@ctv.es">mafer@ctv.es</a>.</font></font>
<p align="justify"><H4><font face="Arial">Macedonia Nipona se divide en dos.</font></H4>
<p align="justify"><font face="Arial"><font size=-1>El n&uacute;mero pasado estrenamos
un nuevo apartado dentro de Teclados Fuera, secci&oacute;n coordinada por
<b>Samuel R&iacute;squez </b>(<a href="mailto:srd@retemail.es">srd@retemail.es</a>),
dedicada al mundo japon&eacute;s. El numero pasado, por cuestiones de tiempo,
no se pudo hacer lo previsto para iniciar la secci&oacute;n, por lo que
pudo parecer un apartado dirigido exclusivamente al Manga y al Anime, algo
que no tiene nada que ver directamente con lo que trata Macedonia.</font></font>
<p align="justify"><font face="Arial"><font size=-1>Este numero ya pod&eacute;is ver como
hemos dividido Macedonia Nipona en dos, una parte que ir&aacute; a <b><a href="index06.htm">Macedonia
de Ocio</a></b>, apartado dedicado a aquello que no es del mundo inform&aacute;tico
pero que puede interesar a quienes lo componen, que es la dedicada al Manga
y al Anime, mientras que en <b><a href="tf.htm">Teclados Fuera</a></b>
reside otra, del mismo nombre, pero dedicada a aquello japon&eacute;s que
tenga que ver de forma directa con los videojuegos. Es este n&uacute;mero,
hay comentarios sobre la publicidad japonesa (tema que se seguir&aacute;
tratando de forma continua en los siguientes), aunque no es lo &uacute;nico
que ofrecer&aacute; esa secci&oacute;n, habr&aacute; que esperar al siguiente
numero.</font></font>
<p align="justify"><H4><font face="Arial">Ay&uacute;danos a dar a conocer Macedonia</font></H4>
<p align="justify"><font face="Arial"><font size=-1>Ver&eacute;is que en la portada hemos
decidido poner el banner que tan amablemente nos hicieron los responsables
de <b><a href="http:\\www.emulatronia.com" alt="_new">Emulatron&iacute;a</a></b>, <b>Jos&eacute;
Antonio Albero "PTS"</b> (que adem&aacute;s es miembro del equipo) y, claro
est&aacute;, el maravilloso grafista <b>DEV</b>, autor del banner. Si tienes
una p&aacute;gina web y te gustar&iacute;a incluir a Macedonia en los links,
te brindamos el banner para que lo coloques en donde te plazca. La idea
es la de ir engordando el equipo en cada edici&oacute;n para poder ofrecer
as&iacute; m&aacute;s informaci&oacute;n y m&aacute;s material en cada
n&uacute;mero. Aqu&iacute; te dejamos el banner. Gracias por adelantado:</font></font>
<br><br>
<center><img src="g_misc/bmace.gif"></center>
<br><br>
<p align="justify"><H4><font face="Arial">...Y comienza las obras de remodelaci&oacute;n
hasta finales de Septiembre</font></H4>
<p align="justify"><font face="Arial"><font size=-1>Pues s&iacute;. La edici&oacute;n n&uacute;mero
11 va a suponer el inicio de una nueva etapa dentro de la revista y, aunque
la segunda &eacute;poca de Macedonia que cerramos con este n&uacute;mero,
no ha sido tan larga como la primera, ha sido suficientemente intensa como
para acometer una renovaci&oacute;n en varios frentes. La creaci&oacute;n
de un nuevo dise&ntilde;o, el futuro y prometedor OFFLINE 2, el important&iacute;simo
cambio de direcci&oacute;n y, en general, los objetivos que se pretenden
configurar con el n&uacute;mero 11, necesitan de una etapa de merecido
descanso. As&iacute; pues, nos vemos a finales del mes de Septiembre. &iexcl;Hasta
entonces, feliz verano!.</font></font>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>

<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">NOTICIAS INTERNAS</FONT></B></FONT></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B></FONT></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</body>
</HTML>

