<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>N</B></font><FONT color="#000000" size=7 face="arial"><B>oticias Internas<hr>Número 7</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<hr>
<br><br>

<p align="justify">
<H3>Perd&oacute;n por el retraso.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Muchos os habr&eacute;is estado preguntado
el por qu&eacute; de tanto retraso para el lanzamiento de este n&uacute;mero.
La verdad es que ha sido un c&uacute;mulo de mala suerte unido a un c&uacute;mulo
de expectativas ciertamente elevadas para esta edici&oacute;n. S&iacute;,
en este n&uacute;mero esper&aacute;bamos tener lista la versi&oacute;n
<B>Off-Line</B>, consumada la uni&oacute;n con <B>Spanish Quest</B> y,
para rematar la faena, terminada la remodelaci&oacute;n total de Macedonia.
Alguno de estos objetivos ha tenido que ser aplazado por la situaci&oacute;n
de incomunicaci&oacute;n que se ha vivido. Despu&eacute;s de que el director
de la revista se quedara sin cuenta de correo electr&oacute;nico, durante
todo el mes de octubre y parte de noviembre, se ha tenido que sufrir una
adaptaci&oacute;n o "cambio de ritmo", para salir del paso, mediante el
uso de correo tradicional y llamadas telef&oacute;nicas. Para colmo de males, Albert,
el webmaster de Macedonia, tuvo un aparatoso accidente justo el dia antes en que habíamos
fijado la fecha oficial de la publicación del 7. Sin embargo, "no hay mal que por bien no venga" 
y ahora mismo Macedonia est&aacute; preparada para resolver casi cualquier tipo de problema. 
Ha merecido la pena esta experiencia (aunque eso lo decimos ahora que por fin hemos podido lanzar el número 7).</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Por otro lado, ver&eacute;is que en
este n&uacute;mero no s&oacute;lo estrenamos nuevo aspecto y una recolocaci&oacute;n
de contenidos sino que preparamos la llegada inminente de la versi&oacute;n
Off-Line (la cual, est&aacute; siendo depurada al m&aacute;ximo por <B>Jos&eacute;
Antonio Su&aacute;rez</B> y <b>Santiago Reinoso</b>) y, c&oacute;mo no, la incorporaci&oacute;n de
Spanish Quest a la familia (ver noticia<I> "Spanish Quest y Macedonia pasan
de novios a casados</I>"). Esto &uacute;ltimo llevar&aacute; un poquito
m&aacute;s de tiempo pues la cantidad de material de este fanzine hermano
es muy elevada. De todos modos, confiamos que est&eacute; todo listo para
el n&uacute;mero 8 como muy tarde (no descartamos que se incorpore durante
la marcha del n&uacute;mero 7).</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Por todo esto pedimos perd&oacute;n
a todos aquellos que hayan estado esper&aacute;ndonos pacientemente. Gracias
por confiar en el equipo.</FONT></FONT>

<H3><FONT COLOR="#000000">Macedonia ya tiene Webmaster
en condiciones.</FONT></H3>

<img src="jpg/albdis.jpg" align="left"><p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Suponemos
que lo primero que os habr&aacute; llamado la atenci&oacute;n al entrar
en Macedonia (a parte de ver que hemos sacado el n&uacute;mero 7 -la broma
era inevitable- ;-), es que hemos renovado por completo el dise&ntilde;o
Web . Antes de que nos digáis si os gusta o no, debéis de saber que es un diseño "temporal" pues
el verdadero, el que hará que Internet tiemble de gusto, será el que colocaremos de la mano
de nuestro webmaster <b>Albert Feliu</b> el cual, está trabajando duro para ofrecer un
diseño a medio camino entre la austeridad gráfica de este y la calidad gráfica para
poder competir entre las mejores web de la red. <BR>
Tenemos previsto colocar el nuevo diseño web, el que sustituya a este, durante el tiempo que esté
Macedonia número 7 alojada en la red. Asi que, ya sabéis, estad "al loro" que actualizamos
de arriba a abajo uno de estos días.<br>
Por el momento, os dejamos una captura de la pantalla principal del verdadero diseño de Macedonia 7.




</FONT>

<H3><FONT COLOR="#000000">Estrenamos nuevo logo</FONT></H3>

<p align="justify"><FONT FACE="Arial"><FONT COLOR="#000000"><FONT SIZE=-1>Si el estreno
de un nuevo y fenomenal dise&ntilde;o Web para Macedonia es todo un acontecimiento,
no lo es menos el de lucir un logotipo acorde a la nueva &eacute;poca que
comenzamos. <B>Carlos Alonso</B>, uno de los "maestros" de la revista,
se ha encargado de demostrarnos de lo que es capaz como dise&ntilde;ador
gr&aacute;fico y, ciertamente, ha creado algo que muestra claramente la
personalidad del fanzine; elegante, seria y, a la vez, jovial. Como v&eacute;is,
se han mantenido cl&aacute;sicas formas como es el hecho de continuar con
nuestra 'N' roja dando esa "vidilla" al logo. Bueno, &iquest;qu&eacute;
os parece?.</FONT></FONT></FONT>

<H3>Spanish Quest y Macedonia pasan de novios a casados.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Pues s&iacute;, <B>Spanish Quest</B>
y <B>Macedonia</B> se han unido. Despu&eacute;s de una temporada de indudable
noviazgo", en cuanto a relaciones "fanzinianas", se ha decidido una fusi&oacute;n
entre ambas entidades. Macedonia tomar&aacute; la gran cantidad de art&iacute;culos
que ha editado Spanish Quest para incorporarlos a sus &aacute;reas o secciones
ya existentes. Por otro lado, se abrir&aacute; una zona especial, dentro
del apartado para juegos de Macedonia que, con el nombre de Spanish Quest,
tratar&aacute; todos los temas puramente aventureros, es decir, habr&aacute;
opini&oacute;n, soluciones, noticias, en definitiva, todo lo que hab&iacute;a
en Spanish Quest y que no halla una ubicaci&oacute;n exacta en Macedonia
al tener un car&aacute;cter m&aacute;s especializado.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Pese a que esta noticia pudiera parecer
una "absorci&oacute;n" por parte de Macedonia, eso no es cierto. Spanish
Quest seguir&aacute; existiendo como entidad, eso s&iacute;, ligada a Macedonia.
Cada tres meses, en principio, se editar&aacute; una recopilaci&oacute;n
de todos los art&iacute;culos aventureros sacados en Macedonia, es decir,
los sacados por los miembros de Spanish Quest y los de Macedonia.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Para que no quede duda de que tal fusi&oacute;n
es, en efecto, una uni&oacute;n entre dos fanzines, los dos m&aacute;ximos
responsables de Spanish Quest, esto es, <B>Ra&uacute;l Alvarez</B> y <B>Daniel
C&aacute;rdenas</B>, pasan a ocuparse de la coordinaci&oacute;n aventurera
de Macedonia.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Por otro lado, la fecha de incorporaci&oacute;n
de Spanish Quest tiene de tope el n&uacute;mero 8 pero es posible que,
durante el tiempo que est&eacute; colocado el n&uacute;mero 7, pueda incorporarse.
Sabed que la colocaci&oacute;n de Spanish Quest no es, por as&iacute; decirlo,
"moco de pavo". Hay una cantidad inmensa de art&iacute;culos que colocar
e interesa mucho hacer las cosas bien no s&oacute;lo hacerlas.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Ya pod&eacute;is lanzar el arroz ;-).</FONT></FONT>

<H3>El director de Emulatron&iacute;a tambi&eacute;n
se hace Macedonio.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Cada vez tenemos menos que envidiar
a los fichajes deportivos porque la plantilla que tenemos sigue y sigue
creciendo en cantidad y, sobre todo, calidad. Ahora le ha tocado el turno
a <B>Jos&eacute; Antonio Albero</B>, es decir, <B>Pts,</B> el responsable
de "<B>Emulatron&iacute;a</B>". Gracias a este experto en el panorama de
los emuladores, la secci&oacute;n administrada por <B>Alejandro Ib&aacute;&ntilde;ez</B>,
esto es, "<B>Recuerdos de 8 Bits</B>", comenzar&aacute; a arrojar informaci&oacute;n
muy interesante e imprescindible sobre el mundo de los emuladores. Bienvenido
Pepe.</FONT></FONT>

<H3>Problemas solucionados con la p&aacute;gina de
Luis Miguel Gordo Cano.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Durante el mes de Agosto apareci&oacute;
una noticia en <B>MeriStation</B> que a m&aacute;s de uno dej&oacute; un
tanto decepcionado. Una p&aacute;gina alojada en Ciudad - Futura estaba
publicando soluciones que no la pertenec&iacute;an. Ante tal hecho la direcci&oacute;n
de Macedonia enseguida se puso en marcha para determinar si alg&uacute;n
art&iacute;culo de nuestro fanzine hab&iacute;a sido "arrebatado" sin previo
aviso. Efectivamente, nuestro fanzine se hab&iacute;a visto privado del
art&iacute;culo dedicado a la soluci&oacute;n del "<I>Ultima VII, The Black
Gate</I>" que fuera confeccionado por nuestro redactor<B> Miguel Angel
Cividanes</B>.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>El email de protesta no se hizo esperar.
Afortunadamente nos encontramos con una persona muy amable y reconocedora
de su error. Desde aqu&iacute; queremos mostrar nuestra disposici&oacute;n
y "buen rollo" a <B>Luis Miguel Gordo Cano</B> por su caballerosidad y
r&aacute;pida actuaci&oacute;n para solucionar los problemas ocasionados
a nuestra Macedonia.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Un saludo, Lu&iacute;s, de parte de
toda Macedonia y un reconocimiento a tu persona por ser el primero en querer
solucionar todo el asunto.</FONT></FONT>

<H3><FONT COLOR="#000000">El Off-Line en camino...</FONT></H3>

<p align="justify"><FONT FACE="Arial"><FONT COLOR="#000000"><FONT SIZE=-1>S&iacute; el
visor no ha podido estar listo, por todo los temas comentados en la noticia
primera, pero eso no quiere decir que no se haya avanzado en el mismo.
Ya podemos asegurar que el visor est&aacute; acabado a un 90% ya que s&oacute;lo
falta realizar todas las pruebas de test para que, en el n&uacute;mero
8, podamos sacar la versi&oacute;n definitiva. A&ntilde;adir tambi&eacute;n
que el visor Off-Line, junto a todos los n&uacute;mero de Macedonia, ser&aacute;
distribuido en las m&aacute;s importantes revistas nacionales y sudamericanas
en los cd’s de las mismas.</FONT></FONT></FONT>
<BR><FONT FACE="Arial"><FONT COLOR="#000000"><FONT SIZE=-1>El visor Off-Line
ha sido programado por <B>Jos&eacute; Antonio Su&aacute;rez</B> contando
con los gr&aacute;ficos de <B>Santiago Reinoso</B>. Estas dos miembros
del equipo han sido los principales creadores del mismo. Tambi&eacute;n
ha contribuido m&aacute;s miembros con ideas pero a ellos dos se les debe
la maravilla de visor que han creado para Macedonia.</FONT></FONT></FONT>
<BR><FONT FACE="Arial"><FONT COLOR="#000000"><FONT SIZE=-1>Para m&aacute;s
informaci&oacute;n, os pod&eacute;is pasar por la secci&oacute;n de la
revista dedicada al visor en la que hallar&eacute;is m&aacute;s datos y
las primeras capturas defintivas del mismo. Como no podemos contener nuestro
orgullo, os mostramos tambi&eacute;n aqu&iacute; las caputuras anteriormente
citadas. &iexcl;Que aprovechen!</FONT></FONT></FONT><BR><BR>
<CENTER><IMG SRC="jpg/offprev.jpg" HEIGHT=257 WIDTH=515></CENTER>


<H3>Inauguramos "Desarrollo Hispano" y rescatamos
"Zona Hardware".</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Hemos abierto una nueva secci&oacute;n
en Macedonia destinada a recoger todas las noticias del mundo del desarrollo
hispano, analizar productos independientes, comentar experiencias y contribuir
a que los proyectos de los grupos actuales sigan desarroll&aacute;ndose.
El objetivo de <B>"Desarrollo Hispano</B>", que es como se llama el apartado,
es el de servir de "escaparate" a todos los grupos "underground" de habla
hispana, a la vez que ser una fuente de noticias de todo lo que rodea al
desarrollo, principalmente orientado a juegos, comercial de nuestro pa&iacute;s.
L&oacute;gicamente la secci&oacute;n est&aacute; empezando y va a necesitar
fuertes dosis de ayuda por parte vuestra. Que el proyecto sobreviva depende
&uacute;nica y exclusivamente de vosotros. Si eres miembro Stratos est&aacute;
en el "contrato" echar una mano ;-).</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Por otro lado, "<B>Zona Hardware</B>",
comandada por <B>Francisco Dom&iacute;nguez</B>, ha sido rescatada para
esta edici&oacute;n de tal forma que ahora podr&eacute;is consultar informes
de la materia en<B> "Aula Macedonia</B>". En el número 8, adelantamos que Sargue, director de
la conocida página Noticias Sargue <a href="http://welcome.to/Noticias-Sargue">http://welcome.to/Noticias-Sargue</a>, se encargará también
 de la coordinación de esta sección. ¡Preparaos para artículos de lujo con sabor a hardware!.</FONT></FONT>

<H3>Sobre los cursos de SQL Server bajo Windows NT
y Word 97.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Los autores de estos dos cursos, <B>Emilio
Rubio</B> de SQL y <B>Juan Carlos Gilarranz</B> de Word 97, siguen perdidos
y sin ponerse en contacto con la direcci&oacute;n desde hace ya dos n&uacute;meros
(muchos meses). Sentimos comunicar que, si a lo largo de la edici&oacute;n
n&uacute;mero 7 no dan se&ntilde;ales de vida, tendremos que suprimir y
retirar sus trabajos pues no podemos dejar cursos a medias. Sentimos el
anuncio de la previsible desaparici&oacute;n de los mismos por la gente
que los haya podido estar siguiendo pero no podemos dejar trabajos a medias.
Hay que terminar lo empezado.</FONT></FONT>

<H3>Aparición de una sección para consolas.</H3>
<p align="justify"><font size=2 face="arial">
Ya está decidido que, para el número 8, se abra un apartado en "Zona de Juegos", destinado al mundo
de la consolas. Con el nombre de <b>"Teclados Fuera"</b>, se va a intentar tapar el hueco existente en
Macedonia para las plataformas de Sega, Nintendo y Sony. <B>Samuel Rísquez</b> será el encargado de
coordinar todos los temas de la misma. Ya hay preparados un buen montón de trabajo asi que el
nacimiento de esta sección va a ser, además de prematuro, con 100% de posibilidades de arrasar. Esperamos
tú ayuda para "Teclados Fuera".
</font>



<H3>Posible aparici&oacute;n de una secci&oacute;n
de programaci&oacute;n de juegos.</H3>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Es muy probable que en el n&uacute;mero
8 se abra una subsecci&oacute;n dedicada, &uacute;nica y exclusivamente,
a la programaci&oacute;n de juegos. Es un principio ir&aacute; como un
apartado independiente de "Aula Macedonia" y necesitar&aacute; mucha, much&iacute;sima,
ayuda de vuestra parte pues se cuentan con los dedos de una mano los art&iacute;culos
en castellano sobre esta disciplina, que tan pocas ayudas recibe y que
tanto gustar&iacute;a alcanzar a todos nosotros.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Si tienes art&iacute;culos sobre teor&iacute;a
de juegos, inteligencia artificial aplicable, sobre dise&ntilde;os, etc&eacute;tera,
ponte en contacto con nosotros cuanto antes.</FONT></FONT>
<br><br>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>

<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">NOTICIAS INTERNAS</FONT></B></FONT></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B></FONT></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

