<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>N</B></font><FONT color="#000000" size=7 face="arial"><B>oticias Internas<hr>Número 8</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<hr>
<br><br>
<a href="offline.htm"><img src="jpg/moffcap.jpg" align="left" border=0 alt="¡Quiero conseguir el OFFLINE!"></a>
<B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Ya est&aacute; aqu&iacute; el Off-Line.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">S&iacute; amigos, s&iacute;, ya tenemos el Off Line preparado. Este programa significa mucho para todos nosotros pues condensa algo m&aacute;s de un a&ntilde;o de trabajo. Tan s&oacute;lo hace falta echar un vistazo a la portada de &eacute;ste n&uacute;mero y ver que est&aacute; dedicada por entero a tal visor. "<B>Macedonia OffLine I"</B> ha sido desarrollado principalmente por <B>Jos&eacute; Antonio Su&aacute;rez</B> y <B>Santiago Reinoso</B> y su proceso de creaci&oacute;n se remonta al mes de Abril / Junio de 1998. </P>
<P ALIGN="JUSTIFY">En la secci&oacute;n de Macedonia habilitada para el Off Line (a la que puedes acceder pulsando <B><a href="offline.htm">aqu&iacute;</a></B>), te comentamos c&oacute;mo poder obtener el visor as&iacute; como su publicaci&oacute;n futura en revistas del sector. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">La uni&oacute;n con Spanish Quest queda consumada.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si ya en el n&uacute;mero 7 ofrecimos los primeros art&iacute;culos procedentes de tal fusi&oacute;n, en &eacute;sta edici&oacute;n se ha conseguido completar la uni&oacute;n entre los dos fanzines. En la secci&oacute;n de &quot;<B>Zona de Juegos</B>&quot; se ha habilitado un apartado llamado, c&oacute;mo no, <B>Spanish Quest</B> que tendr&aacute; como objetivo el llevar todos los temas aventureros de la revista. </P>
<P ALIGN="JUSTIFY">El <B>Spanish Quest</B> que se pueda leer en Macedonia ser&aacute; el Spanish Quest de toda la vida. El objetivo es que este fanzine hermano se vea arropado por toda la gran familia que es Macedonia. En un principio, se prevee que se editen cada tres meses todo el material producido en Spanish Quest tal y como se ven&iacute;a haciendo en esta publicaci&oacute;n antes de la fusi&oacute;n. Otro de los factores que se han procurado cuidar es el referente a la codificaci&oacute;n en HTML pues muchos de los asiduos lectores a Spanish Quest utilizaban para navegar el Lynx. Esperamos que todo est&eacute; en perfecto orden. Si hay alg&uacute;n problema en la p&aacute;gina no dudes en ponerte en contacto con nosotros.</P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">"Petris", el primer juego de Macedonia.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pues s&iacute;. Adem&aacute;s de poder disfrutar ya del Off - Line, tenemos preparada una sorpresa m&aacute;s. Se trata de un sencillo juego <B>Freeware</B> que hemos realizado bajo Windows. Con el nombre de <B>Petris</B>, os presentamos un cl&oacute;nico del cl&aacute;sico e inconfundible <B>Tetris</B> de Alexy Pajitnov. El juego funciona bajo Windows y existe una versi&oacute;n en ingl&eacute;s y otra en castellano. En "Descarga", encontrar&eacute;is toda la informaci&oacute;n para obtener ambas versiones. De todos modos, mientras lees estas noticias internas, puedes pulsar <a href="zip/petrise.zip">aqu&iacute;</a> y comenzar a bajar el programa.</P>
<P ALIGN="JUSTIFY">De todas formas, te diremos que el juego corre perfectamente bajo el entorno del <B>Off</B>-<B>Line</B> gracias a las manos expertas de <B>Jos&eacute;</B> <B>Antonio</B> <B>Su&aacute;rez</B> as&iacute; que si piensas conseguir el Off-Line no te merecer&aacute; la pena bajarte el juego. Lo tendr&aacute;s incluido ya con el visor.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El juego ha sido desarrollado por <B>Fernando Rodr&iacute;guez</B>. La ilustraci&oacute;n de portada ha sido realizada por <B>Santiago Reinoso</B> y la traducci&oacute;n al ingl&eacute;s por <B>Marta Ma&ntilde;anes</B>. El resto de miembros de Macedonia se han encargado de las pruebas de testeo y de las pertinentes felicitaciones de este gremio.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Nuevas incorporaciones y reincorporaciones en Macedonia</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En &eacute;ste n&uacute;mero 8 de Macedonia, se han incorporado una serie de personas a las que queremos dar nuestro m&aacute;s caluroso afecto. &Eacute;stas son, <B>Javier M</B>., que participar&aacute;, junto a <B>Samuel R&iacute;squez</B>, en la confecci&oacute;n principal de la nueva secci&oacute;n "<B>Teclados Fuera</B>" y <B>Alejandro Santacreu</B>, m&aacute;s conocido en Macedonia como "Auryn", que junto a <B>Sergio Baila</B> y <B>Francisco Caliban</B>, se encargar&aacute; de configurar una imponente "Zona de Hardware". 
Por último, <b>Joan Teruel Planas</b>, un miembro de Stratos, también pasa a formar parte de nuestra familia y en éste número ya podéis ver sus trabajos en "Aula Macedonia". Se trata del curso de iniciación a las DirectX.
Bienvenidos a los tres.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por otro lado, viejos ilustres de Macedonia se reincorporan a la plantilla del equipo. Por un lado <B>Carlos P&eacute;rez - G&aacute;ndaras</B>, vuelve al ruedo despu&eacute;s de un grand&iacute;simo lapsus de tiempo y por otro, <B>Juan Carlos Gilarranz</B> que tambi&eacute;n se hallaba perdido en combate. </P>

</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Nos "quedamos" sin Webmaster</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de mil y un problemas, <B>Albert</B> <B>Feliu</B>, el que era hasta ahora "virtual" Webmaster de Macedonia, ha tenido que verse obligado a abandonar su puesto de responsabilidad debido a que carec&iacute;a del tiempo necesario para acometer tan importante proyecto. Por este motivo, no pudimos actualizar la p&aacute;gina cuando prometimos. Lo sentimos.</P>
<P ALIGN="JUSTIFY">Albert ahora ha pasado a formar parte de la plantilla de redactores y para &eacute;ste n&uacute;mero tenemos tres trabajos suyos en secciones tan dispares como son "Programaci&oacute;n de Juegos", "Zona de Simulaci&oacute;n" o "Macedonia de Ocio".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora lo que haremos ser&aacute; seguir utilizando este dise&ntilde;o que, aunque no tiene el potencial gr&aacute;fico para competir por la vistosidad de la red, s&iacute; que ofrece unos tiempos de carga envidiables y una disposici&oacute;n ordenada de los art&iacute;culos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como siempre, si ten&eacute;is alg&uacute;n tipo de sugerencia para mejorar el asunto, coment&aacute;rnosla.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Primera quedada "oficial", en Sevilla, de Macedonia.</P>
</B><P ALIGN="JUSTIFY"></P>
</FONT><I><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El pasado 2 de Enero se "celebr&oacute;" la primera quedada de "macedonios" Sevilla. He aqu&iacute; la cr&oacute;nica de Cid:</P>
</I><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los que hemos empezado a escribir para Macedonia pronto nos sentimos miembros de una gran familia. Formas parte del engranaje de movimiento de la revista, en el cual, aunque seas una pieza peque&ntilde;a, eres de vital importancia para el perfecto funcionamiento del equipo (como se pudo ver en el desgraciado accidente de Albert).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Toda la conexi&oacute;n entre nosotros se realiza v&iacute;a mail debido a que los que formamos Macedonia, vivimos en puntos muy distantes de Espa&ntilde;a. Con mi incorporaci&oacute;n (reciente) a esta revista ya &eacute;ramos tres los Sevillanos del equipo con lo que ya no exist&iacute;a disculpa para no organizar una mini-quedada. Es un honor para mi escribir esta breve cr&oacute;nica de la primera quedada que ha tenido Macedonia en estos 7 n&uacute;meros que se celebro el 2 de Enero de 1999 y a la que asistieron:</P>
<P ALIGN="JUSTIFY"></P><DIR>
<DIR>

<B><P ALIGN="JUSTIFY">Francisco</B> <B>Dom&iacute;nguez</B> "Paco". </FONT><FONT FACE="Arial" SIZE=1>(Uno de los coordinadores "Zona Hardware")</P>
</FONT><B><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Santiago</B> <B>Reinoso</B> "Yago". </FONT><FONT FACE="Arial" SIZE=1>(Uno de los Grafistas de Macedonia.).</P>
</FONT><B><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">David</B> <B>Isla</B> "CID" </FONT><FONT FACE="Arial" SIZE=1>(Un servidor, que es coordinador de la secci&oacute;n "Programaci&oacute;n de Juegos" )</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P></DIR>
</DIR>

<P ALIGN="JUSTIFY">El lugar elegido para el acontecimiento fue el Edifico Cristina de Sevilla, muy c&eacute;ntrico y con buen ambiente. All&iacute;, en una de las cafeter&iacute;as, se nos fueron las horas conversando entre nosotros; a qu&eacute; nos dedic&aacute;bamos, qu&eacute; proyectos ten&iacute;amos en mente, por qu&eacute; no se come Linux a Windows 95 :-) y viendo los fant&aacute;sticos dibujos de Santi. Fue una tarde muy entretenida y qui&eacute;n sabe, quiz&aacute;s tambi&eacute;n un primer paso hacia una Quedada Global de todo el equipo de Macedonia :D</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Que se preparen los consoleros, ya llega Teclados Fuera.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡Al fin tenemos una secci&oacute;n para cosoleros natos!. Con el original nombre de "Teclados Fuera" abrimos un nuevo apartado dentro de Zona de Juegos destinado a cubrir todas las exigencias de los amantes a las consolas. La nueva secci&oacute;n de Macedonia ser&aacute; coordinada por Samuel R&iacute;squez, un Macedonio veterano en estas lides del videojuego.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En &eacute;ste n&uacute;mero, y por las malditas prisas, no hemos podido ofrecer todo lo que ten&iacute;amos inicialmente planteado pero, estad atentos que, o bien actualizamos sobre la marcha, o bien desbordamos Internet para el pr&oacute;ximo n&uacute;mero 8-).</P>
<P ALIGN="JUSTIFY"> </P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">¡Al fin chicos!. Ya tenemos una secci&oacute;n sobre programaci&oacute;n de juegos</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con el nombre de "<B>Programaci&oacute;n</B> <B>de</B> <B>Juegos</B>", nace una nueva secci&oacute;n destinada a abarcar todos los temas concretos que figuran en cualquier desarrollo de videojuegos. Para este n&uacute;mero, tenemos preparados un gran mont&oacute;n de trabajos. Una importante parte de ellos provienen de la fusi&oacute;n que este fanzine realiz&oacute; con "<B>Spanish</B> <B>Quest</B>" pero otros, casi en igual cantidad, son totalmente in&eacute;ditos y tratan tambi&eacute;n temas muy interesantes. Tanto de dise&ntilde;o, como de programaci&oacute;n a todos los niveles. Esta nueva secci&oacute;n de Macedonia ser&aacute; liderada por uno de los todo terreno de la revista, <B>David</B> <B>Isla</B> "<B>Cid</B>".</P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">Los art&iacute;culos ahora llevar&aacute;n fecha de &uacute;ltima revisi&oacute;n.</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A partir de este n&uacute;mero, todos los art&iacute;culos que vayamos editando llevar&aacute;n indicado en la parte inferior derecha la fecha en la que han sido revisados por &uacute;ltima vez. Esta idea, que es original del coordinador de "Zona de Simulaci&oacute;n", esto es, nuestro querido <B>Miguel</B> <B>Angel</B> <B>Fern&aacute;ndez</B> "<B>Raistlin</B>", va a permitir que todos los trabajamos que editemos encuentren siempre un contexto inmediato y sean coherentes para la persona que los pueda consultar. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=3><P ALIGN="JUSTIFY">¡Muchas gracias Emulatronia!</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El pasado d&iacute;a<B> 27 de Enero</B>, nuestros compa&ntilde;eros de <B>Emulatronia</B> (y miembros, por cierto, de Macedonia) nos dieron una sensacional sorpresa al colocar un banner anunciando Macedonia en su p&aacute;gina. El art&iacute;fice de la idea fue el inconfundible <B>Pts</B> y el encargado de llevarla a la pr&aacute;ctica el genio de <B>Dev</B>. Muchas gracias &quot;apa&ntilde;eros&quot; ;). Os dejamos el banner tan chulo que ideo <B>Dev</B>.</P></FONT>
<P ALIGN="CENTER"><img src="g_misc/bmace.gif"></P>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>

<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">NOTICIAS INTERNAS</FONT></B></FONT></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B></FONT></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

