<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>N</B></font><FONT color="#000000" size=7 face="arial"><B>oticias Internas<hr>Número 9</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<hr>
<br><br>
<table align="left">
<td><img src="g_misc/macefx.jpg" WIDTH="200"></td>
<tr>
<td><FONT FACE="Arial" size=1><center>Así se las gasta uno de nuestros grafistas; <br>Carlos Alonso</center></font></td>
</table>

<FONT FACE="Arial"><h4>Desembarco del OFFLINE en las revistas hispanas.</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pues s&iacute; chicos, el pasado mes de Marzo Macedonia comenz&oacute; el desembarco oficial entre las revistas m&aacute;s representativas del mercado espa&ntilde;ol. La verdad es que se hac&iacute;a imprescindible una distribuci&oacute;n a ese nivel. 12 megas es una cantidad excesiva de datos para ser descargada, m&aacute;xime, teniendo en cuenta c&oacute;mo est&aacute; Internet en nuestro pa&iacute;s. Elegimos la opci&oacute;n de distribuir el Off Line entre revistas comerciales porque pensamos que ser&iacute;a el medio m&aacute;s interesante y que mejores garant&iacute;as iba a ofrecer. No podemos establecer ning&uacute;n tipo de canal de distribuci&oacute;n interno por una sencilla raz&oacute;n, carecemos de la infraestructura necesaria. Todos los que quer&aacute;is saber en qu&eacute; revistas ha salido, o va a salir, el Off Line, pod&eacute;is encontrar una relaci&oacute;n de las mismas en la secci&oacute;n del visor. Por supuesto, ya se ha puesto en marcha la maquinaria para que Macedonia Off Line vea la luz en Sudam&eacute;rica. M&aacute;s concretamente en Argentina y M&eacute;xico.</P>
<P ALIGN="JUSTIFY">Así mismo, hemos habilitado un Banner en la página principal para intentar llamar la atención a todos aquellos que quieran hacerse con el visor vean en qué revistas del sector saldrá. El fenomenal Banner ha sido creado e ideado por <b>Alejandro Ibáñez</b></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Macedonia quiere dar las gracias a todas las publicaciones que, de forma totalmente desinteresada, nos han incluido, o incluir&aacute;n, en sus cd’s de portada. Gracias por ayudarnos a distribuir el Off Line. </P>
<P ALIGN="JUSTIFY"></P>
<FONT FACE="Arial"><h4>Telépolis reconoce el trabajo del equipo Macedonia.</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Justo el d&iacute;a antes de la puesta en web del n&uacute;mero 9 de Macedonia, lleg&oacute; hasta nuestra redacci&oacute;n el siguiente mensaje de <B><A HREF="http:\\www.telepolis.com" target="_new">Tel&eacute;polis</b></a>:</P>
<table align="left">
<td><IMG SRC=http://www2.telepolis.com/inicio/interesante.gif></td>
</table>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=2 COLOR="#ff0000"><P ALIGN="JUSTIFY">Nos es grato comunicarle que su web ha sido seleccionado como Interesante en el Directorio Tem&aacute;tico del portal-web Tel&eacute;polis, por lo que aparece en un lugar privilegiado dentro del mismo.
<BR>De los miles de webs que est&aacute;n referenciados en nuestro directorio, s&oacute;lo los mejor dise&ntilde;ados y los que aportan una informaci&oacute;n m&aacute;s relevante adquieren la categor&iacute;a de Interesante.</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Desde Macedonia, queremos dar las gracias a Tel&eacute;polis por interesarse por la revista. Noticias como la recibida ayudan a reforzar m&aacute;s, si cabe, la moral y las ganas necesarias para continuar trabajando en Macedonia.</P></FONT>
<P ALIGN="JUSTIFY"></P>

<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Nuevas incorporaciones al equipo Macedonia</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para el n&uacute;mero 9, tenemos a m&aacute;s gente dispuesta a dejar bien alto la calidad general de la revista. Y es que contamos ya con un webmaster profesional y un m&uacute;sico de prestigio internacional. Pero vayamos por partes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pese a que ya tuvimos un amago de estabilizaci&oacute;n en el dise&ntilde;o de la p&aacute;gina con la incorporaci&oacute;n de Albert<B> </B>Feliu (el cu&aacute;l, por problemas de tiempo, tuvo que abandonar dicha responsabilidad), ahora estamos en condiciones de afirmar que habr&aacute; webmaster estable en la revista. Se trata de <B>Manuel Lao</B>, buen amigo del subdirector de Macedonia, <B>Oscar Garc&iacute;a</B>. A Manuel, le queda una tarea tit&aacute;nica, pues la publicaci&oacute;n ha crecido de forma, casi, exponencial. La remodelaci&oacute;n de la p&aacute;gina est&aacute; servida y ya se ha comenzado a montar un sistema de directorios que sea lo m&aacute;s fiable y flexible posible. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La salida de la nueva Macedonia (estamos hablando del n&uacute;mero 11), est&aacute; prevista para despu&eacute;s de verano. M&aacute;s concretamente, para finales del mes de Septiembre. Por esas fechas, esperamos haber conseguido encontrar el &quot;punto&quot; creativo que nos identifique. Actualmente, en la lista de Macedonia, se est&aacute;n produciendo interesantes debates sobre el dise&ntilde;o que deber&iacute;a de imperar en la futura Macedonia. Si tienes alguna sugerencia, no dudes en hac&eacute;rnosla saber.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Por otro lado, en la &uacute;ltima etapa de realizaci&oacute;n del n&uacute;mero 9, <B>David Isla</B> "<B>Cid</B>", consigui&oacute; traer hasta la publicaci&oacute;n a uno de los miembros m&aacute;s destacados de la "escena" espa&ntilde;ola. Se trata de <B>V&iacute;ctor Vergara</B>, conocido "tracker" y grafista que ha colaborado en la realizaci&oacute;n de juegos comerciales (actualmente, pertenece al grupo de desarrollo <B>Exelweiss</B>), obtenido premios a nivel mundial como el del <B>Music Contest VI</B>, y otros de fuentes tan prestigiosas como la <B>Euskal</B> <B>Party</B>. Sin duda, todo un lujazo para la publicaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">V&iacute;ctor, o <B>Awesome</B> para los amigos, comenzar&aacute; a escribir en un nuevo apartado de "<B>Desarrollo de Juegos</B>", destinado a servir como punto de referencia para todos las personas que deseen aprender los mecanismos existentes a la hora de componer m&uacute;sica para videojuegos. Sus trabajos los comenzaremos a disfrutar a partir del n&uacute;mero 10.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y por &uacute;ltimo, y no por ello menos importante, ni much&iacute;simo menos, tenemos la incorporaci&oacute;n de otro argentino de pro que, aunque no cuenta con conexi&oacute;n a Internet, se vale gracias al "puente" de uni&oacute;n de nuestro veterano <B>Miguel Angel Cividanes</B> "<B>Beren</B>". <B>Ricardo Amil</B> Comenzar&aacute; a trabajar en "Aula Macedonia" con un curso &iacute;ntegro de Ensamblador. En este mismo n&uacute;mero ya lo pod&eacute;is consultar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y bueno, qu&eacute; m&aacute;s decir. Bienvenidos a los tres.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Zona Hardware recupera su territorio.</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El hecho de disponer ya de un equipo totalmente estable para "alimentar" la secci&oacute;n de hardware, nos ha llevado a colocarla en su lugar original, esto es, como un apartado aut&oacute;nomo de la revista. Ya en el n&uacute;mero 4 - 5, nos aventuramos a crear una secci&oacute;n de estas caracter&iacute;sticas sin embargo, el no contar con suficiente material de forma constante, nos imposibilit&oacute; mantener la secci&oacute;n. <B>Sergio Baila</B> ser&aacute; el principal responsable del futuro de la secci&oacute;n. Tambi&eacute;n contar&aacute; con la ayuda de <B>Francisco Dom&iacute;nguez</B> (el cu&aacute;l, hasta que no tenga un poco m&aacute;s de tiempo no podr&aacute; incorporarse al 100% a la din&aacute;mica de Macedonia) y de <B>Alejandro Santacreu</B>. Todos, grandes conocedores del hardware de PC y del mundo tecnol&oacute;gico en general.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Zona Hardware est&aacute; dividida en diferentes secciones, que engloban pr&aacute;cticamente la totalidad del espectro de informaci&oacute;n que se puede encontrar sobre este tema. Veamos cuales son estas secciones.</P>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>&Uacute;ltimas noticias</B>. Aqu&iacute; iremos recogiendo las &uacute;ltimas noticias producidas en este cambiante mundo desde el &uacute;ltimo n&uacute;mero de Macedonia. Imprescindible para estar al d&iacute;a.</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Microprocesadores</B>. Los dise&ntilde;os m&aacute;s avanzados, los planes de futuro inmediato de los principales fabricantes, las &uacute;ltimas tecnolog&iacute;as al detalle, las mejores compras... y mucho m&aacute;s puedes encontrar en esta secci&oacute;n.</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Redes telem&aacute;ticas</B>. Los &uacute;ltimos avances en este campo, tecnol&oacute;gicamente hablando.</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Ciencia y tecnolog&iacute;a</B>. Un peque&ntilde;o rinc&oacute;n de Zona Hardware donde os expondremos los &uacute;ltimos avances en cualquier materia cient&iacute;fica que puedan afectar directa o indirectamente al mundo de la inform&aacute;tica. Desde avances en f&iacute;sica cu&aacute;ntica, hasta nanotecnolog&iacute;a, construcciones org&aacute;nicas y computaci&oacute;n cu&aacute;ntica, sin olvidarnos de cosas m&aacute;s te&oacute;ricas, como teor&iacute;a del caos, l&oacute;gica difusa o cualquier otra cosa de inter&eacute;s.</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Arquitecturas</B>. Os exponemos los &uacute;ltimos avances en arquitectura de computadores y redes. Los nuevos buses de comunicaciones, los &uacute;ltimos chipsets, art&iacute;culos sobre el funcionamiento interno del PC, ...</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Aceleraci&oacute;n gr&aacute;fica</B>. Lo m&aacute;s nuevo que se cuece en el mundo de la generaci&oacute;n 3D v&iacute;a hardware. Las tarjetas m&aacute;s novedosas, perspectivas de futuro, la mejor compra del momento, sin olvidarnos de art&iacute;culos explicando el funcionamiento de estos sistemas, cada d&iacute;a m&aacute;s imprescindibles</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Hardware gen&eacute;rico</B>. Aqu&iacute; tiene cabida cualquier cosa que no quepa en las dem&aacute;s secciones. An&aacute;lisis de productos hardware, bricolaje del PC, explicaci&oacute;n de nuevas tendencias...</LI></P>

<P ALIGN="JUSTIFY"></P>


<B><P ALIGN="JUSTIFY"><LI>Hardware de autoconstrucci&oacute;n</B>. En esta subsecci&oacute;n podr&eacute;is encontrar art&iacute;culos para construir vosotros mismos vuestro propio hardware. ¡Manos al soldador!</LI></P></UL>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Cambios en la coordinaci&oacute;n de Macedonia</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En este n&uacute;mero de Macedonia, son dos personas las que nos dejan m&aacute;s o menos definitivamente. Por un lado <B>Antonio Montesinos</B>, el primer colaborador que tuvo esta revista, ha de dejarnos debido a la imposibilidad de atender a la publicaci&oacute;n como se merece. El hasta ahora coordinador de Macedonia Internet, da paso al nuevo responsable de la secci&oacute;n <B>Gustavo</B> <B>Herrera</B>. Gustavo, que ya lleva pr&aacute;cticamente un a&ntilde;o en la familia, posee una amplia experiencia en el mundo de la inform&aacute;tica y en Internet. </P>
<P ALIGN="JUSTIFY">Por otro lado, <B>Pedro A. Carrasco</B>, el redactor que estaba llevando el curso sobre Linux, tambi&eacute;n se ha visto obligado a dejarnos debido a el ingente trabajo que posee. Al menos, contamos con que, poco a poco, vaya continuando su fenomenal curso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otros cambios producidos en la coordinaci&oacute;n, son los que afectan a la secci&oacute;n de "Administraci&oacute;n de la lista de correo", que ha pasado a ser ocupada por otra persona m&aacute;s. Al veterano de la casa, <B>I&ntilde;aki Ecenarro</B>, se le une <B>Sergio Baila</B>, que tambi&eacute;n cuenta con una amplia experiencia como moderador y administrador de listas de correo. Esta incorporaci&oacute;n, permitir&aacute; que cualquier nueva incorporaci&oacute;n a la lista de Macedonia se haga con la mayor celeridad y efectividad posible.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Coordinaciones que cambian son las de "<B>Desarrollo de Videojuegos</B>" en la que <B>Fernando Rodr&iacute;guez</B> deja de ser el responsable para que <B>David Isla</B> tome las riendas de la misma.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Cambiamos de &quot;Programaci&oacute;n de Juegos&quot; por &quot;Desarrollo de Juegos&quot;</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La primera decisi&oacute;n de <B>David Isla</B> al tomar la coordinaci&oacute;n de "Programaci&oacute;n de Juegos", no se ha hecho esperar. Para este n&uacute;mero pasamos de "Programaci&oacute;n de Juegos" a "<B>Desarrollo</B> <B>de</B> <B>Juegos</B>". El motivo est&aacute; bien claro, en esta secci&oacute;n pretendemos ofrecer art&iacute;culos que tengan que ver con cualquier de las facetas creativas que rodean a la elaboraci&oacute;n de un videojuego. No s&oacute;lo estamos hablando de programaci&oacute;n, tambi&eacute;n hay m&uacute;sica, dise&ntilde;o, grafismo, aspectos de teor&iacute;a general, etc. Lo que no queremos es restringir el gran abanico de posibilidades que ofrecen los videojuegos a uno s&oacute;lo.</P>
<P ALIGN="JUSTIFY"></P>

</FONT><FONT FACE="Arial">
<h4>El futuro de las puntuaciones en Macedonia</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de un intenso debate en la lista interna, se ha llegado a un acuerdo de cara al futuro de las puntuaciones de los juegos en Macedonia. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, los redactores de Macedonia tendr&aacute;n la posibilidad de no puntuar a los juegos en sus comentarios ya que, como dice <B>Ra&uacute;l</B> <B>&Aacute;lvarez</B> "Entiendo que en las publicaciones comerciales, en las que intereses econ&oacute;micos pretenden influir en las compras que hacen los lectores, se usen las puntuaciones como manera de orientarles. Personalmente, el que un juego tenga tal o cual nota me importa un pepino. Yo, cuando quiero saber sobre un juego, me leo el articulo e intento extrapolar". Es m&aacute;s, para <B>Samuel R&iacute;squez</B> "Vaya con las puntuaciones... Yo me pregunto si son necesarias. No sab&eacute;is lo mal que lo estoy pasando teni&eacute;ndole que poner una nota a Zelda... No me siento con derecho a ponerle puntuaci&oacute;n a un juego as&iacute;, en serio"</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sin embargo, hay opiniones claramente diferentes, es decir, que est&aacute;n a favor de las puntuaciones. As&iacute;, <B>Alejandro Santacreu</B> opinaba que "No hay nada m&aacute;s desesperante que leer un comentario sobre un juego y no poder encontrar con un golpe de vista la puntuaci&oacute;n del juego, si se ha lanzado o est&aacute; en desarrollo, si los requisitos m&iacute;nimos "te&oacute;ricos" y los reales coinciden. Sobre la puntuaci&oacute;n creo que los indicadores num&eacute;ricos son el colmo de la subjetividad... personalmente creo que el lector (lo digo por mi, que conste) se siente m&aacute;s "orientado" al leer: Mal/Malo, Regular, Suficiente, Bien/Bueno, Muy bueno/Muy bien, Excelente..." y <B>Miguel &Aacute;ngel Fern&aacute;ndez</B> "A mi me gusta que lean lo que escribo, no que vayan a ver de un golpe de vista la puntuaci&oacute;n y los requisitos y que no se lean el resto del articulo. Adem&aacute;s, y siento discrepar ligeramente, para dar los requisitos y tal ya est&aacute;n las revistas especializadas. Para que alguien nos lea a nosotros tenemos que darle algo que no le dan las revistas y eso es precisamente nuestra opini&oacute;n, como bien has dicho antes, opini&oacute;n valiosa como jugadores que le hemos dedicado muchas horas al juego porque nos apetec&iacute;a jugarlo, no como la mayor&iacute;a de las revistas que se hacen el comentario sin sacar el CD de la caja (y me consta que esto es cierto, aunque no siempre, por suerte). Adem&aacute;s, si comentamos el juego es que ya lo han lanzado, a no ser que sea un "preview" de los que apenas tenemos ninguno." A la propuesta<B> </B>de<B> </B>Alejandro sobre la puntuaci&oacute;n, Miguel opinaba que "De ah&iacute; la necesidad de una gu&iacute;a y homogeneizaci&oacute;n de criterios. Aunque me parece buena idea la que planteas, de malo, regular, bueno. De todas formas a mi los n&uacute;meros s&iacute; me dicen bastante. Si recuerdas la &eacute;poca del colegio / instituto (bueeeeeno, y en la universidad 
tambi&eacute;n). Todo el mundo sabe que un 5 (50%) es un sufi, un 7 (70%) es un notable y un 9 (90%) es un sobresaliente. Y un 10... ¿cuantos sudores costaba sacar un 10 incluso en el colegio? :) Los tiros ir&iacute;an por ah&iacute;, de tal manera que un buen juego como "Half-Life" deber&iacute;a sacar un sobresaliente y no hay que cortarse de darle un 90% o algo m&aacute;s si queremos, pero hay que tener los "eggs" de darle un cate a un juego malo, si lo merece. Si solo usamos la banda de puntuaci&oacute;n entre el 80 y el 95 entonces si que resulta totalmente subjetivo".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En l&iacute;neas generales, se ha acordado que todo aquel redactor que quiera prescindir de dar alg&uacute;n tipo de puntuaci&oacute;n al juego, podr&aacute; hacerlo sin ning&uacute;n tipo de problema. As&iacute; mismo, todo aquel que quiera poner puntuaci&oacute;n a sus comentarios, deber&aacute; de acudir a un documento que tratar&aacute; de realizar una aproximaci&oacute;n lo m&aacute;s coherente posible, para que las puntuaciones futuras de Macedonia resulten proporcionales. Para ello, <B>Miguel Angel Fern&aacute;ndez</B> se ha encargado de redactar tal FAQ el cual, comenzar&aacute; a funcionar con los art&iacute;culos que salgan a partir del n&uacute;mero 10. Los comentarios antiguos (del n&uacute;mero 9 hacia atr&aacute;s), permanecer&aacute;n con el sistema de puntuaci&oacute;n original para dar muestra, entre otras cosas, de la evoluci&oacute;n de la revista.</P>
<P ALIGN="JUSTIFY"></P>

</FONT><FONT FACE="Arial"><h4>Desde el 9 los coordinadores a la palestra</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A petici&oacute;n de <B>Sergio Baila</B>, a partir de este mismo n&uacute;mero, todos los coordinadores de secci&oacute;n aparecer&aacute;n en la portada de cada una de las mismas. El objetivo es ofrecer al lector una comunicaci&oacute;n instant&aacute;nea con el responsable de cada una de las zonas de la revista, ya sea para ofrecer un trabajo o para consultar su incorporaci&oacute;n al equipo. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Posible actualizaci&oacute;n para el OFF LINE con el n&uacute;mero 10.</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A&uacute;n no est&aacute; confirmado, pero es muy probable, que haya una peque&ntilde;a actualizaci&oacute;n del Off Line en el 10. Dicha actualizaci&oacute;n, consistir&aacute; en el reemplazo / actualizaci&oacute;n de algunas p&aacute;ginas en HTML y, sobre todo, en la incorporaci&oacute;n de m&uacute;sica durante la visualizaci&oacute;n, creada por el nuevo miembro de la revista y conocido compositor <B>V&iacute;ctor Vergara "Awesome</B>". Estad al loro, aunque, repetimos, a&uacute;n est&aacute; en el aire tal posibilidad.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>¿Qu&eacute; tal una secci&oacute;n de relatos?</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro de los temas que hemos estado m&aacute;s o menos concretando durante la elaboraci&oacute;n de este n&uacute;mero, es el referente a la creaci&oacute;n de un subapartado, dentro de "Macedonia de Ocio", destinado a la publicaci&oacute;n de relatos. En Macedonia tenemos a unos cuantos aficionados a la escritura y hay material para rato... En principio, todo apunta a que en el n&uacute;mero 10 se ir&aacute;n editando los primeros relatos.</P>
<P ALIGN="JUSTIFY"></P>
<FONT FACE="Arial"><h4>Macedonia Nipona en Teclados Fuera</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para este n&uacute;mero de Macedonia, y dentro de <B>Teclados Fuera</B>, habilitamos una secci&oacute;n dedicada por entero a todo tipo de temas relacionados con el mundo "manga". El porqu&eacute; de incluir en Teclados Fuera estos temas, se basa en el fuerte nexo que existe entre el mundo manga (Jap&oacute;n) y el mercado de las consolas. As&iacute;, bajo el nombre de <B>Macedonia Nipona</B>, iremos incorporando nuevos art&iacute;culos para los amantes del manga. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Oferta de trabajo en Macedonia; imprescindible ser responsable.</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, no es que os vayamos a pagar nada (estamos como para hacer bromas ;) ), es simplemente lanzar un mensaje a todos aquellos que quieran incorporarse al equipo de Macedonia, para que no duden en escribirnos. Actualmente, la revista es capaz de lanzar un n&uacute;mero bastante elevado de art&iacute;culos por edici&oacute;n. Todos ellos tienen una calidad notoria o un esfuerzo importante de elaboraci&oacute;n (aunque alguna vez se nos cuele alg&uacute;n fallo). Pese a todo, hay secciones que no tienen art&iacute;culos suficientes o que se encuentran totalmente vac&iacute;as en algunas ediciones. Necesitamos gente entusiasta que se encargue de cubrir secciones como la de "Arcade Total", dentro de "Zona de Juegos", que nos echen una mano en la "Casa del Estratega", que comenten alg&uacute;n libro t&eacute;cnico en "La Biblioteca", etc. Tambi&eacute;n, agradecer&iacute;amos a todos los grupos de desarrollo, que sabemos que nos leen y mucho, que se dignen a colaborar mandando material para "Desarrollo Hispano". ¿O es que no quieren hacerse famosos? ;).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No es una s&uacute;plica en absoluto. Ahora mismo, y despu&eacute;s de mucho trabajo, podemos decir que somos un equipo estable. Sin embargo, s&iacute; que es un ofrecimiento para todos aquellos indecisos que m&aacute;s de una vez se han pensado en colaborar con nosotros.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><h4>Las cuentas claras</h4>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para este n&uacute;mero os ofrecemos un resultado "estad&iacute;stico" (muy simple) de todo lo que ha sido la publicaci&oacute;n de trabajos desde que comenz&aacute;ramos nuestra andadura con Macedonia.</P></FONT>
<center><img src="g_misc/estadis.gif"></center>
<P ALIGN="JUSTIFY">A este total, hay que unir los artículos no contabilizados como novedades dentro de Spanish Quest, lo que hace un total de 550 artículos, aproximadamente, hasta la fecha bajo el techo Macedonio. </P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<HR>
<FONT color="#000000" size=2 face="arial">
<TD  WIDTH="50%" VALIGN="TOP" align="CENTER">
<TABLE BORDER=0 WIDTH="100%" HEIGHT="*" BGCOLOR="#0000ff" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT COLOR="#0000ff" size=4 face="arial"><B><a href="ninter.htm">C</B></font><FONT color="#000000" size=4 face="arial"><B>onsultar noticias de otros números</a></B></FONT>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>

<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">NOTICIAS INTERNAS</FONT></B></FONT></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B></FONT></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</body>
</HTML>

