<HTML>



<BASE TARGET="TEXTO">

<body bgcolor ="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>J</B></font><FONT color="#000000" size=2 face="arial"><B>uegos</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<P align="right"><IMG SRC="g_misc/69.gif"  ALIGN=RIGHT>
<DIV ALIGN=right>
<p align="right"><B><FONT FACE="arial"><FONT SIZE=-1><FONT COLOR="#CC0000">A</FONT><FONT COLOR="#000000">rt&iacute;culo
realizado por</FONT></FONT></FONT></B>
<BR><B><FONT FACE="arial"><FONT COLOR="#000000"><FONT SIZE=-1><A HREF="mailto:srd@retemail.es">Samuel Rísquez</A></FONT></FONT></FONT></B></DIV>
<BR>
<BR>
<BR>
<FONT FACE="arial"><FONT COLOR="#000000"><H3>[(Nintendo VS Sega) VS Sony]</H3></FONT></FONT>
<p align="justify">
<FONT FACE="arial"><FONT SIZE=-1>Supongo que la mejor manera de romper
el hielo para iniciar un articulo como &eacute;ste es diciendo aquello
que el autor tiene de cada una de las compa&ntilde;&iacute;as y sus experiencias
con cada una.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Veamos. Mi primera consola fue una
NES (Nintendo Entertainment System). Es uno de los grandes tesoros que
guardo y no se que har&iacute;a si la perdiese. Yo nunca alcanc&eacute;
al Spectrum, as&iacute; que podr&iacute;amos decir que lo que para otros
fue esa m&aacute;quina (creo que el resto del equipo de esta misma revista
al completo se encuentra entre ellos), para m&iacute; lo fue esta, mi ya
lejana en el tiempo NES.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Supongo que no hace falta que diga
nada m&aacute;s sobre mis vivencias y lo que siento por esta consola porque
ya le dediqu&eacute; todo un art&iacute;culo. El caso es que, a&uacute;n
hoy, esta consola me divierte cantidad. No estar&iacute;a muy equivocado
si dijese que me entretiene m&aacute;s una partida al Super Mario Bros
de esta consola que una al Super Mario 64.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Despu&eacute;s vino la Master System,
por influencia de mi primo. Y muy poco despu&eacute;s adquir&iacute; la
Mega Drive.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>&Eacute;sta consola fue mi segundo
tesoro. Sonic The Hedgehog es de los juegos que m&aacute;s valoro en mi
colecci&oacute;n. Tambi&eacute;n a&uacute;n hoy tengo mis momentos y conecto
la Mega Drive para revivir momentos pasados.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>El caso es: &iquest;puede decir alguien
que tiene una PlayStation lo mismo sobre un juego para &eacute;sta consola?
No estoy diciendo en absoluto que sus juegos sean malos, pero, en mi opini&oacute;n,
no es posible. No digo que todos, pero s&iacute; es cierto que cuando oyes
hablar a alguien de una vivencia con un juego de &eacute;sta consola, muchas
personas acaban por remitirse, casi desde el principio de su exposici&oacute;n,
al genial v&iacute;deo que le ha salido al final del nivel, o a lo bien
hecho que estaba aquel personaje, o a lo que “mola” el efecto de la sangre.
No es ni mucho menos negativo, pero, &iquest;volver&aacute; a jugar &eacute;sta
persona con &eacute;sta consola dentro de cinco, diez, veinte a&ntilde;os,
o preferir&aacute; comprarse lo &uacute;ltimo para ver tambi&eacute;n una
gran calidad gr&aacute;fica? Creo que &eacute;sta pregunta se responde
ella misma. Y &eacute;sto, &iquest;es malo o bueno?</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Despu&eacute;s tenemos a Nintendo 64.
&iquest;Ha conseguido Nintendo mantener su forma de hacer videojuegos inolvidables,
o incluso &eacute;ste gigante ha deca&iacute;do? Miremos Super Mario 64,
que de momento es la referencia m&aacute;s cercana que podemos tener de
las aventuras de &eacute;ste personaje. &iquest;Mantiene el esp&iacute;ritu
de Super Mario Bros? Desde luego, el juego no es el mismo. Ha pasado de
ser un avanzafases interminable a un conjunto de misiones por nivel. Pero
a pesar de ello, tenemos a los t&iacute;picos personajes de la saga: Bowser,
las tortugas, las setas, los ca&ntilde;ones (en much&iacute;sima menos
proporci&oacute;n, por cierto), las plantas carn&iacute;voras, ... Pero
ya no es lo mismo. No es m&aacute;s que un lavado de cara. No es m&aacute;s
que matar a una seta, como antes, pero en 3D; no es m&aacute;s que ir corriendo
tras una vida, pero en 3D; no es m&aacute;s que salir volando por un remolino
de viento (bueno, esto no lleg&oacute; hasta SMB3), pero en 3D; no es m&aacute;s
que ser comido por un enorme pez, pero tambi&eacute;n en 3D (esto tampoco
lleg&oacute; hasta SMB3). En resumen: no da nada nuevo a la saga, m&aacute;s
que escenarios perfectamente dise&ntilde;ados y personajes anteriores m&aacute;s
detallados en forma poligonal. Pierde mucho. No a&ntilde;ade nuevos personajes
(bueno, salvo los jefes que hay en algunos niveles y alguno que otro como
las ara&ntilde;as que saltan sobre el agua), e incorpora tan s&oacute;lo
algunas nuevas experiencias (subirse a la tortuga, ser lanzado por el ca&ntilde;&oacute;n,
...). Se trata simplemente de rememorar viejos tiempos pero con mayor tecnolog&iacute;a.
Como una reedici&oacute;n de lujo de los anteriores juegos. Pero cuando
yo quiera rememorar experiencias con Mario, recurrir&eacute; a la NES y
como mucho a la Super Nintendo. Super Mario 64 lo dejar&eacute; para despu&eacute;s,
para jugarlo si me queda tiempo.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Una gran labor de t&eacute;cnica, pero,
majestad Miyamoto, con &eacute;ste juego no te has roto mucho los cuernos
m&aacute;s all&aacute; de los gr&aacute;ficos y la genial adecuaci&oacute;n
de la m&uacute;sica a los niveles, en especial a algunas zonas de &eacute;stos.
Pero te perdonamos, fue un desliz para probar la nueva m&aacute;quina.
Porque hemos comprobado que en Zelda 64 has hecho todo lo que ten&iacute;as
que haber hecho con Super Mario 64: escenas entra&ntilde;ables que dan
ganas de empezar el juego de nuevo, y adem&aacute;s, alta tecnolog&iacute;a.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>&iquest;Acaso cree alguien lo contrario?
Os gustar&aacute; Zelda 64 m&aacute;s o menos que a m&iacute;, pero ten&eacute;is
que reconocer, al menos, que en &eacute;sta ocasi&oacute;n no se ha limitado
s&oacute;lo a la t&eacute;cnica.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Pasemos ahora a Sega. Sus primeros
Sonic ofrec&iacute;an continuamente nuevos enemigos, nuevas formas de acabar
un escenario y una de las cosas que m&aacute;s ayudan a mantener una saga:
nuevos personajes principales con diferentes habilidades. &iquest;Han conseguido
lo mismo con Saturn y DreamCast?</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>En Saturn, desde luego, no. No hay
m&aacute;s que mirar a Sonic 3D (que para MegaDrive est&aacute; bien, pero
para Saturn...). O a Sonic R. Un juego de carreras de concepto bastante
sencillo, pero muy bueno gr&aacute;ficamente. No han hecho un Sonic para
&eacute;sta consola que pueda tener el honor de suceder a los anteriores.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>&iquest;Y en DreamCast? No lo he probado,
pero parece ser que ha a&ntilde;adido cosas nuevas. &iquest;Igual que el
caso Super Mario Bros VS Super Mario 64? Cuando llegue a Espa&ntilde;a
podr&eacute; decirlo.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Esto es m&aacute;s o menos una primera
exposici&oacute;n. Hemos comprobado que las tres compa&ntilde;&iacute;as
han pasado por la misma experiencia de sobresaltarse por una gran tecnolog&iacute;a
y olvidarse de lo dem&aacute;s.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Nintendo y Sega no han perdido demasiado
con esto. Todos sabemos que ambas, en sus inicios, se inclinaban por juegos
divertidos olvidando la tecnolog&iacute;a, pero con el tiempo empezaron
a interesarse m&aacute;s por lo segundo. As&iacute; que podemos perdonarlas
porque podemos asimilar que ha sido un resbal&oacute;n y que pueden recuperarse
(Nintendo ya lo ha hecho, aunque veremos qu&eacute; pasa con Dolphin).
Pero, &iquest;y Sony?</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Sony es una compa&ntilde;&iacute;a
relativamente nueva, y para ganarse el puesto que ahora tiene, ha tenido
que renunciar ya desde el principio a una gran tecnolog&iacute;a y a miles
de aparatejos para controlar los juegos. As&iacute; ha atra&iacute;do a
muchos creadores de juegos para ordenador (la mayor&iacute;a de buenos
juegos de &eacute;sta consola est&aacute;n o estar&aacute;n en breve para
PC) y a los millones de personas que han comprado la consolita. Pero, &iquest;qu&eacute;
pasar&iacute;a si, ahora mismo, desapareciesen, a la vez, Nintendo, Sega
y Sony?</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Nintendo ser&iacute;a recordada como
la que introdujo los videojuegos en el mundo y la que hizo muchos de los
juegos m&aacute;s entra&ntilde;ables que existen.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Sega ser&iacute;a recordada como la
primera gran disc&iacute;pula de la anterior, que para su desgracia empez&oacute;
a interesarse demasiado por la tecnolog&iacute;a, llev&aacute;ndola adem&aacute;s
a usar sistemas operativos complicados para manejarlo, por lo que ahora
ha de esforzarse mucho para reponerse.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Y Sony ser&iacute;a recordada como
una simple fabricante de consolas (pues, a diferencia Sega y Sony, no crea
directamente software), y que para triunfar tuvo que recurrir a alta tecnolog&iacute;a
para atraer a grupos de programaci&oacute;n, y que llevaba el mismo camino
para su segunda m&aacute;quina. &iquest;O no?</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Aunque parezca una tonter&iacute;a,
estas diferencias son muy importantes a la hora de subsistir. Sin Third
Parties (compa&ntilde;&iacute;as independientes que crean juegos para las
m&aacute;quinas de otras compa&ntilde;&iacute;as), Nintendo y Sega sobrevivir&iacute;an
(aunque tuviesen pocos juegos), pero el gran cat&aacute;logo se Sony ha
salido TOTALMENTE de &eacute;ste tipo de compa&ntilde;&iacute;as.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Sega ha demostrado que, aunque le ha
sido dif&iacute;cil (y ha acabado por decaer), ha podido mantener una consola
programando casi casi ella sola sus juegos. Recordemos que es de las mayores
compa&ntilde;&iacute;as de juegos para m&aacute;quinas arcades del mundo.
Pero no ha perdido el apoyo de los seguidores m&aacute;s fan&aacute;ticos
e incluso ha conseguido atraer a otros, apunt&aacute;ndose ya a unos compradores
seguros para DreamCast.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Y Nintendo tambi&eacute;n ha demostrado
que ellos son es m&aacute;s que suficientes para implementar juegos exitosos
para sus consolas (Mario, Zelda, los Pocket Monster, y todos sus derivados,
son un ejemplo).</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Luego ya est&aacute; la imagen que
dan al p&uacute;blico.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Nintendo puede dar una imagen infantil,
pero siempre se ha caramelado a gente de todas las edades.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Sega da una imagen de buscar siempre
un nuevo hardware para sus fines, pero &uacute;ltimamente lleva aires de
recuperaci&oacute;n y parece ser que todo puede arreglarse.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Y Sony... Sony da una imagen de necesidad,
de necesidad de otras empresas (aunque los que la siguen no se suelen dar
cuenta) para tener &eacute;xito. Publicitariamente, da una imagen muy agresiva
que ha conseguido que a algunas personas les de verg&uuml;enza reconocer
que disfrutan con Mario y otros.</FONT></FONT>
<p align="justify"><FONT FACE="arial"><FONT SIZE=-1>Una vez expuesta mi opini&oacute;n,
es hora de que cada uno piense lo que quiera y que juegue a lo que quiera,
pero no est&aacute; de m&aacute;s que cada uno tenga la opini&oacute;n
que desee, no la que le impongan.</FONT></FONT>
<BR>&nbsp;
<BR>
<DIV ALIGN=right>
<P align="right"><FONT FACE="arial"><B><FONT COLOR="#0080C0"><FONT SIZE=-1>&Uacute;</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>LTIMA
REVISI&Oacute;N EN</FONT></FONT></FONT> <FONT FACE="arial"><B><FONT COLOR="#CC0000"><FONT SIZE=-1>JULIO</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>
DE </FONT></FONT><B><FONT COLOR="#CC0000"><FONT SIZE=-1>1999</FONT></FONT></B></FONT>
<BR>
<HR></DIV>




<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>

