<HTML>
<HEAD>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
No lo entiendo
</FONT>
</H3>


<font size=2 face=arial>


<P ALIGN="JUSTIFY">No entiendo c&oacute;mo puede haber gente que siga considerando que esto de los ordenadores sea algo &quot;malo&quot;, un simple &quot;boom&quot; que en un tiempo desaparecer&aacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ya s&eacute; que lo que voy a nombrar en el siguiente p&aacute;rrafo ahora est&aacute; muy tocado pero es s&oacute;lo para encaminar a otro punto, no voy a martirizaros con el que ya hay bastantes art&iacute;culos s&oacute;lo para esto. Analicemos lo que hizo Telef&oacute;nica antes de la llegada a Inet de Retevisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Veamos, ¿qu&eacute; necesidad tuvo, con los billones de pesetas que generan anualmente, de subir los precios de Internet? Vale, lo hizo para aprovechar su monopolio, pero ve&aacute;moslo de otra forma: ¿no deber&iacute;a haberse centrado, una vez vio el peligro, en intentar demostrar que era la mejor? Eso suponiendo que lo fuese. Pero si lo era, ahora no lo es. Lo &uacute;nico que consigui&oacute; con &eacute;sa pol&iacute;tica fue perder clientes (como yo) y crear odio. Bueno, 38 millones de espa&ntilde;oles han ca&iacute;do en su telara&ntilde;a gracias a sus &quot;simpatiqu&iacute;simos&quot; anuncios que dan ganas de apagar el televisor. Pero los 2 millones que conectamos a Inet, sabemos de qu&eacute; van, y dos millones son muchos millones. Demostrado: si lo hicieron, no fue como &uacute;ltimo recurso pues han salido perdiendo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces, ¿qu&eacute; fue? Por supuesto, el considerar que Inet se pasar&iacute;a y que ellos ya habr&iacute;an cobrado. Pues mala suerte: la red de redes va a continuar. O... ¿tal vez fue para que la gente se alejase de los ordenadores? Claro: hacen creer que por cualquier cosita hay que pagar y as&iacute; alejan a la gente. Vale, s&iacute; es cierto que por cualquier cosita hay que pagar, pero eso es porque las compa&ntilde;&iacute;as tienen la pol&iacute;tica que tienen. Continuemos: no es il&oacute;gico que quieran alejar a la gente: al fin y al cabo, recordemos que ha pertenecido y en la pr&aacute;ctica (¿en serio creen que ha colado?) pertenece al Gobierno, y el Gobierno, seamos sinceros, odia a la comunidad infoadicta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aparquemos casos concretos pues hablando de uno hemos llegado al m&aacute;s preocupante: ¿Por qu&eacute; a los gobiernos no les gusta que la gente use ordenadores personales y/o videojuegos? ¿Ser&aacute; por el mismo motivo que en la Edad Media los monjes quer&iacute;an que nadie salvo ellos pudiesen pensar por s&iacute; mismos? Es probable, viendo lo que hacen los pol&iacute;ticos, hay que preguntarse qu&eacute; es lo que hacen si no hacen nada por el beneficio humano (o casi nada, porque alg&uacute;n tanto se marcan de tanto en tanto).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para empezar, nos culpan de los desastres del mundo:</P>
<P ALIGN="JUSTIFY"></P>
<OL>

<P ALIGN="JUSTIFY"><LI>Ha habido una matanza creada por estudiantes: la culpa es del Quake.</LI></P>
<P ALIGN="JUSTIFY"><LI>Unos tipos van por la calle tirando dados y matando a gente: deber&iacute;amos prohibir los juegos de rol (sean inform&aacute;ticos o no, as&iacute; matan dos p&aacute;jaros de un tiro, pero a&uacute;n as&iacute; seguro que no ven la diferencia, simplemente es &quot;malo&quot;).</LI></P>
<P ALIGN="JUSTIFY"><LI>A un ni&ntilde;o le coge un ataque por jugar a un determinado videojuego: la culpa es de que se mare&oacute; de tanta virtualidad que los asesinos llamados programadores han creado.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora seamos razonables y veamos lo que verdaderamente pasa:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Caso 1: si unos ni&ntilde;os han sido mal criados (algunos de ellos han usado armas desde peque&ntilde;os guiados por sus propios padres), ya pueden jugar al Quake que al Buscaminas que al mus: est&aacute;n locos y malcriados. Y PUNTO. Los millones de personas que hemos jugado a ese tipo de juegos, ¿vamos con una pistola en el bolsillo buscando cualquier ser que matar? No s&eacute;, a veces me ha cogido la tentaci&oacute;n de &quot;¿qu&eacute; pasar&iacute;a si...?&quot;, pero me considero una persona m&aacute;s o menos normal y espero a hacerlo con una espada gigante en el videojuego del momento. Al fin y al cabo, ¿no est&aacute;n los juegos para realizar aquello que en la realidad no se puede? Si alguien puede, siempre que quiera, montar sobre un coche e ir a toda velocidad, no le interesar&aacute; hacerlo jugando: a una persona normal como yo s&iacute;, y lo hago, pero no cojo el coche y me voy a toda m&aacute;quina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Caso 2: estos son otros ni&ntilde;os que han sido malcriados; jugadores de rol hay muchos (entre los que yo me encuentro, tanto de videojuego como de tablero), y tampoco van (vamos) por ah&iacute; tirando dados a ver a qui&eacute;n matamos hoy. Eso ya no lo hacemos ni con el ordenador (y tampoco lo echamos de menos).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Caso 3: evidentemente, eso ha sido culpa de los padres. En las instrucciones de los juegos siempre se dice: &quot;ADVERTENCIA: &eacute;ste videojuego genera paisajes virtuales tan reales que puede afectar a los enfermos del coraz&oacute;n y/o epil&eacute;pticos&quot;. ¿O no? Pues es responsabilidad de los padres asegurarse de que cualquier cosa que hagan sus hijos cuando a&uacute;n no tienen uso de raz&oacute;n no sea perjudicial para ellos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces, hemos visto que en estos tres casos (y he omitido algunos otros) la responsabilidad ha sido TOTALMENTE de los padres. Entonces, ¿por qu&eacute; no prohibimos a los padres? Suena muy exagerado, pero si se prohiben los videojuegos porque (siempre supuestamente) son perjudiciales, ¿por qu&eacute; no se prohiben a los padres irresponsables? Donde las dan las toman. Si un padre no ha sabido criar a su hijo y no ha sabido alejarle de lo que le es perjudicial, no hay que echar la culpa a los objetos que ha utilizado para tal fin.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Acaso si se le ense&ntilde;a una revista &quot;X&quot; (perd&oacute;n si acabo de convertir &eacute;ste art&iacute;culo en algo que se ha de prohibir por escribir tan perversa letra) a alguien y luego a ese alguien le gusta y va y se compra una, hay que prohibir las revistas porque a las asociaciones de padres de turno les parece algo malo? La responsabilidad de ello ha sido del que ense&ntilde;&oacute; la revista a quien no deb&iacute;a o no estaba preparado, no de esa revista por existir, que como bien debe indicar su portada es para un determinado grupo de gente (en este caso, mayores de edad).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Creo que he dado una opini&oacute;n bastante correcta (ahora ya no pueden decir que somos unos incultos y no merecemos ser escuchados) del asunto, y tal vez no todo el mundo estar&aacute; de acuerdo con todo lo que he escrito, pero espero que si son razonables sepan entender mi intenci&oacute;n.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
