<HTML>

<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
La informática no es lo que dicen
</FONT>
</H3>




</FONT>
</H3>
<P align="justify">
<FONT color="#000000" size =2 face="arial" >        
<P ALIGN=JUSTIFY>
Desde siempre he escuchado que la inform&aacute;tica puede crear malos
h&aacute;bitos en los ni&ntilde;os debido a la adicci&oacute;n a los videojuegos;
que puede perjudicar el aprendizaje porque no deja que se piense, tan s&oacute;lo
que se reciba informaci&oacute;n; y que permite la posibilidad de que las
volubles mentes de los menores asuman como suyos comportamientos de los
videojuegos machaca-todo-lo-que-veas, aplicando luego esas pautas de violencia
en su vida real.
<BR>&nbsp;
<BR>&Uacute;ltimamente a los medios de comunicaci&oacute;n y a los expertos
presentadores de programas de todo tipo les da por usar la palabra Internet:
&iexcl;Uoooo! &iexcl;Qu&eacute; bien suena eso!; y luego se ponen a soltar
dos chorradas y media de que si tal internauta en Italia ha tenido que
recibir atenci&oacute;n psiqui&aacute;trica porque necesitaba estar "enchufado"
durante diecis&eacute;is horas al d&iacute;a a Internet.

<P align="justify">Hace poco, en las noticias de televisi&oacute;n se anunciaba a los cuatro
vientos que un ni&ntilde;o de once a&ntilde;os era capaz de hacer un programa
que:
<UL><P align="justify">"... maneja la gesti&oacute;n de la friolera de quinientos empleados
de una empresa, y ya est&aacute; recibiendo ofertas de desarrollo de programas
por parte de otras empresas del sector".</UL><P align="justify">
El caso es que lo dec&iacute;an convencidos, d&aacute;ndole una relevancia
de car&aacute;cter ultra-trascendente.
<BR>&iquest;El resultado? Pues que 38 millones de espa&ntilde;olitos, de
los cuarenta que somos, consider&oacute; al nene como a un superdotado,
y es que hacer un programa para manejar los datos de quinientas personas
era todo logro.
<BR>Ante esto, todos los informaticos espa&ntilde;oles no tuvimos m&aacute;s
remedio que soltar una carcajada sarc&aacute;stica (mi caso), cabrearse
(un amigo), frustrarse (varios conocidos), y dem&aacute;s reacciones humanas
ante semejante estupidez.
<BR>&iquest;No habr&iacute;a sido lo justo el decir que el ni&ntilde;o
hizo ese programa con un lenguaje que puede ser utilizado por inexpertos
como es el Visual Basic? (con todos mis respetos para los programadores
de Visual Basic, ya que me refiero a su facilidad de uso para alguien que
no sabe nada de inform&aacute;tica).
<BR>&iquest;No tendr&iacute;an que haber dicho que ese lenguaje incluye
ejemplos para el manejo de bases de datos, o sea, para guardar informaci&oacute;n
de forma que se pueda consultar y actualizar con tan solo un "click" del
rat&oacute;n?
<BR>&iquest;Por qu&eacute; no dijeron que a los programas de este tipo
les importa un pimiento el n&uacute;mero de datos que maneje, suponiendo
lo mismo 1 dato que 200.000 en cuanto a la complejidad de crear el programa?
<BR>&iquest;No se les ocurri&oacute; mostrar en las im&aacute;genes que
salieron en la televisi&oacute;n, con otras pantallas del programa? Lo
digo porque dos botones y 7 cajas de textos que aparecieron se hacen en:
36 segundos, el conectar todo eso con la base de datos: 1 minuto, crear
la base de datos: 5 minutos, y si se quiere perder algo de tiempo, en poner
un color bonito: 5 segundos.
<BR>&iexcl;Pues bien! &iexcl;Eso era lo que sal&iacute;a en ese "incre&iacute;ble
programa que dejaba asombrados a todos lo expertos de inform&aacute;tica!
<BR>Me r&iacute;o yo de esos expertos. &iexcl;Y el ni&ntilde;o se atrev&iacute;a
a hablar de la complejidad de manejar tantos datos!&iexcl;Y todo el mundo,
incluido mi padre, menos cuatro gatos se lo cre&iacute;a! &iquest;Y qu&eacute;
empresas est&uacute;pidas eran esas que se interesaron por el programa?

<P align="justify">Pues pongo el ejemplo de este montaje que liaron para decir que, como
inform&aacute;tico estoy harto de que se anuncien tantas estupideces cuando
la informaci&oacute;n va dirigida al p&uacute;blico en general, estoy harto
de que muestren la inform&aacute;tica como algo tan "simple" que lo puede
hacer un ni&ntilde;o, o como algo tan terrible que puede provocar el apocalipsis.
<BR>&iquest;Quien no ha visto el t&iacute;pico anuncio del "Curso de X
de Inform&aacute;tica", y sale el ignorante de turno diciendo que haces
sus propios programas... y juegos. &iquest;Qu&eacute; hace, el: Adivina
cuanto es dos mas dos?
<BR>Tambien sale el/la listo/a que dice que le dieron el trabajo porque
sab&iacute;a programar. Y es que claro, con unos fasc&iacute;culos y en
los ratos libres, uno es experto programador en TODOS los lenguajes, en
TODAS las plataformas, y las empresas son imb&eacute;ciles y contratan
a esta gente cuando hay barrenderos, basureros y limpiadores, licenciados
en inform&aacute;tica, ingenieros t&eacute;cnicos o por el estilo. O en
el mejor de los casos, en la REALIDAD ves a ingenieros y t&eacute;cnicos
titulados trabajando en una empresa como becarios de 40.000 pesetas al
mes, o tambi&eacute;n haciendo pr&aacute;cticas sin ver ni un duro, o incluso
haciendo labores de secretar&iacute;a.
<BR>O sea, que una carrera de 5 a&ntilde;os, que en realidad para "rebajarla"
al mismo nivel de dificultad (no por sus contenidos, sino por la calidad
del profesorado), que el resto de carreras, habr&iacute;a que darla en
8 a&ntilde;os; cuando si acabas en 6 a&ntilde;os eres un monstruo; cuando
has superado 90 asignaturas de todos los &aacute;mbitos y colores de la
inform&aacute;tica, unido a soportar profesores, man&iacute;as y mala leche...
despues de todo esto, es lo mismo que si haces un cursito por fasc&iacute;culos.

<P align="justify">Pero lo peor de todo es que la gente se lo cree, que luego los que quieren
que se les haga un programa, "porque un ni&ntilde;o lo hace", un profesional
lo tiene que hacer por una miseria, cuando, y esto es algo a lo que nos
enfrentamos los inform&aacute;ticos tarde o temprano, lo que te dice el
cliente es: "Quiero un programa que me maneje la contabilidad" Y se quedan
tan panchos porque eso es muy f&aacute;cil de hacer, eso es lo que ellos
ven, y porque seg&uacute;n tienen entendido, lo de programar se hace en
un rato... y encima te echan en cara que tardas mucho en acabarlo.

<P align="justify">Yo empec&eacute; como programador independiente, o sea, que llegaba
el cliente y dec&iacute;a: "Quiero un programa que... " y de ah&iacute;
para adelante. Entonces, comienza una lucha cuerpo a cuerpo para que el
cliente sepa lo que quiere en realidad, yo me entere de lo que pretende
que se haga, y al final llegue todo a buen fin.
<BR>Pero siempre me encontr&eacute; con el mismo problema:
<UL><P align="justify">para el com&uacute;n de los mortales, la idea general que se tiene
de los inform&aacute;ticos es que tienen que saber absolutamente TODO sobre
TODOS los temas del mundo del ordenador (cosa que ser&iacute;a ideal &iquest;no?),
pero dominarlo TODO como si se fuera el creador de esta ciencia (&iquest;est&aacute;n
locos?). O sea, es como si a un neurocirujano, especialista en el cerebro,
le piden que te opere del coraz&oacute;n, o si a un pediatra, especialista
en ni&ntilde;os, le piden que te opere del o&iacute;do interno. Son todos
m&eacute;dicos al fin y al cabo &iquest;no?</UL><P align="justify">
As&iacute; que en inform&aacute;tica, ni especialidades ni nada. &iquest;Que
eres titulado en la especialidad de Gesti&oacute;n Inform&aacute;tica?
&iquest;Y qu&eacute;? &iexcl;A montar ordenadores, que para eso eres inform&aacute;tico!
&iquest;Que eres de Sistemas Inform&aacute;ticos! &iexcl;A programar un
programa de Gesti&oacute;n Inform&aacute;tica!
<BR>Y as&iacute; vamos. La gente tiene una imagen falsa de lo que en realidad
es la inform&aacute;tica y la culpa es fundamentalmente de los medios de
comunicaci&oacute;n visuales, que primero deber&iacute;an informarse ellos
antes de dar "su versi&oacute;n vendible de las noticias".
<BR>Pero esto no para tan solo con la inform&aacute;tica. Si un desgraciado
se inventa una partida de Rol y le da por interpretarla y mata a un inocente,
&iexcl;El Rol es SATANICO!&iexcl;El Rol degenera las mentes!&iexcl;No jugu&eacute;is
al Rol, acord&aacute;os del Crimen del Rol!
<BR>Pues a todas esas cadenas de televisi&oacute;n y lo que es peor, a
todos los peri&oacute;dicos les dio por culpar al rol, apareciendo cr&iacute;ticas
de su nocividad, de sus influencias... levantando el rechazo por parte
de la sociedad espa&ntilde;ola, creando m&aacute;s ignorancia a&uacute;n...
y a muy pocos se les ocurri&oacute; en ese momento el informarse de lo
que es en realidad el Rol, de sus muchas aplicaciones adem&aacute;s de
"perder una noche entera encerrado en un cuarto".
<BR>&iquest;Quien sab&iacute;a que el rol se usa como terapia para que
los ni&ntilde;os y ni&ntilde;as autistas con problemas graves de comunicaci&oacute;n,
que puede servirles de ayuda para superar su aislamiento personal mediante
la interpretaci&oacute;n de otra personalidad que les haga ver las cosas
desde otro punto de vista? &iquest;Alguien sabe lo que significa en realidad
esta palabra: ROL? &iquest;No quiere decir esa palabra en realidad: interpretar?
<BR>Pues seguro que la mayor&iacute;a de los espa&ntilde;oles no lo saben,
pero lo que s&iacute; que saben es que un inform&aacute;tico debe hacer
de todo, y si n&oacute;:
<UL><P align="justify">&iexcl;Vaya profesional que te crees! &iquest;No has visto en la televisi&oacute;n
lo que hacen los ni&ntilde;os?
<BR>Por cierto, &iquest;no tendr&aacute;s juegos de esos de asesinos, esos
que dicen que tambien hay en los ordenadores... esos de ROL?
<BR>Y espero que no se te ocurra tener ninguna imagen de esas japonesas...
las que se sabe que son todo pornograf&iacute;a infantil, violencia y explosiones...
s&iacute;, esas del Gokuh ese.</UL><P align="justify">
Otro caso de manipulaci&oacute;n es este &uacute;ltimo caso; el de las
series japonesas, tanto el anime (series de TV), como el manga (c&oacute;mics).
<BR>Un buen d&iacute;a comenz&oacute; un acoso sobre ellas, porque como
Dragon Ball era violento, TODO el manga ten&iacute;a que prohibirse; como
U-JIN triunfaba con sus dibujos de ni&ntilde;as es pelotas, TODO el manga
era pornogr&aacute;fico, y los ni&ntilde;os no deben verlo, que es nocivo
para su educaci&oacute;n.
<BR>Consiguieron generar de nuevo la intolerancia. Surgieron enseguida
las asociaciones de padres, la Asociaci&oacute;n de Defensa del Menor y
toda esa morralla moralista. Y su portavoz sali&oacute; diciendo que el
manga japon&eacute;s era perverso, pornogr&aacute;fico y violento... porque
como hab&iacute;an analizado detalladamente Dragon Ball y los c&oacute;mics
de U-JIN y mucha documentaci&oacute;n m&aacute;s... (seguro que s&iacute;).

<P align="justify">Esta persona representante de esas sociedades puritanas y fascistas
que quieren imponer su opini&oacute;n y si n&oacute;, amenazan y asustan
al resto de los padres con que sus hijos saldr&aacute;n naranjas y con
el pelo verde, para m&iacute; se merece un calificativo no pronunciable
aqu&iacute;.
<BR>As&iacute; que, la cosa funciona as&iacute;: hay 200 series japonesas
en circulaci&oacute;n;
<UL><P align="justify">miran 1 y ya todas son pornogr&aacute;ficas; miran otra y ya todas
son violentas.</UL><P align="justify">
&iexcl;Pues reinventaron la estad&iacute;stica!
<BR>Y de nuevo para los espa&ntilde;olitos de a pie, la "moda" de prohibir
que sus hijos consumiesen material japon&eacute;s hizo furor: cancelaron
series de dibujos animados, editoriales de "prestigio" cancelaron la salida
de los n&uacute;meros m&aacute;s perjudiciales para nuestros hijos, acusaron
de blasfemos a los que defend&iacute;an su propio punto de vista, provocaron
la alarma social sobre un tema que no merec&iacute;a la pena...

<P align="justify">Pues por desgracia, esto sucede con todo. Ya no es posible creerse ninguna
noticia que aparezca en la televisi&oacute;n si no se es experto sobre
lo que se est&aacute; hablando, porque no podemos saber si ser&aacute;
verdad, un montaje o simple propaganda de los intereses de turno. Y se
aprovechan de que la sociedad no est&aacute; acostumbrada a razonar la
informaci&oacute;n que nos acosa por todos lados, con doscientas versiones
e interpretaciones partidistas diferentes, pues aceptamos y tomamos esas
conclusiones que nos dan, en lugar de la informaci&oacute;n en s&iacute;,
como nuestras.

<P align="justify">Tambien se cree que una persona que est&aacute; todo el d&iacute;a delante
del ordenador pierde parte de su vida, que no se relaciona, y que es una
l&aacute;stima... cuando lo m&aacute;s seguro es que est&eacute; liberando
su tensi&oacute;n "matando marcianos", o desarrollando su creatividad escribiendo
historias, o dibujando, o creando m&uacute;sica, o escribiendo mensajes
electr&oacute;nicos a colegas de cualquier parte del mundo, o leyendo una
historia de fantas&iacute;a que alg&uacute;n otro en cualquier parte del
mundo haya escrito y dejado para compartirla, y todo esto mientras escucha
m&uacute;sica a trav&eacute;s de su ordenador, mientras disfruta viendo
im&aacute;genes de dragones y de orcos, de draconianos y kenders, de hobbits
y elfos, tratando de escapar de ese maldito mundo exterior que la humanidad
no quiere cambiar.
<BR>&iquest;Y esto es lo que dicen en las noticias que es: "&iexcl;El aislamiento
de la persona!"?
<BR>... pues muy bien... yo me aislo.
<BR>Yo me hundo en Internet, foco de perversi&oacute;n de menores, de propagandas
terroristas... y me comunico con las decenas de conocidos "virtuales" que
tengo repartidos por todo el mundo. Leo peri&oacute;dicos de otros pa&iacute;ses,
escucho la m&uacute;sica de esas series japonesas que seg&uacute;n muchos
son negativas; me deleito con esas impresionantemente hermosas baladas
del pornogr&aacute;fico "Kimagure Orange Road" y me pierdo en la fantas&iacute;a
de Rol de asesinos de "Record of the Loddoss War"; vivo la sencillez de
ese violento "Mi vecino Totoro", o siento las paisones de esa perversi&oacute;n
llamada "Video Girl Ai"... y todo esto a trav&eacute;s del ordenador y
del sat&aacute;nico Internet.
<BR>Y soy inform&aacute;tico, especialista en Sistemas y Analista Programador.
Y cuando llego a mi casa tras 10 horas trabajando delante de ordenadores,
desperdicio mi tiempo libre con otra sesi&oacute;n con el mio propio, creyendo
mis padres que su hijo puede convertirse en esas cosas que dicen en la
televisi&oacute;n porque tiene cerca de &eacute;l una influencia nefasta
de todas las cosas malas que tiene en su ordenador (rol, manga, juegos...)
<BR>&iquest;Y por qu&eacute; piensan as&iacute;?

<P align="justify">Supongo que os imaginar&eacute;is la respuesta desde mi punto de vista
&iquest;no?

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
