<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.6 [en-gb] (Win98; I) [Netscape]">
   <title>SQ Noticias</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#000080" vlink="#000080" alink="#000080">

<center><font face="arial"><font color="#000080"><font size=+2>Noticias
Aventureras</font></font></font></center>

<hr>
<p><b><font face="Arial,Helvetica">Alfa del parser sucesor de Sintac </font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Javier San Jos&eacute; sigue
trabajando duro en su <b>Visual Sintac</b> y en el momento de escribir
estas l&iacute;neas ya est&aacute; disponible la alfa-4. Si quieres hacerte
una idea de c&oacute;mo ser&aacute; Visual Sintac y tambi&eacute;n realizar
sugerencias al autor, puedes baj&aacute;rtela en: <a href="http://personales.jet.es/jsjlogin/sintac">http://personales.jet.es/jsjlogin/sintac</a>.Hasta
sacar la primera beta Javier tiene en su agenda los siguientes puntos:</font></font>
<ol>
<li>
<font face="Arial,Helvetica"><font size=-1>Incorporar los comandos de sonido</font></font></li>

<li>
<font face="Arial,Helvetica"><font size=-1>Comandos para cargar tipos de
letra (True Type)</font></font></li>

<li>
<font face="Arial,Helvetica"><font size=-1>Posibilidad de crear ficheros
de recursos (para juntar los gr&aacute;ficos, sonidos, fuentes...)</font></font></li>

<li>
<font face="Arial,Helvetica"><font size=-1>Int&eacute;rprete independiente
del entorno</font></font></li>

<li>
<font face="Arial,Helvetica"><font size=-1>Librer&iacute;a (base de datos)
de inicio</font></font></li>
</ol>
<font face="Arial,Helvetica"><font size=-1>Adem&aacute;s, Javier ha hecho
p&uacute;blicas las fuentes de las versiones anteriores de SINTAC, tanto
de la T2 como de la G3. Se incluye documentaci&oacute;n, c&oacute;digo
fuente y ejemplos, y lo puedes encontrar en la misma p&aacute;gina de antes,
en el apartado de descarga.</font></font>
<center>
<p><img SRC="n-vs.jpg" ALT="Imagen de Visual Sintac" height=200 width=320></center>

<hr SIZE=0 WIDTH="100%">
<p><b><font face="Arial,Helvetica">La p&aacute;gina del CAAD se renueva
</font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Impresionante el trabajo
de Jos&eacute; Luis Cebri&aacute;n que ha renovado toda la p&aacute;gina
del <b>CAAD</b> y ha introducido interesantes mejoras, como las encuestas
(polls) que ya se est&aacute;n realizando y en la que todo aventurero puede
participar. Aunque lo m&aacute;s destacable de todo son las noticias, que
se actualizan bastante a menudo, incluso a diario cuando la actualidad
aventurera as&iacute; lo demanda. Sobre todo, no olvid&eacute;is que la
p&aacute;gina ha cambiado de ubicaci&oacute;n y que ahora se encuentra
en: <a href="http://www.cir.es/caad">http://www.cir.es/caad</a>.</font></font>
<p><font face="Arial,Helvetica"><font size=-1>Lo que se ha renovado tambi&eacute;n
ha sido el <b>anillo de aventuras</b> espa&ntilde;ol, pues Carlos S&aacute;nchez
recientemente le aplic&oacute; unos interesantes cambios. Ahora el darse
de alta y de baja y efectuar modificaciones ser&aacute; pr&aacute;cticamente
autom&aacute;tico gracias a que todo ha quedado centralizado. Si tienes
una p&aacute;gina de aventuras y deseas a&ntilde;adirla al anillo, p&aacute;sate
por <a href="http://nmsoft.grupo-ronda.com/roebuck">Roebuck</a>.</font></font>
<br>
<hr>
<p><b><font face="Arial,Helvetica">Caso Cerrado II descargable </font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>En nuestra anterior encarnaci&oacute;n
os coment&aacute;bamos la buena marcha de este proyecto de Papada Soft,
la segunda parte de <b>Caso Cerrado</b>, titulada <b>El Pueblo</b>. Pues
bien, ya pod&eacute;is descargar la versi&oacute;n beta desde la p&aacute;gina
de Papada, sita.&nbsp; <a href="http://pagina.de/PapadaSoft">http://pagina.de/PapadaSoft</a>.
Desde aqu&iacute; enviamos nuestras felicitaciones a los padres de la criatura.</font></font>
<center>
<p><img SRC="n-cc2.gif" height=200 width=320></center>

<hr>
<p><b><font face="Arial,Helvetica">Equipazo en Papada Soft </font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Poco despu&eacute;s de sacar
la beta de Caso Cerrado II, se produjo un aut&eacute;ntico aluvi&oacute;n
de incorporaciones a <b>Papada Soft</b>. Ahora ya son nueve integrantes,
entre ellos cuatro grafistas, hay nuevos proyectos y por tener tienen hasta
nuevo logo.</font></font>
<p><font face="Arial,Helvetica"><font size=-1>En mente tienen dos aventuras
gr&aacute;ficas. La primera es <b>Fray Luis</b>, en la que manejaremos
a un joven y revoltoso monje llamado Fray Luis, y deberemos apa&ntilde;&aacute;rnoslas
para salvar al mundo del mal personificado, encerr&aacute;ndolo en las
tres estatuas que crearon los antiguos monjes. La aventura, tendr&aacute;
un aspecto de dibujos animados, con un engine muy similar al SCUMM de Monkey
Island II, Day of the Tentacle, etc.</font></font>
<p><font face="Arial,Helvetica"><font size=-1>La segunda aventura es la
parodia <b>Estar Guars</b>: "Todos estan de mala uva, es la guerra civil.
Las naves rebeldes, atacando desde una base secreta (Rabin 4.5) han ganado
la primera batalla contra el malvado, ruin y pendenciero Imperio Colacao.
En el transcurso de la batalla, carne de ca&ntilde;on rebelde ha robado
los planos de la ultima superarma que-te-cagas de chunga... la Baticao
de la Muerte. Un terror tessnologico con el suficiente poder como pa que
la di&ntilde;en planetas enteros. Perseguida por agentes imperiales, la
princesa Leia vuelve a su keli sin saber que algun pringao le ha colao
los planos robados... unos planos que pueden llevar a la destrucci&oacute;n
total si cayeran en manos de las multinacionales niponas".</font></font>
<p><font face="Arial,Helvetica"><font size=-1>En cuanto a Caso Cerrado
III, ya sabemos que se llamar&aacute; <b>En cuerpo y alma</b>, y que deberemos
acabar definitivamente con el propietario de la mansi&oacute;n, que tantos
tormentos nos est&aacute; causando. Se est&aacute; trabajando para realizar
unas buenas descripciones y unos buenos gr&aacute;ficos, y tambi&eacute;n
corre la voz de que posiblemente al cerrar la trilog&iacute;a se reediten
las dos primeras partes con algunas mejoras, sobre todo en el aspecto gr&aacute;fico.</font></font>
<br>&nbsp;
<table BORDER=0 CELLPADDING=0 WIDTH="100%" >
<tr>
<td WIDTH="50%">
<center><img SRC="n-papa-1.jpg" ALT="Imagen de Fray Luis" height=135 width=180></center>
</td>

<td WIDTH="50%">
<center><img SRC="n-papa-2.jpg" ALT="Imagen de Estar Guars" height=135 width=180></center>
</td>
</tr>
</table>

<hr>
<p><b><font face="Arial,Helvetica">Jos&eacute; Luis D&iacute;az no para...
</font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>No, la verdad es que no.
Si hace poco os coment&aacute;bamos como prosegu&iacute;a con su esfuerzo
de llevar al p&uacute;blico de habla hispana el fant&aacute;stico Inform,
ahora tambi&eacute;n ha encontrado tiempo para dos &uacute;tiles y curiosas
utilidades. &iexcl;Felicidades Zak!</font></font>
<p><font face="Arial,Helvetica"><font size=-1>El primero es <b>PawseZ</b>,
un convertidor de aventuras de Spectrum creadas a partir de PAW a un fuente
Inform, que puede ser compilado y, por tanto, jugado en m&uacute;ltitud
de plataformas distintas. &iexcl;Genial!</font></font>
<p><font face="Arial,Helvetica"><font size=-1>Por otra parte, <b>Zipi</b>
(Z-InvisiPistas Interactivas) es un compilador de un lenguaje muy sencillo
(con tags estilo HTML) a c&oacute;digo Inform. &iexcl;Estupendo! El lenguaje
permite especificar pistas y soluciones para aventuras y evitar que el
jugador lea m&aacute;s de la cuenta, estilo las UHS (Universal Hint System),
y como decimos es muy pero que muy sencillo:</font></font>
<p><font face="Arial,Helvetica"><font size=-1>&lt;MENU> Invisipistas La
Isla de Aurora</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp; &lt;MENU>
En el camarote del capit&aacute;n</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PREG> &iquest;C&oacute;mo hablo con el capit&aacute;n?</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PISTA> Con "hablar xxxxx", donde xxxx es el personaje al que quieres
hablar.</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PREG> &iquest;C&oacute;mo leo los papeles?</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PISTA> Est&aacute;n atados</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PISTA> 'desatar papeles'</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&lt;PISTA> y luego 'leer papepes'.</font></font>
<br><font face="Arial,Helvetica"><font size=-1>&nbsp;&nbsp;&nbsp; &lt;/MENU></font></font>
<br><font face="Arial,Helvetica"><font size=-1>&lt;/MENU></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Todo esto en la p&aacute;gina
de <a href="http://www.geocities.com/TimesSquare/Fortress/9939">Inform
en espa&ntilde;ol</a>.</font></font>
<br>
<hr SIZE=0 WIDTH="100%">
<p><b><font face="Arial,Helvetica">Alone in the Dark 4 </font></b><font face="Arial"><font color="#FF0000"><font size=-2>Novedad</font></font></font>
<p><font face="Arial,Helvetica"><font size=-1>Hac&iacute;a tiempo que o&iacute;amos
rumores sobre un nuevo t&iacute;tulo de la famosa serie de <b>Infogrames</b>,
<b>Alone
in the Dark</b>, pero no ha sido hasta hace poco que han comenzado a llegarnos
informaciones fiables. Seg&uacute;n cuenta el product manager de Infogrames,
Francois Lourdin, en una entrevista publicada en <a href="http://www.avault.com">http://www.avault.com</a>,
la compa&ntilde;&iacute;a pidi&oacute; propuestas entre diversos grupos
de desarrollo europeos para un juego Alone in the Dark y la elegida result&oacute;
ser la de un grupo al que se conoce como Darkworks. El juego, que deber&iacute;a
aparecer hacia finales del a&ntilde;o 2000 para Dreamcast, PC y Playstation,
combinar&aacute; exploraci&oacute;n, puzles y acci&oacute;n, y como era
de esperar estar&aacute; implementado mediante un ingenio de 3D en tiempo
real. Aqu&iacute; ten&eacute;is unas de las pocas im&aacute;genes del juego
que Infogrames ha hecho p&uacute;blicas...</font></font>
<center>
<p><img SRC="n-aitd4.jpg" ALT="Otra casa ominosa y opresiva..." height=236 width=300></center>

<hr>
<p><b><font face="Arial,Helvetica">Proyecto para el a&ntilde;o de la aventura</font></b>
<p><font face="Arial,Helvetica"><font size=-1>Recientemente Luis Felipe
Morales realiz&oacute; una interesante propuesta de proyecto para este
a&ntilde;o de la aventura: "El proyecto trata de conseguir que este a&ntilde;o
(1999) sea de verdad el a&ntilde;o de la aventura... Para ello se han dado
tres ideas. La primera es que cada persona de la lista del Caad o aventurero
en general realice una aventura en conmemoraci&oacute;n del a&ntilde;o...
Luego se tratar&iacute;a de pasar alguna de esas aventuras a ingl&eacute;s....
Y por &uacute;ltimo se intentar&iacute;a realizar una aventura en com&uacute;n."</font></font>
<p><font face="Arial,Helvetica"><font size=-1>Y si te has enterado de esto
por nosotros muy requetemal, ya est&aacute;s tardando mucho para pinchar
en <a href="http://www.onelist.com/subscribe.cgi/caad">http://www.onelist.com/subscribe.cgi/caad</a>
y suscribirte a la lista aventurera, gracias a la cual estar&aacute;s a
la &uacute;ltima de proyectos y novedades...</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="Arial,Helvetica">InformATE</font></b>
<p><font face="Arial,Helvetica"><font size=-1>Resulta inminente la aparici&oacute;n
de una nueva versi&oacute;n de <b>InformatE</b>, que corregir&aacute; algunos
bugs menores. Adem&aacute;s, Jos&eacute; Luis D&iacute;az ha terminado
la librer&iacute;a-modulo adicional PNJMovil, que permite que los PNJs
se muevan v&iacute;a rutas preestablecidas,</font></font> <font face="Arial,Helvetica"><font size=-1>aleatoriamente,
o para conseguir 'una meta'. Este m&oacute;dulo es compatible con la ampliaci&oacute;n
de tiempo-real de InformatE. Y por si fuera poco el portador de Inform
a espa&ntilde;ol est&aacute; preparando la documentaci&oacute;n &iacute;ntegra
en espa&ntilde;ol: <a href="http://www.geocities.com/TimesSquare/Fortress/9939/informate/documentate.htm">DocumentatE</a>.</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="Arial,Helvetica">Caso Cerrado II</font></b>
<p><font face="Arial,Helvetica"><font size=-1>Luis Felipe, director de
<b>Papada
Soft</b>, nos comenta que el desarrollo de <b>Caso Cerrado II</b> avanza
a buen ritmo. De momento hay unos 40 gr&aacute;ficos y ya se puede llegar
al final, centr&aacute;ndose ahora los autores en hacerla m&aacute;s jugable.
El argumento contin&uacute;a donde lo dejaba la primera parte: el jugador
(Rom&aacute;n) tiene que ir al pueblo donde supuestamente est&aacute; enterrado
el cuerpo del primer propietario de la mansion, ya que destruir ese cuerpo
es la &uacute;nica manera de salvar a tu compa&ntilde;ero Raul...</font></font>
<p><font face="Arial,Helvetica"><font size=-1>Pues nada, para los que no
os hay&aacute;is acabado <b>Caso Cerrado I</b> irlo haciendo ya; os recordamos
que la ten&eacute;is disponible gratuitamente en <a href="ftp://ftp.gmd.de/if-archive/games/pc/non-english/casoc_1.zip">ftp://ftp.gmd.de/if-archive/games/pc/non-english/casoc_1.zip</a>
o en un mirror como &eacute;ste <a href="ftp://ftp.funet.fi/pub/misc/if-archive/games/pc/non-english/casoc_1.zip">ftp://ftp.funet.fi/pub/misc/if-archive/games/pc/non-english/casoc_1.zip</a>.</font></font>
<p><font face="Arial,Helvetica"><font size=-1>Ah, y en absoluta primicia
os adelantamos que a esta segunda parte le seguir&aacute; una tercera.
&iexcl;Bien!</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="Arial"><font size=+0>Juegos Star Wars</font></font></b>
<p><font face="Arial"><font size=-1>LucasArts ha anunciado que, coincidiendo
con el estreno en los cines del primer episodio de la nueva trilog&iacute;a
de <b>Star Wars</b>,
<b>The Phantom Menace</b>, lanzar&aacute; dos videojuegos
basados en la pel&iacute;cula. Uno de ellos ser&aacute; una <i>action adventure</i>
que llevar&aacute; el mismo t&iacute;tulo que la pel&iacute;cula y que
suponemos tendr&aacute; un desarrollo comparable al de los <i>Tomb Raider</i>
(es decir, plataformas por las que saltar, palancas que abren puertas y
enemigos a los dar muerte con diversas armas). Para m&aacute;s informaci&oacute;n
visita la p&aacute;gina de <a href="http://www.lucasarts.com/">LucasArts</a>.</font></font>
<br>&nbsp;
<table BORDER=0 CELLPADDING=0 WIDTH="100%" >
<tr>
<td WIDTH="50%">
<center><img SRC="n-swar-1.jpg" height=114 width=180></center>
</td>

<td WIDTH="50%">
<center><img SRC="n-swar-2.jpg" height=135 width=180></center>
</td>
</tr>
</table>

<hr>
<p><b><font face="arial">Simon vuelve a casa para navidad</font></b>
<p><font face="arial"><font size=-1><b>Simon The Sorcerer 3D</b>, el nuevo
juego de AdventureSoft, ya tiene distribuidora: Hasbro Interactive, y deber&iacute;a
aparecer a tiempo para la pr&oacute;ximas navidades.</font></font>
<br>&nbsp;
<table BORDER=0 CELLPADDING=0 WIDTH="100%" >
<tr>
<td WIDTH="33%">
<center><img SRC="n-sim3-1.jpg" ALT="n-sim3-1.jpg (6846 bytes)" height=112 width=150></center>
</td>

<td WIDTH="33%">
<center><img SRC="n-sim3-2.jpg" height=112 width=150></center>
</td>

<td WIDTH="34%">
<center><img SRC="n-sim3-3.jpg" ALT="n-sim3-3.jpg (4706 bytes)" height=112 width=150></center>
</td>
</tr>
</table>

<p><font face="arial"><font size=-1>El desarrollo del juego comenz&oacute;
hace ya bastante tiempo, pero Adventuresoft no encontr&oacute; a nadie
que quisiera distribuirlo porque no usaba 3D en tiempo real. As&iacute;
que abandonaron todo el trabajo que ten&iacute;an (aproximadamente la mitad
acabado) y volvieron a empezar creando un engine que nos permitir&aacute;
explorar con toda libertad los escenarios.</font></font>
<p><font face="arial"><font size=-1>Para m&aacute;s informaci&oacute;n
visita las p&aacute;ginas de Adventuresoft <a href="http://www.adventuresoft.com/">http://www.adventuresoft.com/</a>
y <a href="http://www.simon3d.com/">http://www.simon3d.com/</a>.</font></font>
<br>
<hr>
<p><b><font face="arial">Sobre Broken Sword III</font></b>
<p><font face="arial"><font size=-1>Si bien en Revolution Software se muestran
ansiosos por dar el espaldarazo definitivo a la tercera aventura de George
y Nico, <b>Broken Sword III</b>, el proyecto ha sido aplazado porque entre
otras cosas no tienen quien les distribuya el juego. Actualmente trabajan
en un arcade (con elementos de aventura) para Playstation. Esperemos que
puedan volver pronto a su terreno favorito, y que no les pase como a los
chicos de Delhpine Software, que tras probar el arcade abandonaron la aventura
definitivamente.</font></font>
<br>
<hr>
<p><b><font face="arial">Gabriel Knight III retrasado hasta verano</font></b>
<p><font face="arial"><font size=-1>La aventura m&aacute;s esperada de
Sierra (de hecho, la &uacute;nica que preparan en la actualidad), el tercer
episodio de la serie <b>Gabriel Knight</b>, <b>Blood of The Sacred Blood
of The Damned</b>, ha visto retrasado su lanzamiento hasta agosto. Esto
significa que hasta oto&ntilde;o o invierno no lo veremos por aqu&iacute;.</font></font>
<br>&nbsp;
<table BORDER=0 CELLPADDING=0 WIDTH="100%" >
<tr>
<td WIDTH="33%">
<center><img SRC="n-gk3-1.jpg" height=112 width=150></center>
</td>

<td WIDTH="33%">
<center><img SRC="n-gk3-2.jpg" height=112 width=150></center>
</td>

<td WIDTH="34%">
<center><img SRC="n-gk3-3.jpg" height=112 width=150></center>
</td>
</tr>
</table>

<p><font face="arial"><font size=-1>Pod&eacute;is encontrar abundante informaci&oacute;n
sobre esta prestigiosa serie en la p&aacute;gina no oficial <a href="http://www.schattenjager.com/">http://www.schattenjager.com/</a>y
en la web de <a href="http://www.sierra.com">Sierra</a>.</font></font>
<br>
<hr>
<p><b><font face="arial">Alcachofa Soft</font></b>
<p><font face="arial"><font size=-1>Alcachofa Soft ya tiene nombre final
para su pr&oacute;xima aventura: <b>El Tesoro de Isla Alcachofa</b>. Parece
que se terminar&aacute; por Agosto y se espera que salga en Septiembre.
A&uacute;n por confirmar est&aacute; que la distribuya Dinamic en vez de
Zeta con la que publicaran su anterior <b>El Sulfato At&oacute;mico</b>.</font></font>
<p><font face="arial"><font size=-1>Adem&aacute;s nos hemos enterado de
que los poco profesionales hermanos Ruiz han abandonado Dinamic, tras ser
comprada &eacute;sta por una persona que no sabemos qui&eacute;n es, pero
a la que estaremos eternamente agradecidos...</font></font>
<p><font face="arial"><font size=-1>(...) Seg&uacute;n noticias de &uacute;ltima
hora parece que los hermanos Ruiz fundar&aacute;n otra compa&ntilde;&iacute;a.
&iexcl;No pod&iacute;a ser tan bonito!</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="arial">Indyjava</font></b>
<p><font face="arial"><font size=-1><b>Indyjava</b> es un sistema para
crear y jugar aventuras graficas en 2D al estilo Lucas clasico. Dispone
de un lenguaje especializado muy simple para describir todos los elementos
que componen la aventura y no hacen falta conocimientos de Java.</font></font>
<center>
<p><img SRC="n-ijav.gif" height=279 width=326></center>

<p><font face="arial"><font size=-1>Viene con una aventura demo jugable
inmediatamente, y un tutorial. Para jugar, s&oacute;lo se necesita IE 4.
Para programarlo, no hacen falta conocimientos de java. Es gratuito para
uso no comercial y lo pod&eacute;is encontrar en <a href="http://java.indy3d.net">http://java.indy3d.net</a>.</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="arial">P&eacute;ndulo Studios</font></b>
<p><font face="arial"><font size=-1>Nuestra intr&eacute;pida Jezabel, que
a veces se digna a echarnos una manita, se introdujo recientemente en la
red de P&eacute;ndulo, y nos comenta que esta compa&ntilde;&iacute;a prepara
algo muy grande. Seg&uacute;n parece est&aacute; con gente nueva y muchos
colaboradores, realizando una aventura 2D, ambientaci&oacute;n estilo Mad
Max y con el humor que tanto nos gusta de P&eacute;ndulo.</font></font>
<br>
<hr WIDTH="100%">
<p><b><font face="arial">Nace Adventuregamer</font></b>
<p><font face="arial"><font size=-1>Si te gustan las aventuras y te manejas
bien con el ingl&eacute;s, no dejes de visitar <b>Adventuregamer</b> (<a href="http://www.adventuregamer.com/">http://www.adventuregamer.com/</a>),
una estupenda publicaci&oacute;n electr&oacute;nica que se actualiza regularmente
con noticias muy interesantes y con art&iacute;culos de toda clase: an&aacute;lisis
de juegos, entrevistas, soluciones, ... Adventuregamer engloba adem&aacute;s
otras imprescindibles p&aacute;ginas como <b>LucasFans</b> o <b>Larry Channel</b>.</font></font>
<br>
<hr>
<p><b><font face="arial">Premios a la mejor ficci&oacute;n interactiva</font></b>
<p><font face="arial"><font size=-1>1998 acab&oacute;, al igual que la
cuarta edici&oacute;n del <a href="http://www.ifcompetition.org">IF Contest</a>,
resultando ganadoras las siguientes aventuras:</font></font>
<p><font face="arial"><font size=-2><b>Primer puesto:</b> Photopia</font></font>
<br><font face="arial"><font size=-2><b>Segundo puesto:</b> Little Blue
Men</font></font>
<br><font face="arial"><font size=-2><b>Tercer puesto:</b> Muse</font></font>
<p><font face="arial"><font size=-1>Adem&aacute;s, desde el pasado 6 de
febrero de 1999 se conocen los ganadores de los 1998 <i>XYZZY Awards </i>otorgados
por la prestigiosa publicaci&oacute;n <a href="http://www.xyzzynews.com">XYZZY
News</a>...</font></font>
<p><font face="arial"><font size=-2><b>Best game</b> Spider and Web, by
Andrew Plotkin</font></font>
<br><font face="arial"><font size=-2><b>Best writing</b> Photopia, by Adam
Cadre</font></font>
<br><font face="arial"><font size=-2><b>Best story</b> Photopia, by Adam
Cadre</font></font>
<br><font face="arial"><font size=-2><b>Best setting</b> Anchorhead, by
Michael Gentry</font></font>
<br><font face="arial"><font size=-2><b>Best puzzles</b> Spider and Web,
by Andrew Plotkin</font></font>
<br><font face="arial"><font size=-2><b>Best NPCs (non-player characters)</b>
Once and Future, by Gerry Kevin Wilson</font></font>
<br><font face="arial"><font size=-2><b>Best individual puzzle</b> Getting
out of the chair, from Spider and Web (Andrew Plotkin)</font></font>
<br><font face="arial"><font size=-2><b>Best individual NPC</b> The interrogator
in Spider and Web (Andrew Plotkin)</font></font>
<br><font face="arial"><font size=-2><b>Best individual PC (player character)</b>
Little Blue Men, by Michael Gentry</font></font>
<br><font face="arial"><font size=-2><b>Best use of medium</b> Spider and
Web, Andrew Plotkin</font></font>
<br>
<hr>
<p><b><font face="arial">Nuevo Broken Sword?</font></b>
<p><font face="arial"><font size=-1>Para todos los seguidores de la serie
de aventuras gr&aacute;ficas Broken Sword, he aqu&iacute; lo que Tony Warriner,
de Revolution Software, public&oacute; en el foro internacional de noticias:</font></font>
<p><font face="arial"><font size=-1>"Estamos trabajando en un nuevo juego
firmemente enraizado en el g&eacute;nero de las aventuras -- caracterizaci&oacute;n,
argumento, di&aacute;logo, puzles, etc, con algunos nuevos elementos a&ntilde;adidos
para probar y hacer avanzar las cosas. Tambi&eacute;n hemos estado desarrollando
un nuevo ingenio gr&aacute;fico que no es poligonal pero es 3D en el sentido
de que un personaje como George puede ser contemplado desde diferentes
&aacute;ngulos bien iluminado, sombreado, etc. Espero que esto d&eacute;
a los juegos una refrescante apariencia sin caer en esa fea sensaci&oacute;n
poligonal que sospecho desagrada a la mayor&iacute;a de jugadores de aventuras.
Ahora que estamos satisfechos con el aspecto tecnol&oacute;gico, hay un
gran consenso aqu&iacute; en Revolution por hacer un nuevo Broken Sword
con el nuevo sistema."</font></font>
<br>
<hr>
<p><b><font face="arial">La verdad sobre los internados</font></b>
<p><font face="arial"><font size=-1><a href="mailto:versus@vkor.com">Ferran
F. Figueras</a> es un chaval que est&aacute; preparando una curiosa aventura
ambientada en un escenario real: el internado PIVE, situado en Tona (Vic)
y que quiz&aacute; alguno conocer&aacute;. Como Ferran explica...</font></font>
<p><font face="arial"><font size=-1>"El PIVE es un internado de catalu&ntilde;a
y ah&iacute; es donde se basa la aventura; el protagonista es un porrero
salido del todo (en el mal sentido de la palabra) y siempre se intenta
aprovechar de las t&iacute;as. El juego intenta explicar la vida de un
chaval <i>corriente</i> (lo que ah&iacute; lo es en el mundo real no, es
un mundo aparte) y por tanto el juego est&aacute; basado en la vida de
<i>ciertas
personas</i> a las cuales no quiero nombrar por respeto, o sea que no me
vengais diciendo que si esto no es cierto, que si esto es inventadisimo,
que si esto es imposible... porque no lo es; habr&aacute; cosas que ser&aacute;n
falsas, evidentemente, sino c&oacute;mo jugar?</font></font>
<p><font face="arial"><font size=-1>He empezado desde zero la aventura
como unas 6 veces, con m&eacute;todos distintos de trabajo, y he optado
por el te&oacute;rico, o sea, no empezar a programar nada hasta no tener
definido todo el juego sobre papel; quiz&aacute; os sonar&aacute; un poco
basto, pero estando toda la semana internado y teniendo un resumen del
juego sobre papel os puedo asegurar que se trabaja mejor.</font></font>
<p><font face="arial"><font size=-1>En principio el juego intentar&eacute;
que corra el tiempo interno mediante el tiempo externo; me explico, si
son las dos de la ma&ntilde;ana en el reloj de tu Pc ser&aacute; oscuro
y si son las dos de la tarde ser&aacute; hora de comer; tambien espero
poder solucionar las t&iacute;picas respuestas de no entiendo, o sea que
meter&eacute; todos los sin&oacute;nimos y burradas que seme ocurran; se
aceptan comentarios y todo eso, solo hace falta que me</font></font> <font face="arial"><font size=-1>deis
un toque a <a href="mailto:versus@vkor.com">versus@vkor.com</a>."</font></font>
<br>
<hr>
<p><b><font face="arial">Caso Cerrado II</font></b>
<p><font face="arial"><font size=-1>Seg&uacute;n nos comenta el responsable
del proyecto, Luis Felipe Morales, la segunda parte de "Caso Cerrado" est&aacute;
ya siendo ultimada. A parte los chicos de Papada, han realizado un experimento,
en el fant&aacute;stico NMP, que tiene como t&iacute;tulo "Me Marcho pa'
Francia 98":</font></font>
<p><font face="arial"><font size=-1>"Con esta mini-cutre-aventura-conversacional
he tratado de plasmar esa cr&iacute;tica de una forma amena. Espero que
sep&aacute;is apreciar el esp&iacute;ritu con el cual ha sido concebida
la aventura. Aunque en un principio promet&iacute;a ser m&aacute;s larga
he decidido dejar tal como la ver&eacute;is y as&iacute; poder dedicar
ese tiempo a acabar otros proyectos y comenzar otros nuevos."</font></font>
<p><font face="arial"><font size=-1>Toda una cr&iacute;tica a un ex seleccionador
balomp&eacute;dico (&iquest;se escribe as&iacute;?) de cuyo nombre no quiero
acordarme...</font></font>
<br>
<hr>
<p><b><font face="arial">Pro-Imagyna</font></b>
<p><font face="arial"><font size=-1>Nuestro contacto en esta 'casa' asegura
que por all&aacute; siguen trabajando duro. A parte de sacar una nueva
versi&oacute;n del archimascado Eudoxio, siguen trabajando en dos guiones,
uno de ellos el Concilio. El otro ya se ultima y es el de una aventura
que se prepara para el verano.</font></font>
<p><font face="arial"><font size=-1>Afirman, adem&aacute;s, que el nuevo
parser est&aacute; muy avanzado y nos han prometido tener lista una beta
para muy pronto. Y por si fuera poco, dicen que si todo va bien, podremos
tener Concilio antes de fin de a&ntilde;o...</font></font>
<br>
<hr>
<p><b><font face="arial">Movimiento pagin&iacute;stico...</font></b>
<p><font face="arial"><font size=-1>Una nueva p&aacute;gina para el mundillo,
de mano del inquieto sgag. Contiene una p&aacute;gina dedicada exclusivamente
a noticias aventureras. La puedes encontrar en <a href="http://members.xoom.com/sgag/">http://members.xoom.com/sgag/</a>.</font></font>
<p><font face="arial"><font size=-1>Y mientras unas nacen, otras se mudan.
Es el caso de Ricardo Villalba, autor del parser SKC, quien se ha mudado
a xoom, y ahora podemos encontrarle en <a href="http://www.xoom.com/~rvmsoft">http://www.xoom.com/~rvmsoft</a>.
Y tambi&eacute;n Vicente Tarin Font, que ahora se ha asentado en <a href="http://ttt.eui.upv.es/~vitafon">http://ttt.eui.upv.es/~vitafon</a>,
y 69 Soft, trasladada a <a href="http://www.lanzadera.com/69soft">http://www.lanzadera.com/69soft</a>.</font></font>
<br>
<hr>
<p><b><font face="arial">Inf&oacute;rmate de InformATE</font></b>
<p><font face="arial"><font size=-1>Jos&eacute; Luis Diaz tambi&eacute;n
sigue trabajando en InformATE, la traducci&oacute;n a espa&ntilde;ol de
la librer&iacute;a de Inform. Lo &uacute;ltimo que ha perpretado ha sido
un breve tutorial, que tiene como t&iacute;tulo 'Manejo de arrays en Inform'.
Seg&uacute;n cuenta el autor en el mismo documento: "los arrays en Inform
tienen una sintaxis bastante extra&ntilde;a, sobre todo para los programadores
habituados al C. Aunque los conceptos relacionados con arrays son simples,
la sintaxis usada por Inform complica un poco las cosas de forma innecesaria.
Este cursillo (en formato TXT, texto plano) pretende aclarar las cosas.
De paso, se aclaran tambi&eacute;n otros conceptos que aparecen un tanto
'enredados' en el manual original, como el de los strings, las palabras
de diccionario, las propiedades que contienen listas, etc, conceptos relacionados
directa o indirectamente con los arrays."</font></font>
<br>
<hr>
<p><b><font face="arial">El a&ntilde;o de la aventura</font></b>
<p><font face="arial"><font size=-1>Decidido. El 99, pen&uacute;ltimo a&ntilde;o
del siglo XX, ser&aacute; el a&ntilde;o del relanzamiento de la aventura
conversacional. Pero eso s&oacute;lo ser&aacute; posible si todos ponemos
nuestro granito de arena: hablar de la conversacional a los conocidos (aunque
te tomen por loco), poner links en tu p&aacute;gina personal, comentarlo
en las news, hacer esa aventura que siempre quisiste hacer, colaborar en
fanzines, escribir a revistas comerciales... y lo que se te ocurra, porque...&iexcl;t&uacute;
decides como ayudar a la aventura! No te preguntes qu&eacute; puede hacer
la aventura por ti, sino qu&eacute; puedes hacer T&Uacute; por la aventura...
&iexcl;&iexcl;&iexcl;Hora de moverse!!! Para visitar la p&aacute;gina oficial
de 'El a&ntilde;o de la Aventura' pincha <a href="http://www.webglass.com/up/conversacional_principal.HTML">aqu&iacute;</a>.</font></font>
<br>
<hr>
<p><b><font face="arial">Visual Sintac</font></b>
<p><font face="arial"><font size=-1>En un reciente mensaje a la lista de
aventuras del CAAD (suscr&iacute;bete ya en http://www.onelist.com/subscribe.cgi/caad)
Javier San Jos&eacute;, autor de SINTAC, nos sorprend&iacute;a gratamente
al realizar el siguiente comunicado:</font></font>
<p><font face="arial"><font size=-1>"Pues eso... que ya he terminado un
proyecto que me estaba absorviendo todo el tiempo que dedicaba a estos
menesteres y me voy a dedicar de lleno al Proyecto VISUAL SINTAC... Que
&iquest;qu&eacute; es eso?...</font></font>
<p><font face="arial"><font size=-1>Pues se trata de desarrollar el primer
parser visual (al menos que yo sepa). Es decir, casi todo el desarrollo
de una aventura ser&aacute; a base de "clickar" con el rat&oacute;n y arrastrar
y soltar cosas por el entorno.</font></font>
<p><font face="arial"><font size=-1>Por supuesto, sinti&eacute;ndolo mucho
para los usuarios de otros S.O., el Visual SINTAC s&oacute;lo estar&aacute;
disponible para entorno Windows de 32 bits (aunque quiz&aacute;, si los
muchachos del Wine se dan prisa...).</font></font>
<p><font face="arial"><font size=-1>En fin, aunque el parser comparte nombre
con sus hermanos menores, no va a ser compatible con ellos. Ello es debido
al cambio de filosof&iacute;a de dise&ntilde;o. Adem&aacute;s el lenguaje
de programaci&oacute;n que tengo pensado incorporar (siiii... no todo va
a funcionar a golpe de rat&oacute;n 8-P) en el parser va a ser una especie
de Basic o quiz&aacute; Pascal o quiz&aacute; C o... bueno que ya ver&eacute;
sobre la marcha.</font></font>
<p><font face="arial"><font size=-1>El entorno est&aacute; casi perfilado
al 100% y, en principio, voy a orientar el desarrollo de este parser a
otro proyecto paralelo.... el desarrollo de La Aventura Original 2... de
la que, gracias a Juanjo Mu&ntilde;oz (gracias, gracias, gracias, ...)
tengo el gui&oacute;n...</font></font>
<p><font face="arial"><font size=-1>Pues nada... a partir de ahora se admiten
sugerencias... pero aviso que en principio me centrar&eacute; en acabar
lo suficiente del parser para programar la AO2... luego... ya veremos..."</font></font>
<p><font face="arial"><font size=-1>Su page, por cierto, la pod&eacute;is
encontrar en <a href="http://web.jet.es/jsjlogin">http://web.jet.es/jsjlogin</a>.
Y si le quieres sugerir algo, usa la direcci&oacute;n <a href="mailto:jsjlogin@jet.es">jsjlogin@jet.es</a>.</font></font>
<br>
<hr>
<p><b><font face="arial">La Biblia en formato electr&oacute;nico</font></b>
<p><font face="arial"><font size=-1>Una fabulosa noticia nos llega del
<a href="http://www.arrakis.es/~caad">CAAD</a>...
Muchos recordar&eacute;is los art&iacute;culos que Andr&eacute;s R. Samudio,
padre de Aventuras AD e impulsor de este mundillo en nuestro pa&iacute;s,
public&oacute; en la revista Microhobby, bajo el ep&iacute;grafe "El Mundo
de La Aventura". Pues bien, para mayor gloria, dichos art&iacute;culos
han sido pasados a formato electr&oacute;nico por los siguientes disc&iacute;pulos:
Tony Vera D&iacute;az, Jose Manuel Hinojosa Pi&ntilde;a, Josetchu Malanda
Uriarte y Sergio Costas Rodr&iacute;guez. B&aacute;jatelos desde la p&aacute;gina
de Carlos S&aacute;nchez, <a href="http://thepentagon.com/nmsoft">The Roebuck</a>.
Por los siglos de los siglos.</font></font>
<br>
<hr>
<center><table BORDER=0 COLS=1 WIDTH="100%" >
<tr>
<td>
<table BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<tr>
<td>
<center><b><font face="Arial"><a href="sumario.htm" style="text-decoration:none"><font color="#000000">SUMARIO
DE</font> <font color="#CC0000">S</font><font color="#000000">PANISH</font><font color="#CC0000">Q</font><font color="#000000">UEST</font></a></font></b></center>
</td>
</tr>
</table>

<center><table BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<tr>
<td BGCOLOR="#0080C0"><font face="Arial">&nbsp;</font></td>
</tr>
</table></center>
&nbsp;
<div ALIGN=right><table BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<tr>
<td>
<center><b><font face="Arial">MACEDO<font color="#CC0000">N</font>IA Magazine</font></b></center>
</td>
</tr>
</table></div>
</td>
</tr>
</table></center>

</body>
</html>
