<HTML>
<HEAD>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<p align="RIGHT"><IMG SRC="g_misc/69.gif"  ALIGN=RIGHT>
<DIV ALIGN=right>
<B><FONT FACE="arial"><FONT SIZE=-1><FONT COLOR="#CC0000">A</FONT><FONT COLOR="#000000">rt&iacute;culo
realizado por</FONT></FONT></FONT></B>
<BR><B><FONT FACE="arial"><FONT COLOR="#000000"><FONT SIZE=-1><A HREF="mailto:kilivor@geocities.com">Daniel
C&aacute;rdenas</A></FONT></FONT></FONT></B></DIV>

<BR>
<BR>
<BR>
<H3>
<FONT FACE="arial"><p align="justify"><FONT COLOR="#000000">Comprando un nuevo PC</FONT></FONT></H3>
<FONT FACE="Arial"><p align="justify"><FONT SIZE=-1>El otro d&iacute;a estaba hojeando la
publicidad de cierta cadena de electrodom&eacute;sticos y me sorprendi&oacute;
leer lo que dec&iacute;an del nuevo procesador Pentium III de Intel. Se
soltaban a la ligera cosas como: "tiene prestaciones especiales para mejorar
Internet gracias a sus 70 nuevas instrucciones, que dan mejores prestaciones",
"la b&uacute;squeda en la Web es m&aacute;s visual", "te ayuda incluso
a comunicarte mejor a trav&eacute;s del correo electr&oacute;nico multimedia
y a los chats en tiempo real", "tanto si utilizas juegos 3D en Internet
como si dise&ntilde;as tus propias p&aacute;ginas Web, un PC con procesador
Pentium III es tu v&iacute;a de acceso a nuevos entornos y a la nueva dimensi&oacute;n
de Internet".</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Analizemos un poco todo eso... Realmente
el Pentium III incorpora esas 70 nuevas instrucciones 3D que s&iacute;
pueden mejorar cosas tan espec&iacute;ficas como los juegos 3D, pero s&oacute;lo
los nuevos juegos que est&eacute;n preparados para ello y empleen esas
instrucciones sacar&aacute;n provecho. Adem&aacute;s, el Pentium III tambi&eacute;n
incorpora un n&uacute;mero de serie que es diferente en cada chip y que
por tanto se puede emplear para identificarte en la red y, por ejemplo,
realizar compras m&aacute;s c&oacute;modamente. Pero dejando aparte estas
dos cosas, instrucciones y n&uacute;mero identificativo, el nuevo procesador
resulta totalmente equivalente al Pentium II.</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Desde luego decir cosas como lo de
la b&uacute;squeda en la Web es m&aacute;s visual o lo de las mejoras en
comunicaci&oacute;n es, por tanto, absolutamente falso y s&oacute;lo desinforma.
Lo 'visual' de Internet se ve igual de bien tanto en un Pentium normal
o en un Pentium III, y crear p&aacute;ginas Web se puede hacer igual de
bien hasta en un 386..</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Esto no hace m&aacute;s que sacar a
la luz, una vez m&aacute;s, el trinomio vendedores + fabricantes de hardware
(Intel) + software (Microsoft, casas de juegos). Intel saca los procesadores,
hace grandes campa&ntilde;as de marketing, a las que se les suma publicidad
como la de m&aacute;s arriba por parte de los vendedores, y ambos tienen
asegurada su supervivencia... a costa del usuario. Un usuario que tirar&aacute;
su viejo cacharro, se comprar&aacute; nuevo PC con ese novedoso procesador,
y que a los dos a&ntilde;os dejar&aacute; de serle &uacute;til... &iquest;Por
qu&eacute;? Porque en dos a&ntilde;os ya no podr&aacute; ejecutar la &uacute;ltima
versi&oacute;n de Windows, ya que Microsoft habr&aacute; introducido a&uacute;n
m&aacute;s pijaditas que obligar&aacute;n a tener un equipo m&aacute;s
potente para poderse ejecutar. Tampoco podr&aacute; disfrutar del todo
de ese novedoso juego, porque s&oacute;lo los equipos con procesadores
de tecnolog&iacute;a tal y cual podr&aacute;n hacerlo (y en esto el fabricante
de procesadores har&aacute; lo posible -incluso poniendo dinero sobre la
mesa- para convencer a la casa de soft para que use su tecnolog&iacute;a
en el mismo y as&iacute; poder usar el juego como reclamo). Y en esos dos
a&ntilde;os tu AGP 2X, TATA/33, Bus a 100 MHz y memoria TRIMM se habr&aacute;
quedado todo anticuado, ahora se llevar&aacute; placa AGP 16X, TATA/266,
Bus a 1 GHz y memoria FILIPRIM-TRIM que, por supuesto, no podr&aacute;s
instalar en tu anticuada placa.</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Est&aacute; claro que al comprarnos
un ordenador ni a Intel, ni a los vendedores, ni a Microsoft le interesa
que sea para toda la vida... Porque sino, como s&oacute;lo les comprar&iacute;amos
una vez, todos ellos se acabar&iacute;an yendo a pique cuando todos hubi&eacute;ramos
comprado ya. Interesa, pues, hacernos creer que un ordenador dura poco,
y que para estar a la &uacute;ltima hay que irlo cambiando constantemente.</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Para solucionar esto s&oacute;lo hay
un remedio: informaci&oacute;n. Lamentablemente apenas hay y, en mi humilde
opini&oacute;n, la mayor&iacute;a de medios s&oacute;lo desinforman al
usuario, que puede acabar cayendo bajo el influjo del trinomio. Un ejemplo:
hace un a&ntilde;o o as&iacute; le&iacute; en un peri&oacute;dico local
que el requerimiento m&iacute;nimo para acceder a Internet era un Pentium
166... El que esto escribe se ha conectado a la red durante un par de a&ntilde;os
con un 's&iacute;mple' 486.</FONT></FONT><FONT FACE="Arial"><FONT SIZE=-1></FONT></FONT>
<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Llegados a este punto debemos recordarles
a los se&ntilde;ores vendedores, fabricantes y productores de software
que como usuarios finales de sus productos estamos en nuestro perfecto
derecho de EXIGIR:</FONT></FONT>
<UL>
<LI><P ALIGN="JUSTIFY">
<FONT FACE="Arial"><FONT SIZE=-1>Publicidad seria y cien por cien fiable.
Que se diga exactamente cu&aacute;les son las ventajas reales de sus productos
con respecto a productos que nos venden como 'desfasados'.</FONT></FONT></LI>

<LI><P ALIGN="JUSTIFY">
<FONT FACE="Arial"><FONT SIZE=-1>Profesionalidad, informaci&oacute;n y
honradez. Afortunadamente no lo son todas, pero haberlos haylos. Cuando
recientemente adquir&iacute; un nuevo equipo descubr&iacute; al llegar
a casa, y de casualidad, como no me hab&iacute;an puesto la placa que hab&iacute;a
pagado y me hab&iacute;an colocado una 4000 pesetas m&aacute;s barata.
No quiero pensar que fueran con mala fe, pero cuando uno va a la tienda
da por supuesta una m&iacute;nima profesionalidad y que se comprueba que
lo que te han pagado se corresponda con lo que finalmente has puesto.</FONT></FONT></LI>

<LI><P ALIGN="JUSTIFY">
<FONT FACE="Arial"><FONT SIZE=-1>En los sistemas operativos, las pijaditas
'visuales' son s&iacute;mples extras y las que recargan demasiado el equipo
no deber&iacute;an estar activadas por defecto. En caso de estarlas, deber&iacute;an
ser f&aacute;cilmente desconectables, con un proceso m&aacute;s intuitivo
que el del actual editor de registro.</FONT></FONT></LI>

<LI><P ALIGN="JUSTIFY">
<FONT FACE="Arial"><FONT SIZE=-1>Queremos que nuestros equipos tengan una
vida m&aacute;s larga. Ahora la moda es cambiar de placa cada vez que hay
una nueva generaci&oacute;n de procesadores. Intel le ha dado por ah&iacute;,
nos hizo cambiar innecesariamente de Socket 7 a un m&aacute;s caro Slot
1, y AMD ha demostrado que no hac&iacute;a falta cambiar de placa para
obtener m&aacute;s prestaciones (AGP o Bus a 100 MHz).</FONT></FONT></LI>
</UL>
<FONT FACE="Arial"><FONT SIZE=-1><P ALIGN="JUSTIFY">Mientras se siga jugando con el usuario
debemos tratar de informarnos lo m&aacute;ximo posible, acudiendo a la
red o preguntando a amigos y conocidos antes de comprarnos un nuevo equipo.
Desde aqu&iacute; te animo a que te cuestiones si realmente lo necesitas,
y que si tienes que compr&aacute;rtelo intentes adquirir un equipo acorde
a tus necesidades: no te gastes un past&oacute;n en un Pentium III si vas
a usar tu PC principalmente para editar textos, por ejemplo. Intenta tambi&eacute;n
comprar con visi&oacute;n de futuro, tratando que en la placa puedan meterse
procesadores a m&aacute;s velocidad. Ahora mismo una posibilidad muy atractiva
es comprarse una placa compatible Pentium III, meterle un Celeron de los
menos r&aacute;pidos, que te cuesta cuatro duros, y de aqu&iacute; a un
tiempo cuando los Pentium III bajen y valgan esos cuatro duros, pon&eacute;rtelo.
S&oacute;lo es un consejo... de amigo.</FONT></FONT>
<BR>&nbsp;

<DIV ALIGN=right>
<p align="RIGHT"><FONT FACE="arial"><B><FONT COLOR="#0080C0"><FONT SIZE=-1>&Uacute;</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>LTIMA
REVISI&Oacute;N EN</FONT></FONT></FONT> <FONT FACE="arial"><B><FONT COLOR="#CC0000"><FONT SIZE=-1>JULIO</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>
DE </FONT></FONT><B><FONT COLOR="#CC0000"><FONT SIZE=-1>1999</FONT></FONT></B></FONT>
<BR>
<HR>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>
