<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">
<font face=arial size=2>
<p align=right>
Artículo realizado por<br>
David Miraut
</p> 
<P align="justify">
<h3>Biografía completa de J.R.R. Tolkien</h3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La verdad es que no s&eacute; por donde comenzar, pues lo m&iacute;o no es precisamente esto de escribir, pero puesto que sobreentiendo que entre los lectores habr&aacute; bastante gente interesada en la vida de tan ilustre escritor pues por lo general suele gustar su obra, empezar&eacute; desde lo m&aacute;s atr&aacute;s en el tiempo que pueda, aunque si lo que realmente te interesa son las circunstancias que le rodearon al escribir su obra ve directamente al apartado (pulsa el bot&oacute;n de b&uacute;squeda)</P>
<B><P ALIGN="JUSTIFY">La infancia y juventud de J.R.R. Tolkien </P>
</B><P ALIGN="JUSTIFY">El noviazgo de los padres de J.R.R. Tolkien (en adelante John) fue bastante complicado. Arthur Tolkien (el futuro padre de John) propuso el matrimonio a Mabel Suffield (la futura madre de John) cuando &eacute;sta cumpli&oacute; los 18 a&ntilde;os, sin embargo no pudieron casarse hasta tres a&ntilde;os despu&eacute;s . El padre de Mabel no permiti&oacute; un compromiso formal durante 2 a&ntilde;os, por lo Arthur y Mabel s&oacute;lo pudieron escribirse cartas en secreto y encontrarse en reuniones, que sol&iacute;an ser, de car&aacute;cter musical, vigilados por la familia. Mabel le daba sus cartas a Jane (su hermana peque&ntilde;a) para que &eacute;sta se las diese a Arthur (quedaban en el and&eacute;n de la New Street Station de Birmingham, ciudad donde resid&iacute;an ambas familias). En las reuniones musicales de las hermanas de Arthur, tocaban el piano, que era de la marca "Tolkien"; firma que hac&iacute;a tiempo hab&iacute;a gozado de bastante prestigio, aunque en aquella &eacute;poca hab&iacute;a llegado a manos de Arthur en tal estado de bancarrota que tuvo que trabajar en el Lloyds Bank, su sueldo no era una gran maravilla y no hubiese podido mantener con &eacute;l a toda una familia. Y puesto que en las oficinas de Birmingham no ascend&iacute;a con rapidez, un a&ntilde;o m&aacute;s tarde de la proposici&oacute;n de matrimonio se las arregl&oacute; para conseguir un puesto en el 'Bank of Africa'. Durante el a&ntilde;o siguiente no par&oacute; de viajar (Capetown, Johannesburg...) y despu&eacute;s de no pocos esfuerzos logr&oacute; ser nombrado gerente de la importante sucursal en Bloemfontein (capital del Estado Libre de Orange) en 1890; se le dio una casa y un buen sueldo, por lo que al fin el matrimonio parec&iacute;a ser posible.</P>
<P ALIGN="JUSTIFY">Algo despu&eacute;s de su 21º cumplea&ntilde;os, Mabel fue a Sud&aacute;frica en barco, con el matrimonio bendecido por su padre. El viaje dur&oacute; 3 semanas, el barco lleg&oacute; a Ciudad de El Cabo a principios de abril. Se casaron en la catedral de esta ciudad el 16 de abril de 1891 y pasaron la luna de miel en Sea Point, y despu&eacute;s de un viaje de m&aacute;s de 1000 Km llegaron a Bloemfontein.</P>
<P ALIGN="JUSTIFY">Bloemfotein exist&iacute;a desde hac&iacute;a 45 a&ntilde;os y en aquellos tiempos no era m&aacute;s grande que lo hoy d&iacute;a consideramos un pueblo peque&ntilde;o. El edificio del Bank of Africa inclu&iacute;a una casa y un jard&iacute;n, la casa ten&iacute;a criados (mayoritariamente negros o mestizos, aunque tambi&eacute;n hab&iacute;a alg&uacute;n inmigrante blanco). Mabel disfrutaba de bastante tiempo libre (cabe destacar que iba a clases de holand&eacute;s pues era la lengua oficial en la que se escrib&iacute;an los documentos importantes en aquel pa&iacute;s), sin embargo Arthur ten&iacute;a bastante trabajo, ya que tambi&eacute;n hab&iacute;a all&iacute; otro banco que le hac&iacute;a la competencia (el 'Banco Nacional del Estado Libre de Orange', que _estaba dirigido por el antiguo gerente del suyo).</P>
<P ALIGN="JUSTIFY">Poco despu&eacute;s, Mabel qued&oacute; embarazada y tuvo un hijo; &eacute;ste fue bautizado el 31 de enero de 1892 en la catedral de Bloemfontein con el nombre de John Ronald Ruelen Tolkien. Es de destacar cierta an&eacute;cdota que le sucedi&oacute; poco despu&eacute;s de comenzar a caminar, cuando una tar&aacute;ntula le pic&oacute; (afortunadamente una criada le salv&oacute; a tiempo); qui&eacute;n sabe si ese hecho influy&oacute; m&aacute;s tarde al escribir sus obras.</P>
<P ALIGN="JUSTIFY">En aquellas tierras el clima era muy extremo. A Arthur le iba bastante bien (pues su salud no era muy buena) y tambi&eacute;n a Hillary (el hermano peque&ntilde;o de John), pero a John y a su madre no les favorec&iacute;a mucho. John empez&oacute; a empeorar, y su madre, su hermano y &eacute;l fueron a la costa de vacaciones, en noviembre de 1894 (a cientos de Kms), para que se mejorase. Una vez regresaron a Bloemfontein, comenzaron a hacer los preparativos para el viaje a Inglaterra. Arthur no pudo ir debido al trabajo (ninguno de ellos sab&iacute;a que ser&iacute;a un viaje sin retorno).</P>
<P ALIGN="JUSTIFY">El S.S. Guelp zarp&oacute; con ellos de Sud&aacute;frica a Southampton (donde los esperaba Jane) y de all&iacute; fueron a Birmingham en donde eran esperados por los padres de Mabel. Durante la primavera y parte del verano la salud de John mejor&oacute; sensiblemente.</P>
<P ALIGN="JUSTIFY">No mucho despu&eacute;s, les lleg&oacute; la noticia de que Arthur hab&iacute;a contra&iacute;do la fiebre reum&aacute;tica, de tal manera que le ser&iacute;a imposible ir a celebrar la Navidad a Inglaterra (debido al clima). Cuando en enero se supo que Arthur no estaba repuesto, se hicieron los preparativos para volver a Bloemfontein y cuidarle. Sin embargo, jam&aacute;s llegaron a hacer dicho viaje, pues les lleg&oacute; un telegrama diciendo que Arthur hab&iacute;a tenido una hemorragia, y un d&iacute;a despu&eacute;s (el 15 de febrero de 1896) Arthur muri&oacute;. Su cuerpo fue enterrado en el cementerio anglicano de Bloemfontein.</P>
<P ALIGN="JUSTIFY">Mabel comprendi&oacute; que no pod&iacute;a quedarse para siempre en la casa de sus padres, y con lo poco que pudieron ahorrar Arthur y ella empez&oacute; a buscar un nuevo hogar. Tambi&eacute;n ten&iacute;a el problema de la educaci&oacute;n de sus hijos (durante los primeros a&ntilde;os ella podr&iacute;a ocuparse ya que dominaba el lat&iacute;n, el franc&eacute;s, y el alem&aacute;n), pues cuando alcanzasen la edad suficiente quer&iacute;a que entrasen en el King Edward's School de Birmingham (que era la mejor escuela de esa ciudad).</P>
<P ALIGN="JUSTIFY">Resulta bastante curiosa la historia del apellido 'Tolkien', al parecer el apellido original de la familia (por parte de su padre) era Von Hohenzollern (por provenir del distrito Hohenzollern del antiguo Imperio Romano); un antepasado de &eacute;stos llamado George von Hohenzollern hab&iacute;a luchado junto al archiduque Fernando de Austria durante el sitio de Viena (en 1529), conduciendo una invasi&oacute;n contra los turcos, y cogi&oacute; el estandarte del sult&aacute;n. Debido a ello le dieron el sobrenombre de Tollk&uuml;hn (que en espa&ntilde;ol significa temerario). Despu&eacute;s de algunas generaciones, la familia mantuvo relaciones con la nobleza francesa, y su apodo se "afrances&oacute;", dando lugar a 'du T&eacute;m&eacute;raire'; no se sabe muy bien cu&aacute;ndo llegaron a Inglaterra, aunque se cree que debi&oacute; ser en torno a 1756, escapando de la invasi&oacute;n prusiana a Sajonia, lugar en el que pose&iacute;an tierras. Posteriormente, la familia se dedic&oacute; a la fabricaci&oacute;n de relojes y pianos, campo en el que alcanz&oacute; cierto renombre. Al parecer la familia por parte de su madre proced&iacute;a de Wocershire (en donde hab&iacute;a vivido durante much&iacute;simas generaciones).</P>
<P ALIGN="JUSTIFY">Al fin, en el verano de 1896, Mabel encontr&oacute; un alojamiento bastante econ&oacute;mico (en alquiler) en la aldea de Sarehole (a unos 2 km de la ciudad); en aquella &eacute;poca Hillary contaba con 2 a&ntilde;os y pico y John con 5, la aldea no era muy grande y el hecho de que los ni&ntilde;os de aquella zona hablasen un dialecto un tanto extra&ntilde;o hizo que no les fuese f&aacute;cil relacionarse con los ni&ntilde;os de los alrededores.</P>
<P ALIGN="JUSTIFY">Muy pronto Mabel les comenz&oacute; a ense&ntilde;ar, a los 4 a&ntilde;os John ya sab&iacute;a leer y pronto supo escribir perfectamente; ya desde un principio John se sinti&oacute; atra&iacute;do por los idiomas: a muy corta edad comenz&oacute; a aprender tambi&eacute;n el lat&iacute;n.</P>
<P ALIGN="JUSTIFY">Si bien es cierto que Mabel era anglicana, al igual que su familia y la de Arthur, e iban los domingos a una iglesia anglicana, en la primavera de 1900, decidi&oacute; con su hermana (May Inclendon) convertirse al catolicismo; esto trajo como consecuencia que el marido de May se enfadase much&iacute;simo con ellas y que ambas familias (tanto la de Mabel como la de Arthur) dejasen de ayudar econ&oacute;micamente a la viuda.</P>
<P ALIGN="JUSTIFY">No mucho despu&eacute;s, John alcanz&oacute; la edad suficiente e hizo el examen de ingreso para el King Edward's (en 1899), pero no fue admitido hasta el a&ntilde;o siguiente. La escuela estaba situada en el centro de Birmingham a 6 Km de Sarahole y John ten&iacute;a que ir a pie: debido a ello Mabel alquil&oacute; una casa en Hoseley (a finales de 1900), m&aacute;s c&eacute;ntrica y en el trayecto del tranv&iacute;a. El colegio se pod&iacute;a ver desde la estaci&oacute;n de tren, era de estilo g&oacute;tico victoriano de Barry, y hab&iacute;a sido fundada por Eduardo VI, el padre de John hab&iacute;a estudiado all&iacute;. Durante parte del primer curso, John no pudo ir, ya que estuvo enfermo, y pronto tuvieron que cambiar de nuevo de casa, pues la que viv&iacute;an iba a ser demolida, de tal manera que Mabel acab&oacute; alquilando otra (cerca de la de sus padres, aunque a decir verdad la elecci&oacute;n parece que fue debida m&aacute;s que otra cosa a que se encontraba cerca de la iglesia cat&oacute;lica de St. Dunson), a 1 Km de la anterior. A Mabel no pareci&oacute; gustarle demasiado la iglesia a la que iban, as&iacute; que comenzaron a ir al Oratorio de Birmingham (una gran iglesia en el suburbio de Edgbaston, atendida por un grupo de sacerdotes a cuya direcci&oacute;n estaba la escuela de St. Philip) y como al parecer hab&iacute;a una casa vac&iacute;a y en alquiler, decidieron mudarse all&iacute; a principios de 1902.</P>
<P ALIGN="JUSTIFY">El Oratorio hab&iacute;a sido fundado en 1849 por John Henry Newman, el cual hab&iacute;a muerto all&iacute; en 1890. Hac&iacute;a poco tiempo que Francis Xavier Morgan hab&iacute;a comenzado a ejercer como p&aacute;rroco (es de destacar que sin su ayuda Mabel y sus hijos no hubiesen durado mucho). En seguida John fue el primero en el colegio y Mabel tuvo que volver a ocuparse de su educaci&oacute;n (con bastante &eacute;xito), de tal manera que John consigui&oacute; una beca de la Fundaci&oacute;n para la King Edward's. Cuando volvi&oacute; a &eacute;sta, fue puesto directamente en el 6º curso y comenz&oacute; a aprender griego. El profesor que se lo ense&ntilde;aba se llamaba George Brewerton, y prefer&iacute;a que le hablasen en ingl&eacute;s antiguo en vez del normal. El nuevo a&ntilde;o no empez&oacute; muy bien, John y Hillary tuvieron sarampi&oacute;n, tos convulsa y neumon&iacute;a, y para colmo de males Mabel estuvo en abril ingresada en el hospital con diabetes, de tal manera que Hillary se qued&oacute; con los padres de Mabel y John con Jane y su marido. En aquella &eacute;poca todav&iacute;a no se conoc&iacute;a el tratamiento de la diabetes con la insulina, y el estado de Mabel era realmente lamentable, as&iacute; pues el padre Francis le ofreci&oacute; que fuese con los ni&ntilde;os a la modesta casa de campo que ten&iacute;an los sacerdotes y donde hab&iacute;a un cottage, en el cual viv&iacute;an el cartero y su mujer, quienes les pod&iacute;an dejar una habitaci&oacute;n (y de esta manera al descansar all&iacute; mejorase su salud). As&iacute; pues, a finales de junio de 1904 Mabel y los ni&ntilde;os fueron a pasar las vacaciones de verano a Readnal, y el padre Francis los visitaba a menudo. En septiembre volvieron a empezar las clases, John iba a una estaci&oacute;n a 2 Km, de tal manera que regresaba bastante tarde a casa. La salud de Mabel volvi&oacute; a empeorar (sin que sus hijos se enterasen), y a principios de octubre tuvo una gran reca&iacute;da. El 14 de noviembre, ap
enas una semana m&aacute;s tarde, muri&oacute;.</P>
<P ALIGN="JUSTIFY">La muerte de su madre convirti&oacute; a John en una persona pesimista, y continu&oacute; con todos sus esfuerzos en el estudio de las lenguas. Mabel fue enterrada en el cementerio cat&oacute;lico de Bromsgrave, en Rednal, y sobre su tumba el padre Francis puso una cruz de piedra igual a la de los sacerdotes del Oratorio. En su testamento Mabel confiaba la tutela de sus hijos al padre Francis (fue como se vio m&aacute;s tarde una elecci&oacute;n muy acertada), y dejaba a John y a Hillary 800 libras, pero el padre Francis - que hab&iacute;a heredado de su padre una bodega - aument&oacute; en secreto ese dinero para que no les faltase de nada.</P>
<P ALIGN="JUSTIFY">Ahora que Mabel hab&iacute;a muerto, el padre Francis tuvo que buscarles una casa (ya que si les dejaba con sus familiares, &eacute;stos les apartar&iacute;an de la Iglesia Cat&oacute;lica); por suerte, encontraron una t&iacute;a pol&iacute;tica - llamada Beatrice Suffield - que viv&iacute;a bastante cerca del Oratorio y que no ten&iacute;a puntos de vista acerca de temas religiosos, as&iacute; que se mudaron all&iacute; y ocuparon el dormitorio del piso de arriba. John odiaba ver cientos de techos y chimeneas de f&aacute;bricas desde la ventana de su habitaci&oacute;n. Como la muerte de su madre hab&iacute;a sido el motivo por el que "perdi&oacute;" el campo y el aire libre, lleg&oacute; a asociarlos con ella, e idealizarlos (es bastante probable que esta sea la raz&oacute;n por la que sus obras y textos est&aacute;n siempre rodeados de naturaleza).</P>
<P ALIGN="JUSTIFY">La t&iacute;a Beatrice les dio alojamiento y comida, pero no fue excesivamente cari&ntilde;osa con ellos (pues estaba bastante deca&iacute;da al haber perdido a su marido poco tiempo atr&aacute;s) y fue poco compresiva. Por suerte, el Oratorio estaba casi al lado (y &eacute;ste fue su verdadero hogar). Por la ma&ntilde;ana temprano iban a misa, desayunaban en el refectorio y despu&eacute;s de jugar un poco iban a la escuela (a veces en autob&uacute;s tirado por caballos). En aquella &eacute;poca Hillary ya hab&iacute;a aprobado el examen de ingreso a la King Edward's.</P>
<P ALIGN="JUSTIFY">John tuvo muchos amigos en la escuela, el mejor fue Christopher Wiseman, hijo de un ministro wesleyano y un a&ntilde;o menor que John, ambos adoraban el lat&iacute;n, el griego y el rugby, y eran los alumnos m&aacute;s aventajados de su clase.</P>
<P ALIGN="JUSTIFY">Poco antes de que John cumpliese los 16 a&ntilde;os, entraron en la "Senior Class" (la 1ª clase), que se encontraba bajo la "atenta mirada" de Cary Gilson (un destacado cient&iacute;fico, inventor y magnifico profesor de lenguas cl&aacute;sicas), quien empez&oacute; a desarrollar el inter&eacute;s de John por el lenguaje. Una cosa era saber idiomas y otra bien distinta es saber por qu&eacute; son c&oacute;mo son; John hab&iacute;a empezado a estudiar filolog&iacute;a y una nueva lengua: el anglosaj&oacute;n (del que ley&oacute; libros, prestados, de George Brewerton). &Eacute;sta era la lengua que hablaban los ingleses antes de que los normandos invadiern Inglaterra, y John avanz&oacute; r&aacute;pidamente en su estudio, desde el libro de texto de George Brewerton, al gran poema Beowulf.</P>
<P ALIGN="JUSTIFY">Luego, volvi&oacute; al ingl&eacute;s medio, del que quer&iacute;a conocer el dialecto que hablaron sus antepasados en West Midland, y ley&oacute; muchos libros como Sir Gawain and the Green Knight o Pearl) y m&aacute;s tarde se dedic&oacute; al noruego antiguo.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Hay ni&ntilde;os que inventan lenguajes rudimentarios, y John no fue menos en este campo: durante su ni&ntilde;ez, junto con 2 de sus primas, inventaron el 'animalico' y el 'nevbosh', pero cuando fue avanzando decidi&oacute; intentar hacer un lenguaje m&aacute;s serio, completo y bien organizado: de esta propuesta nacieron el 'Naffarin' (con una fuerte influencia del espa&ntilde;ol) y otro basado en el g&oacute;tico. en aquella &eacute;poca estaba estudiando egipcio y sus jerogl&iacute;ficos.</P>
<P ALIGN="JUSTIFY">El padre Francis llevaba a John y a Hillary a Lyme Regis, donde se albergaban en el Tree Cups Hotel. El padre hablaba mucho con ellos en esa &eacute;poca, y durante una de esas vacaciones se dio cuenta de que no eran felices en la casa de la t&iacute;a Beatrice. Empez&oacute; a buscar algo mejor y pens&oacute; en la se&ntilde;ora Faulkner, quien ten&iacute;a una casa detr&aacute;s del oratorio en la que alquilaba habitaciones, y por la noche ofrec&iacute;a veladas musicales a las que iban algunos sacerdotes. La se&ntilde;ora Faulkner acept&oacute;, y a principios de 1908 los 2 hermanos se trasladaron a esta casa.</P>
<P ALIGN="JUSTIFY">Era casa cubierta de enredaderas, bastante sombr&iacute;a. John y Hillary viv&iacute;an en el 2º piso y entre las personas que all&iacute; viv&iacute;an estaba Edith Bratt, una muchacha delgada, de ojos grises, rasgos firmes y claros, pelo negro y corto, hu&eacute;rfana, nacida en Gloucester en 1889, y que viv&iacute;a en el cuarto situado bajo el de los Tolkien y dedicaba casi todo su tiempo a coser en la maquina (hubiera podido llegar a ser profesora de piano de no haber sido por su tutor, y tambi&eacute;n hab&iacute;a heredado algunas tierras en Birmingham). Pronto John y Hillary se hicieron amigos de Edith. Aunque Edith era 3 a&ntilde;os mayor que John, &eacute;ste era muy maduro y a su lado parec&iacute;a mayor. Los tres decidieron 'aliarse' contra la 'Vieja' (as&iacute; era como llamaban a la se&ntilde;ora Faulkner): Edith convenc&iacute;a a la criada para sustraer comida para los hambrientos hermanos, y cuando la 'Vieja' sal&iacute;a hac&iacute;an, fiestas secretas en el cuarto de Edith.</P>
<P ALIGN="JUSTIFY">John y Edith sal&iacute;an a tomar t&eacute;s, se enamoraron, y sol&iacute;an hablar por las ventanas de sus cuartos. Durante esta &eacute;poca se supone que John deb&iacute;a esforzarse para conseguir una beca en Oxford, pero le era dif&iacute;cil con media mente ocupada por los lenguajes inventados y la otra mitad por Edith, y por si fuera poco tambi&eacute;n estaba muy ocupado con la Sociedad de Debates, en la que dio muchos discursos (en lat&iacute;n, griego, g&oacute;tico y anglosaj&oacute;n).</P>
<P ALIGN="JUSTIFY">Cuando el padre Francis hizo una peque&ntilde;a investigaci&oacute;n, vio que John no rend&iacute;a todo lo que pod&iacute;a, y que sal&iacute;a con una chica mayor que &eacute;l, y secretamente pidi&oacute; a John que no la volviese a ver (s&oacute;lo una vez para despedirse), ni que la escribiese mientras &eacute;l siguiese siendo su tutor, y cambi&oacute; de alojamiento a John y a Hillary. La competencia para las becas de Oxford era dur&iacute;sima y John fall&oacute; el primer intento de conseguir una.</P>
<P ALIGN="JUSTIFY">John odiaba enga&ntilde;ar a su tutor, pero Edith y &eacute;l se vieron unas pocas veces antes de que ella se fuera a Cheltenham el 2 de marzo de ese mismo a&ntilde;o. No podr&iacute;an verse hasta que John cumpliese 21 a&ntilde;os y el padre Francis dejase de ser su tutor (quedaban 3 largos a&ntilde;os).</P>
<P ALIGN="JUSTIFY">Durante las semanas siguientes a la partida de Edith, John estuvo enfermo y deprimido. En Pascua, John pidi&oacute; permiso al padre Francis para escribir a Edith, y &eacute;ste se lo dio, aunque no de muy buena gana. Edith estaba en la casa de sus "t&iacute;os" (que en realidad no eran parientes, pero como si lo fueran), y tambi&eacute;n tocaba el piano en una iglesia anglicana... Para John, la escuela se convirti&oacute; en el centro de su vida durante estos 3 a&ntilde;os. La biblioteca de King Edward's estaba a cargo de un profesor adjunto y de un grupo de estudiantes Senior (a los que se les daba el t&iacute;tulo de bibliotecarios), y en 1911 estaban - entre otros - John, C. Wiseman y R.Q. Gilson (el hijo del rector); &eacute;stos tres chicos formaron un peque&ntilde;o grupo amistoso llamado Tea Club.</P>
<P ALIGN="JUSTIFY">La historia de la 'T.C.B.S.' comenz&oacute; cuando Wiseman (editor del School Chronicle) tuvo que publicar una lista de alumnos con distinciones en la que puso "Adem&aacute;s, miembros del T.C.B.S., etc." su significado fue un misterio durante una semana, a los tres les gustaban la literatura griega y latina. John recitaba trozos de Beowulf, Pearl, Sir Gwain and the Green Knight, o narraba terribles episodios de la V&ouml;lsunagasaga n&oacute;rdica, burlas a Wagner...</P>
<P ALIGN="JUSTIFY">Algo m&aacute;s tarde entr&oacute; un nuevo miembro, Geoffrey Bache Smith, un a&ntilde;o m&aacute;s joven que Gilson y casi tres m&aacute;s que John; le consideraban "el ingenio de Midland" y era bastante buen poeta y conocedor de la literatura inglesa.</P>
<P ALIGN="JUSTIFY">S&oacute;lo dos profesores ense&ntilde;aban con seriedad la literatura inglesa (C. Brewerton y R.W. Reynolds). John no escribi&oacute; mucha poes&iacute;a y no era muy buena (al menos en est&aacute; &eacute;poca). Su preocupaci&oacute;n fue en 1910 trabajar duramente para el 2º intento de la beca de Oxford, y el 17 de noviembre de 1910 obtuvo la beca Open Classical Exhibition para Exeter College, que eran 60 libras anuales. Con &eacute;sta, la beca de fin de curso del King Edward's, y la ayuda del padre Francis, pudo ir a Oxford.</P>
<P ALIGN="JUSTIFY">Era secretario de la sociedad de Debates y de Rugby. Descubri&oacute; el Karevala fin&eacute;s en la traducci&oacute;n de W.H. Kirby y decidi&oacute; encontrar un original lo antes posible. El curso de verano de 1911 fue el &uacute;ltimo que pas&oacute; en King Edward's School, y acab&oacute; con una obra teatral griega, La paz de Arist&oacute;fanes en la que John hizo de Hermes, y finalmente se cant&oacute; el himno nacional griego (costumbre en la King's Edward's).</P>
<P ALIGN="JUSTIFY">En las vacaciones fue a Suiza, con su hermana Hillary, y John estuvo a punto de morir. Entre las postales que compr&oacute; hab&iacute;a una reproducci&oacute;n de una pintura del artista alem&aacute;n J. Madelener, que se llamaba Der Berggeist (el esp&iacute;ritu de la monta&ntilde;a) y en ella se ve a un anciano con una barba blanca, sombrero redondo de ala ancha, que est&aacute; hablando con un fauno blanco: John la guard&oacute; con bastante cuidado, y a&ntilde;os m&aacute;s tarde escribi&oacute; en el sobre donde la guardaba: "origen de Gandalf".</P>
<P ALIGN="JUSTIFY">Volvi&oacute; a principios de septiembre y a la segunda semana de octubre su antiguo profesor D. Reynolds lo llev&oacute; a Oxford en su coche.</P>
<B><P ALIGN="JUSTIFY">La llegada de J.R.R. Tolkien a Oxford</P>
</B><P ALIGN="JUSTIFY">Era una ciudad maravillosa, su "college" no era el mejor, pero estaba bastante bien. Entre los estudiantes sin grado acad&eacute;mico hab&iacute;a dos clases bien diferenciadas: los estudiantes pertenecientes a las clases aristocr&aacute;ticas, y los llamados "poor scholar". A estos &uacute;ltimos pertenec&iacute;a John. No eran pobres, como pueda entenderse del nombre, sino que simplemente necesitaban de las becas para poder estar en Oxford. Las cosas en Oxford eran bastante caras y a John se le acababa el dinero r&aacute;pidamente, jugaba al rugby, y se asoci&oacute; al Club de Ensayos y a la Sociedad Dial&eacute;ctica de la Universidad. Tambi&eacute;n particip&oacute; en la sociedad de Debates (llamada "Stapeldon") y cre&oacute; su propio club (llamado "Apolausticks", traducido vendr&iacute;a a decir "los devotos de la indulgencia"). A partir de esta &eacute;poca comenz&oacute; a fumar en pipa.</P>
<P ALIGN="JUSTIFY">Los estudiantes de ambos sexos viv&iacute;an en "colleges" separados. John se hab&iacute;a vuelto perezoso y vago, le aburr&iacute;a el griego y el lat&iacute;n, le gustaban m&aacute;s las lenguas germ&aacute;nicas, y su clase preferida era la de Filolog&iacute;a Comparada que le daba J. Wright. &Eacute;ste era bastante exigente (precisamente lo que necesitaba John), y le aconsej&oacute; que estudiase Gal&eacute;s medieval, un idioma que encontr&oacute; John</P>
<P ALIGN="JUSTIFY">verdaderamente interesante. Durante sus primeras vacaciones visit&oacute; a los otros miembros de la</P>
<P ALIGN="JUSTIFY">"T.C.B.S.", e interpretaron Los rivales de Sheridan, para lo que R.Q. Gilson consigui&oacute; el permiso del rector (su padre).</P>
<P ALIGN="JUSTIFY">En las vacaciones de 1912, John pas&oacute; dos semanas en el King Edward's Horse (el regimiento territorial de caballer&iacute;a donde se acababa de enrolar). Despu&eacute;s de ese tiempo renunci&oacute; al regimiento, y el resto de las vacaciones las pas&oacute; recorriendo a pie Berkshire. Iba varias veces a la semana y recordando que no hab&iacute;a ido casi a misa durante su estancia en Oxford, intent&oacute; corregirse. Aprendi&oacute; mucho fin&eacute;s, aparte del que ya sab&iacute;a cuando ley&oacute; el Karevala original, dejo su lenguaje inventado de influencia g&oacute;tica, y empez&oacute; a crear uno influenciado por el fin&eacute;s, que luego se llamar&iacute;a "Quenya" o "Alto elfo": esto no pasar&iacute;a hasta dentro de muchos a&ntilde;os, pero la semilla ya brotaba en su mente.</P>
<P ALIGN="JUSTIFY">En la Navidad de 1912 estuvo en Bart Green, cerca de Birmingham, con los Incledon, sus t&iacute;os. Esta familia sol&iacute;a animar sus fiestas con algo de teatro, y ese a&ntilde;o la obra representada fue escrita por John, quien el represent&oacute; el papel principal. Unos d&iacute;as despu&eacute;s John cumpli&oacute; los 21 a&ntilde;os y escribi&oacute; a Edith, renovando su declaraci&oacute;n de amor, pero ella le contest&oacute; que se hab&iacute;a prometido con George Field.</P>
<P ALIGN="JUSTIFY">John pod&iacute;a haber roto la carta y haberse olvidado de ella, pero eso era imposible: en los &uacute;ltimos tres a&ntilde;os Edith hab&iacute;a sido su ideal, su inspiraci&oacute;n, y su amor hab&iacute;a crecido en secreto. A John s&oacute;lo se le ocurri&oacute; una cosa: ir a Cheltenham, pedirle que rompiera con George Field y que se casara con &eacute;l. Estaba seguro de que Edith aceptar&iacute;a, ya que en la carta dec&iacute;a que se hab&iacute;a comprometido con George por lo amable que hab&iacute;a sido y porque dudaba de que John volviese por ella.</P>
<P ALIGN="JUSTIFY">El 8 de enero de 1913 John fue a Cheltenham en tren, y Edith le esperaba en la estaci&oacute;n. Ese mismo d&iacute;a, despu&eacute;s de un paseo por el campo, Edith decidi&oacute; dejar a George y casarse con John, pero no lo anunciaron (por la posible reacci&oacute;n familiar). John volvi&oacute; a Oxford mucho m&aacute;s animado.</P>
<P ALIGN="JUSTIFY">Lo primero que hizo, al llegar fue escribir una carta al padre Francis. Su respuesta no fue excesivamente alegre, porque aunque ya no era su tutor, le segu&iacute;a ayudando econ&oacute;micamente, y por eso era necesario que aprobara el matrimonio.</P>
<P ALIGN="JUSTIFY">Ahora John deber&iacute;a estudiar mucho, ya que el primero de los dos ex&aacute;menes que deber&iacute;a aprobar para obtener su grado en Cl&aacute;sicas (el "Honour Moderation"), comprend&iacute;a una cantidad de textos escritos sobre varios aspectos del tema del candidato, y la calificaci&oacute;n pod&iacute;a ir desde una primera clase (la mejor) hasta una cuarta clase. Hoy d&iacute;a el titulo de primera clase equivale (en Oxford y en Cambridge) a un "magna cum laude", el de segunda clase a un notable de media. No ten&iacute;a las materias preparadas cuando empezaron os ex&aacute;menes a finales de febrero, por lo que sac&oacute; un "segunda clase", aunque consigui&oacute; un "Alfa puro" (un trabajo sin errores) en Filolog&iacute;a comparada. A John le gustaba m&aacute;s el ingl&eacute;s antiguo y medio y las leguas germ&aacute;nicas; el doctor Farnell lo sab&iacute;a y le propuso que se cambiara a la Escuela de Ingl&eacute;s. En la "Honour School English Language and Literature" John se especializ&oacute; en estudios ling&uuml;&iacute;sticos, y tuvo que esforzarse bastante.</P>
<P ALIGN="JUSTIFY">En el futuro matrimonio de John hab&iacute;a un problema bastante espinoso: Edith era anglicana y su familia era violentamente anticat&oacute;lica, pero al final Edith se convirti&oacute; al catolicismo, con el consiguiente enfado por parte de sus t&iacute;os, quienes la expulsaron de casa. Ella y su prima Jennie fueron a Warwick, donde encontraron un alojamiento temporal. John se reuni&oacute; con ellas en junio de 1913, y algo despu&eacute;s encontraron un alojamiento estable cerca de all&iacute;. Aunque ambos hab&iacute;an crecido y alejado un poco, pronto se volvieron a unir fuertemente.</P>
<P ALIGN="JUSTIFY">En el oto&ntilde;o de 1913 G.B. Smith lleg&oacute; a Oxford como becario. La C.T.B.S. se encontraba ahora repartida igualitariamente entre Oxford y Cambridge. Ninguno de los amigos de John conoc&iacute;a la existencia de Edith, quien se convirti&oacute; al catolicismo el 8 de enero de 1914 (fecha del primer aniversario de su reencuentro), y poco despu&eacute;s John y Edith se comprometieron oficialmente.</P>
<P ALIGN="JUSTIFY">A Edith le gustaba ir a misa, pero su mala salud no le permit&iacute;a ayunar hasta despu&eacute;s de tomar la comuni&oacute;n, y su vida cuando no estaba John era bastante mon&oacute;tona. John, por su parte se estaba volviendo demasiado "elegante", cre&oacute; un nuevo club, "Chequers", y fue elegido presidente de la sociedad de Debates del "college" (una instituci&oacute;n de bastante influencia en Exeter). Jugaba al tenis, y estudiaba (gan&oacute; el premio Steak de Ingl&eacute;s).</P>
<P ALIGN="JUSTIFY">En el verano de 1914, despu&eacute;s de visitar a Edith, su percepci&oacute;n de paisajes se desarroll&oacute; mucho en Comwall, en la pen&iacute;nsula de Lizard, donde pas&oacute; unas largas vacaciones junto al padre Vincent (del Oratorio de Birmingham), despu&eacute;s de esto fue a pasar unos d&iacute;as en la granja de su t&iacute;a Jane con su hermano Hillary.</P>
<B><P ALIGN="JUSTIFY">La Primera Guerra Mundial</P>
</B><P ALIGN="JUSTIFY">A finales de verano Inglaterra ya hab&iacute;a declarado la guerra a Alemania, y los j&oacute;venes se alistaban por millares (su hermano Hillary se hab&iacute;a alistado como corneta), pero John quer&iacute;a quedarse en Oxford hasta graduarse y ten&iacute;a esperanzas de sacar notas de primera clase. En Oxford, de los pocos estudiantes que quedaban, s&oacute;lo conoc&iacute;a a C. Cullis, que se hab&iacute;a quedado debido a su mala salud; John se alegr&oacute; mucho cuando descubri&oacute; un programa que permit&iacute;a entrenarse para el ej&eacute;rcito sin dejar los estudios y que retrasaba su llamamiento a filas para despu&eacute;s de la graduaci&oacute;n, y tambi&eacute;n se alegr&oacute; cuando vio que su amigo G.B. Smith se encontraba en su mismo grupo. Ambos recibieron la instrucci&oacute;n en el "Officers Training Corps", situado en los parques de la Universidad). Su entusiasmo por Morris le inspir&oacute; a adaptar una historia del Kalevala fin&eacute;s al estilo de Morris, y eligi&oacute; la de Kullervo, que m&aacute;s tarde dar&iacute;a lugar a la historia de Turin, pero su primer ensayo qued&oacute; inacabado. Al empezar las vacaciones de Navidad, John viaj&oacute; a Londres a la nueva casa de C. Wiseman, en Wandsworth, donde se reunieron los miembros del "C.T.B.S."</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de ese fin de semana, John comenz&oacute; a escribir poemas mejores que los anteriores, y especialmente de amor para Edith. A principios de 1915 volvi&oacute; a un poema que hizo sobre Earendel y empez&oacute; a hacer una historia m&aacute;s grande. Aquel lenguaje que invent&oacute; a partir del fin&eacute;s hab&iacute;a llegado en esa &eacute;poca a un nivel de dificultad bastante alto.</P>
<P ALIGN="JUSTIFY">Pas&oacute; el tiempo, y sus poemas eran ya muchos, una buena parte de ellos trataban acerca de Earendel, Valinor, la Tierra Media... y algunos de ellos estaban escritos en Quenya (se cree que por estas fechas debi&oacute; de nacer el Silmarillion). John ya se hab&iacute;a preparado para los "Schools" (los ex&aacute;menes finales de Lengua y Literatura inglesas), que comenzaron la segunda semana de junio de 1915, y consigui&oacute; honores de primera Clase. A partir de aquel momento ya pod&iacute;a tener esperanzas de conseguir un trabajo acad&eacute;mico cuando finalizase la guerra.</P>
<P ALIGN="JUSTIFY">Fue destinado al 13º batall&oacute;n de los Lancashire Fusiliers como subteniente, aunque &eacute;l hubiese preferido ir al 19º batall&oacute;n, donde se encontraba su amigo G.B. Smith. En julio fue a Bedford para iniciar la instrucci&oacute;n, y se le ense&ntilde;o c&oacute;mo instruir a los nuevos reclutas, compr&oacute; a medias con un amigo una motocicleta, y cuando ten&iacute;a permiso los fines de semana iba con ella a ver a Edith.</P>
<P ALIGN="JUSTIFY">En agosto fue trasladado a Stafforshire, y durante muchas semanas su batall&oacute;n fue de un sitio a otro, todo lo cual era bastante inc&oacute;modo, pues es de destacar que su escaso tiempo libre lo dedicaba a leer island&eacute;s. A principios de 1916 decidi&oacute; especializarse en se&ntilde;ales (aprendi&oacute; c&oacute;digo Morse, se&ntilde;alizaci&oacute;n por discos y banderas, utilizaci&oacute;n de bengalas...) y al final fue nombrado oficial de se&ntilde;ales del batall&oacute;n.</P>
<P ALIGN="JUSTIFY">Todo parec&iacute;a indicar que John tendr&iacute;a que ir muy pronto a Francia y &eacute;l y Edith decidieron casarse antes de que partiera (en aquel momento &eacute;l ten&iacute;a 24 a&ntilde;os y ella 27). No ten&iacute;an mucho dinero, pero su sueldo llegaba regularmente por su trabajo en el ej&eacute;rcito, y consiguieron algo de dinero por la publicaci&oacute;n de un poema de John llamado Goblin Feet en el Oxford Poetry, junto con la venta de su parte de la motocicleta; adem&aacute;s el padre Francis les ayud&oacute;.</P>
<P ALIGN="JUSTIFY">Quince d&iacute;as antes de la boda, John confes&oacute; al padre Francis su intenci&oacute;n de casarse con Edith: no se lo hab&iacute;a dicho antes por miedo a que no lo aceptara, pero &eacute;ste les dese&oacute; "felicidad y todas las bendiciones", y quiso ocuparse personalmente de la ceremonia en el Oratorio, pero era ya demasiado tarde, pues se hab&iacute;an hecho los preparativos para celebrarla en Warwick. Se casaron el 22 de marzo de 1916, y despu&eacute;s de la boda fueron en tren a Clevendon (Somerset), donde pasar&iacute;an una semana.</P>
<P ALIGN="JUSTIFY">Cuando volvieron de su luna de miel, Edith fue a Warwick a solucionar ciertos asuntos, pues hab&iacute;an decidido que viviese - en alojamientos alquilados - lo m&aacute;s cerca posible del campamento de su esposo. M&aacute;s tarde, vivir&iacute;a junto a Jennie. Sin embargo nada m&aacute;s instalarse, John recibi&oacute; la orden de ir a Francia en barco el 4 de junio). El "gran empuj&oacute;n" era inminente en el Frente Occidental, que hab&iacute;a resistido grandes y numerosos ataques, como la masacre de Verdoun en 1915, y ahora que ven&iacute;an cientos de miles de reclutas nuevos, era seguro que algo gordo iba a ocurrir. John lleg&oacute; a Calais el 6 de junio, lo llevaron al campamento de base de Etaples, y en el viaje perdi&oacute; todo el equipo (que era muy caro) y tuvo que pedir prestado y comprar nuevos instrumentos; y de all&iacute; fue al 11º batall&oacute;n.</P>
<P ALIGN="JUSTIFY">Los oficiales ten&iacute;an asistentes (parecidos a criados), y de ah&iacute; parece ser que le vino la inspiraci&oacute;n para crear m&aacute;s tarde a Sam Gamgee (o Samsagaz en espa&ntilde;ol), el compa&ntilde;ero de Frodo. Tres semanas m&aacute;s tarde su batall&oacute;n fue al frente, pasaron por Amiens, Rubempre, Bouzincourt... y all&iacute; pudo ver los horrores de la guerra.</P>
<P ALIGN="JUSTIFY">La compa&ntilde;&iacute;a A del 11º batall&oacute;n pas&oacute; al ataque el 6 de julio y la compa&ntilde;&iacute;a B (en la que se encontraba John) el 14 del mismo mes. El lugar de trabajo de John era una mara&ntilde;a de cables, unos tel&eacute;fonos de campo cubiertos de fango, un tel&eacute;grafo (que no pod&iacute;a usarse debido a que los alemanes los ten&iacute;an pinchados), unas banderas y algunas palomas mensajeras. Su primer combate no tuvo &eacute;xito, aunque fue una gran ofensiva, y al volver a Bouzincourt encontr&oacute; en su caba&ntilde;a una carta de G.B. Smith, en la que le comunicaba que Rob Gilson hab&iacute;a muerto. Esta noticia, junto a la de que el propio G.B. Smith fuera v&iacute;ctima de una granada poco despu&eacute;s, dejaron su animo para el arrastre. Poco despu&eacute;s &eacute;l estuvo al borde de la muerte debido a unas fiebres y fue llevado a un hospital cerca de las trincheras; al continuar empeorando le tuvieron que llevar a Inglaterra el 8 de noviembre, donde fue ingresado en el hospital de Birmingham; all&iacute; se reuni&oacute; con Edith, y la tercera semana de diciembre ya hab&iacute;a mejorado sustancialmente.</P>
<P ALIGN="JUSTIFY">John hab&iacute;a meditado acerca de hacer una obra gigantesca, una mitolog&iacute;a completa, ya que Inglaterra no ten&iacute;a ninguna, y alg&uacute;n tiempo despu&eacute;s C. Wiseman le dijo que deber&iacute;a empezar a escribirla. As&iacute; fue m&aacute;s o menos como se gestaron los que m&aacute;s tarde ser&iacute;an denominados "Cuentos Perdidos". La Tierra Media (y Arda en general) no son otro planeta sino el nuestro en un periodo de la antig&uuml;edad totalmente imaginario en el que las formas de los continentes eran distintas. John hizo de esa manera su mitolog&iacute;a porque quer&iacute;a que diese la impresi&oacute;n de ser algo lejana, extra&ntilde;a y a la vez "realista". Durante su enfermedad escribi&oacute; la primera de estas historias: La ca&iacute;da de Gondolin. En 1917 el Quenya ya ten&iacute;a varios cientos de palabras, y proced&iacute;a del Eldar&iacute;n, y de &eacute;ste surgi&oacute; el Sindarin. Tambi&eacute;n cre&oacute; otras lenguas &eacute;lficas, como las lenguas silvianas. Mientras estuvo de permiso por enfermedad Edith le hizo una preciosa copia de La Ca&iacute;da de Gondolin a mano.</P>
<P ALIGN="JUSTIFY">Pero aquella "fiebre de las trincheras", como se la conoc&iacute;a, fue remitiendo, y se le reclam&oacute; a las filas francesas. John tuvo una reca&iacute;da al final de su permiso, mejor&oacute; unas semanas despu&eacute;s, y fue destinado a Yorksea, pero algo despu&eacute;s enferm&oacute; de nuevo y fue llevado al sanatorio de Harrogate, donde estuvo bastante grave. Edith y Jennie se trasladaron a un pueblo cercano. En abril estaba otra vez apto para el ej&eacute;rcito, y fue enviado a un entrenamiento adicional de se&ntilde;ales: si hubiese aprobado el examen hubiese sido nombrado muy probablemente oficial de se&ntilde;ales de Yorkshire (no Yorksea), lo que le hubiese tenido lejos del frente, pero suspendi&oacute;. En julio volvi&oacute; a</P>
<P ALIGN="JUSTIFY">enfermar y en agosto fue internado (en el hospital de Bookland, en Hull), continu&oacute; con sus obras y escribi&oacute; Los hijos de Hurin.</P>
<P ALIGN="JUSTIFY">La comida escaseaba porque los submarinos alemanes hund&iacute;an los barcos ingleses. Edith volvi&oacute; con Jennie a Chelenham para dar a luz en un buen hospital, y el 16 de noviembre de 1917 despu&eacute;s de un parto dif&iacute;cil en el que Edith estuvo en peligro, tuvieron un hijo. John fue dado de alta, pero no consigui&oacute; verles hasta que le dieron un permiso en el campamento y una semana despu&eacute;s le bautiz&oacute; el padre Francis con el nombre de John Francis Reuel (en honor al p&aacute;rroco). Edith y John Francis fueron a Roos, un pueblecito de Yorkshire, cerca del campamento de John, quien hab&iacute;a sido ascendido a teniente y ya era bastante probable que no tuviese que regresar al frente. En la primavera de 1918, fue destinado a Penkridge, uno de los campamentos de Staffordshire, pero inmediatamente fue enviado de regreso a Hull. Edith ya no pod&iacute;a seguir soportando aquella situaci&oacute;n, y se qued&oacute; all&iacute; junto a su hijo y a Jennie. Pero poco despu&eacute;s de llegar volvi&oacute; a recaer, saliendo del hospital en octubre. </P>
<P ALIGN="JUSTIFY">La paz parec&iacute;a cada vez m&aacute;s cercana, y John fue a Oxford para ver si pod&iacute;a encontrar alg&uacute;n puesto econ&oacute;mico, pero la Universidad casi no funcionaba, aunque William Cragie le ofreci&oacute; un puesto como lexic&oacute;grafo. La guerra termin&oacute; el 11 de noviembre, John obtuvo la licencia para quedarse en Oxford (con el fin de terminar su educaci&oacute;n) y encontr&oacute; alojamiento. A finales de 1918, Edith, el ni&ntilde;o, Jennie y &eacute;l se establecieron en Oxford.</P>
<B><P ALIGN="JUSTIFY">De regreso a Oxford</P>
</B><P ALIGN="JUSTIFY">John hab&iacute;a tenido una gran nostalgia de Oxford durante la guerra, y Edith y &eacute;l deb&iacute;an recuperar el tiempo perdido (&eacute;l contaba ya con 27 a&ntilde;os y ella con 30). Fue contratado para trabajar en el New Dictionary (el diccionario de ingl&eacute;s m&aacute;s grande que jam&aacute;s se ha recopilado, que hab&iacute;a sido comenzado en 1878 y del que s&oacute;lo quedaba la parte de la U a la Z), pues mucha de la gente que trabajaba en el proyecto hab&iacute;a muerto en la guerra. Seg&uacute;n el mismo John, en ning&uacute;n otro periodo de su vida aprendi&oacute; m&aacute;s en 2 a&ntilde;os comparado con &eacute;ste. (saj&oacute;n antiguo, holand&eacute;s medio, holand&eacute;s moderno, alto alem&aacute;n antiguo, bajo alem&aacute;n medio, alto alem&aacute;n medio, alem&aacute;n moderno,</P>
<P ALIGN="JUSTIFY">teut&oacute;n antiguo...). Le gustaba su trabajo y fue felicitado numerosas veces, a pesar de que all&iacute; el nivel era alt&iacute;simo. Este trabajo no duraba toda la jornada, pues muchos de los trabajadores eran profesores y ten&iacute;an que dar clase, hab&iacute;a cierta demanda de profesores de anglosaj&oacute;n en los "colleges" femeninos, y puesto que ten&iacute;a la ventaja de estar casado, tuvo pronto otro trabajo.</P>
<P ALIGN="JUSTIFY">No tardaron mucho en poder pagar el alquiler de una casa, e incluso contratar a una criada como cocinera; en la primavera de 1920 John dej&oacute; el trabajo del Diccionario, ya que las clases le daban lo suficiente. Sigui&oacute; escribiendo, y un d&iacute;a en el Club de ensayos del Exeter College ley&oacute; La ca&iacute;da de Gondolin, que gusto mucho a los asistentes (entre los que estaban Nevill Coghill y Hugh Dyson).</P>
<P ALIGN="JUSTIFY">John solicit&oacute; el puesto de 'Lector de Lengua Inglesa de la Universidad de Leeds, sin creer que le fuesen a considerar, pero le hicieron una entrevista en verano de 1920, y le ofrecieron el cargo.</P>
<B><P ALIGN="JUSTIFY">J.R.R. Tolkien en Leeds:</P>
</B><P ALIGN="JUSTIFY">Tuvo dudas de aceptar el cargo, ya que se trataba de una ciudad industrial, llena de humo y holl&iacute;n, y los edificios universitarios no eran tan buenos como los otros. Al principio todo fueron dificultades: en octubre de 1920 Edith dio a luz a otro hijo, al que bautizaron con el nombre de Michael Hillary Reuel, y debido a ello hasta principios de 1921 no pudieron trasladarse a Leeds.</P>
<P ALIGN="JUSTIFY">El departamento de ingl&eacute;s de la Universidad de Leeds era peque&ntilde;o, y estaba dirigido por George Gordon, el cual quer&iacute;a que John organizase un programa "atractivo" para los alumnos y con un buen "entrenamiento filol&oacute;gico".</P>
<P ALIGN="JUSTIFY">John estuvo a punto de dejar Leeds porque consigui&oacute; la nueva c&aacute;tedra "De Beers" Capetown (Sud&aacute;frica), pero no pudo aceptarla debido a que Edith y Michael no estaban en condiciones de viajar. A principios de 1922 public&oacute; un peque&ntilde;o diccionario de ingles medio. &Eacute;l y el reci&eacute;n llegado Eric Valentine Gordon (un canadiense que no ten&iacute;a nada que ver con George Gordon) decidieron hacer una nueva edici&oacute;n de Sir Gawain and the Green Knight adecuada para los universitarios. La public&oacute; el Claredon Press, a principios de 1925, y tambi&eacute;n crearon el "Viking Club" entre los estudiantes, lo que hizo muy populares a estos dos profesores, con lo que unido a lo bien que ense&ntilde;aban, lograron que la secci&oacute;n de Lenguaje del Departamento tuviese muchos m&aacute;s estudiantes.</P>
<P ALIGN="JUSTIFY">Edith se hizo amiga de muchas esposas de profesores, y ahorraban para comprar una casa. Entre la poes&iacute;a que fue publicada en los &uacute;ltimos a&ntilde;os estaban: The Gryphon, Yorkshire Poetry, </P>
<P ALIGN="JUSTIFY">Cuentos y canciones de Bible Bay y La visita de Drag&oacute;n y Glip. En mayo de 1923 John tuvo un grave resfriado, que se convirti&oacute; en neumon&iacute;a. Por aquel tiempo, su abuelo, John Suffield, le visit&oacute;, a sus 90 a&ntilde;os. Cuando John estuvo recuperado de la neumon&iacute;a, Edith, los ni&ntilde;os y &eacute;l fueron a ver a su hermano, que hab&iacute;a comprado un peque&ntilde;o huerto cerca de Evesham, y todos trabajaron en &eacute;l. Por aquella &eacute;poca el Libro de los Cuentos Perdidos estaba casi acabado, pero no lo termin&oacute; nunca, ya que seg&uacute;n C. Wiseman, si terminaba su obra los personajes que all&iacute; "viv&iacute;an", all&iacute; "morir&iacute;an", as&iacute; que se limit&oacute; simplemente a revisar, alterar y pulir lo que ya hab&iacute;a escrito. George Gordon hab&iacute;a vuelto a Oxford como profesor, y la c&aacute;tedra que dej&oacute; estuvo a punto de conseguirla John; sin embargo, el vicerrector prometi&oacute; a John que el nuevo profesorado de lengua inglesa que se iba a crear ser&iacute;a para &eacute;l, as&iacute; pues John fue nombrado profesor a los 32 a&ntilde;os de edad (incre&iacute;blemente joven para los c&aacute;nones de las universidades brit&aacute;nicas). Ese mismo a&ntilde;o (1924) Edith qued&oacute; embarazada y en noviembre tuvo un hijo que fue bautizado con el</P>
<P ALIGN="JUSTIFY">nombre de Christopher Reuel Tolkien, y tambi&eacute;n compraron una casa en las afueras de Leeds, mucho m&aacute;s grande que la anterior y rodeada de campos.</P>
<P ALIGN="JUSTIFY">A principios de 1925 se anunci&oacute; que iba a quedar libre la c&aacute;tedra de Anglosaj&oacute;n de Oxford, y John la consigui&oacute;. Hasta finales del siglo XIX la mayor&iacute;a de los profesores de Oxford eran becados y no se les permit&iacute;a casarse mientras lo fuesen, a comienzos del siglo XX esto cambi&oacute;, y trajo como consecuencia que Oxford se llenase de casas, convirti&eacute;ndose en una "colonia" de acad&eacute;micos, familiares de &eacute;stos y habitantes.</P>
<P ALIGN="JUSTIFY">John y su familia se establecieron en 1926 en una modesta casa nueva, en forma de L, en una calle de North Oxford, y entre 1929 y 1930 compraron la casa del vecino, que era bastante grande. Algo antes de esta mudanza naci&oacute; el &uacute;ltimo hijo de John y Edith, una ni&ntilde;a, que fue bautizada con el nombre de Priscilla Mary Reuel. Despu&eacute;s de esto ya no hubo muchos grandes cambios en la vida de John.</P>
<P ALIGN="JUSTIFY">Para que comprend&aacute;is lo que sol&iacute;a ser un d&iacute;a rutinario de la vida de John, os contar&eacute; un d&iacute;a t&iacute;pico de su vida a principios de los a&ntilde;os 30. En realidad, era dif&iacute;cil que sucediesen tantas cosas en un mismo d&iacute;a, pero da una idea general [¿de verdad queda alguien al otro lado de la pantalla? :-m es verdaderamente fascinante... todav&iacute;a queda un lector sin caerse de sue&ntilde;o :-), &aacute;nimo que en seguida viene lo interesante].</P>
<P ALIGN="JUSTIFY">Es el d&iacute;a de un santo, as&iacute; que John se levanta a las 7 de la ma&ntilde;ana (de mala gana, ya que no le gusta levantarse temprano), despierta a Michael y a Christopher (y casi tropieza con una peque&ntilde;a locomotora que se hab&iacute;an dejado abandonada en el suelo). En esta &eacute;poca John Francis ya ten&iacute;a 14 a&ntilde;os y estudiaba en una escuela cat&oacute;lica, en Brekshire; John se viste con unos pantalones de franela y chaqueta de tweed (entre otras cosas). &Eacute;l y sus hijos van en bicicleta hasta la iglesia cat&oacute;lica de St. Aloysius (a un kil&oacute;metro y pico), la misa es a las 7:30, llegan tarde a casa para tomar el desayuno (que se sol&iacute;a tomar a las 8:00), y Phoebe Coles, la doncella o criada que lleva trabajando all&iacute; dos a&ntilde;os, acaba de entrar y ya se la oye haciendo ruido con la vajilla.</P>
<P ALIGN="JUSTIFY">Durante el desayuno John ojea el peri&oacute;dico y hace alg&uacute;n crucigrama, cuando termina va a su estudio, enciende la estufa, ya que no tiene calefacci&oacute;n central (hace un d&iacute;a fr&iacute;o y quiere tener "habitable" la habitaci&oacute;n para cuando llegue una alumna a las 9), ordena sus notas, limpia las cenizas de la estufa (el d&iacute;a anterior se hab&iacute;a quedado hasta muy tarde trabajando) enciende el fuego, echa carb&oacute;n y va r&aacute;pidamente a afeitarse (pues el tiempo se le echa encima), los ni&ntilde;os se van a la escuela; a&uacute;n no ha terminado de afeitarse cuando suena una campanilla, es el cartero, Edith le dice a John que baje y le avisa de que sale humo del despacho, John va corriendo y echa agua a las llamas (que ten&iacute;an ganas de salir de la estufa), da las gracias al cartero y habla un poco con &eacute;l, cuando empieza a abrir las cartas se da cuenta de que a&uacute;n no hab&iacute;a terminado de afeitarse, consigue (por los pelos) estar presentable cuando llega su alumna. A las 9:10 ya est&aacute;n 'enfrascados' analizando una palabra dudosa del Ancrene Wisse, acaban a las 10:40 (la alumna al salir piensa que si todos los fil&oacute;logos fueran como John la Escuela de Ingl&eacute;s ser&iacute;a un lugar m&aacute;s animado), despu&eacute;s de acompa&ntilde;arla hasta la puerta, John coge las notas para clase (no le da tiempo para examinarlas, as&iacute; que si le falta alguna improvisar&iacute;a sobre el texto que piensa comentar, Exodus, en ingl&eacute;s antiguo) y se va en bicicleta con su malet&iacute;n y su toga de "master" a las Examination Schools (y no como, a veces, a su propio "college"), suele tener mucho p&uacute;blico, pero hoy habla de un texto de lectura obligatoria para muy pocos, comienza la clase justo cuando suenan las campanadas del reloj de Merton dando las 11:00. Habla con mucha fluidez y analiza el texto l&iacute;nea a l&iacute;nea (descartando el significado de algunas l&iacute;neas o expresiones; al parecer no 
se limitaba a ense&ntilde;ar a sus alumnos el significado de las palabras sino que tambi&eacute;n la raz&oacute;n por la cual el autor hab&iacute;a podido elegir esa palabra y no otra y c&oacute;mo encajaba en el esquema general de la obra), los &uacute;ltimos 10 minutos los dedica a explicar un tema relacionado por una palabra (que bien podr&iacute;a ser la relaci&oacute;n entre el g&oacute;tico y el ingl&eacute;s antiguo), luego habla con un alumno y se va dejando el aula a otro profesor, por el pasillo se encuentra con C.S. Lewis, hablan un poco y seguidamente le deja para ir a hacer unas compras antes de comer, va en bicicleta por High Street hasta Covered Market, recoge en la carnicer&iacute;a de Lindsey unas salchichas, pasa por la papeler&iacute;a de la esquina Market Street a comprar plumas, y vuelve finalmente a su casa en bicicleta por Banbury Road. Logra conseguir 15 minutos para escribir a maquina una carta a E.V. Gordon sobre cierto proyecto. En la comida est&aacute; toda la familia (hablan sobre que a Michael no le gustan las clases de nataci&oacute;n y si su pie lastimado podr&iacute;a impedir que nadase). Despu&eacute;s de comer, John sale a ver c&oacute;mo crecen las habichuelas, Edith saca a Priscilla al c&eacute;sped para que juegue, Edith y John acerca de remover la tierra de lo que ha quedado del antiguo campo de tenis para cultivar m&aacute;s hortalizas, y luego mientras Edith alimenta a los p&aacute;jaros del aviario que hay al lado de la casa, John va a la reuni&oacute;n de la English Faculty (en una biblioteca de un &aacute;tico de las Examination Schools en el "college" de Merton). La reuni&oacute;n comienza a las 14:30 y se refiere a las fechas de ex&aacute;menes y los fondos de la biblioteca de la facultad, acaban sobre las 16:00.</P>
<P ALIGN="JUSTIFY">Pasa unos minutos en la Bodleain Library y hace una consulta de un libro que hab&iacute;a pedido ayer, vuelve r&aacute;pidamente a casa para tomar el t&eacute; con su familia a las 16:30; despu&eacute;s de esto, pasa una hora y media en su escritorio acabando la carta que hab&iacute;a comenzado antes de comer y preparando las notas para el d&iacute;a siguiente. Una vez terminado esto, pasa unos 20 minutos ayudando a su hijo Michael en unos ejercicios de prosa latina. Llegan las 18:30 y se tiene que cambiar la ropa para ir a cenar (no suele salir a cenar fuera m&aacute;s que uno o dos d&iacute;as a la semana), es una noche de invitados en Pembroke y hab&iacute;a prometido ir, se prepara r&aacute;pido y se va all&iacute; en su bicicleta, llegando justo a a tiempo para tomar el sherry (en el Senior Common Room), es una cena sencilla, y una vez finalizada se disculpa y se va pronto hac&iacute;a el Balliol College donde se realiza una reuni&oacute;n de los "Coalbiters" (en las habitaciones de John Bryson, este club fue creado por John para convencer a sus amigos - todos ellos tutores - del placer de leer en la lengua original la literatura islandesa), una hora m&aacute;s tarde concluyen la lectura y beben un poco de whisky mientras es analizada, ya pasadas las 23:00 se despiden. Cuando llega a su casa toda su familia est&aacute; dormida, va a su estudio, llena y enciende su pipa junto a la estufa, se pone a elaborar sus notas, a continuaci&oacute;n sigue escribiendo un relato inconcluso con el que se divert&iacute;a toda la familia (que m&aacute;s tarde se llamar&iacute;a El Hobbit) y all&iacute; permanecer&aacute; hasta las 2 &oacute; quiz&aacute;s algo mas tarde.</P>
<P ALIGN="JUSTIFY">Al parecer, lo que m&aacute;s le atra&iacute;a de las lenguas era su forma y el sonido de sus palabras (de hecho incluso podr&iacute;a decirse que le gustaban de una manera casi emocional el fin&eacute;s, el gal&eacute;s, el g&oacute;tico y el ingl&eacute;s antiguo).</P>
<P ALIGN="JUSTIFY">A su regreso de Oxford, John not&oacute; que le faltaba algo al haber desaparecido la T.C.B.S., y a pesar de verse de vez en cuando con el otro superviviente de &eacute;sta, ya no era lo mismo. El 11 de mayo de 1926 (en una reuni&oacute;n de la Facultad), John conoci&oacute; a Clive Staples Lewis (un medievalista de la Literatura): al principio no fueron precisamente amigos, pero pronto la situaci&oacute;n cambi&oacute; (en mayo de 1927, John, ya lo hab&iacute;a "enrolado" en los "Coalbiters", y a partir de entonces quedaron los jueves por la noche en las habitaciones de Lewis en Magdalen, donde le&iacute;an sagas islandesas). John y C.S. Lewis sol&iacute;an comentar muchas poes&iacute;as entre ellos. Es de destacar una poes&iacute;a que escribi&oacute; John llamada Mytopheia que dedic&oacute; a C.S. Lewis .</P>
<P ALIGN="JUSTIFY">A finales de 1929 C.S. Lewis apoyaba los planes de John para las reformas de la Escuela de Ingl&eacute;s, y en 1931 lograron que fuese aceptada, d&aacute;ndose una mayor importancia al programa de island&eacute;s. Tambi&eacute;n fundaron el club "The Inklings" (que en ingl&eacute;s medio significa "presentimiento"). En realidad fue fundada por Tangye Lean, pero cuando &eacute;ste se fue, su verdadero n&uacute;cleo fue C.S. Lewis. Hacia el a&ntilde;o 1940 "The Inklings" era un elemento bastante importante de la vida de John, y algo antes (al comienzo de la guerra, en 1939) se uni&oacute; un nuevo miembro llamado Charles Williams, poeta, novelista, te&oacute;logo y critico. Durante este periodo C.S. Lewis escribi&oacute; bastantes novelas, como las conocidas The Four Loves, That Hideous Strength, The Screwtape Letters...</P>
<B><P ALIGN="JUSTIFY">La vida de Edith</P>
</B><P ALIGN="JUSTIFY">Durante esta &eacute;poca Edith hac&iacute;a de ama de casa y tocaba el piano, administr&oacute; su hogar con suma habilidad y casi lo convirti&oacute; en un centro social para los amigos de John. Sin embargo, no sol&iacute;a ir a las fiestas que se celebraban en Oxford, m&aacute;s que nada por falta de &aacute;nimos (le daba la impresi&oacute;n de que Oxford era una fortaleza impenetrable). Cuando, m&aacute;s tarde fueron a Leeds (sin Jennie, que se qued&oacute; en Oxford), la cosa fue muy diferente: todo el mundo viv&iacute;a en modestas casas, nadie se preocupaba por las "tarjetas de visita" que se utilizaban en Oxford... en fin, era una vida mucho m&aacute;s sencilla y con menos artificios, que tan poco le gustaban a Edith. Edith se encontraba all&iacute; muy feliz e hizo muchas amigas. John consigui&oacute; una casa m&aacute;s grande en Darnley Road, en donde contrataron a una criada y a una ni&ntilde;era.</P>
<P ALIGN="JUSTIFY">Pero entonces tuvieron que volver a Oxford, John compr&oacute; una casa sin que Edith la viese, era peque&ntilde;a, y para colmo de males los chicos mayores hab&iacute;an enfermado de exantema cr&oacute;nico (debido a un peine p&uacute;blico del estudio de un fot&oacute;grafo), cuyo tratamiento era largo y caro. Una vez se recuperaron fueron a la Dragon School. Edith qued&oacute; embarazada de Priscilla, que naci&oacute; en 1929, pero no se sinti&oacute; de verdad en su casa hasta el traslad&oacute; en 1930 a la casa de al lado. John era bastante tierno y considerado con ella, se preocupaba por los asuntos dom&eacute;sticos y la salud de Edith, y ella tambi&eacute;n le correspond&iacute;a (parece ser que ten&iacute;a unos pocos celos de C.S. Lewis, ya que &eacute;ste parec&iacute;a poder alegrar una parte de John que s&oacute;lo pod&iacute;a ser alegrada por personas de su misma 'especie', y como C.S. Lewis era muy t&iacute;mido con Edith, ella no lograba comprender qu&eacute; ve&iacute;a John en &eacute;l).</P>
<P ALIGN="JUSTIFY">A Edith le gustaba que las comidas se sirviesen a su hora en punto, que no se desperdiciase nada, y que los criados cumpliesen diligentemente sus tareas; a menudo se quedaba sola con los</P>
<P ALIGN="JUSTIFY">criados, y aunque hizo algunas amistades, aquello no le agradaba demasiado.</P>
<P ALIGN="JUSTIFY">John y Edith se preocupaban mucho por la familia y les encantaba hablar y meditar acerca de los detalles de la vida de sus hijos y nietos (en especial se sintieron muy orgullosos cuando Michael gan&oacute; la Geoge Medal en la Segunda Guerra Mundial, y cuando John Francis fue ordenado sacerdote). </P>
<P ALIGN="JUSTIFY">En 1932 John compr&oacute; un coche, un Morris Cowley; no era demasiado bueno en el volante, y m&aacute;s tarde tuvo otro hasta finales de la Segunda Guerra Mundial, ya que debido al racionamiento de la gasolina tuvo que deshacerse de &eacute;l, luego se dio cuenta del da&ntilde;o que hac&iacute;an a la naturaleza, y ya no volvi&oacute; a conducir.</P>
<P ALIGN="JUSTIFY">John y Edith eran bastante buenos en las cuestiones relacionadas con la jardiner&iacute;a, as&iacute; pues en su jard&iacute;n ten&iacute;an rosas, muchos &aacute;rboles y un huerto. Sol&iacute;an pasar sus vacaciones en Lyme Regis (junto al anciano padre Francis), en Lamorna Cove o en Sidmouth.</P>
<B><P ALIGN="JUSTIFY">El nacimiento de El Hobbit</P>
</B><P ALIGN="JUSTIFY">John sol&iacute;a contar historias a John Francis en Leeds para que se durmiese, y de este modo fue como nacieron y se desarrollaron muchas de las historias que escribi&oacute; tanto de temas relacionados con el Silmarillion (como la de Tom Bombadil) como de otros temas (como El se&ntilde;or Bliss). Cada Navidad desde que John Francis tuvo 3 a&ntilde;os, Santa Claus enviaba una carta a sus hijos; m&aacute;s tarde tuvo de c&oacute;mplice al cartero (por lo cual sus hijos no pudieron dudar de que era Santa Claus quien escrib&iacute;a las cartas) y fue creando personajes adicionales.</P>
<P ALIGN="JUSTIFY">En las habitaciones de los ni&ntilde;os las estanter&iacute;as estaban repletas de libros (muchos de los cuales le hubiesen encantado a John de haberlos le&iacute;do en su infancia). Ahora John le&iacute;a muy poca ficci&oacute;n, prefiriendo las novelas contempor&aacute;neas, aunque como es l&oacute;gico, lo que sol&iacute;a leer eran obras filol&oacute;gicas. </P>
<P ALIGN="JUSTIFY">En alg&uacute;n momento de los a&ntilde;os 30, John escribi&oacute; Edigio, el granjero de Ham, que fue le&iacute;da en una conferencia dada por &eacute;l sobre cuentos de hadas (despu&eacute;s de &eacute;sta decidi&oacute; alargarla y mejorarla), pero como libro no apareci&oacute; hasta 1949. Tard&oacute; tanto en ser publicada debido a que no se encontraba a un buen ilustrador, que al final fue Pauline Diana Baynes, quien tambi&eacute;n ilustr&oacute; la Antolog&iacute;a de Poemas de Tolkien y El herrero de Wootton Mayor. Tambi&eacute;n pens&oacute; hacer una segunda parte, pero no pudo ser, porque estall&oacute; la guerra (y debido a que el paisaje en el que se hab&iacute;a inspirado John qued&oacute; totalmente destruido).</P>
<P ALIGN="JUSTIFY">Sigui&oacute; trabajando en la Gesta de Beren y Luthien y en la historia de Turin y el drag&oacute;n, para lo que contaba con el apoyo de C.S. Lewis. Cuando alcanzaron 4.000 y 2.000 versos, quedaron inconclusos. Tambi&eacute;n escribi&oacute; otros poemas, como Aotrou and Itroun (del bret&oacute;n "Se&ntilde;or y Se&ntilde;ora") y The Fall of Arthur ("La ca&iacute;da de Arturo"). Tambi&eacute;n escribi&oacute; El camino perdido (en el que un hombre y su hijo hacen un viaje en el tiempo y descubren la mitolog&iacute;a de El Silmarillion), La leyenda de Numenor, Los papeles de Notion Club y Imram (que en gal&eacute;s significa "viaje"); mientras, C.S.Lewis escrib&iacute;a Fuera del planeta silencioso.</P>
<P ALIGN="JUSTIFY">Pr&aacute;cticamente nada de lo que escribi&oacute; en esta &eacute;poca fue publicado en la misma, y lo poco que sali&oacute; a la luz lo hizo a trav&eacute;s del Oxford Magazine. John necesitaba algo que uniese los relatos hechos para entretener a sus hijos y a los temas mayores (como El Silmarillion), y un d&iacute;a de verano, mientras correg&iacute;a unos ex&aacute;menes en su estudio de Nothmoor Road, escribi&oacute; en una hoja: En un agujero en el suelo viv&iacute;a un hobbit; pens&oacute; que deber&iacute;a descubrir c&oacute;mo eran los hobbits y parece ser as&iacute; comenz&oacute; la historia.</P>
<P ALIGN="JUSTIFY">Lo que durante tanto tiempo hab&iacute;a estado buscando estaba precisamente all&iacute;, a su lado: Suffield y los sentimientos hacia las West Midland que le hab&iacute;an guiado en su trabajo acad&eacute;mico se unieron y crearon al se&ntilde;or Bilbo Baggins (Bilbo Bols&oacute;n en espa&ntilde;ol), el t&iacute;pico hobbit. John y Bilbo se parec&iacute;an bastante en casi todos los aspectos (casi podr&iacute;a decirse que John no era un hobbit &uacute;nicamente debido a su altura).</P>
<P ALIGN="JUSTIFY">El Hobbit fue escrito en un principio con el &uacute;nico fin de entretener a su familia, y aunque en el manuscrito no pone la fecha, se cree que debi&oacute; empezarse entre 1930 y 1931 (quiz&aacute; antes); fue </P>
<P ALIGN="JUSTIFY">escrito con fluidez y en poco tiempo, hasta el cap&iacute;tulo en el van a matar a Smaug, el drag&oacute;n; es de destacar que los nombres cambian bastante de la primera versi&oacute;n a la segunda, y no cre&iacute;a que fuese a tener ninguna relaci&oacute;n con El Silmarillion, ni siquiera que fuese a estar situado en la Tercera Edad. Se trataba de un cuento infantil, sin acabar, y al haber crecido sus hijos ya no cre&iacute;a que lo fuese a terminar nunca.</P>
<P ALIGN="JUSTIFY">Una de las pocas personas que lo ley&oacute; fue Elaine Griffiths, quien habl&oacute; de &eacute;ste a Susan Dagnall (de Allen &amp; Unwin, una editorial), y esta ultima pidi&oacute; el manuscrito a John y le propuso acabarlo para publicarlo al a&ntilde;o siguiente. La primera semana de Octubre acab&oacute; El Hobbit: el hijo del presidente de Allen &amp; Unwin lo ley&oacute; e hizo un informe en el que contaba el argumento y tambi&eacute;n que le hab&iacute;a gustado la obra. As&iacute; pues, el libro fue aceptado y fue ilustrado con 8 dibujos en blanco y negro (aparte del mapa en color). Antes de ser impreso, se hicieron algunas correcciones.</P>
<P ALIGN="JUSTIFY">Fue publicado el 21 de septiembre de 1937: a los cr&iacute;ticos les gust&oacute; mucho, y la primera edici&oacute;n se agot&oacute; en Navidad, reedit&aacute;ndose en seguida con 4 de las 5 ilustraciones a color que hab&iacute;a hecho John. Unos meses m&aacute;s tarde apareci&oacute; la edici&oacute;n americana y le fue concedido a John el premio del New York Herald Tribune a la mejor obra para j&oacute;venes de la temporada.</P>
<B><P ALIGN="JUSTIFY">La historia de 'El Se&ntilde;or de los Anillos'</P>
</B><P ALIGN="JUSTIFY">Unas semanas despu&eacute;s John fue a cenar a Londres con Stanley &amp; Unwin; en esta cena hablaron de publicar la continuaci&oacute;n de El Hobbit: Unwin tambi&eacute;n le propuso que le enviase los manuscritos del resto de sus obras (El Se&ntilde;or Bliss, Edigio, el granjero de Ham, Roverandom, y las obras inconclusas de El Silmarillion y El camino perdido. As&iacute; pues, John se los envi&oacute;, y tuvieron una buena aceptaci&oacute;n. Sin embargo, lo que editor deseaba era una obra en la cual tambi&eacute;n hubiese hobbits y "continuase" la historia. De tal manera que muy pronto John se puso manos a la obra y escribi&oacute; el primer capitulo, al que llam&oacute; Una fiesta largamente esperada). Tras mucho pensar, decidi&oacute; que la "devoluci&oacute;n" del anillo ser&iacute;a el tema de la obra, mecanografi&oacute; el cap&iacute;tulo, y se lo mand&oacute; al editor para que lo leyese su hijo, y &eacute;ste le respondi&oacute; que siguiera adelante.</P>
<P ALIGN="JUSTIFY">Poco despu&eacute;s, cuando ya iba por el tercer cap&iacute;tulo del cuento, empez&oacute; a &iacute;rsele de las manos, y el relato empez&oacute; a pasar del estilo alegre de El Hobbit a algo m&aacute;s grande y oscuro. La elaboraci&oacute;n del relato se retraso debido a la enfermedad cardiaca de Christopher, su trabajo, y el duro golpe que le supuso la noticia de la muerte de E. V. Gordon. El 31 de agosto ya iba escribiendo el s&eacute;ptimo cap&iacute;tulo y estaba claro que el argumento tratar&iacute;a acerca de que el anillo deber&iacute;a ser llevado a Mordor y arrojado al interior del Monte del Destino con el fin de destruir a las fuerzas del mal, y lo titul&oacute; El Se&ntilde;or de los Anillos.</P>
<P ALIGN="JUSTIFY">Se convirti&oacute; en la continuaci&oacute;n de El Silmarillion en vez de en la de El Hobbit. Al volver de sus vacaciones en Sidmouth (1938), John escribi&oacute; bastante de El Se&ntilde;or de los Anillos y ya estaba bastante avanzado el libro II (no os confund&aacute;is con el tomo II). En el verano de 1939 cambi&oacute; el nombre del protagonista por el de Frodo (ya que el que ten&iacute;a antes - Bingo - no sonaba demasiado bien). A pesar de lo que mucha gente opina, John siempre ha dicho que El Se&ntilde;or de los Anillos no fue escrito para reflejar la situaci&oacute;n de aquellos tiempos - estaba a punto de estallar la Segunda Guerra Mundial. Le fue imposible trabajar en El Se&ntilde;or de los Anillos durante los primeros meses de 1939, debido a que ten&iacute;a que preparar una conferencia sobre los cuentos de hadas en la universidad de St. Andrews el 8 de marzo de 1939, y despu&eacute;s de &eacute;sta continu&oacute; escribiendo, el que hac&iacute;a inscripciones en &eacute;lfico, y ley&oacute; cap&iacute;tulo a cap&iacute;tulo en "The Inklings", donde gust&oacute; mucho.</P>
<P ALIGN="JUSTIFY">A principios de 1940 hab&iacute;a llegado a la mitad del libro II (la guerra hab&iacute;a comenzado en septiembre del a&ntilde;o pasado y a&uacute;n no le hab&iacute;a afectado), y sus hijos comenzaron a irse de casa: John Francis se preparaba para el sacerdocio cat&oacute;lico en Roma, Michael ingres&oacute; en la artiller&iacute;a antia&eacute;rea en el Trinity, y Christopher, despu&eacute;s de recuperarse e ir un poco a la escuela, ingres&oacute; tambi&eacute;n en el Trinity, s&oacute;lo se qued&oacute; Priscilla.</P>
<P ALIGN="JUSTIFY">Escaseaba el servicio dom&eacute;stico, a veces iban evacuados a su casa, criaron gallinas en el jard&iacute;n y John hizo turnos de previsi&oacute;n de ataques antia&eacute;reos. Oxford no fue bombardeada y no le fueron solicitadas a John tareas para el Ministerio de Guerra u otro departamento del Gobierno. John organiz&oacute; un programa para los cadetes navales en la Escuela de Ingl&eacute;s, modificando las clases para un p&uacute;blico menos especializado, pero a pesar de todo, su vida era bastante parecida a la que ten&iacute;a antes de iniciarse la guerra.</P>
<P ALIGN="JUSTIFY">A finales de 1940, El Se&ntilde;or de los Anillos se interrumpi&oacute; durante casi un a&ntilde;o, y cuando continu&oacute; con &eacute;l crey&oacute; que lo acabar&iacute;a pronto (se encontraba en la parte en la que Barbol, el ent, se topa con Merry y Pippin). El Hobbit hab&iacute;a vuelto a agotarse, el dep&oacute;sito de Allen &amp; Unwin se incendi&oacute;, y John estaba redactando el cap&iacute;tulo 31 (m&aacute;s o menos el final del tercer libro) y cre&iacute;a que en unos seis cap&iacute;tulos m&aacute;s habr&iacute;a terminado: no sab&iacute;a que escribir&iacute;a otros tantos. Quiso asegurarse de que no fallaba nada (geograf&iacute;a, cronolog&iacute;a, nomenclaturas...), as&iacute; pues junto a Christopher hicieron mapas, toda clase de tablas de medici&oacute;n (incluso tuvieron en cuenta las fases lunares), y desarrollaron nuevos lenguajes, aunque a un nivel rudimentario. Los lenguajes &eacute;lficos ten&iacute;an ya un nivel de complejidad muy alto.</P>
<P ALIGN="JUSTIFY">Hab&iacute;a llegado a un punto en el que a sus 51 a&ntilde;os le era muy dif&iacute;cil continuar: hab&iacute;a comenzado El Se&ntilde;or de los Anillos 6 a&ntilde;os antes. Una ma&ntilde;ana, en aquella &eacute;poca, comenz&oacute; a escribir el famoso cuento de Niggle. Al empezar 1944, el libro no hab&iacute;a sido tocado durante meses. y C.S. Lewis presion&oacute; a John para que lo acabase, y as&iacute; comenz&oacute; el libro IV. Christopher se hab&iacute;a ido a Sud&aacute;frica para ser piloto y John le escrib&iacute;a cont&aacute;ndole los progresos en el libro, y al terminar el libro IV, lo pas&oacute; a maquina y se lo envi&oacute;. En este momento la inspiraci&oacute;n de John estaba bastante agotada y tuvo que descansar, para m&aacute;s tarde seguir escribiendo. De tal manera que en 1945 no progres&oacute; casi nada.</P>
<P ALIGN="JUSTIFY">El 9 de marzo termin&oacute; la guerra, al d&iacute;a siguiente C. Williams enferm&oacute;, y aunque fue operado en Oxford, muri&oacute; el 15 de mayo. En oto&ntilde;o de este mismo a&ntilde;o fue nombrado profesor de Lengua y Literatura Inglesas y "fellow" del Merton College. Christopher le acompa&ntilde;aba ahora a las reuniones de "The Inklings", y la amistad entre John y C.S. Lewis hab&iacute;a menguado considerablemente. C.S. Lewis, durante esta &eacute;poca, escribi&oacute; bastantes libros muy semejantes a los de John, sobre "Narnia", despu&eacute;s de 1954 C.S. Lewis fue a Cambridge para ocupar la C&aacute;tedra de Literatura Medieval y Renacentista. </P>
<P ALIGN="JUSTIFY">El Hobbit fue reeditado despu&eacute;s de la guerra , y se hicieron arreglos para la publicaci&oacute;n de Edigio, el granjero de Ham, en 1946. John casi no hab&iacute;a tocado El Se&ntilde;or de los Anillos desde 1944, y cuando volvi&oacute; a ponerse a ello se cambi&oacute; de casa, teni&eacute;ndolo que retrasar.</P>
<P ALIGN="JUSTIFY">El hijo del editor ya no era un ni&ntilde;o, y estudiaba en Oxford. John le dio la versi&oacute;n mecanografiada de El Se&ntilde;or de los Anillos, ahora casi completo, y le gust&oacute;, aunque no sab&iacute;a cual ser&iacute;a el tipo de publico al que le encajar&iacute;a ese tipo de obra. Lo revis&oacute; con minuciosidad y corrigi&oacute; los errores de los cap&iacute;tulos anteriores, aunque tard&oacute; tanto que sus colegas casi le dieron por perdido en lo referente a las obras filol&oacute;gicas).</P>
<P ALIGN="JUSTIFY">En el verano de 1947 hizo una revisi&oacute;n de El Hobbit, en la que se daba una mejor explicaci&oacute;n de lo referente al anillo para que encajase mejor con El Se&ntilde;or de los Anillos, que entreg&oacute; a Unwin para ver lo que le parec&iacute;a, pero &eacute;ste por error lo envi&oacute; directamente a su departamento de producci&oacute;n; al ver en los libros de la siguiente edici&oacute;n el capitulo revisado, John se qued&oacute; estupefacto.</P>
<P ALIGN="JUSTIFY">Acab&oacute; El Se&ntilde;or de los Anillos unos meses m&aacute;s tarde, con la partida de los portadores del anillo a las Tierras Imperecederas, John revis&oacute; muchas veces la obra hasta sentirse satisfecho del todo, lo que tambi&eacute;n le llev&oacute; bastantes meses, la escribi&oacute; a m&aacute;quina, e hizo una copia a limpio, que envi&oacute; a C.S. Lewis (a quien tambi&eacute;n le gust&oacute;). John no pensaba que la obra fuese perfecta, pero la termin&oacute; definitivamente en el oto&ntilde;o de 1949. Hab&iacute;a tardado 12 a&ntilde;os en escribir El Se&ntilde;or de los Anillos, y cuando lo termin&oacute; ya ten&iacute;a casi 60 a&ntilde;os.</P>
<P ALIGN="JUSTIFY">Quer&iacute;a verlo publicado, pero no estaba seguro de querer que Allen &amp; Unwin fuese el que lo hiciese, ya que quer&iacute;a que El Se&ntilde;or de los Anillos y El Silmarillion fuesen publicados juntos, y ya hab&iacute;a encontrado a alguien que lo har&iacute;a, Milton Waldman (de la editorial Collins). John envi&oacute; a Waldman un manuscrito enorme, que no era El Se&ntilde;or de los Anillos, sino El Silmarillion (que aunque se encontraba sin acabar, estaba bastante ordenado), a Waldman le gust&oacute; y le propuso que si lo terminaba se lo publicar&iacute;a; as&iacute; pues John le invit&oacute; a Oxford, donde le dej&oacute; el manuscrito de El Se&ntilde;or de los Anillos para que lo leyese durante las vacaciones.</P>
<P ALIGN="JUSTIFY">A principios de 1950 ya casi lo hab&iacute;a acabado de leer y felicit&oacute; a John, dici&eacute;ndole adem&aacute;s que podr&iacute;a publicarlo; es de destacar que durante esta &eacute;poca debido a la Segunda Guerra Mundial el papel escaseaba bastante. Por tanto, la extensi&oacute;n de El Se&ntilde;or de los Anillos era un problema para Allen &amp; Unwin, que quer&iacute;a dividir la obra en 3 &oacute; 4 tomos y John se negaba a ello. Deseaban publicarlo, pero no con El Silmarillion, al final rompieron y John qued&oacute; libre para editarlo con Collins.</P>
<P ALIGN="JUSTIFY">Durante esta &eacute;poca, Priscilla estudiaba en el Margaret Hall, y Christopher, mientras acababa su bachillerato universitario en Literatura, trabajaba como tutor "freelance" en la English Faculty. Poco antes de que firmase el contrato con Collins, Milton Waldman fue a Oxford para decir a John que deb&iacute;a hacer urgentes recortes en El Se&ntilde;or de los Anillos (que "med&iacute;a" aproximadamente medio mill&oacute;n de palabras). Las negociaciones se volvieron cada vez m&aacute;s confusas y Waldman se fue a Italia, donde sol&iacute;a pasar la mayor parte del a&ntilde;o, W. Collins no conoc&iacute;a bien la obra de John y hab&iacute;a dejado el asunto en manos de Waldman, el cual enferm&oacute; en Italia y no pudo volver hasta el oto&ntilde;o, de tal manera que a finales de 1950 El Se&ntilde;or de los Anillos estaba tan cerca de su publicaci&oacute;n como el a&ntilde;o anterior.</P>
<P ALIGN="JUSTIFY">Cuando Stanley Unwin se enter&oacute;, escribi&oacute; a John dici&eacute;ndole que todav&iacute;a esperaba "el privilegio de vincularse a su publicaci&oacute;n", pero John no estaba dispuesto a dejarse convencer tan f&aacute;cilmente. La mayor parte del tiempo, John estuvo ocupado con asuntos de Oxford. Tambi&eacute;n fue a B&eacute;lgica, como fil&oacute;logo, y a Irlanda, como examinador.</P>
<P ALIGN="JUSTIFY">A finales de 1951 el libro segu&iacute;a igual y John escribi&oacute; a Milton una carta de unas 10.000 palabras en la que explicaba que su mitolog&iacute;a era indivisible. En marzo de 1952 el precio del papel subi&oacute;, Collins se encontraba en Sud&aacute;frica y Waldman en Italia, El Silmarillion sin acabar y el contrato sin firmar. John envi&oacute; a Collins una especie de ultim&aacute;tum, en el que le dec&iacute;a que o publicaba El Se&ntilde;or de los Anillos o devolver&iacute;a el manuscrito a Allen &amp; Unwin: el 18 de abril de 1952 Collins le escribi&oacute; dici&eacute;ndole que publicar en aquel momento el libro supondr&iacute;a una inversi&oacute;n demasiado fuerte y no pod&iacute;an permit&iacute;rsela.</P>
<P ALIGN="JUSTIFY">Su antiguo editor, cuyo cargo ahora ten&iacute;a Rayner (el hijo del anterior) no se lo pens&oacute; dos veces y acept&oacute; en seguida. Rayner dijo a John que le enviase el manuscrito por correo certificado en cuanto pudiera. Sin embargo, John s&oacute;lo ten&iacute;a una copia a m&aacute;quina de la revisi&oacute;n definitiva, por lo que quer&iacute;a darla en persona, lo que fue imposible durante unas semanas debido a un viaje a Irlanda. El 19 de septiembre de 1952 fue a Oxford y recogi&oacute; la versi&oacute;n final de El Se&ntilde;or de los Anillos y lo ley&oacute; de nuevo, calcul&oacute; los gastos de producci&oacute;n (lo que m&aacute;s le preocupaba era que el libro deb&iacute;a estar a un precio normal para ser competitivo) y pens&oacute; en dividirlo en 3 vol&uacute;menes que pod&iacute;an venderse a unos 21 chelines la unidad (era bastante caro y dejaba pocos beneficios). Rayner telegrafi&oacute; a su padre, que se encontraba en Jap&oacute;n, para preguntarle si lo editar&iacute;an, puesto que supon&iacute;a un riesgo importante y podr&iacute;an perder 1.000 libras; a pesar de ello hicieron la inversi&oacute;n, ya que su padre estuvo de acuerdo.</P>
<P ALIGN="JUSTIFY">El 10 de noviembre Rayner Unwin dijo a John que publicar&iacute;a finalmente El Se&ntilde;or de los Anillos, pero con un contrato de participaci&oacute;n de ganancias. O sea, que John no ganar&iacute;a el porcentaje normal, sino la mitad de lo que se ganase, una vez las ventas cubriesen el costo; esto se sol&iacute;a hacer con los libros antiecon&oacute;micos, pero si el libro se vend&iacute;a bien el autor ganaba m&aacute;s que con un contrato de derechos.</P>
<P ALIGN="JUSTIFY">Rayner no pidi&oacute; a John que hiciese recortes, y John quiso revisar de nuevo El Se&ntilde;or de los Anillos para eliminar las posibles contradicciones; tambi&eacute;n quer&iacute;a hacer unos ap&eacute;ndices, ya medio hechos pero desordenados, y el mapa (ya que el antiguo ten&iacute;a nombres que hab&iacute;an sido cambiados). Adem&aacute;s, llevaba retraso en su labor acad&eacute;mica y acababa de volver a cambiarse de casa. Priscilla hab&iacute;a ido a trabajar a Bristol y Edith ten&iacute;a artritis y reumatismo. John acab&oacute; la revisi&oacute;n final del primer volumen en abril y poco despu&eacute;s el segundo, y se decidieron los t&iacute;tulos de &eacute;stos. No se pudo imprimir en color el facs&iacute;mil del Libro de Mazarbul y tambi&eacute;n hubo problemas de tipo tipogr&aacute;fico.</P>
<P ALIGN="JUSTIFY">Se previ&oacute; que el primer volumen deb&iacute;a de salir en el verano de 1954; la edici&oacute;n era peque&ntilde;a, s&oacute;lo unos 3.500 ejemplares del primer tomo y pocos m&aacute;s entre los del segundo y el tercero. Esto era porque los editores pensaban que la obra iba a atraer a muy poca gente.</P>
<P ALIGN="JUSTIFY">Los cr&iacute;ticos hablaron mucho de El Se&ntilde;or de los Anillos y casi siempre de manera favorable, lo que ayud&oacute; a mejorar las ventas. En seguida (a las 6 semanas) los 3.500 ejemplares de La compa&ntilde;&iacute;a del anillo se agotaron y se prepar&oacute; una segunda edici&oacute;n. En julio, John visit&oacute; Dubl&iacute;n, donde le hicieron Doctor Honoris Causa de la Universidad Cat&oacute;lica de Irlanda, y en octubre tuvo que volver a viajar, a Lieja, para recibir otro t&iacute;tulo honorario. Estas y otras causas hicieron que los ap&eacute;ndices se retrasasen, el tercer volumen ya estaba compuesto por los tip&oacute;grafos, pero no se pod&iacute;a imprimir hasta que los ap&eacute;ndices, el mapa y el &iacute;ndice de nombres estuvieran terminados.</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">A mediados de noviembre aparecieron Las dos torres, las cr&iacute;ticas fueron parecidas a las del primer tomo y se esperaba ansiosamente el tercer volumen, pues como ya sab&eacute;is Frodo al final de este tomo queda prisionero en Cirith Ungol. John se esforzaba todo lo que pod&iacute;a, pero s&oacute;lo logr&oacute; enviar parte del material. En Am&eacute;rica fue publicado el primer tomo en octubre y el segundo poco despu&eacute;s, pero la cr&iacute;tica (aunque buena) no logr&oacute; aumentar las ventas. El 20 de mayo de 1955 Rayner recibi&oacute; la versi&oacute;n final de los ap&eacute;ndices, pero la tabla de runas ten&iacute;a errores y hasta que no volvi&oacute; de sus vacaciones a Italia no pudieron corregirse. El 20 de octubre apareci&oacute; por fin en las librer&iacute;as, la cr&iacute;tica ya pudo valorar la obra completa y no hubo opiniones medias: o gustaba much&iacute;simo o simplemente la aborrec&iacute;an. Las ventas fueron aumentando poco a poco pero sin cesar.</P>
<P ALIGN="JUSTIFY">Ahora ten&iacute;a que dedicarse m&aacute;s a la vida acad&eacute;mica, y el 21 de octubre de 1955 dio una conferencia sobre "El ingl&eacute;s y el gal&eacute;s". Las emisiones de radio de El Se&ntilde;or de los Anillos (que no gustaban mucho a John) popularizaron la obra, y a principios de 1956, John recibi&oacute; su primer pago de Allen &amp; Unwin (m&aacute;s de 35.000 libras, que era m&aacute;s de lo que ganaba en un a&ntilde;o en Oxford). En 1956 las ventas subieron y su cheque fue a&uacute;n mayor. A&ntilde;os despu&eacute;s lament&oacute; no haberse jubilado de su c&aacute;tedra a los 65 a&ntilde;os, en vez de a los 67 como hizo.</P>
<P ALIGN="JUSTIFY">El Se&ntilde;or de los Anillos fue pronto traducido a los principales idiomas europeos y mundiales, y recibi&oacute; muchas invitaciones para visitar pa&iacute;ses extranjeros, aunque s&oacute;lo fue a Holanda en la primavera de 1858. Y hubo ofertas para llevar su obra al cine en 1957, en dibujos animados, pero los guiones no estaban muy trabajados y a John no le gustaron; despu&eacute;s de su muerte s&iacute; fue filmada.</P>
<P ALIGN="JUSTIFY">En 1965, en los EE.UU. un editor no autorizado se propuso hacer una edici&oacute;n en r&uacute;stica de El Se&ntilde;or de los Anillos, el editor autorizado se apresur&oacute; a hacer lo mismo, pero antes, para as&iacute; poder obtener los derechos, e hicieron tambi&eacute;n lo mismo con El Hobbit. John tard&oacute; mucho en revisar ambas obras en r&uacute;stica, y la versi&oacute;n pirata apareci&oacute; en junio.</P>
<P ALIGN="JUSTIFY">La editorial "pirata" era Ace Books y pudo poner un precio bastante bajo (unos 65 centavos), al no pagar derechos de autor. Cuando John se puso a trabajar en serio empez&oacute; por El Hobbit y se dej&oacute; para m&aacute;s tarde El Se&ntilde;or de los Anillos (a pesar de que &eacute;ste era m&aacute;s importante), as&iacute; pues hasta agosto no pudo enviar a Am&eacute;rica El Se&ntilde;or de los Anillos revisado. Mientras, Balentine Books no esper&oacute; m&aacute;s y public&oacute; El Hobbit sin revisar, para publicar en otra el texto revisado. En la portada se pod&iacute;a ver una colina y sobre &eacute;sta dos avestruces y un &aacute;rbol con frutos redondos :-?¿ que no pegaban ni con cola :-).</P>
<P ALIGN="JUSTIFY">En octubre de 1965 apareci&oacute; la versi&oacute;n en r&uacute;stica autorizada de El Se&ntilde;or de los Anillos en los EE.UU. En una de las p&aacute;ginas se dec&iacute;a que esta era la &uacute;nica edici&oacute;n en r&uacute;stica publicada con el consentimiento del autor, pero a pesar de ello como estos &uacute;ltimos val&iacute;an 20 centavos m&aacute;s caros que los otros, no tuvieron mucho &eacute;xito al principio. No mucho despu&eacute;s comenzaron a crearse en los EE.UU. clubes de admiradores de su obra (tales como la "The Tolkien Society of America") que defend&iacute;an a la editorial legal, de tal manera que as&iacute; se inici&oacute; la llamada "guerra por la Tierra Media", que acab&oacute; dando mucha publicidad a las obras y el dinero de los derechos de autor a John de los 100.000 ejemplares vendidos por Ace, y muy pronto se vendieron m&aacute;s de tres millones (en 1968).</P>
<B><P ALIGN="JUSTIFY">Los &uacute;ltimos a&ntilde;os de J.R.R. Tolkien</P>
</B><P ALIGN="JUSTIFY">A mediados de la d&eacute;cada de los 50 acab&oacute; la etapa de la vida de John dedicada a los clubes, ya que ten&iacute;a que cuidar de Edit, quien apenas pod&iacute;a moverse y sufr&iacute;a constantes trastornos digestivos. Y en 1959 se retir&oacute; de su c&aacute;tedra.</P>
<P ALIGN="JUSTIFY">Sanfield Road, el lugar donde viv&iacute;an, no era un buen lugar de retiro debido a las constantes visitas de admiradores, y a las llamadas a altas horas de la madrugada de fans americanos, adem&aacute;s de que la estaci&oacute;n de autobuses estaba muy lejos y Edith no pod&iacute;a recorrerlos 3 Km que los separaban de ella.</P>
<P ALIGN="JUSTIFY">Christopher era ahora profesor y junto a su esposa Faith les sol&iacute;an visitar a menudo. John Francis era p&aacute;rroco en Staffordshire, Michael era maestro en las Midlands, ten&iacute;a un hijo y dos hijas, y Priscilla, que hab&iacute;a vuelto a Oxford, trabajaba como "Probation Officer".</P>
<P ALIGN="JUSTIFY">El Exeter College le dio una "Honorary Fellowship" en 1963, y algo m&aacute;s tarde el Merton le concedi&oacute; el "Emeritus Fellowship". Normalmente era invitado a muchas cenas, pero raramente iba, pues alguien ten&iacute;a que quedarse cuidando a Edith, y esto era lo principal para &eacute;l. Ten&iacute;a lumbago y tuvo que llevar a su casa sus libros, que ten&iacute;a en sus habitaciones del college, lo cual no le fue nada f&aacute;cil: los coloc&oacute; en el garaje (que ahora no utilizaba y lo convirti&oacute; en biblioteca), y este traslado dur&oacute; varios meses.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de esto, se puso a trabajar en El Silmarillion y empez&oacute; a reconstruir la obra, pero nada m&aacute;s comenzar tuvo que interrumpirlo para corregir las 222 pgs. escritas en ingl&eacute;s medio del Ancrene Wisse, y las traducciones de Gwain y Pearl, adem&aacute;s de las introducciones que le hab&iacute;an pedido los editores. Antes de acabar estas tareas, Allen &amp; Unwin le encarg&oacute; que revisara su conferencia sobre los cuentos de hadas (pues quer&iacute;an reeditarla junto a Hoja de Niggle). Asimismo, tambi&eacute;n le retras&oacute; bastante la correspondencia que ten&iacute;a que responder, aunque le ayudaba en esto la editorial. Tal vez si se hubiese organizado mejor, podr&iacute;a haber acabado El Silmarillion y editarlo en vida.</P>
<P ALIGN="JUSTIFY">C.S. Lewis muri&oacute; el 22 de noviembre de 1963 a los 64 a&ntilde;os, esto represent&oacute; un duro golpe para John. En sus &uacute;ltimos a&ntilde;os de vida, se vio aquejado por algunas depresiones, aunque logr&oacute; que diesen frutos positivos (como El granjero de Wootton Mayor, que fue publicado en 1957). En 1962 las ventas volvieron a subir. </P>
<P ALIGN="JUSTIFY">Edith y &eacute;l celebraron sus bodas de oro en 1966 con una gran ceremonia. La casa de Sanfield Road no les gustaba mucho y cada vez se hac&iacute;a m&aacute;s incom&oacute;da. La salud de Edith empeor&oacute; y su artritis era cada vez m&aacute;s grave. As&iacute; pues, a principios de 1968, se cambiaron a una casa m&aacute;s apropiada, y en este traslado ocultaron su nueva direcci&oacute;n para evitar las llamadas y visitas de tantos admiradores, y fueron a Bournemouth.</P>
<P ALIGN="JUSTIFY">Era un pueblo costero, adonde John y Edith hab&iacute;an ido varias veces a veranear. A Edith le gustaba mucho y tenia muchas amigas. John vivi&oacute; en Bournemouth desde 1968 hasta finales de 1971. La casa en donde estaban era justo como ellos quer&iacute;an, con calefacci&oacute;n central, un gran jard&iacute;n y una empleada permanente. Este traslado supuso un gran sacrificio para John, puesto que redujo su vida acad&eacute;mica (ya bastante menguada) a la nada, pero fue de sobras recompensado por la felicidad de Edith. Durante el traslado John tuvo un accidente bastante grave, agudizado por su edad, al caer por unas escaleras, y debido a ello tuvo que estar ingresado en el hospital unas cuantas semanas, y otras tantas enyesado. Cuando se recuper&oacute;, volvi&oacute; a ponerse a trabajar en El Silmarillion (ya estaba casi acabado, pero estaba todo desordenado y hab&iacute;a partes que no coincid&iacute;an del todo con otras), hizo una copia de cada texto a m&aacute;quina y los guard&oacute; en lugares diferentes por motivos de seguridad.</P>
<P ALIGN="JUSTIFY">Ahora deber&iacute;a reescribirlo de tal manera que estuviese acorde con El Se&ntilde;or de los Anillos, ya que en &eacute;ste se hablaba de antes y algunas otras cosas que no aparec&iacute;an en El Silmarillion. En verano de 1971 ya hab&iacute;a avanzado en gran medida, pero a finales de este a&ntilde;o Edith sufri&oacute; una inflamaci&oacute;n de ves&iacute;cula, fue internada en el hospital y unos d&iacute;as m&aacute;s tarde muri&oacute;, en la ma&ntilde;ana del lunes 29 de noviembre.</P>
<P ALIGN="JUSTIFY">Cuando comenz&oacute; a reponerse del dur&iacute;simo golpe y la angustia que le hab&iacute;a producido la muerte de Edith, John comprendi&oacute; que deb&iacute;a volver a Oxford, pero no sab&iacute;a muy bien a d&oacute;nde. El Merton college le invit&oacute; a que fuese residente, ofreci&eacute;ndole una de las habitaciones de una de las casas de la instituci&oacute;n en Merton Street, donde un criado y su esposa se ocupar&iacute;an de &eacute;l (este era un honor muy excepcional y una soluci&oacute;n perfecta).</P>
<P ALIGN="JUSTIFY">John acept&oacute;: su vivienda era una habitaci&oacute;n, un ba&ntilde;o y el sal&oacute;n. La familia Carr (el criado y su esposa) eran muy amables con &eacute;l y viv&iacute;an en la planta baja. La vida en Oxford durante los a&ntilde;os 1972-73 gust&oacute; mucho a John y fue muy activa. Durante este par de a&ntilde;os, recibi&oacute; muchos honores: por ejemplo, en 1972 la Reina de Inglaterra le concedi&oacute; un OBE (Condecoraci&oacute;n de la Orden del Imperio Brit&aacute;nico) en el palacio de Buckingham, y fue nombrado Doctor Honorario en Letras en la Universidad.</P>
<P ALIGN="JUSTIFY">&Eacute;l no pens&oacute; que fuese a morir pronto, pues sus antepasados siempre hab&iacute;an sido bastante longevos; sin embargo, en 1972 comenz&oacute; a sufrir de indigesti&oacute;n aguda y a envejecer r&aacute;pidamente. El d&iacute;a 28 de agosto de 1973 fue a Bournemouth, para asistir al aniversario del m&eacute;dico del pueblecito, Denis Tolhurst, quien era bastante amigo suyo: no se sinti&oacute; muy bien durante el festejo y por la noche sufri&oacute; bastantes dolores. Fue ingresado en el hospital al d&iacute;a siguiente y se le diagnostic&oacute; &uacute;lcera g&aacute;strica (Michael estaba en Suiza y Christopher en Francia, pero John Francis y Priscilla fuerona acompa&ntilde;arle), el s&aacute;bado tuvo una infecci&oacute;n tor&aacute;cica y en la </P>
<P ALIGN="JUSTIFY">ma&ntilde;ana del domingo d&iacute;a 2 de septiembre de 1973, muri&oacute; a los 81 a&ntilde;os.</P>
<P ALIGN="JUSTIFY">En Oxford fue celebrada una misa r&eacute;quiem en la iglesia de Headington, oficiada por John Francis, R. Murray y el sacerdote de la di&oacute;cesis, monse&ntilde;or Duran. La iglesia estuvo abarrotada de coronas de flores.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de la misa, la comitiva dio una larga caminata alrededor de Oxford, desde Headington hasta el cementerio de Wolvercote, y John fue enterrado al lado de su esposa.</P>
<B><P ALIGN="JUSTIFY">Para saber m&aacute;s</P>
</B><P ALIGN="JUSTIFY">Si est&aacute;is interesados en conocer m&aacute;s acerca de la vida de este genial autor podr&eacute;is encontrar m&aacute;s informaci&oacute;n en los siguientes libros:</P>

<UL>

<UL>
<P ALIGN="JUSTIFY"><LI>J.R.R. Tolkien, una bibliograf&iacute;a, Humphrey Carpenter, Ed. Minotauro.</LI></P>
<P ALIGN="JUSTIFY"><LI>Tolkien, Daniel Grotta, Ed. Planeta.</LI></P>
<P ALIGN="JUSTIFY"><LI>El autor y su obra: Tolkien, J.C. Santoyo, Ed. Barcanova.</LI></P></UL>
</UL>

<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P></FONT></BODY>
</HTML>
