<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>



<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<b><FONT color="#cc0000" size=2 face="arial">

A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>

<A href="mailto:ramis@lettera.net">Pablo Vázquez "Ramis"</a>

</b></FONT>

<br><br>



<BR><BR><BR><BR><BR>



<font face=arial>

<H3>En la boca del dragón<br> por Ken Follet</H3>



<FONT FACE="Arial" SIZE=2>

<P ALIGN="JUSTIFY">Esta es la &uacute;ltima novela del Ken Follet, en la que narra la historia de la defensa de una comuna de hippies, amenazada por la construcci&oacute;n de una presa, lo que conlleva la inundaci&oacute;n del valle donde se encuentra esta comuna.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La historia se centra en torno al "jefe" de la comuna, Priest; en su infancia fue un delincuente juvenil, pero con el paso de los a&ntilde;os se fue reformando y termin&oacute; dentro de este grupo de vi&ntilde;adores (ya que los miembros de la comuna trabajan en unas vi&ntilde;as elaborando su propio vino que luego comercializan). Dentro de la comuna Priest tiene dos amantes: Star, que es la novia que ha conocido desde la juventud, y Melanie, una joven separada, guapa y mucho menor que &eacute;l, que tiene un hijo que padece todo tipo de alergias, y que s&oacute;lo se encuentra bien en el valle donde se ubica la comuna. Melanie, que est&aacute; separada de uno de los m&aacute;s insignes sism&oacute;logos del estado de California, es la que aporta los conocimientos te&oacute;ricos al plan de este grupo de hippies.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La novela arranca con el robo de un vibrador s&iacute;smico, aparato que sirve para, a trav&eacute;s de las vibraciones que produce, dar a conocer la composici&oacute;n del suelo. As&iacute; comienza el plan que tiene Priest para salvar a la comuna: amenaza al gobernador de California dici&eacute;ndole que si no se cancela la construcci&oacute;n de m&aacute;s centrales el&eacute;ctricas en dicho estado, ser&aacute; capaz de producir terremotos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A partir de recibir la amenza se llama al FBI para que se encargue de la investigaci&oacute;n: concretamente para aclarar si dicha amenaza tiene fundamento, y si lo tiene descubrir a los terroristas y acabar la amenaza de este grupo. Como en todo organismo federal, se aprecia una serie de luchas internas dentro del FBI que est&aacute;n a punto de hacer fracasar la investigaci&oacute;n. La agente especial que empieza y acaba la investigaci&oacute;n, aunque en alg&uacute;n momento es apartada de ella y vuelve gracias a la intervenci&oacute;n del gobernador, se llama Judy Maddox. Cuando empieza a investigar, se dedica a preguntar a los sism&oacute;logos de California si es posible que la mano humana produzca terremotos, y s&oacute;lo va a recibir una respuesta afirmativa: la del marido de Melanie. A pesar de ello, desde instancias m&aacute;s altas en el FBI se asegura al gobernador que la amenaza carece de fundamento. Ante esto a Priest no le queda otro remedio que provocar un primer terremoto; se trata de un seismo muy peque&ntilde;o. Al ser tan peque&ntilde;o los sism&oacute;logos siguen sin creer que se produjera artificialmente y de nuevo desde la oficina del gobernador se anuncia la carencia de fundamento de dicha amenaza. Un nuevo terremoto, mucho m&aacute;s violento (y ya con v&iacute;ctimas mortales) que el anterior, da una nueva dimensi&oacute;n al problema y tambi&eacute;n da pie a una terrible persecuci&oacute;n que tratar&aacute; de acabar con los terroristas antes de que la presi&oacute;n a la que se ve sometida la oficina del gobernador haga aceptar la propuesta del grupo de Priest.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A trav&eacute;s de este argumento, Ken Follet da una imagen particular de dos mundos bien diferenciados, y algunos sentidos contrapuestos: la visi&oacute;n de un agente del FBI y la de los habitantes de la comuna: </P>
<P ALIGN="JUSTIFY"></P>
<OL>

<LI><P ALIGN="JUSTIFY">En cuanto a las gentes de Priest, destaca la particular visi&oacute;n de la vida a nivel de libertades (sexual, independencia, etc). A&uacute;n as&iacute; es un grupo que renuncia a determinadas cosas que aporta la civilizaci&oacute;n en estos momentos como es la electricidad y determinados tipos de tejidos, entre otras cosas. Ellos creen que su m&eacute;todo de vida es el m&aacute;s sano, aunque consuman marihuana, y como prueba de ello tienen el caso del hijo de Melanie, que es al&eacute;rgico a varias cosas pero que nunca tuvo alergia dentro de la comuna. Adem&aacute;s, todos los integrantes de la comuna est&aacute;n muy orgullosos de lo que tienen, ya que se han consolidado como una comunidad pr&oacute;spera, cuando en sus principios ten&iacute;an que vivir con la idea de que si la cosecha de vino no era buena tendr&iacute;an que dejar aquel lugar al a&ntilde;o siguiente. Como comuna que es, se observan ciertas costumbres de estos sitios como el hecho de que todos cuidan de los hijos de todos y que las mujeres cocinan todas juntas. Pero lo que m&aacute;s llama la atenci&oacute;n de estos personajes son sus ideales, y sobre todo los sexuales, de los que tenemos buena muestra con el tri&aacute;ngulo Star - Priest - Melanie.</LI></P>
<P ALIGN="JUSTIFY"></P>
<LI><P ALIGN="JUSTIFY">Por contraposici&oacute;n nos encontramos con el mundo "civilizado", competitivo y mucho menos humano del FBI. Aqu&iacute; el autor nos muestra las tremendas trampas que existen en la vida laboral, las envidias de unos contra otros, la corrupci&oacute;n y el abuso de poder de los cargos m&aacute;s altos. Aparte, tambi&eacute;n muestra ciertos aspectos de superioridad de los agentes del FBI por el hecho de serlo: como ejemplo aparece un pasaje donde J. Maddox va a ver al sism&oacute;logo sin cita previa y este le dice que tiene que pedirla, que por ser del FBI no tiene derecho a saltarse las reglas establecidas (al final pide la cita y va a verle). Pero no todo es negativo dentro de este mundo; tambi&eacute;n se muestran aspectos positivos como el compa&ntilde;erismo y la confianza dentro de un grupo de trabajo, el sentido del deber pasando por encima de problemas de car&aacute;cter m&aacute;s personal y laboral. Adem&aacute;s, tambi&eacute;n podemos encontrar una muestra de lo que puede ser una investigaci&oacute;n policial y c&oacute;mo, a partir de detalles que parecen totalmente intrascendentes o incluso sin ning&uacute;n tipo de l&oacute;gica, se pueden obtener nuevas v&iacute;as de investigaci&oacute;n que den lugar a la resoluci&oacute;n de alg&uacute;n caso.</LI></P></OL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro aspecto comparativo que lleva a cabo el autor es el de las relaciones amor - sexo y la diferencia de las dos filosof&iacute;as de vida que llevan los personajes de la novela. As&iacute;, mientras el tri&aacute;ngulo Star - Priest - Melanie cree en un amor libre, sin compromisos ni tab&uacute;es, e incluso sin fidelidad, la relaci&oacute;n que tratan de establecer Judy Maddox y Michael, marido de Melanie y sism&oacute;logo, est&aacute; más en consonancia con lo establecido en esta &uacute;ltima parte del siglo XX, es decir, basada en la fidelidad y amor &uacute;nico.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como en todas las novelas de Ken Follet, el lenguaje no es dif&iacute;cil y se hace muy ameno de leer ya que, aunque exista alguna descripci&oacute;n, bien sea de paisajes o de acciones, lo que priman son los di&aacute;logos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se trata de una novela ambientada completamente en la actualidad, ya que, adem&aacute;s de estar fechada en esta &eacute;poca, hace menciones a fen&oacute;menos sociol&oacute;gicos de la actualidad como puede ser el actor Leonardo di Caprio o alguna marca de consola de videojuegos que ahora est&aacute; de moda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En definitiva, se trata de una novela muy entretenida y que aporta ciertas visiones interesantes acerca de dos mundos coet&aacute;neos pero distintos.</P></FONT>
<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr><center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 



</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>



<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





