<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>
<font face=arial>

<H3>La Historia Interminable <br>por Michael Ende</H3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ya s&eacute; que este no es un libro de actualidad, ni algo reci&eacute;n editado, pero creo que merece un espacio en esta revista, despu&eacute;s de todo, es un cl&aacute;sico. </P>
<P ALIGN="JUSTIFY">La Historia Interminable es seguramente conocida por todos gracias a la pel&iacute;cula (ya un poco vieja), pero os aseguro que no le hace justicia, la verdad. De hecho, para reproducir todo el libro, han tenido que hacer dos pel&iacute;culas, ya que la primera trata sobre el libro hasta la primera mitad, y la segunda el resto, y aun as&iacute; han tenido que acortar mucho la trama. Voy a contar a continuaci&oacute;n la trama b&aacute;sica de las dos partes del libro. Cada una de ellas se diferencia claramente de la otra simplemente por el color de las letras, ya que en la primera parte hay letras de un color (cuando Bastian esta leyendo el libro, mundo real) y otras de otro (las aventuras de Atreyu, Fantas&iacute;a), mientras que en la segunda parte las letras son todas del mismo color.</P>
<STRONG><P ALIGN="JUSTIFY">Primera Parte (Desde el capitulo 1 al 13)</P>
</STRONG><P ALIGN="JUSTIFY">La historia esta centrada en dos personajes, Bastian Baltasar Bux y Atreyu. Bastian es un ni&ntilde;o mas bien gordo y d&eacute;bil, muy impopular en la escuela, y que esta realmente demente por los libros. Un d&iacute;a, perseguido por unos ni&ntilde;os, entro corriendo en una librer&iacute;a, donde se encontr&oacute; un hombre bastante antip&aacute;tico que le&iacute;a un libro. El se&ntilde;or (Karl Konrad Koreander) abandona por un momento el sal&oacute;n donde estaba, y entonces Bastian ve el libro que le&iacute;a Karl, y siente un deseo irrefrenable de leerlo. El libro era color cobre y tenia grabado en oro el nombre, "La Historia Interminable". Decide robarlo, y se encierra en el desv&aacute;n del colegio. En cuanto comienza a leer el libro, la historia se divide, y (en la edici&oacute;n que le&iacute; yo) cambian las letras de color, dependiendo si se trata de Bastian en la vida real, o de lo que pasa en el libro. La historia cuenta que la Emperatriz Infantil (leer apartado "Fantas&iacute;a") se enfermo, lo que ha causado un efecto realmente devastador en el mundo, algo llamado "La Nada". Esta nada se come a pedazos el mundo, dejando en su lugar absolutamente nada, ni un color, ni negro, ni nada (me ha costado mucho imaginarme esto, seg&uacute;n el libro "Mirar a la nada es como quedarse ciego"). A la b&uacute;squeda de la cura para la emperatriz es enviado un guerrero de poco mas de 10 a&ntilde;os llamado Atreyu, que vivir&aacute; aventuras sin fin durante todo el libro, incluidas las dos partes.</P>
<B><EM><P ALIGN="JUSTIFY">Fantas&iacute;a</P>
</B></EM><P ALIGN="JUSTIFY">Aqu&iacute; voy a contar mas o menos que es el mundo de Fantas&iacute;a, donde se desarrolla el libro. Fantas&iacute;a es una especie de mundo de los sue&ntilde;os, donde todas las fantas&iacute;as de los humanos se hacen realidad. Por eso, Fantas&iacute;a tiene las m&aacute;s extra&ntilde;as especies de bichos raros, h&eacute;roes extra&ntilde;os, razas inveros&iacute;miles, etc. que nadie haya visto jamas. Fantas&iacute;a se encuentra reinada por la Emperatriz Infantil, un personaje enigm&aacute;tico en realidad. Toda la geograf&iacute;a de Fantas&iacute;a se encuentra en permanente cambio, por lo tanto seria imposible hacer mapas de ese lugar. Tampoco tiene limites, si se tiene en cuenta que esta hecho por las fantas&iacute;as de la gente. Solo se podr&iacute;a decir que hay un lugar de referencia, la torre de Marfil, que siempre esta en el centro de Fantas&iacute;a, y es la residencia de la Emperatriz Infantil.</P>
<STRONG><P ALIGN="JUSTIFY">Segunda Parte (desde el capitulo 13 al 26)</P>
</FONT><I><U><FONT FACE="Arial" SIZE=1><P ALIGN="CENTER">Advertencia</U></STRONG> : Si piensas leer el libro y no te gustar&iacute;a saber como termina la primera parte, <U>no leas lo siguiente.</P>
</I></U></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Luego de salvar a Fantas&iacute;a, Bastian entra en ese mundo, con un poder ilimitado. Ese poder es el de crear cualquier cosa con solo desearlo. As&iacute;, Bastian crea poco a poco partes nuevas de Fantas&iacute;a con sus historias y pensamientos, pero tarde se da cuenta del precio, por cada uno de sus deseos, pierde un recuerdo del mundo de los humanos, el mundo del que &eacute;l viene. Sin embargo, Bastian, lejos de ser humilde, se encierra en sus propios pensamientos, neg&aacute;ndose a volver a su mundo, y deseando cada vez mas, sin importarle nada lo que pierde. Esto le trae la enemistad de Atreyu y Fujur, el drag&oacute;n de la suerte, que queri&eacute;ndolo aconsejar, solo lograron su furia y odio. Un nuevo personaje demoniaco aparece en esta segunda parte, la hechicera Xayide, que intenta hacer olvidar a Bastian, susurr&aacute;ndole las palabras que &eacute;l quiera o&iacute;r, y conden&aacute;ndolo cada vez m&aacute;s. Personalmente me gusto mas la primera parte, sin embargo, esta tambi&eacute;n es muy interesante.</P>
<STRONG><P ALIGN="JUSTIFY">Opiniones Personales</P>
</STRONG><EM><P ALIGN="JUSTIFY">Esto va dedicado a los que habiendo le&iacute;do la obra, desean saber un poco mas, detalles y opiniones que desde mi punto de vista intentare formular. No leer esto si no se ha le&iacute;do la obra, a menos que hayas decidido no leerla y no te importe enterarte de toda la historia (y el final).</P>
</EM><STRONG><P ALIGN="JUSTIFY">El Escritor</P>
</STRONG><P ALIGN="JUSTIFY">Intentare hablar resumidamente sobre el escritor.</P>
<P ALIGN="JUSTIFY">Michael Ende naci&oacute; en garmisch-partenkirchen, en Alemania, en 1929. Curso estudios en la escuela de teatro de C&aacute;mara de Munich y, tras unos a&ntilde;os en los que fue actor, se dedic&oacute; a la literatura. Su primer libro fue Jim Bot&oacute;n y Lucas el Maquinista. , que han seguido otros t&iacute;tulos de &eacute;xito destinados a un publico juvenil, como Momo, Tranquila Trabalenguas, Jojo, historia de un saltimbanqui y El Ponche de los deseos. En la colecci&oacute;n de relatos El Espejo en el espejo se ha dirigido a lectores adultos. ES el creador de la famosa frase "Por Ende…" que se usa como reemplazante del "Por tanto…". Esto sali&oacute; de la costumbre de Ende de acabar sus obras con esa frase.</P>
<STRONG><P ALIGN="JUSTIFY">Diferencias entre la pel&iacute;cula y el libro</P>
</STRONG><P ALIGN="JUSTIFY">Esto va para los que han visto la pel&iacute;cula y deciden que no hace falta leer el libro (craso error!), para que se hagan una idea de lo que se pierden. Tambi&eacute;n va como curiosidad para los que han hecho todo lo contrario, y aun no han tenido la oportunidad de ver la pel&iacute;cula. Tengan en cuenta que la adaptaci&oacute;n del libro siempre tiene que acortar los contenidos, esto no intenta criticar a nadie. Notaran que algunas diferencias no las he escrito, porque a mi entender, convertir&iacute;a al articulo en algo demasiado largo y tedioso.</P>
<OL>

<B><EM><P ALIGN="JUSTIFY"><LI>La Fisonom&iacute;a de Bastian</EM><I>:</B></I> Mientras que en la pel&iacute;cula Bastian aparece con una contextura mas bien normal, se supone que tendr&iacute;a que ser gordo y debilucho, con muy mala imagen de s&iacute; mismo, baja autoestima, etc.</LI></P>
<B><EM><P ALIGN="JUSTIFY"><LI>El llamamiento de Atreyu</EM><I>:</B></I> Atreyu en realidad no se presento en la torre de marfil, sino que no se entero de la enfermedad de la Emperatriz hasta que el centauro medico lo fue a buscar. Adem&aacute;s, la piel de Atreyu era verde.</LI></P>
<B><EM><P ALIGN="JUSTIFY"><LI>Ygramul el m&uacute;ltiple</EM><I>:</B></I> Este personaje y el capitulo dedicado a &eacute;l falta por completo, supongo que por la dificultad de filmaci&oacute;n, y el encuentro con Fujur es en otra parte.</LI></P>
<B><EM><P ALIGN="JUSTIFY"><LI>El Or&aacute;culo del Sur</B><U>:</U></EM> La m&aacute;s notoria de las diferencias es que seg&uacute;n el libro las esfinges dejaban pasar a los que quer&iacute;an, y mataban a los otros plante&aacute;ndoles todos los enigmas del universo, mientras que las de la pel&iacute;cula disparaban rayos al abrir los ojos. Adem&aacute;s, en la pel&iacute;cula falta la tercera puerta del or&aacute;culo, y Uyulala tiene forma de 2 esfinges en lugar de no tener forma y vivir en el recinto con columnas. Y por cierto, en la pel&iacute;cula, Uyulala no habla en verso.</LI></P>
<B><EM><P ALIGN="JUSTIFY"><LI>El lobo:</B></EM> El lobo que persigue a Atreyu nunca lo alcanza en realidad, sino que &eacute;l lo encuentra atado en la ciudad fantasma (que no existe en la pel&iacute;cula). En el libro, Atreyu nunca encuentra a los gigantes de roca, al contrario que en la pel&iacute;cula, en la que reemplazan a las "gentuza".</LI></P>
<B><EM><P ALIGN="JUSTIFY"><LI>El viejo de la monta&ntilde;a errante:</B></EM> Este personaje que escribe durante todo el tiempo la historia de Fantas&iacute;a (y que le da el nombre al libro, ya lo explicare luego) desaparece de la historia en la pel&iacute;cula. Y por cierto, al final Fujur persigue en el mundo real a los ni&ntilde;os malvados, cosa que seria inconcebible en el libro.</LI></P></OL>

<STRONG><P ALIGN="JUSTIFY">El Nombre</P>
</STRONG><P ALIGN="JUSTIFY">Por si no lo hab&eacute;is notado, os voy a decir de donde viene el nombre de Historia Interminable. Fuera de todos los indicios que nos da la obra, el verdadero nombre viene del capitulo donde aparece el viejo de la monta&ntilde;a errante. Este escribe continuamente un libro, contando todo lo que pasa en Fantas&iacute;a, cada detalle, cada cosa, todo. En el momento en que la emperatriz infantil lo obliga a leer el libro para concienciar a Bastian de que &eacute;l era a quien se refer&iacute;an, el viejo lee y reescribe la historia a medida que la lee, y cada vez que llega al punto de la historia donde cuenta como el mismo lee la historia, comienza a leerla de nuevo, y as&iacute; sucesivamente, por toda la eternidad (o hasta que Bastian haga algo). Esto es lo que convierte realmente al libro en una "Historia Interminable".</P>
<STRONG><P ALIGN="JUSTIFY">Opini&oacute;n Personal</P>
</STRONG><P ALIGN="JUSTIFY">A pesar de que mucha gente cree que este libro es infantil, y no lo lee solo por eso, me he deleitado enormemente con su lectura. As&iacute; como otros libros "infantiles", como El Principito, este libro deja al lector impresionado por su f&aacute;cil lectura, su lenguaje simple pero al mismo tiempo profundo en contenido. Se podr&iacute;a decir que el mensaje de este libro es que nunca dejemos de so&ntilde;ar. La llamada "Nada" es algo as&iacute; como la representaci&oacute;n de todos los pensamientos oscuros del hombre, que destruyen su deseo de so&ntilde;ar. As&iacute; Ende nos dice en un momento "todos los personajes de Fantas&iacute;a que caen dentro de la Nada se convierten en mentiras al pasar al mundo real.</P>
<P ALIGN="JUSTIFY">Ya sab&eacute;is entonces, si no hab&eacute;is le&iacute;do el libro, leedlo!, y si ya lo hab&eacute;is hecho, una segunda lectura no har&iacute;a mal ;-). Para terminar con este articulo, solo os digo algo, No dej&eacute;is de so&ntilde;ar, y no os dej&eacute;is inundar por pensamientos serios y correctos, un poco de locura y sue&ntilde;os nos hacen personas mejores.</P>
<I><STRONG><P ALIGN="RIGHT">POR ENDE…</P>
</I></STRONG><P ALIGN="JUSTIFY"></P></FONT>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


