<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A href="mailto:ramis@lettera.net">Pablo Vázquez "Ramis"</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<font face=arial>
<H3>Sin noticias de Gurb<br> por Eduardo Mendoza</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">"Sin noticias de Gurb" relata la b&uacute;squeda de un extraterrestre que ha desaparecido, tras adoptar la apariencia de la vocalista Marta S&aacute;nchez, en la jungla urbana barcelonesa. Pero el protagonista de la narraci&oacute;n no es Gurb, sino otro alien&iacute;gena que sale en pos de &eacute;l (tambi&eacute;n adoptando diversas apariencias de gente conocida de nuestra historia) y cuyo diario constituye el esqueleto de la narraci&oacute;n. La verdadera naturaleza del relato es de car&aacute;cter par&oacute;dico y sat&iacute;rico. La invenci&oacute;n de Eduardo Mendoza convierte esta Barcelona a un tiempo cotidiana y absurda en el escenario de una carnavalada que revela, tras las m&aacute;scaras pintarrajeadas y grotescas, acaso el verdadero rostro del hombre urbano actual, y, tras el chisporroteo del estilo, la acerada conciencia art&iacute;stica del escritor.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Eduardo Mendoza naci&oacute; en Barcelona en 1943 y residi&oacute; en Nueva York de 1973 a 1982. Ha publicado las novelas "La verdad sobre el caso Savolla", que obtuvo el premio de la cr&iacute;tica, "El misterio de la cripta embrujada", "El laberinto de las aceitunas", "La ciudad de los prodigios", "La isla inaudita" y "El a&ntilde;o del diluvio". En colaboraci&oacute;n con su hermana Cristina, ha escrito la obra "Barcelona modernista". Es autor de la obra teatral en catal&aacute;n "Restauraci&oacute;", que &eacute;l mismo ha traducido al castellano.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como ya se ha se&ntilde;alado en la introducci&oacute;n, el libro cuenta, en 15 d&iacute;as, la b&uacute;squeda de Gurb, un extraterrestre que, para no llamar la atenci&oacute;n de la fauna aut&oacute;ctona (real y potencial), toma la apariencia del ser humano denominado Marta S&aacute;nchez. Por ello, el protagonista de la novela es otro alien&iacute;gena que, al no tener noticias de Gurb, sale en su b&uacute;squeda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A trav&eacute;s de esa b&uacute;squeda, el autor refleja multitud de reflexiones, unas desde la s&aacute;tira y otras desde la narraci&oacute;n. As&iacute;, por ejemplo, al principio cuenta los problemas del personaje para adaptarse tanto a la nueva forma de vida: es atropellado por distintos veh&iacute;culos, cae en diversas "zanjas" y acaba reventado por tener que respirar, caminar, etc....</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez acostumbrado a l medio empieza a lanzar diversas cr&iacute;ticas a trav&eacute;s de las dificultades que tiene el protagonista para valerse por s&iacute; mismo. Comenta las diferencias entre pobres y ricos visitando dos barrios completamente distintos de Barcelona; tambi&eacute;n comenta los problemas econ&oacute;micos que tiene tras comer en restaurantes y su curiosa manera de resolverlos (este tema acaba con una curiosa frase; "El dinero no da la felicidad").</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C&oacute;mo no, tambi&eacute;n toca el tema de la pol&iacute;tica (con una menci&oacute;n, de pasada, a Guerra), el f&uacute;tbol (comentando la alineaci&oacute;n de Espa&ntilde;a para el mundial) e incluso la televisi&oacute;n (contado una curiosa an&eacute;cdota en un concurso televisivo)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En otro par de pasajes tarta el tema de la "movida" nocturna e incluso sus problemas con el alcohol y sus consecuencias (una vez termina en el cuartelillo, y varias veces con una tremenda resaca). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Junto con estos temas y otros que me han quedado en el tintero, puede verse que, a trav&eacute;s de &eacute;ste libro, el autor refleja su visi&oacute;n de la sociedad de principios de los noventa. Eso s&iacute;, la visi&oacute;n que ofrece no es profunda, ni desde el punto de vista del an&aacute;lisis de las causas, ni tampoco desde el contenido.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En cuanto al an&aacute;lisis de la forma del libro, lo que en principio llama m&aacute;s la atenci&oacute;n, es que est&aacute; escrito en forma de diario, con horas y d&iacute;as; cada d&iacute;a viene a constituir un cap&iacute;tulo. Esta escrito con un lenguaje muy sencillo, sin apenas un t&eacute;rmino de dif&iacute;cil compresi&oacute;n; como es normal en los diarios est&aacute; escrito en primera persona y alterna p&aacute;rrafos donde hay frases largas (e incluso alguna descripci&oacute;n detallada de alg&uacute;n aspecto especial) con p&aacute;rrafos hechos a base de frases cortas, casi telegr&aacute;ficas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra de las grandes curiosidades que posee &eacute;ste relato es la manera que tiene el autor de utilizar algo tan "fant&aacute;stico", como es la visita de dos extraterrestres a Barcelona, para dar su visi&oacute;n sat&iacute;rica de la sociedad. Otro aspecto que tambi&eacute;n destaca radica en el hecho de que el autor no pasa a analizar profundamente los temas que trata, sino que simplemente los trata a trav&eacute;s de peque&ntilde;as situaciones particulares. Lo que es s&iacute; es cierto es que el libro tiene multitud de situaciones y cada una de ellas posee una lectura particular.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La gran ventaja de la ausencia de profundidad en las cr&iacute;ticas que el autor lleva a cabo es que al lector, el libro le resulta ameno y entretenido, ya que carece de largas disertaciones que podr&iacute;an aburrir e incluso hacer de la novela un relato muy denso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En mi opini&oacute;n, se trata de un libro de recomendable lectura.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr><center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


