<HTML><BASE TARGET="TEXTO"><BODY BGCOLOR="#FFFFFF"><center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2><TD><TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2><TR><TD><DIV align="center"><FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR></DIV></TD></TR></TABLE></TD></TABLE></center><br><HR><TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2><TD><TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2><TR><TD><DIV align="left"><FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rítica de Cine</B></FONT></a></DIV></TD></TR></TABLE></TD></TABLE><br><br><img src="g_misc/69.gif" align=right><P align=right><b><FONT color="#cc0000" size=2 face="arial">A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br><A href="mailto:afeliu@retmail.es">Albert Feliu</a></b></FONT><br><br><BR><BR><BR><BR><BR><font face=arial>
<H3>La niña de tus ojos. <br></H3><FONT color="#000000" face="arial"><FONT color="#000000" size=2 face="arial"><P ALIGN=justify>Es sorprendente como la humanidad es capaz de dar la espalda a las realidades m&aacute;s crudas. En este film podremos ver como un grupo de actores espa&ntilde;oles marchan hasta la Alemania nazi para participar en una producci&oacute;n cinematogr&aacute;fica mientras Espa&ntilde;a se hunde en una guerra civil incoherente y Europa cierra los ojos ante el crecimiento del movimiento nacional-socialista. Asistiremos a las mil y unas peripecias de este curioso grupo de almas, cada una con sus propias penas personales, pero unidas en un intento de saltar a la fama.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">El reparto cuenta con estrellas de m&aacute;ximo nivel, entre ellas encontraremos a grandes profesionales como Antonio Resines, Pen&eacute;lope Cruz (reci&eacute;n galardonada con un premio Goya por su interpretaci&oacute;n en esta pel&iacute;cula), Rosa Mar&iacute;a Sard&aacute;, Loles Le&oacute;n, Jorge Sanz, Neus Asensi y un espectacular Santiago Segura en un papel completamente diferente de lo habitual en el, entre muchos otros. </P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Cuando asistamos al cine nos enfrentaremos a una pel&iacute;cula con cierto aire a cr&iacute;tica hacia la sociedad del momento, nos presentar&aacute;n un grupo de cineastas que viven alejados de la cruda realidad, alojados en su mundo de facilidades. Los actores han recreado un entorno excelente en el que se mezcla el reflejo de aquella dif&iacute;cil sociedad con cucharadas de humor que hacen el conjunto de la pel&iacute;cula muy recomendable. Una pel&iacute;cula que no nos aburrirá, revalorizada por su triunfo en los premios Goya.</P>
<font face=arial>
<h3>Entre las piernas</h3><P ALIGN="JUSTIFY">Nos enfrentamos a una pel&iacute;cula que quiz&aacute;s nos haga entender la posici&oacute;n dentro de nuestra sociedad de muchas personas, entenderemos porque hacen las cosas que hacen y porque a veces descubrimos que no son lo que parecen ser. Reflejando una realidad palpable de nuestra sociedad, veremos pasar ante nuestros ojos las andanzas de dos amantes, adictos al sexo; veremos como se puede llegar a temer a un enemigo que nunca ha existido, veremos como casi siempre las cosas no s&oacute;n lo que parecen ser. Un film recomendable para ver una tarde que estemos aburridos.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Catalogado como thriller, entraremos en un mundo de traiciones y frases con doble sentido. Asistiremos a un gran papel de los actores protagonistas; Carmelo G&oacute;mez, el GRAN Carmelo G&oacute;mez, nos mostrara el lado m&aacute;s oscuro de un matrimonio, nos har&aacute; entender porque se puede llegar a odiar a alguien, Victoria Abril, en el papel de mujer desencantada, se dejar&aacute; seducir por un Javier Bardem escritor de guiones. Guiones que podr&iacute;an reflejar su propia existencia. </P><P ALIGN="JUSTIFY"></P>
<font face=Arial>
<h3>Salvar al Soldado Ryan</h3>

<P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Del Rey Midas de Hollywood nos llega su &uacute;ltima superproducci&oacute;n. Una pel&iacute;cula b&eacute;lica basada en la segunda guerra mundial. El director de &quot;La lista de Schindler&quot; vuelve a apostar por un gui&oacute;n facil&oacute;n, muy en su l&iacute;nea, que nos transmitir&aacute; un mensaje moralista barato, y que convierte a esta pel&iacute;cula en una consecuci&oacute;n de efectos de luces y sonidos.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Asistiremos a la cruzada de unos hombres que arriesgar&aacute;n su vida para salvar un nombre, el soldado Ryan. Alguien a quien no conocen, no quieren conocer, alguien a quien quieren encontrar para devolverlo a casa. Tom Hanks se nos presenta en el papel del mando de este grupo de hombres, en un papel realmente bien interpretado.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Es de elogio la recreaci&oacute;n y la ambientaci&oacute;n perfecta del campo de batalla que era Francia en 1945. Las secuencias de combate son sencillamente geniales, llegando a veces a rozar lo macabro. Veremos, y casi sentiremos, el dolor de aquellos hombres que arriesgaron su vida por, en teor&iacute;a, defender unos ideales.</P><P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY">Una pel&iacute;cula muy recomendable si sabemos controlar nuestro estomago, a pesar de las tres horas que dura. Quiz&aacute;s, si la pel&iacute;cula fuera un poco m&aacute;s corta y huyera del mensaje intimista barato, nos encontrar&iacute;amos ante una pel&iacute;cula &uacute;nica.</P></FONT><br><br><P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR><hr><center><TABLE CELLPADDING=2 WIDTH="100%"><TD  WIDTH="50%" VALIGN="TOP" align="left"><TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspaci
ng=0 CELLPADDING=2><TD><TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2><TR><TD><DIV align="CENTER"><FONT SIZE=2><A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR><A HREF="ocioc.htm"><font FACE="ARIAL"><B>[Crítica de Cine]</B></font></a> </DIV></TD></TR></TABLE></TD></TABLE></TD></TABLE><br><HR><CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" ><TR><TD><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" ><TR><TD><CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER></TD></TR></TABLE><CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" ><TR><TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD></TR></TABLE></CENTER><DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" ><TR><TD><CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER></TD></TR></TABLE></DIV></TD></TR></TABLE></CENTER></HTML>