<HTML>
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>E</B></font><FONT color="#000000" size=6 face="arial"><B>ntrevistas <FONT COLOR="#cc0000" size=6 face="arial"> &</FONT><br> <FONT COLOR="#009933" size=6 face="arial">F</FONT>irmas Invitadas</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>ntrevistas</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>
<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
E</font><FONT color="#000000" size=2 face="arial">ntrevista realizada por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br>




<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Entrevista a Rafael Latiegui, Ramón Hernáez y Felipe Gómez.
</FONT>
</H3>


<p align=justify>

<FONT color="#000000" size=2 face="arial" >        
<P ALIGN=JUSTIFY>
Cuando Péndulo Studios sacó a la venta la primera aventura gráfica comercial realizada aquí,
en España, muchos de nosotros casi no nos lo podíamos creer. Tras la sequía que 
arrastramos desde la época de los 8 bits, no habíamos visto si quiera un
atisbo de resurgimiento, real, de nuestras casas de desarrollo y así, derrepente
y casi sin quererlo, Péndulo se ha colocado como una de las casas más queridas
de nuestro país y ya puede presumir de contar con una gran cantidad de incondicionales y
de lo más importante, demostrar con <i>hechos</i> que ellos no sólo saben hacer
juegos, sino que saben hacer buenos juegos. Aventuras, para ser más exactos. <br><br>
El motor que rige esta casa de desarrollo se sustenta en tres pilares que son <b>Rafael
Latiegui</b>, <b>Ramón Hernáez</b> y <b>Felipe Gómez</b> y si me permitis, un equipo
con la madurez que hace falta para realizar buenas aventuras.
<br><br>
En esta entrevista yo he sacado un montón de conclusiones. Os recomiendo que la
leáis pausadamente no sólo una vez sino varias porque, como he dicho, se aprende
y mucho.
<BR><br>
Antes de dejaros ya con esta extensa entrevista, volver a saludar a Rafa, Ramón y
Felipe ya que me han demostrado un tratamiento de lo más atento y preocupado cuando,
en realidad, a penas tienen tiempo para atender a grandes (pero plastas ;) ) ilusionados
de este mundillo.
<br> Muchas gracias Péndulo.
<hr>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>Macedonia Magazine.- </b></font>
<FONT FACE="Arial" SIZE=2>
<I>En primer lugar, daros las gracias por permitir esta entrevista y m&aacute;s teniendo en cuenta lo liados de trabajo que est&aacute;is estos momentos en los que os encontr&aacute;is inmersos en la versi&oacute;n de Hollywood Monsters para el mercado italiano con c&oacute;digo nativo en Win32.</I></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>Péndulo Studios.- </b></font>Bueno, esa versi&oacute;n ya est&aacute; terminada y totalmente depurada. De hecho, el Hollywood Monsters ya ha sido publicado este mes en Italia y la respuesta de la cr&iacute;tica en las revistas no ha podido ser m&aacute;s positiva. Ahora queda ver c&oacute;mo reaccionan los usuarios&nbsp;:-).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>
P&eacute;ndulo es una casa de soft sustentada en tres pilares b&aacute;sicos 
que son Ram&oacute;n Hern&aacute;ez, Felipe G&oacute;mez y Rafael Latiegui sin embargo, esta amistad que ha posibilitado el nacimiento de P&eacute;ndulo ¿d&oacute;nde encuentra su punto de partida?, es decir, ¿cu&aacute;l es el origen de P&eacute;ndulo?.</I></P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>Rafael Latiegui.- </b></font></B>P&eacute;ndulo se form&oacute; hace ya unos cinco a&ntilde;os, cuando despu&eacute;s de dar muchas vueltas al asunto, decidimos que no era impensable hacer una aventura gr&aacute;fica que pudiera competir con lo que hab&iacute;a en el mercado por aquel momento y nos pusimos manos a la obra.<BR>
<B><FONT color="#AF0C00"><b>Ramón Hernáez.- </b></font></B>Se puede decir que yo fui el nexo de uni&oacute;n entre Rafa y Felipe, ya que Felipe y yo estudiamos juntos en el colegio por lo que nos conoc&iacute;amos desde peque&ntilde;os, y posteriormente conoc&iacute; a Rafa al entrar en la facultad.</P>
<br><br>
<CENTER><TABLE><td>
<center><img src="jpg/equipo.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<center>
<b>
Aquí tenéis a este imponente trio que es el corazón de Péndulo Studios.<br>
De izquierda a derecha tenemos a <FONT color="#AF0CAA">Ramón Hernáez</font> y 
<FONT color="#AF0CAA">Felipe Gómez</font> (a la derecha del todo), 
como programadores jefe de Péndulo Studios. <FONT color="#AF0CAA">Rafael Latiegui</font> (sentado), es el responsable el departamento
gráfico.<br>
Aparte, Rafael, Ramón y Felipe, se encargan de diseñar y desarrollar el
argumento y guión de los títulos de Péndulo.
</b>
</center></td>
</table></center>
<p align = justify>
<br><br>

<P ALIGN="JUSTIFY"></P><P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Igor, Objetivo Uikokahonia (a partir de ahora Igor) fue vuestro primer producto y, dicho sea de paso, la primera aventura gr&aacute;fica realizada en Espa&ntilde;a. Me supongo que guardar&eacute;is para &eacute;l un recuerdo muy especial sin embargo, me gustar&iacute;a saber de d&oacute;nde surge la idea de Igor y cu&aacute;nto tiempo real os cost&oacute; desarrollarlo plenamente.</P>
</I><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>El gui&oacute;n de Igor, sufri&oacute; diez mil cambios hasta tomar forma. Creo que, de alguna manera, nos divirti&oacute; enormemente el hecho de poder reflejar en un juego el ambiente estudiantil que hab&iacute;amos vivido todos.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>El tiempo total de desarrollo es dif&iacute;cil de precisar ya que los primeros meses nos junt&aacute;bamos en ratos libres y de una forma m&aacute;s bien amateur. Cuando realmente vimos que pod&iacute;amos sacar adelante el proyecto fue cuando empez&oacute; el desarrollo serio, que nos llev&oacute; unos seis meses con jornada de trabajo completa. Creo que se puede decir que el tiempo total podr&iacute;a fijarse en nueve meses.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>¿Lo tuvisteis muy dif&iacute;cil para encontrar la distribuidora que os permitiera mostrar el producto o enseguida os fue aceptado?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Nos empezamos a mover con una peque&ntilde;a demo y encontrar distribuidora en Espa&ntilde;a no fue dif&iacute;cil, aunque alguna de ellas no cre&iacute;a en el producto; de hecho, hubo una en la que directamente ni siquiera nos recibieron por tratarse de un juego espa&ntilde;ol, ya que ellos s&oacute;lo distribu&iacute;an software extranjero; en otras palabras, quer&iacute;an decir que asociaban un producto espa&ntilde;ol con p&eacute;sima calidad. Afortunadamente, esta actitud parece haber desaparecido ya.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>La verdad es que fue f&aacute;cil, tuvimos varias ofertas y, de hecho, nos cost&oacute; mucho tomar la decisi&oacute;n de optar finalmente por DroSoft.<B>.</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Me supongo que al realizaci&oacute;n del Igor, al ser vuestro primer producto, no ser&iacute;a tarea sencilla, ¿cu&aacute;l fue la parte que m&aacute;s os cost&oacute; desarrollar: el aspecto gr&aacute;fico, de c&oacute;digo o el desarrollo y gui&oacute;n del mismo?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Como t&uacute; dices, al ser el primer juego, cada cosa tuvo sus dificultades y tuvimos que aprender un poco de todo sobre la marcha. Pero eso no ha parado desde entonces, incluso finalizando HollyWood Monsters segu&iacute;amos aprendiendo cosas y espero que nunca dejemos de hacerlo.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Quiz&aacute;s lo m&aacute;s complicado fue la parte gr&aacute;fica en el aspecto econ&oacute;mico, ya que para ella necesitamos encontrar un fondista contando con un presupuesto m&iacute;nimo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>¿En todo el desarrollo del Igor os sentisteis con seguridad para concluirlo o hubo alg&uacute;n momento en el que os vierais "pillados" con vuestra propia creaci&oacute;n?. Y os lo pregunto pensando en los duros comienzos de un proyecto con el que intentar fundar una casa de soft, en el que el &uacute;nico "compa&ntilde;ero de viaje" es la propia seguridad que tenga el equipo de desarrollo en si mismo.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Hubo un momento en que estuvimos a punto de dejarlo todo con Igor, ya que las expectativas econ&oacute;micas que mostraron en un principio las distribuidoras no eran todo lo buenas que nosotros hab&iacute;amos calculado, y al fin y al cabo ese juego se hab&iacute;a convertido en nuestro trabajo a jornada completa.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Tuvimos momentos de desaliento, pero siempre fue a causa de problemas econ&oacute;micos, nunca por cuestiones del propio desarrollo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>He de reconocer que durante el periodo que sigui&oacute; al desarrollo del Igor pas&oacute; un tiempo que a uno se le antoj&oacute; demasiado largo. Incluso pude leer rumores de que hab&iacute;ais sido contratados por Infogrames y de una versi&oacute;n de Igor en otro idioma y posterior distribuci&oacute;n en el resto de Europa, pasando por "cotilleos" que apuntaban a vuestra desaparici&oacute;n... Luego lleg&oacute;, de sorpresa, el Hollywood Monsters (a partir de ahora HM). Durante todo ese intervalo de tiempo que va del Igor hasta el HM, ¿d&oacute;nde estuvisteis metidos?, es decir, ¿el HM realmente os llevo todo ese tiempo?, y ¿c&oacute;mo es que, teniendo el "engine" del Igor desarrollado no saliera ninguna otra aventura hasta el actual HM?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><TABLE align="left"><td>
<center><img src="jpg/igor01.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="left"><b>Aquí tenéis, en exclusiva,
una captura de la <br>versión de Igor que salio en EEUU.</b>
<b>
</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Bueno, es cierto que hubo muchas reuniones con Infogrames y de hecho, se lleg&oacute; a un acuerdo para su distribuci&oacute;n, pero por problemas internos suyos, al final tuvieron que echar para atr&aacute;s varios proyectos, entre los cuales se encontraba Igor<I>.</I> Respecto a otras versiones del programa, se desarroll&oacute; una versi&oacute;n para Estados unidos con int&eacute;rprete mejorado y algunas pantallas nuevas. Lamentablemente, la compa&ntilde;&iacute;a que lo licenci&oacute; no hizo un buen trabajo de distribuci&oacute;n all&iacute; y el producto pas&oacute; un poco desapercibido. En Espa&ntilde;a, va a lanzarse muy pronto a trav&eacute;s del peri&oacute;dico El Mundo una versi&oacute;n CD-Rom con voces, m&uacute;sica audio y todas las mejoras de la versi&oacute;n americana.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Al terminar Igor, una cosa que ten&iacute;amos clara era que hab&iacute;a que mejorar el engine para ofrecer m&aacute;s calidad en un siguiente proyecto. De forma que desarrollamos uno muy potente en modo protegido y 320x200. Requer&iacute;a cuatro megas de Ram, lo que permit&iacute;a scrolls multidireccionales en pantallas de gran tama&ntilde;o, as&iacute; como animaciones enormes y suaves estilo dibujos animados, voces, etc. Bajo este nuevo engine comenzamos a desarrollar el Igor que quer&iacute;a Infogrames, pero lamentablemente, el proyecto tuvo que paralizarse y nunca sali&oacute; a la luz el engine. En esos momentos, el mercado avanz&oacute; mucho tecnol&oacute;gicamente y tuvimos que ponernos manos a la obra partiendo desde cero con otro engine que funcionase en alta resoluci&oacute;n, el utilizado finalmente en HM.</P>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00">
<TABLE align="right"><td>
<center><img src="jpg/demo1.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="right"><b>Y otra super exclusiva:<br> la versión de Igor que
Péndulo estaba preparando<br> para la casa fracesa Infogrames.
Vaya cambio<br> que sufrió el bueno de Igor ¿eh?.<br>
Una auténtica lastima que se tuviera que paralizar<br> el proyecto porque
la pinta era estupenda.
</b>
<b>
</b></p>
</td>
</table>
<p align = justify>

<b>MM.- </b></font><I>El HM sali&oacute; a la venta en plenas navidades pasadas cuando el g&eacute;nero de moda, la estrategia en tiempo real, se disputaba todas las ventas sin embargo, vuestra aventura ha conseguido ya un enorme &eacute;xito de ventas. ¿Os esperabais un recibimiento as&iacute; para vuestra segunda "criatura" y m&aacute;s teniendo en cuenta el estado por el que est&aacute; atravesando el mundo aventurero?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Est&aacute;bamos seguros de su &eacute;xito por tratarse de un programa de alta calidad a un precio muy barato. Confi&aacute;bamos que el boca a boca funcionara y as&iacute; ha sido, hemos recibido montones de emails y cartas de personas felicit&aacute;ndonos, lo cual nos hace sentirnos bastante satisfechos.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Nuestra enorme fe en el g&eacute;nero de la aventura impidi&oacute; que nos desanim&aacute;ramos ante el &eacute;xito arrollador de la estrategia. Siempre confiamos en que una buena aventura ten&iacute;a que tener su sitio en el mercado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Pese a que vosotros tres sois las cabezas visibles de todo proyecto de P&eacute;ndulo, supongo que un producto de las caracter&iacute;sticas de HM no podr&iacute;a haber sido realizado &uacute;nicamente por tres personas, es decir ¿cu&aacute;nta gente real particip&oacute; en la creaci&oacute;n de HM? y ¿cu&aacute;l ha sido el cambio mas importante a la hora de trabajar en el HM frente al Igor?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>En HM han participado alrededor de cuarenta personas contando con todos los actores que han doblado las voces.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>El cambio m&aacute;s importante, sin duda alguna, ha sido al tener que coordinar el trabajo de tantas personas, que en la mayor&iacute;a de los casos trabajaban por cuenta ajena, y no en nuestra propia oficina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Desde luego una de las caracter&iacute;sticas que m&aacute;s han llamado la atenci&oacute;n sobre este producto ha sido su notable dificultad o, al menos, pertenecer al grupo de aventuras no apto para noveles en estas lides. ¿Los puzzles que desarrollasteis para el HM fueron "intencionados", es decir, quer&iacute;ais hacer un producto, desde el comienzo, con una dificultad m&aacute;s que notable o, simplemente, "os sali&oacute; as&iacute;"?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>La dificultad de los puzzles de HM fue premeditada, ya que tras salir a la calle Igor, pudimos comprobar que la dificultad del juego no era lo suficientemente alta y la gente llegaba al final del juego con rapidez. Personalmente creo que elevar la dificultad de HM ha sido todo un acierto.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Personalmente, opino que la dificultad en acabar el juego no radica tanto en lo dif&iacute;ciles que sean los puzzles, sino en la enorme longitud de la aventura. HM es un juego que ofrece muchas m&aacute;s horas de juego que la mayor&iacute;a de aventuras en el mercado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">
<p align = justify><TABLE align="right"><td>
<center><img src="jpg/hm3.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="right"><b>El HollyWood Monsters ha resultado
ser <br>sobresaliente tanto en el desarrollo como en el<br> apartado
gráfico, como podéis comprobar.<br> ¡Esto sí que es 
evolucionar!.</b>
<b>
</b>
</p></td>
</table>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>El salto que ha habido del Igor al HM es casi "abismal", en cuanto a gr&aacute;ficos, desarrollo y calidad en general. Desde luego, era dif&iacute;cil pensar que con un segundo titulo se pudieran perfeccionar y asimilar tan r&aacute;pidamente un estilo de creaci&oacute;n. El tercer titulo que os de la tan ansiada "consagraci&oacute;n" ;-), ¿presentar&aacute; alguna novedad m&aacute;s que significativa en vuestra l&iacute;nea de producci&oacute;n (a nivel de interfaz, gr&aacute;fico, etc) o seguir&aacute; la misma l&iacute;nea que el HM? y... ya de paso, la pregunta ineludible, ¿nos podr&iacute;ais dar alguna m&iacute;nima informaci&oacute;n de lo que ser&aacute; vuestra tercera creaci&oacute;n y para cuando estar&iacute;a lista?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Nuestro pr&oacute;ximo proyecto dar&aacute; un salto en calidad con respecto a HM tan grande como &eacute;ste de Igor. No podemos adelantar detalles, pero las primeras muestras de trabajo est&aacute;n quedando geniales, tanto a nivel gr&aacute;fico como de programaci&oacute;n.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Desde que se empez&oacute; a producir HM con el engine ya creado, hasta el final de dicha producci&oacute;n, hubo un mont&oacute;n de buenas ideas para mejorar aspectos gr&aacute;ficos y t&eacute;cnicos. Todas esas ideas y muchas m&aacute;s se van a incluir en el nuevo proyecto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Leyendo la entrevista que os hizo Jordi Espunya en MeriStation, pude comprobar que Rafa Latiegui tiene raices mas que profundas, teniendo en cuenta que viene de los 8 bits e incluso que ya, en esa &eacute;poca, hizo sus "pinitos" en el mundo de  los juegos. Me gustar&iacute;a preguntaros por "vuestro pasado". ¿La totalidad del equipo de P&eacute;ndulo se "educ&oacute;" dentro de esa fant&aacute;stica &eacute;poca? y, de ser as&iacute;, ¿cu&aacute;les fueron entonces vuestros juegos preferidos, aquellos que record&aacute;is de un modo especial?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>En mi caso, mi pasado es un tanto at&iacute;pico ya que mientras todo el mundo ten&iacute;a un Spectrum o Amstrad o Commodore, yo ten&iacute;a un Dragon 64 y no hab&iacute;a pr&aacute;cticamente nadie en Espa&ntilde;a con ese ordenador y mucho menos tiendas que vendieran software compatible, por lo que me limitaba a hacer mis propias chapucillas y ense&ntilde;&aacute;rselas a mis amiguetes.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>S&iacute;, mi primera m&aacute;quina fue un Amstrad CPC 6128. Mi mayor afici&oacute;n no era jugar, sino trastear empezando a aprender los secretos de estos chismes. Sin embargo, recuerdo con especial cari&ntilde;o juegos como el Knight Lore, Manic Miner o Jet Set Willy.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Durante aquella &eacute;pocas, me supongo que ya ser&iacute;ais seguidores de las cl&aacute;sicas conversacionales, ¿qu&eacute; opini&oacute;n os merecen ese g&eacute;nero madre de las actuales aventuras gr&aacute;ficas?, ¿cre&eacute;is que deber&iacute;an de volver a la palestra o, por el contrario, veis a el parser como un m&eacute;todo de comunicaci&oacute;n restringido a un reducido n&uacute;cleo de jugadores sin posibilidad de ser utilizado en productos "comerciales"?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font> </B>A m&iacute; siempre me gustaron, aunque creo que la aventura gr&aacute;fica ha eclipsado de tal forma el g&eacute;nero conversacional, que veo improbable una resurrecci&oacute;n a nivel comercial. <BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Veo harto improbable la reaparici&oacute;n del g&eacute;nero conversacional tal y como lo conocimos. Quiz&aacute;s el reconocimiento de voz pueda hacer resurgir ese g&eacute;nero sustituyendo el teclado por un micr&oacute;fono.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Como insinuaba mas arriba, el g&eacute;nero de las aventura se ha visto sobrecargado con montones de a&ntilde;adidos para hacerle m&aacute;s "vendible" en los tiempos que corren. ¿Cu&aacute;l es vuestra opini&oacute;n sobre el panorama actual de las aventuras, teniendo en cuenta t&iacute;tulos, (que todos tenemos en mente)  que van a incorporar ya entornos tridimensionales?, ¿Cre&eacute;is que el panorama se ha convertido en algo puramente comercial desplazando esa magia que toda aventura sol&iacute;a tener?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Actualmente no me gusta demasiado lo que se hace en cuesti&oacute;n de aventuras, salvo excepciones claro. Creo que la mejor &eacute;poca fue cuando Sierra empez&oacute; a lanzar sus primeras secuelas de los &quot;quest&quot; originales. Cada a&ntilde;o llegaban nuevos Space Quest, King’s Quest, Larry... y todos estos juegos alcanzaron la cumbre con la llegada de cosas estilo Quest for Glory, Colonel’s Bequest y las obras de arte de Lucas; aventuras como Monkey Island, Day of the Tentacle o el Fate of Atlantis son muy dif&iacute;ciles de superar a&uacute;n hoy en d&iacute;a. El alma de una aventura es el gui&oacute;n, si &eacute;ste es bueno y no se deja ahogar por el resto de la producci&oacute;n, la aventura ser&aacute; un &eacute;xito...<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Posiblemente s&iacute; se est&eacute; perdiendo el esp&iacute;ritu cl&aacute;sico de las aventuras en cierta medida. El problema, pienso, radica en que las grandes casas (no todas) se preocupan m&aacute;s de intentar asombrar al usuario con maravillosas intros y escenas autom&aacute;ticas (que casi nunca se corresponden con el resto de la aventura) que de elaborar buenos guiones llenos de puzzles ingeniosos que hagan al usuario meterse plenamente en el juego y disfrutar de &eacute;l. Creo que hay que apostar mucho m&aacute;s por un usuario interactuando con el juego, y no por un usuario espectador que simplemente contemple el juego.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>El panorama Aventurero siempre ha estado dominado por casas como Lucas Arts o Sierra, marcando la pauta de los dem&aacute;s productores mundiales sin embargo, ¿cu&aacute;l es el signo distintivo del que pretend&eacute;is dotar a vuestras producciones?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Ante todo la calidad, los compradores no son tontos y si se sienten defraudados con uno de tus productos, no comprar&aacute;n el siguiente. Creo que LucasArts es un ejemplo perfecto a seguir, tal y como lo fue Sierra en sus primeros tiempos.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Nuestro objetivo es que llegue el d&iacute;a que el usuario al ver una de nuestras producciones diga algo as&iacute; como &quot;se nota que es de P&eacute;ndulo&quot;, y que lo diga con satisfacci&oacute;n, claro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Si antes habl&aacute;bamos del panorama Yankee, tambi&eacute;n deber&iacute;amos de fijarnos en el Europeo y es que tan solo hay actualmente dos casas que se dediquen de cuerpo y alma a la producci&oacute;n de este g&eacute;nero. Una es Revolution Software y la otra, pues vosotros mismos. Mi pregunta es la siguiente, ¿cre&eacute;is que el genero de la aventura ha pasado ya sus mejores momentos o, como ciertos t&iacute;tulos parecen indicar, se vuelve al rescate del mismo en un plazo de uno o dos a&ntilde;os m&aacute;ximo?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><TABLE align="left"><td>
<center><img src="jpg/hm4.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="left"><b>Una de las particularidades del HollyWood es el<br>
hecho de que la primera parte del mismo<br> se desarrolla con una
protagonista femenina. <br>¡Aquí tenéis a Sue en plena acción!</b>
<b>
</b></p>
</td>
</table>
<p align = justify><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Honestamente, creo que todos los g&eacute;neros pasan por ciclos. En estos momentos, los programas de estrategia est&aacute;n viviendo una &eacute;poca fant&aacute;stica en cuanto a ventas y aceptaci&oacute;n, pero poco antes hab&iacute;an sido los de lucha... La aventura gr&aacute;fica est&aacute; resurgiendo ahora con t&iacute;tulos como Curse of Monkey Island, Broken Sword 2 o el mismo Hollywood Monsters. Y realmente estoy seguro que las producciones van a aumentar en calidad y popularidad.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B> Sin duda, la aventura ha conocido tiempos mejores pero no creo que esto signifique en absoluto que no pueda competir con el resto de los g&eacute;neros y, por qu&eacute; no, llegar a ser de nuevo uno de los preferidos por el usuario. Somos los creadores los que tenemos que conseguir esto con producciones de gran calidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>La verdad, es que nos encontramos con tal cantidad de productos que no siguen unas normas b&aacute;sicas, que son realmente dif&iacute;ciles de clasificar sin que la gente pueda llegar "a las manos". Solo hay que leer an&aacute;lisis de juegos en los que unos opinan que el producto es un arcade mientras que otros opinan que puede ser catalogado como una aventura... la pregunta que os hago ahora no es sencilla: ¿qu&eacute; son los elementos esenciales que para vosotros deber&iacute;a de tener una aventura, es decir, cual es la definici&oacute;n de P&eacute;ndulo del termino aventura?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>¡Vaya pregunta! Supongo que podr&iacute;a calificar como aventura un juego basado en una historia y en cuyo desarrollo prime especialmente la resoluci&oacute;n de puzzles por encima de la acci&oacute;n o la estrategia.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Por favor, no me hagas replantearme toda mi existencia...</P>
<P ALIGN="JUSTIFY"></P> 
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>¿P&eacute;ndulo siempre desarrollar&aacute; aventuras o, por el contrario, se os ha pasado ya por mente meteros en alg&uacute;n g&eacute;nero que pueda mantener ciertas similitudes con este como, por ejemplo, juegos de rol-aventura (estilo Ultima VII)? y, por otro lado, ¿qu&eacute; g&eacute;nero ser&aacute; el que nunca tocar&iacute;ais y por qu&eacute;?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Nunca puedes decir de este agua no beber&eacute;, pero para desarrollar un buen juego es imprescindible conocer a fondo el g&eacute;nero. Hay otro tipo de juegos que me atraen mucho, como la estrategia y la mezcla rol-aventura, y hay otros que no me veo desarrollando, como simuladores de vuelo o deportivos.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B> De momento, es poco probable abordar otro g&eacute;nero distinto a la aventura, pero tal vez m&aacute;s adelante pudieran tener cabida el rol y la estrategia. Creo poder asegurarte que nunca haremos juegos de lucha o deportivos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>Las exigencias que se piden en la actualidad para desarrollar juegos resultan a todas luces, realmente elevadas para personas que se est&aacute;n iniciando en este mundo o intentan seguir y adquirir experiencia lo mejor que puedan (pese a que hay importantes iniciativas como el concurso de creaci&oacute;n de aventuras del CAAD), de todas formas,¿no cre&eacute;is que tanta "novedad tecnol&oacute;gica" puede llegar a ser algo totalmente desalentador y que impida la creaci&oacute;n de canteras de j&oacute;venes creadores en nuestro pa&iacute;s en particular?</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>S&iacute; y no. Obviamente, me parece dif&iacute;cil que una persona que se inice en el mundillo compita con grandes producciones que incluyen los &uacute;ltimos adelantos t&eacute;cnicos, pero por otra parte me resulta rid&iacute;culo considerar que juegos hechos con tecnolog&iacute;a de hace dos o tres a&ntilde;os se califiquen como poco atractivos. Creo que el factor m&aacute;s importante a la hora de desarrollar un producto es el talento.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Definitivamente no. Me consta que en Espa&ntilde;a hay muchos j&oacute;venes que sacar&iacute;an los colores a m&aacute;s de un programador de las grandes casas. La cuesti&oacute;n es que el desarrollar juegos requiere mucho m&aacute;s que una buena preparaci&oacute;n inform&aacute;tica. Creo que la ilusi&oacute;n y las ganas de hacer cosas deben ser la piedra angular de posibles nuevos grupos de desarrollo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>En el n&uacute;mero anterior, cuando preguntaba a Daniel Navarro, de Hammer, sobre su opini&oacute;n acerca del panorama espa&ntilde;ol de casas de desarrollo, se mostr&oacute; de un gran optimismo. Ahora os lo pregunto a vosotros, ¿Cre&eacute;is que nuestro pa&iacute;s se encuentra, de nuevo, en la "rampa de lanzamiento" tanto a nivel Europeo como internacional o aun deberemos de esperar alg&uacute;n tiempo?.</P>
</I><P ALIGN="JUSTIFY"> </P>
<B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Sin duda alguna, estamos al principio de una nueva etapa para el soft espa&ntilde;ol. Aqu&iacute; siempre ha habido mucho talento y en el momento en que las compa&ntilde;&iacute;as apoyen econ&oacute;micamente ese talento, las producciones de m&aacute;xima calidad empezar&aacute;n a ver la luz.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Sinceramente, creo que estamos bastante lejos de pa&iacute;ses como Inglaterra, Francia o Estados Unidos. En cualquier caso, la ra&iacute;z del problema es de &iacute;ndole econ&oacute;mica.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>En la actualidad, adem&aacute;s de vosotros, hay gente que "entra y sale" del grupo de trabajo de P&eacute;ndulo para poder acelerar vuestras nuevas creaciones ¿os hab&eacute;is planteado ya un aumento considerable de la plantilla pero de forma estable y as&iacute; ir produciendo los t&iacute;tulos con mayor celeridad sin desmerecer la calidad final?. </P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>- Por supuesto, en el pr&oacute;ximo proyecto contaremos con m&aacute;s personas para aumentar tanto la calidad del producto como la rapidez de su producci&oacute;n, pero de momento lo m&aacute;s probable es que sigamos en r&eacute;gimen de colaboraci&oacute;n.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Nos gustar&iacute;a contar con una plantilla estable, pero para ello tendremos que crecer a&uacute;n m&aacute;s como compa&ntilde;&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>De todas las partes que hay que tener en cuenta a la hora de desarrollar una aventura, las mas importantes son, sin duda, ofrecer un gui&oacute;n, desarrollo y planteamiento de los problemas lo mas depurado posible. ¿El desarrollo del gui&oacute;n, historia y planteamiento inicial de vuestros productos, es tarea de alguno en particular y que luego se somete a montones de a&ntilde;adidos por parte del resto del equipo o, por el contrario, es algo totalmente realizado en equipo mediante las conocidas "brainstorm" (tormenta de ideas) ?, Aun as&iacute;, ¿cu&aacute;nto tiempo puede consumir la creaci&oacute;n de un gui&oacute;n y desarrollo en el tiempo total de una aventura, como por ejemplo, el HM?.</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Un gui&oacute;n como el de HM, requiere unos tres meses para estar completamente definido al detalle. Esto, que quiz&aacute;s puede parecer exagerado desde fuera, no lo es cuando te paras a pensar que en un gui&oacute;n se incluyen infinidad de cosas como todos los personajes, las relaciones entre ellos y el dise&ntilde;o preliminar de todos y cada uno de los escenarios. En nuestro caso, funcionamos a base de las famosas tormentas y de alguna que otra cerveza tambi&eacute;n. Los tres nos juntamos y vamos plasmando nuestras ideas en la historia, reforzando las que nos parecen m&aacute;s interesantes y olvidando las menos apropiadas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>¿Cu&aacute;l es el juego en el que os hubiera gustado estar involucrados? y ¿cu&aacute;l ha sido el &uacute;ltimo juego con el que hab&eacute;is jugado?.</P>
<P ALIGN="JUSTIFY"> </P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Me hubiera encantado estar involucrado en much&iacute;simos juegos, pero quiz&aacute;s especialmente en el primer<I> </I>Monkey<I> </I>Island y en el primer Alone<I> </I>In The Dark. Ambos fueron una revoluci&oacute;n. Ultimamente juego muy poco, lo &uacute;ltimo ha sido el antiguo <I>Mario Bros</I> en versi&oacute;n emulaci&oacute;n de recreativa, y espero catar dentro de poco el Starcraft, que tiene muy buena pinta.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>No me importar&iacute;a haber firmado alguno de los cl&aacute;sicos de Lucas. El &uacute;ltimo que he jugado es The Curse of Monkey Island.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>¿Y La persona a la que m&aacute;s admir&aacute;is dentro de este mundo y de la que m&aacute;s os sent&iacute;s inspirados e identificados?</P>
<P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B>Creo que en particular a Ron Gilbert por la obra de arte que hizo con Monkey<I> </I>Island, y en general admiro a todos aquellos que consiguen desarrollar proyectos originales y cuidados con presupuestos peque&ntilde;os.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B> Creo que hay un mont&oacute;n de buenos creadores, pero no puedo decir que me sienta especialmente inspirado o identificado por ninguno. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#00aa00"><b>MM.- </b></font><I>En fin, much&iacute;simas gracias por haber completado esta extensa entrevista. No os voy a desear suerte porque eso es algo que no os hace en absoluto falta. Hab&eacute;is demostrado que sab&eacute;is hacer las cosas bien y a la primera, sin necesidad de recurrir a m&uacute;ltiples intentonas y productos mediocres. Todos esperamos ya con ansias ese juego que finalmente os catapulte a las posiciones m&aacute;s altas en el panorama tanto Europeo como internacional ya que en el Espa&ntilde;ol ten&eacute;is un hueco y bien grande. Un fuerte abrazo a los tres y que sep&aacute;is que en Macedonia ten&eacute;is una "legi&oacute;n" de incondicionales.</P>
</I><B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT color="#AF0CAA"><b>R.L.- </b></font></B> Tan solo animar a aquellos que deseen hacer algo en el mundo de los juegos a que se involucren de la manera que sea, que contacten entre si o con las casas ya existentes, de esta forma se afianzar&aacute; la producci&oacute;n espa&ntilde;ola. Y a quienes simplemente les interesen los juegos como usuarios, que apoyen el software nacional y especialmente los juegos de P&eacute;ndulo, jejeje.<BR>
<B><FONT color="#AF0C00"><b>R.H.- </b></font></B>Un saludo para todos los lectores de Macedonia. Espero que pronto pod&aacute;is leer una entrevista parecida con motivo del lanzamiento de nuestro pr&oacute;ximo producto.</P></FONT></BODY>
</p>
<p align = justify>
<center><TABLE><td>
<center><img src="jpg/logopen.jpg" border=1></center>
</td>
</table></center>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="firmas.htm"><font FACE="ARIAL"><B>[Entrevistas y Firmas Invitadas]</B></font></a> <hR>
<A HREF="firmasa.htm"><font FACE="ARIAL"><B>[Entrevistas]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ENTREVISTAS Y FIRMAS INVITADAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
