<HTML>
<BODY BGCOLOR="#FFFFFF">
<CENTER><IMG src="g_sec/p_juegos.gif"></CENTER>
<BR>
<HR>
<img src="g_subsec/sol.gif">
<HR>
<FONT color="#3399cc" size=2 face="arial" >
<img src="g_misc/69.gif" align=right>
<p align="right">
<b><i>Artículo realizado por <br><A HREF="mailto:isaura@arrakis.es">Miguel Angel "Beren Erchamion".</A></i></b>

<H3>
<FONT color="#000000">        <br><br><br>
Solución a La ciudad de los niños perdidos
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial" >        
<P align="justify">
<h4>Primera parte</h4>
<P ALIGN="JUSTIFY">
<FONT color="#000000" size=2 face=arial>
<p align="justify">
<img src="g_misc/a.gif" align=left><P ALIGN=JUSTIFY>
ntes de salir de la escuela pregunta a las dos mujeres como podr&aacute;s entrar en la caseta.</LI></P>
<br><br>
<ol>
<LI><P ALIGN="JUSTIFY">Sal de la escuela y p&iacute;dele la llave al viejo que esta sentado justo enfrente de la puerta.</LI>
<LI><P ALIGN="JUSTIFY">Entra en el callej&oacute;n que esta a la derecha del viejo, justo despu&eacute;s del edificio y coge un hueso. No se lo des al perro.</LI>
<LI><P ALIGN="JUSTIFY">Sal del patio por la puerta de enfrente y avanza hasta el puerto. Solo hay un camino posible</LI>
<LI><P ALIGN="JUSTIFY">S&uacute;bete a las cajas de embalaje del muelle que lleva al faro y coge una barra de metal. Esta en el primer grupo de cajas y tendr&aacute;s que buscar con mucho cuidado.</LI>
<LI><P ALIGN="JUSTIFY">Corre hasta el faro y arroja la barra de metal a la caja de fusibles que esta a la izquierda del edificio.</LI>
<LI><P ALIGN="JUSTIFY">Esc&oacute;ndete tras las cajas que hay junto al faro, a la derecha,  usando el bot&oacute;n de agacharte. Procura que no se te vea. Probablemente tengas que practicar para alcanzar la postura adecuada.</LI>
<LI><P ALIGN="JUSTIFY">Espera hasta que el guarda entre en el faro y entonces dir&iacute;gete hacia su casa. No tiene perdida ;.)</LI>
<LI><P ALIGN="JUSTIFY">Para poder abrir la puerta de la caseta tendr&aacute;s que usar la llave que te dio el viejo sentado.</LI>
<LI><P ALIGN="JUSTIFY">Enciende la luz apretando el interruptor que esta junto a la puerta de entrada.</LI>
<LI><P ALIGN="JUSTIFY">Abre la caja registradora y d&eacute;jala atascada para que permanezca abierta usando el hueso que hab&iacute;a en el callej&oacute;n. Tendr&aacute;s que abrir la caja usando el hueso.</LI>
<LI><P ALIGN="JUSTIFY">Al quedar la caja registradora abierta, la trampa electrificada del armario se desconecta y podr&aacute;s coger el bot&iacute;n de su interior. Sigue una animaci&oacute;n en la que un desconocido te salva de ser atrapada por el guarda.</LI></OL>
<h4><P ALIGN="JUSTIFY">Segunda parte</P>
</h4><P ALIGN="JUSTIFY"></P>
<OL>
<LI><P ALIGN="JUSTIFY">Ve al fondo del aula y coge la bolsa de canicas que esta en una estanter&iacute;a.</LI>
<LI><P ALIGN="JUSTIFY">Sal de la escuela y entra en la puerta de la derecha, la cocina.</LI>
<LI><P ALIGN="JUSTIFY">Cambia a la cocinera las canicas por una botella de t&oacute;nico.</LI>
<LI><P ALIGN="JUSTIFY">Dale la botella al viejo sentado.</LI>
<LI><P ALIGN="JUSTIFY">Cuando el viejo se duerma usa la manivela que hay junto a la barandilla para bajar la cesta.</LI>
<LI><P ALIGN="JUSTIFY">Coge de la cesta el picaporte y la salchicha.</LI>
<LI><P ALIGN="JUSTIFY">Sube las escaleras y usa el picaporte para poder entrar en la casa del viejo.</LI>
<LI><P ALIGN="JUSTIFY">Enciende la luz y coge una llave que esta ca&iacute;da junto a la cama.</LI>
<LI><P ALIGN="JUSTIFY">Sal de la habitaci&oacute;n y vuelve al patio. Dale la salchicha al perro.</LI>
<LI><P ALIGN="JUSTIFY">Usa la llave para abrir la puerta del patio, que esta a la derecha del perro.</LI>
<LI><P ALIGN="JUSTIFY">Baja las escaleras y gira a la derecha hasta el final de la calle.</LI>
<LI><P ALIGN="JUSTIFY">Quédate junto al hombre que arregla el coche y cuando se agache c&oacute;gele las tenazas que tiene en el suelo junto a el.</LI>
<LI><P ALIGN="JUSTIFY">Ve al fondo, detras del coche, y usa las tenazas para alcanzar la campana.</LI>
<LI><P ALIGN="JUSTIFY">Vuelve por donde has venido hasta encontrar al guardia que vigila la casa del prestamista.</LI>
<LI><P ALIGN="JUSTIFY">Golpea la barandilla con la campana hasta que el guardia se tire al agua.</LI>
<LI><P ALIGN="JUSTIFY">Entra en la casa del prestamista.</LI>
<LI><P ALIGN="JUSTIFY">Coge una cajita de la mesa.</LI>
<LI><P ALIGN="JUSTIFY">Pon la cajita en los platos de la balanza, junto a la caja fuerte. Eso har&aacute; que la caja se abra.</LI>
<LI><P ALIGN="JUSTIFY">Coge el diamante y sal.</LI></OL>


<h4><P ALIGN="JUSTIFY">Tercera Parte</P>
</h4><P ALIGN="JUSTIFY"></P>
<OL>
<LI><P ALIGN="JUSTIFY">Coge el trozo de madera que hay tras unas cajas.</LI>
<LI><P ALIGN="JUSTIFY">Localiza dos interruptores.</LI>
<LI><P ALIGN="JUSTIFY">Baja el interruptor izquierdo y bloqu&eacute;alo con la madera.</LI>
<LI><P ALIGN="JUSTIFY">Activa el interruptor derecho.</LI>
<LI><P ALIGN="JUSTIFY">Coge la llave junto a la cabecera de la cama del hombre que delira.</LI>
<LI><P ALIGN="JUSTIFY">Mira por el periscopio.</LI>
<LI><P ALIGN="JUSTIFY">Abre la puerta con la llave y sal.</LI>
<LI><P ALIGN="JUSTIFY">Avanza hasta la siguiente pantalla y coge el mechero que hay tras el pivote de cemento.</LI>
<LI><P ALIGN="JUSTIFY">Sigue avanzando hasta llegar a una especie de plaza y trepa por las cajas que hay junto a la pared y que hacen de escalera.</LI>
<LI><P ALIGN="JUSTIFY">Sigue hacia la derecha la pared por la que has trepado y coge una vela.</LI>
<LI><P ALIGN="JUSTIFY">Coge las tijeras de encima de la mesa.</LI>
<LI><P ALIGN="JUSTIFY">Pon la vela bajo la cuerda que sujeta el paquete.</LI>
<LI><P ALIGN="JUSTIFY">Enciende la vela y una animaci&oacute;n te mostrara los resultados</LI></OL>

<P ALIGN="JUSTIFY"></P>
<H4><P ALIGN="JUSTIFY">Cuarta Parte</P>
</H4><P ALIGN="JUSTIFY"></P>
<OL>

<LI><P ALIGN="JUSTIFY">Avanza en l&iacute;nea recta hasta llegar a un hombre que pinta un bote. H&aacute;blale.</LI>
<LI><P ALIGN="JUSTIFY">Sube las escaleras y coge una lata vac&iacute;a.</LI>
<LI><P ALIGN="JUSTIFY">Baja otra vez hasta el hombre. Se habr&aacute; movido y podr&aacute;s coger un pincel.</LI>
<LI><P ALIGN="JUSTIFY">Moja el pincel en la pintura.</LI>
<LI><P ALIGN="JUSTIFY">Sube las escaleras y avanza hasta encontrar un comerciante chino. Habla con el.</LI>
<LI><P ALIGN="JUSTIFY">Coge una especie de vaporizador y vuelve sobre tus pasos.</LI>
<LI><P ALIGN="JUSTIFY">Ve al muelle.</LI>
<LI><P ALIGN="JUSTIFY">Usa la brocha en el guardia. Caer&aacute; el agua y te dejara el camino libre.</LI>
<LI><P ALIGN="JUSTIFY">Llega hasta el final del muelle, habla con el pescador y dale la lata vac&iacute;a para que guarde los gusanos.</LI>
<LI><P ALIGN="JUSTIFY">Ve a la tienda de tatuajes del chino y afloja un tornillo de la estructura. Entonces coge el mapa.</LI>
<LI><P ALIGN="JUSTIFY">Ve al embarcadero y dale el mapa a One. Coge el palo.</LI>
<LI><P ALIGN="JUSTIFY">Anda hasta el tercer embarcadero y habla con el domador de pulgas. Utiliza el palo para tirar del bote.</LI>
<LI><P ALIGN="JUSTIFY">Usa el organillo d&aacute;ndole a la manivela. Despu&eacute;s, utiliza el vaporizador sobre el domador. Coge la br&uacute;jula.</LI>
<LI><P ALIGN="JUSTIFY">Regresa con One, dale la br&uacute;jula y prep&aacute;rate para ver el final del juego.</LI></OL>
</FONT>



<br>
</p>
<hr>

<FONT color="#000000" size=1 face="arial">
<P ALIGN=right>
<img src="g_misc/loglow.gif">
<P ALIGN=left>
<A HREF="index04.htm"><I>¡De vuelta a la Zona de Juegos!</I></A>

<br>
<br>
<center>
<a href="http://www.ciudadfutura.com" target="_new"><img src="g_misc/logocf.gif" border=0 ></a> 
</center>
</HTML>
