<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="">por Dick Stuphen</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Técnicas de persuasión y lavado de cerebro utilizadas
hoy con el público
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>Traducci&oacute;n del texto "</FONT><B><FONT FACE="Courier" SIZE=1>THE BATTLE FOR YOUR MIND</B></FONT><FONT FACE="Arial" SIZE=2>", de <B>Dick Sutphen</FONT><FONT FACE="Courier" SIZE=1> "Persuasion &amp; Brainwashing Techniques Being Used On The Public Today</B></FONT><FONT FACE="Arial" SIZE=2>" Traducci&oacute;n realizada por <B>Julia</B> (juliaknorr@jet.es)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Este archivo se proporciona por sus ideas acerca del uso de los medios en el control de la poblaci&oacute;n, no por sus especulaciones acerca de conspiraciones pol&iacute;ticas.- mech@eff.org</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Courier New" SIZE=2><P>De: piety@hplred.HP.COM (Bob Piety)<br>
Newsgroups: alt.conspiracy<br>
tema: paranoia acerca de los combustibles (muy largo)<br>
Fecha: 28 de marzo del 90  21:44:03 GMT<br>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Alguien me remiti&oacute; esto recientemente--¡pertenece a este grupo de noticias! Pistolas, drogas, aborto etc no son cosas nuevas-- ¿Por qu&eacute; este s&uacute;bito deseo de hacernos renunciar a nuestros derechos y libertades?. ¿Donde/ en quien est&aacute; el impulso que lo nueve?. ¿Una rama del gobierno?. ¿La mayor&iacute;a moral?</P>
</FONT><FONT FACE="Courier New" SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P>Leedlo (¡aunque es largo!)</P>
</FONT><FONT FACE="Courier New" SIZE=2>
<hr>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">LA BATALLA POR SU MENTE, por Dick Sutphen ---22.2 KB.</P>
<P ALIGN="JUSTIFY">T&eacute;cnicas de persuasi&oacute;n y lavado de cerebro usadas p&uacute;blicamente hoy en d&iacute;a.</P>
</FONT><FONT FACE="Courier New" SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><B>Sumario del contenido</B></P>
<P ALIGN="JUSTIFY"></P>

<UL>
<li><p align=justify>El nacimiento de la Conversi&oacute;n/Lavado de Cerebro en el Resurgimiento Cristiano en 1735</LI>
<li><p align=justify>La explicaci&oacute;n Pavloviana de las tres fases del cerebro. Predicadores natos: Paso a paso, como conducen al resurgimiento y a los resultados fisiol&oacute;gicos esperados. T&eacute;cnica del "papel de la voz" usada por los predicadores, abogados e hipnotizadores.</LI>
<li><p align=justify>Nuevas Iglesias inductoras de trances. Los 6 pasos a la conversi&oacute;n. El proceso de decognici&oacute;n. Tecnicas de parada del pensamiento. La t&eacute;cnica de "venderlo por el zelote". Verdaderos creyentes y movimientos de masas. </LI>
<li><p align=justify>T&eacute;cnicas de persuasi&oacute;n: "S&iacute; inflexible", "Comandos ocultos", "Shock y confusi&oacute;n", y "Tecnica de intercalado".</LI>
<li><p align=justify>Mensajes subliminales. Ondas vibratorias y ELF. Inducci&oacute;n de trances con sonidos vibratorios.</LI>
<li><p align=justify>Incluso observadores profesionales pueden ser "poseidos" en reuniones carism&aacute;ticas. La &uacute;nica esperanza tecnica de presenciarlas y no ser "convertido". Programaci&oacute;n neur&oacute;fona no detectable a trav&eacute;s de la piel. </LI>
<li><p align=justify>El medium en la toma de posesi&oacute;n de masas.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Soy Dick Sutpen y esta cinta es una grabaci&oacute;n de estudio, una versi&oacute;n ampliada de la charla que tuvo lugar en el congreso mundial de la Sociedad de Hipnotizadores Profesionales en Las Vegas, Nevada. Aunque la grabaci&oacute;n est&aacute; protegida por un copyright para impedir duplicaciones ilegales para venderla a otras compa&ntilde;&iacute;as, en este caso, invito a los individuos a hacer copias y darlas a los amigos o a cualquiera en posici&oacute;n de poder comunicar esta informaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque he sido entrevistado acerca de este tema en muchas emisoras de radio y TV locales y regionales, la comunicaci&oacute;n a gran escala parece estar bloqueada, ya que pudiera resultar una sospecha o investigaci&oacute;n del mismo medio en que se difunde o de los sponsors que lo financian. Algunas agencias gubernamentales no desean que esta informaci&oacute;n se difunda. Y tampoco los renacidos movimientos y cultos Cristianos y sociedades de formaci&oacute;n de potenciales humanos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo lo que voy a exponer no refleja sino la superficie del problema. No s&eacute; como puede detenerse el mal uso de estas t&eacute;cnicas. No creo que sea posible legislar contra lo que, frecuentemente, no puede ser detectado; y si los que legislan est&aacute;n utiliz&aacute;ndolas, hay pocas esperanzas de aplicar las leyes a la conducta del gobierno. S&eacute; que el primer paso para iniciar el cambio es generar inter&eacute;s en ello. En este caso, solo puede llegar de los esfuerzos clandestinos (no oficiales).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hablando de este tema, estoy hablando de mi propio medio de vida. Lo conozco, y s&eacute; lo efectivo que puede llegar a ser. Soy productor de cintas hipn&oacute;ticas y con mensajes subliminales y, en algunos de mis seminarios, utilizo t&aacute;cticas de conversi&oacute;n para ayudar a los participantes a llegar a ser independientes y autosuficientes. Pero, cada vez que uso estas t&eacute;cnicas, advierto de que las estoy usando, y las personas participantes pueden elegir si asistir a ello o no. Tambi&eacute;n saben el resultado que cabe esperar de su participaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De modo que, para empezar, quiero dejar claro el m&aacute;s b&aacute;sico de los hechos sobre los lavados de cerebro: EN TODA LA HISTORIA DE LA HUMANIDAD, NADIE HA SUFRIDO UN LAVADO DE CEREBRO Y SE HA DADO CUENTA, O HA CRE&Iacute;DO, QUE LO ESTABA SUFRIENDO. Quienes han pasado por ello por regla general defienden apasionadamente a sus manipuladores, asegurando que solamente les han "ense&ntilde;ado la luz"....o han sido transformados de alguna manera milagrosa.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El nacimiento de la conversi&oacute;n</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">CONVERSI&Oacute;N es una palabra "amable" para designar el LAVADO DE CEREBRO...y cualquier estudio acerca del lavado de cerebro debe de comenzar con el  estudio del resurgimiento Cristiano en la Am&eacute;rica del siglo XVIII. Aparentemente, Jonathan Edwards descubri&oacute; accidentalmente las t&eacute;cnicas durante la cruzada religiosa de 1735 en Northampton, Massachussets.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Induciendo sentimientos de culpa y aprensi&oacute;n aguda, e incrementando la tensi&oacute;n, los "pecadores" que asist&iacute;an a su reuniones de resurgimiento acababan rompi&eacute;ndose y someti&eacute;ndose completamente. T&eacute;cnicamente, lo que Edwards hac&iacute;a era crear condiciones que limpiaban el cerebro para que la mente aceptara una nueva programaci&oacute;n. El problema era que las nuevas &oacute;rdenes eran negativas. Les pod&iacute;a decir: "¡Sois pecadores, est&aacute;is destinados al infierno!"</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El resultado fue que una persona se suicid&oacute; y otra intent&oacute; hacerlo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y los parientes del suicida contaron que ellos estaban tambi&eacute;n tan profundamente afectados que, aunque hab&iacute;an encontrado la "salvaci&oacute;n eterna", estaban obsesionados con la diab&oacute;lica tentaci&oacute;n de acabar con sus vidas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez un predicador, o un lider de una religi&oacute;n, un manipulador o una figura con autoridad crea la fase en que el cerebro puede vaciarse y quedar limpio, sus v&iacute;ctimas quedan completamente abiertas. Nuevas instrucciones, en forma de sugestiones, pueden sustituir a sus ideas previas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como Edwards no enviaba mensajes positivos hasta el final del resurgimiento, muchos aceptaron las sugestiones negativas y actuaron, o desearon actuar, seg&uacute;n ellas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Charles J. Finney fu&eacute; otro renacentista Cristiano que utiliz&oacute; las mismas t&eacute;cnicas cuatro a&ntilde;os m&aacute;s tarde en conversiones religiosas en masa en Nueva York. Las t&eacute;cnicas son todav&iacute;a usadas por renacentistas cristianos, cultos, ense&ntilde;antes, empresas, y el ej&eacute;rcito de los Estados Unidos, por citar solo unos pocos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">D&eacute;jenme se&ntilde;alar aqu&iacute; que no creo que la mayor parte de los renacentistas religiosos se den cuenta de que est&aacute;n usando t&eacute;cnicas de lavado de cerebro. Edwards simplemente insisti&oacute; en un sistema que realmente funcionaba, y otros no hicieron m&aacute;s que copiarle y lo siguen haciendo doscientos a&ntilde;os despu&eacute;s. Y cuanto m&aacute;s sofisticado es nuestro conocimiento y nuestra tecnolog&iacute;a, m&aacute;s efectiva es la conversi&oacute;n. Estoy profundamente convencido de que esta es una de las principales razones del incremento del fundamentalismo cristiano, especialmente en su variedad televisiva, mientras la mayor parte de las religiones convencionales declinan.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Las tres fases del cerebro</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque los cristianos fueran los primeros en formular con &eacute;xito el lavado de cerebro, hemos de mirar a Pavlov, el cient&iacute;fico ruso, para obtener una explicaci&oacute;n t&eacute;cnica. En los primeros a&ntilde;os del siglo, su trabajo con animales abri&oacute; la puerta a ulteriores investigaciones con seres humanos. Tras la revoluci&oacute;n rusa, Lenin vio r&aacute;pidamente el potencial de la aplicaci&oacute;n de las investigaciones de Pavlov a sus propios fines.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pavlov identific&oacute; tres estadios diferentes y progresivos de la inhibici&oacute;n transmarginal. El primero es la fase EQUIVALENTE, en la que el cerebro da la misma respuesta a est&iacute;mulos d&eacute;biles o fuertes. La segunda es la fase PARAD&Oacute;JICA, en la cual el cerebro responde m&aacute;s activamente a </P>
<P ALIGN="JUSTIFY">los est&iacute;mulos d&eacute;biles que a los fuertes. Y la tercera es la fase ULTRA-PARAD&Oacute;JICA, en la que las respuestas condicionadas y los patrones de comportamiento pasan de positivos a negativos o de negativos  a positivos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Con la progresi&oacute;n a trav&eacute;s de cada fase, el grado de conversi&oacute;n se hace m&aacute;s efectivo y completo. Las formas de conseguir la conversi&oacute;n son muchas y variadas, pero el primer paso habitual en el lavado de cerebro religioso o pol&iacute;tico es trabajar con las emociones del individuo o del grupo hasta que alcanzan un nivel an&oacute;malo de ansiedad, miedo, excitaci&oacute;n o tensi&oacute;n nerviosa.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El resultado progresivo de esta condici&oacute;n mental es la disminuci&oacute;n de la capacidad de juicio y el incremento de la sugestibilidad. Cuanto m&aacute;s se mantenga o intensifique esta condici&oacute;n, m&aacute;s se agrava. Una vez se alcanza la catarsis, o primera fase cerebral, la conquista completa de la mente es m&aacute;s f&aacute;cil. La programaci&oacute;n mental preexistente puede ser reemplazada por nuevos patrones de pensamiento y conducta. Otras armas usadas frecuentemente para modificar el normal funcionamiento del cerebro son el adelgazamiento, las dietas radicales o altas en az&uacute;car, las incomodidades f&iacute;sicas, la regulaci&oacute;n de la respiraci&oacute;n, el recitado de mantras en la meditaci&oacute;n, la exposici&oacute;n de misterios asombrosos, efectos especiales de luz y sonido, la respuesta programada al incienso, o intoxicaci&oacute;n por drogas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se consiguen los mismos resultados en los tratamientos psiqui&aacute;tricos contempor&aacute;neos con electroshock o con la disminuci&oacute;n intencionada de los niveles de az&uacute;car en sangre inyectando insulina.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de hablar del modo exacto en que algunas de la t&eacute;cnicas se aplican, quiero se&ntilde;alar que la hipnosis y las t&eacute;cnicas de conversi&oacute;n son dos cosas diferentes--y que las t&eacute;cnicas de conversi&oacute;n son mucho m&aacute;s poderosas. Sin embargo, ambas se usan a la vez frecuentemente ...con poderosos resultados.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">C&oacute;mo trabajan los predicadores renacentistas</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Si quiere ver a un predicador renacentista en plena faena, en su ciudad hay probablemente varios. Vaya a la iglesia temprano y sintiese en la parte de atr&aacute;s. Probablemente, se tocar&aacute; una m&uacute;sica repetitiva mientras la gente va llegando. Un ritmo repetitivo, idealmente de 45 a 72 "golpes" por minuto (un ritmo cercano al del coraz&oacute;n humano), es muy hipn&oacute;tico y puede generar estados alterados de la conciencia en un alto porcentaje de personas. Y, una vez se est&aacute; en estado alfa, se es al menos 25 veces m&aacute;s sugestionable que en estado beta de plena conciencia. La m&uacute;sica es probablemente la misma en todos los servicios, o tiene el mismo ritmo, y muchas personas pueden caer en estados alterados de la conciencia en cuanto entran en la iglesia. Subconscientemente, recuerdan su estado mental en servicios anteriores y responden de acuerdo con la programaci&oacute;n post-hipn&oacute;tica.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Mire a la gente mientras espera que comience el servicio. Muchos muestran signos externos de trance: relajaci&oacute;n corporal y ojos ligeramente dilatados. A menudo, se balancean adelante y atr&aacute;s sentados en sus sillas. Despu&eacute;s, el sacerdote entra. Y suele hablar con una "voz rodada".</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">T&eacute;cnica de la voz rodada</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La "voz rodada" es un estilo repetitivo y r&iacute;tmico usado por los hipnotizadores cuando quieren inducir un trance. Lo usan tambi&eacute;n muchos abogados, algunos de los cuales son consumados hipnotizadores, cuando desean introducir firmemente una idea en la mente del jurado. La voz rodada puede sonar como si el orador estuviera hablando con el ritmo de un metr&oacute;nomo, o como si estuviera enfatizando cada palabra con un estilo monotono y repetitivo. Las palabras son pronunciadas habitualmente a un ritmo de 45 a 60 por minuto, maximizando el efecto hipn&oacute;tico.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Luego, el sacerdote comienza el proceso de "construcci&oacute;n". Induce un estado alterado de la conciencia y/o comienza a excitar a los oyentes. Despu&eacute;s, un grupo de mujeres j&oacute;venes con "dulces y puros" vestidos de gasa suelen salir a cantar. Las canciones Gospel son estupendas para crear excitaci&oacute;n y hacer que los oyentes se IMPLIQUEN. En mitad de la canci&oacute;n, una de las muchachas puede ser "poseida por el esp&iacute;ritu" y caer al suelo o actuar como si el Esp&iacute;ritu Santo estuviera en su interior. </P>
<P ALIGN="JUSTIFY">Esto incrementa muy efectivamente la intensidad en la habitaci&oacute;n. En este punto, las tacticas de hipnosis y de conversi&oacute;n est&aacute;n siendo mezcladas. Y el resultado es que la atenci&oacute;n de la audiencia se focaliza en la comunicaci&oacute;n a medida que el ambiente se hace m&aacute;s excitado o tenso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">M&aacute;s o menos en ese momento, cuando se ha conseguido un estado mental alfa colectivo, es cuando pasan el cesto de las donaciones. En el plano de fondo, la voz rodada del sacerdote puede exhortar "Dad a Dios...Dad a Dios...Dad a Dios..."</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y los asistentes dan. Puede que Dios no coja el dinero, pero su representante si que lo hace.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s aparece el sacerdote "amenazador". Induce el miedo e incrementa la tensi&oacute;n hablando acerca del "diablo", "ir al infierno" o de la proximidad del fin del mundo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el ultimo rally de este tipo al que asist&iacute;, el predicador habl&oacute; acerca de la sangre que pronto manar&iacute;a de cada boca en la tierra. Estaba tambi&eacute;n obsesionado con la "sangrienta lanza de Dios", que todos hab&iacute;an visto colgada sobre el p&uacute;lpito la anterior semana. No tengo ninguna duda </P>
<P ALIGN="JUSTIFY">de que todos la vieron. El poder de la sugesti&oacute;n dada a cientos de personas en la hipnosis asegura que al menos del 10 al 25 por ciento de ellos ver&aacute;n cualquier cosa que se les sugiera que han de ver.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la mayor parte de las reuniones renacentistas, "testificar" o "ser testigos" sigue usualmente al serm&oacute;n basado en el miedo. Gente del auditorio se levanta y relata sus historias. "¡Estaba impedido y ahora puedo andar!" "¡Ten&iacute;a artritis y ahora se ha curado!" Son manipulaciones psicol&oacute;gicas que funcionan. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tras escuchar numerosos casos de historias de curaciones milagrosas, el tipo medio de la audiencia con un problema menor est&aacute; convencido de que puede ser curado. La sala est&aacute; cargada con miedo, culpabilidad, intensa excitaci&oacute;n y expectaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En ese momento los que quieren ser curados se alinean alrededor de la habitaci&oacute;n, o se les dice que salgan al frente. El predicador puede tocarles la cabeza firmemente y gritar "¡Sana!" Esto libera la energ&iacute;a ps&iacute;quica y, para muchos, resulta la catarsis. La catarsis es la purga de las emociones reprimidas. Unos individuos pueden llorar, caer al suelo o incluso tener espasmos. Y si la catarsis se efect&uacute;a, tienen una posibilidad de curarse. En la catarsis (una de las tres fases cerebrales mencionadas anteriormente), el cerebro queda temporalmente vac&iacute;o y se aceptan las nuevas sugestiones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para algunos, la curaci&oacute;n puede ser permanente. Para muchos, puede durar de cuatro d&iacute;as a una semana, que es, incidentalmente, lo que duran las sugestiones hipn&oacute;ticas dadas a un sujeto en estado de sonambulismo. Incluso si la curaci&oacute;n no es duradera, la vuelta de estas personas a la iglesia cada semana asegura que el poder de sugesti&oacute;n va a anular continuamente el problema....o a veces, tristemente, puede enmascarar un problema f&iacute;sico que perjudicar&aacute; al individuo a largo plazo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No estoy diciendo que no ocurran verdaderas curaciones. Ocurren. Puede que la persona estuviera lista para dejar de lado la negatividad que caus&oacute; el problema en principio; puede que fuera obra de Dios; Pero creo que pueden explicarse con el conocimiento actual del funcionamiento de la mente/el cerebro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las t&eacute;cnicas y la representaci&oacute;n pueden variar de iglesia a iglesia. Muchas usan "el don de lenguas" para generar la catarsis en algunas personas mientras el espect&aacute;culo crea intensa excitaci&oacute;n en los observadores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El uso de t&eacute;cnicas hipn&oacute;ticas por los religiosos es sofisticada, y los profesionales aseguran que son cada vez m&aacute;s efectivas. Un hombre en Los Angeles esta dise&ntilde;ando, construyendo y remodelando iglesias de todo el pa&iacute;s. Dice a los sacerdotes lo que necesitan y como deben usarlo. La experiencia de este hombre dice que la audiencia y los ingresos de la congragaci&oacute;n se duplicar&aacute;n si el ministro sigue sus consejos. Admite que alrededor del 80 por ciento de sus esfuerzos se dirigen al sistema de iluminaci&oacute;n y sonido.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un sonido potente y el uso adecuado de la iluminaci&oacute;n es de primera importancia para inducir un estado alterado de la conciencia. He estado us&aacute;ndolos durante a&ntilde;os en mis propios seminarios. Pero mis participantes est&aacute;n plenamente advertidos del proceso y de lo que pueden esperar como resultado de su participaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Seis t&eacute;cnicas de conversi&oacute;n</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los cultos (sectas) y las organizaciones de potencial humano est&aacute;n siempre buscando nuevos conversos. Para conseguirlos, deben tambi&eacute;n crear una fase cerebral. Y a menudo necesitan hacerlo en un corto espacio de tiempo, un fin de semana, o tal vez incluso un d&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las siguientes son seis t&eacute;cnicas primarias usadas para generar la conversi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El encuentro o reuni&oacute;n de entrenamiento se producen en un lugar en el que los participantes est&aacute;n separados del mundo exterior. Puede ser cualquier lugar: una casa privada, un emplazamiento rural remoto, o incluso la sala de bailes de un hotel en donde a los participantes solo se les permite un uso limitado del cuarto de ba&ntilde;o. En las organizaciones de potencial humano, los controladores dan una larga charla acerca de la importancia de "mantener los compromisos" en la vida.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A los participantes se les dice que si no mantienen sus compromisos, su vida nunca funcionar&aacute; bien. Es una buena idea mantener los compromisos, pero los controladores subvierten un valor humano positivo para sus propios prop&oacute;sitos. Los participantes se juran a s&iacute; mismos y a su entrenador que mantendr&aacute;n sus compromisos. Cualquiera que no lo haga es intimado a hacerlo o abandonar inmediatamente la reuni&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El siguiente paso es comprometerse a completar el entrenamiento, asegurando as&iacute; un alto porcentaje de conversiones para la organizaci&oacute;n. Tienen que comprometerse GENERALMENTE a no tomar drogas, fumar, y a veces no comer...o se les da breves interrupciones para comer que incrementan la tensi&oacute;n. La verdadera raz&oacute;n para el compromiso es alterar la qu&iacute;mica interna, que genera ansiedad y con suerte, no hace m&aacute;s que desequilibrar levemente el sistema nervioso, lo que a su vez aumenta las posibilidades de conversi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de que termine el encuentro, los compromisos se usan para asegurar que los nuevos conversos vayan fuera y encuentren nuevos participantes. Son obligados a comprometerse a ello antes de partir. Como la importancia de mantener los compromisos es tan alta en sus prioridades, los conversos presionar&aacute;n a todos sus conocidos, intentando hablarles acerca de su asistencia a una sesi&oacute;n introductoria gratuita que la organizaci&oacute;n ofrecer&aacute; en el futuro. Los nuevos conversos son zelotes. De hecho, la frase interna para promocionar la mayor y m&aacute;s exitosa organizaci&oacute;n de potencial humano es "¡que lo venda un zelote!"</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al menos un mill&oacute;n de personas son adeptos a estas organizaciones y un buen porcentaje de ellos llevan un "bot&oacute;n" de activaci&oacute;n mental que asegura su futura lealtad si el gur&uacute; o la organizaci&oacute;n les llaman. Piensen acerca de la implicaciones pol&iacute;ticas de cientos de miles de zelotes programados para hacer campa&ntilde;a a favor de su gur&uacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tengan cuidado con una organizaci&oacute;n de este tipo que ofrezca sesiones de seguimiento despu&eacute;s del seminario. Las sesiones de seguimiento pueden ser reuniones semanales dadas de forma regular que la organizaci&oacute;n intente hacerle seguir, o cualquier evento usado para mantener el control. Como sab&iacute;an los primitivos renacentistas Cristianos, el control a largo plazo depende de un buen sistema de seguimiento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien. Ahora, echemos un vistazo al segundo punto que indica que se est&aacute;n utilizando t&eacute;cnicas de conversi&oacute;n. Se utiliza un esquema que causa fatiga f&iacute;sica y mental. Esto se hace en primer lugar realizando sesiones de muchas horas durante las cuales los participantes no tienen ocasi&oacute;n de relajarse o reflexionar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tercer paso: t&eacute;cnicas para aumentar la tensi&oacute;n en la habitaci&oacute;n y en el entorno.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuarto paso: Incertidumbre. Podr&iacute;a pasar horas hablando acerca de las diversas t&eacute;cnicas para incrementar la tensi&oacute;n y generar incertidumbre. B&aacute;sicamente, los participantes se sienten preocupados por la posibilidad de ser "pillados" por los organizadores, y se ponen en juego sentimientos de culpabilidad, los participantes son instados por los organizadores a relatar verbalmente sus m&aacute;s &iacute;ntimos secretos a otros participantes o forzados a participar en actividades que enfatizan el "quitarse las m&aacute;scaras". Uno de las m&aacute;s efectivas organizaciones de "potencial humano" fuerza a los participantes a mantenerse de pi&eacute; en el estrado frente a toda la audiencia mientras son atacados verbalmente por los organizadores. Una encuesta p&uacute;blica realizada hace algunos a&ntilde;os revel&oacute; que la situaci&oacute;n m&aacute;s temida en general es la de hablar en p&uacute;blico. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se sit&uacute;a por encima de lavar cristales exteriores en el piso 85 de un edificio de oficinas. De modo que pueden imaginarse el temor y la tensi&oacute;n que esta situaci&oacute;n genera entre los participantes. Algunos se desmayan, pero otros pueden soportar el stress saliendo mentalmente del lugar. Literalmente pasan a estado alfa, lo que los hace autom&aacute;ticamente mucho m&aacute;s sugestionables de lo que son normalmente. Y otra vuelta en la espiral hacia la conversi&oacute;n queda completada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El quinto indicio de que se est&aacute;n usando t&eacute;cnicas de conversi&oacute;n es la introducci&oacute;n de un argot: nuevos t&eacute;rminos que solamente tienen significado para "iniciados" que participan. A veces se usa un lenguaje incorrecto intencionadamente para hacer que los participantes se dientan inc&oacute;modos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El punto quinto es que no hay ni rastro de humor en las conferencias...al menos hasta que los participantes han sido convertidos. </P>
<P ALIGN="JUSTIFY">Entonces, la alegr&iacute;a y el humor son muy deseables como s&iacute;mbolo de la felicidad que los participantes se supone que han "encontrado".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No estoy diciendo que no resulte ning&uacute;n bien de estas reuniones. Puede suceder y sucede. Pero sostengo que es bueno que la gente sepa lo que ha sucedido y que una participaci&oacute;n cont&iacute;nua puede no ser de su inter&eacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A trav&eacute;s de los a&ntilde;os, he dirigido seminarios profesionales para ense&ntilde;ar a la gente a ser hipnotizadores, entrenadores y consejeros. Algunos de ellos se han acercado a mi y me han dicho: "Estoy aqu&iacute; porque s&eacute; que lo que hago funciona, pero no se por qu&eacute;". Despu&eacute;s de mostrarles como y por qu&eacute;, muchos han salido del negocio o han decidido encararlo de manera mucho m&aacute;s humana y cari&ntilde;osa.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muchos de esos entrenadores se han convertido para mi en amigos personales, y a todos nos asusta el haber experimentado el poder de una persona con un micr&oacute;fono en la mano en una habitaci&oacute;n llena de gente. A&ntilde;adan un poco de carisma y pueden estar seguros de obtener un alto </P>
<P ALIGN="JUSTIFY">porcentaje de conversiones. La triste realidad es que un alto porcentaje de personas quiere "creer".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las reuniones de culto y las de empresas de potencial humano son lugares ideales para observar de primera mano o que se llama t&eacute;cnicamente el "S&iacute;ndrome de Estocolmo". Esta es una situaci&oacute;n en la que los que son intimidados, controlados o padecen sufrimiento impuestos, comienzan a </P>
<P ALIGN="JUSTIFY">amar, admirar e incluso en ocasiones desear sexualmente a sus controladores o secuestradores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">D&eacute;jenme introducir aqu&iacute; una palabra de aviso: Si usted piensa que puede asistir a una de esas reuniones y no resultar afectado, probablemente est&aacute; equivocado. Un ejemplo perfecto es el caso de una mujer que fue a Haiti con una beca Guggenheim para estudiar el Voodoo haitiano. En su informe, relataba como la m&uacute;sica induc&iacute;a finalmente un movimiento corporal incontrolable y un estado alterado de la conciencia. A pesar de que entend&iacute;a el proceso y pensaba que estaba por encima de ello, cuando empez&oacute; a sentirse vulnerable a la m&uacute;sica, intent&oacute; luchar contra ello y lo consigui&oacute; moment&aacute;neamente. El miedo o la resistencia casi  siempre aseguran la conversi&oacute;n. Pocos momentos despu&eacute;s se sinti&oacute; pose&iacute;da por la m&uacute;sica y comenz&oacute; a bailar en trance alrededor de la sala de reuni&oacute;n voodoo. Una fase cerebral hab&iacute;a sido inducida por la m&uacute;sica y la excitaci&oacute;n, y se despert&oacute; sinti&eacute;ndose renacida. La &uacute;nica esperanza de asistir a una de esas reuniones sin ser afectado es ser un Buda y no permitirse emociones negativas ni positivas. Pocas personas son capaces de un tal desapego.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de seguir adelante, veamos nuevamente los seis puntos esenciales de conversi&oacute;n. Quiero mencionar al Gobierno de los Estados Unidos y los campos de entrenamiento del ej&eacute;rcito. El cuerpo de los marines habla de romper a los hombres antes de "reconstruirlos como hombres nuevos: ¡como marines!" Bien, eso es exactamente lo que hacen, de la misma manera que las iglesias o sectas rompen a las personas y las reconstruyen como felices vendedores de flores en las esquinas de las calles. Considerando las necesidades del ej&eacute;rcito, no estoy haciendo juicios acerca de si es bueno o malo. ES UN HECHO que los hombres sufren efectivamente un lavado de cerebro. Los que no se someten son despedidos o pasan gran parte de su tiempo en el calabozo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Proceso de decognici&oacute;n</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una vez se ha efectuado la conversi&oacute;n inicial, las sectas, servicios armados y grupos similares no pueden tener dudas acerca de sus miembros. Los miembros deben responder a las &oacute;rdenes y actuar como se les dice, de lo contrario son peligrosos para el control de la organizaci&oacute;n. Esto se consigue por medio de las tres etapas del proceso de decognici&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El primer paso es LA REDUCCI&Oacute;N DE LA ALERTA: Los controladores causan un mal funcionamiento del sistema nervioso, haciendo dif&iacute;cil la distinci&oacute;n entre fantas&iacute;a y realidad. Esto se puede llevar a cabo de diferentes maneras. La DIETA POBRE es una de ellas; cuidado con las galletitas y las p&iacute;ldoras de glucosa. El az&uacute;car estropea el sistema nervioso. M&aacute;s sutil es la DIETA ESPIRITUAL usada por muchas sectas. Comen solamente vegetales y fruta; sin la ayuda de las legumbres, frutos secos, semillas, l&aacute;cteos, pescado y carne, el individuo queda mentalmente "lento". SUE&Ntilde;O INADECUADO es otra forma primaria de reducir la alerta, especialmente si se combina con largas horas de trabajo o de intensa actividad f&iacute;sica. Ser bombardeado con experiencias intensas y especiales consiguen el mismo resultado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El segundo paso es LA CONFUSI&Oacute;N PROGRAMADA: La persona es asaltada mentalmente mientras se encuentra en estado de alerta reducida  causada en el primer paso. Se consigue con un diluvio de informaci&oacute;n nueva, lecturas, discusiones en grupo, encuentros o sesiones cara a cara en los que usualmente el controlador bombardea al sujeto con preguntas. Durante esta fase de la decognici&oacute;n, la realidad y la ilusi&oacute;n a menudo se mezclan y una l&oacute;gica perversa es f&aacute;cilmente aceptada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El tercer paso es LA DETENCI&Oacute;N DEL PENSAMIENTO: Se utilizan t&eacute;cnicas que hacen que la mente se quede "plana". Estas son t&eacute;cnicas de "estado alterado de la conciencia" que inicialmente inducen la calma d&aacute;ndole a la mente algo simple en lo que fijar la atenci&oacute;n. Manteni&eacute;ndolo mucho tiempo se produce una sensaci&oacute;n de euforia y finalmente alucinaciones. El resultado es la reducci&oacute;n del pensamiento y finalmente, si dura lo suficiente, la parada de todo pensamiento y el rechazo de todos y todo lo que no sean las directrices emanadas del controlador. La conquista es entonces completa. Es importante se&ntilde;alar que cuando los miembros o participantes son instruidos para usar las t&eacute;cnicas de "parada del pensamiento", se les dice que se ver&aacute;n beneficiados por hacerlo: ser&aacute;n "mejores soldados" o "encontrar&aacute;n la luz".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay tres t&eacute;cnicas b&aacute;sicas usadas para detener el pensamiento. La primera es la MARCHA: el ritmo tump, tump, tump crea literalmente auto-hipnosis y por lo tanto gran susceptibilidad a la sugesti&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La segunda t&eacute;cnica es la MEDITACI&Oacute;N. Si alguien dedica cada d&iacute;a una hora y media a la meditaci&oacute;n, despu&eacute;s de unas pocas semanas hay muchas posibilidades de que no vuelva al estado beta de conciencia. Puede permanecer en estado alfa por tanto tiempo como contin&uacute;e practicando la meditaci&oacute;n. No estoy diciendo que sea MALO, si lo hace por si mismo. Puede ser muy beneficioso. Pero es un hecho que est&aacute; provocando que su mente quede "plana". He trabajado con personas que practican la meditaci&oacute;n cuyos resultados electroencefalograficos son concluyentes: cuanto m&aacute;s medita alguien, m&aacute;s plana es su mente hasta que, finalmente y en especial si se utiliza conjuntamente con la decognici&oacute;n o en exceso, todo pensamiento desaparece. Algunos grupos religiosos ven esto como el Nirvana, pero eso es una tonter&iacute;a. Es simplemente un resultado fisiol&oacute;gico predecible. Y si el cielo en la tierra es realmente no pensar y no tomar decisiones, creo que debo cuestionarme para que estamos aqu&iacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La tercera t&eacute;cnica para parar el pensamiento es CANTAR,  y a menudo, cantar en la meditaci&oacute;n. "Hablar en otras lenguas" puede ser tambi&eacute;n incluido en esta categor&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estas tres t&eacute;cnicas producen un estado alterado de la conciencia. Esto puede ser estupendo si UNO MISMO est&aacute; controlando el proceso, porque uno mismo controla tambi&eacute;n las influencias que le llegan de fuera. Yo, personalmente, uso al menos una sesi&oacute;n programada de auto-hipnosis al d&iacute;a y s&eacute; qu&eacute; beneficioso es para mi. Pero uno tiene que saber que usando esas t&eacute;cnicas hasta el extremo de permanecer continuamente en estado alfa, aunque uno sea muy maduro, tambi&eacute;n le hace m&aacute;s sugestionable.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Verdaderos creyentes y movimientos de masas</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de terminar esta secci&oacute;n acerca de la conversi&oacute;n, quiero hablar acerca de las personas que son m&aacute;s vulnerables a ella y acerca de los movimientos de masas. Estoy convencido de que al menos un tercio de la poblaci&oacute;n es lo que Eric Hoffer llama "creyentes verdaderos". Son seguidores...gente que quiere entregar a otros el poder, ser convencidos. Est&aacute;n buscando respuestas, sentido a las cosas y una iluminaci&oacute;n que proceda de fuera de s&iacute; mismos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hoffer, que escribi&oacute; EL VERDADERO CREYENTE, un cl&aacute;sico en movimientos de masas, dice "los verdaderos creyentes no pretenden potenciar ni mejorar su propio yo, sino que est&aacute;n deseando librarse de un yo no querido. Son seguidores, no porque deseen avanzar ellos mismos, </P>
<P ALIGN="JUSTIFY">sino porque eso puede satisfacer su pasi&oacute;n de renunciar a su yo". Hoffer dice tambi&eacute;n que los verdaderos creyentes "est&aacute;n eternamente incompletos y eternamente inseguros".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Conozco esto a trav&eacute;s de mi propia experiencia. En los a&ntilde;os que llevo comunicando conceptos y dirigiendo entrenamientos, he encontrado este tipo de personas una y otra vez. Todo lo que puedo hacer es mostrarles que lo &uacute;nico que se debe buscar es nuestro verdadero YO en nuestro interior. Sus respuestas personales han de encontrarse all&iacute; una y otra vez. Les comunico que la base de la espiritualidad es la auto- responsabilidad y el auto- mejoramiento. Pero muchos de los verdaderos creyentes me dicen simplemente que yo no soy espiritual y se van a buscar a alguien que les d&eacute; el dogma y la estructura que ellos desean.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Nunca debe subestimarse el peligro potencial que representa esa gente. Pueden ser convertidos f&aacute;cilmente en fan&aacute;ticos que mueran y maten encantados por su sagrada causa. Es un sustituto de su fe perdida en s&iacute; mismos y se ofrecen a s&iacute; mismos como sustitutos de la esperanza individual. La Mayor&iacute;a Moral est&aacute; construida con verdaderos creyentes. Todos los cultos est&aacute;n compuestos de verdaderos creyentes. Se los puede usted encontrar en la pol&iacute;tica, la iglesia, los negocios y los grupos que trabajan por una causa social. Son los fan&aacute;ticos de todas esas organizaciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los movimientos de masas tienen por regla general un l&iacute;der carism&aacute;tico. Los seguidores quieren convertir a otros a su manera de vivir o imponerles un nuevo modo de vida---si es necesario haciendo leyes que obliguen a los dem&aacute;s a adoptar su punto de vista, como se evidencia en las actividades de la Mayor&iacute;a Moral. Esto significa forzar con armas o con castigos, en realidad esta es la base que subyace en las obligaciones legales.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La existencia de un enemigo com&uacute;n, un demonio, es esencial para el &eacute;xito de los movimientos de masas. Los renacentistas cristianos ten&iacute;an a Sat&aacute;n en persona, pero eso no era suficiente: han a&ntilde;adido lo oculto, los pensadores de la Nueva Era y, por &uacute;ltimo, a todos los que se oponen a su mezcla de iglesia y pol&iacute;tica, como se evidencia en sus campa&ntilde;as pol&iacute;ticas contra todos los que no est&aacute;n de acuerdo con sus opiniones. En las revoluciones, el demonio es generalmente el poder establecido o la aristocracia. Algunas empresas de potencial humano son demasiado listas </P>
<P ALIGN="JUSTIFY">para pedir a sus miembros que se afilien a ellas, etiquet&aacute;ndose a s&iacute; mismos de ese modo como secta, pero, si miramos detenidamente, nos damos cuenta que el demonio es todo aquel que no ha seguido su entrenamiento.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hay movimientos de masas sin demonios, pero esos nunca llegan a mucho. Los Verdaderos Creyentes son gente mentalmente desequilibrada e insegura, o personas sin esperanza o sin amigos. Gente que no busca aliados para amar, pero si para odiar o para obsesionarse con una causa. Y los que desean una nueva vida y un nuevo orden de cosas sienten que las viejas maneras deben de ser eliminadas antes de que su nuevo orden pueda ser construido.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">T&eacute;cnicas de persuasi&oacute;n</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La persuasi&oacute;n no es t&eacute;cnicamente lo mismo que el lavado de cerebro pero es la manipulaci&oacute;n de la mente humana por otro individuo, sin que la parte manipulada se de cuenta de que es lo que le ha hecho cambiar de opini&oacute;n. Me gustar&iacute;a tener tiempo para introducirles en algunas de las miles de t&eacute;cnicas que se usan hoy en d&iacute;a, pero la base de la persuasi&oacute;n es siempre el acceso AL MISMO CEREBRO. La mitad izquierda de nuestro cerebro es anal&iacute;tica y racional. La mitad izquierda es creativa e imaginativa. Esto es una simplificaci&oacute;n, pero sirve para lo que quiero decir. La idea es distraer a la parte izquierda del cerebro manteni&eacute;ndola ocupada. Idealmente, el persuasor genera un estado alterado de conciencia, haciendo que uno pase del estado beta de alerta al alfa; esto se puede medir en una maquina de electroencefalogramas (EEG).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En primer lugar, d&eacute;jenme poner un ejemplo de distracci&oacute;n de lado izquierdo del cerebro. Los pol&iacute;ticos usan estas poderosas t&eacute;cnicas todo el tiempo; los abogados usan algunas variantes que, seg&uacute;n me han dicho, llaman "apretar el lazo".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Piense por un momento que est&aacute; viendo a un pol&iacute;tico dando un discurso. En primer lugar, debe de crear lo que se llama "estado de asentimiento". Esto es lanzar afirmaciones con las que los oyentes est&aacute;n de acuerdo; deben incluso asentir con la cabeza mientras habla para mostrar su asentimiento. Seguidamente vienen los "truismos". Estos son generalmente hechos que pueden ser discutidos pero, una vez que el pol&iacute;tico tiene a la audiencia asintiendo, todas las posibilidades est&aacute;n a favor de que los oyentes no van a comenzar a pensar por si mismos, y por lo tanto seguir&aacute;n asintiendo. Por &uacute;ltimo llega la sugesti&oacute;n. Esto es lo que el pol&iacute;tico quiere que hagamos y, como hemos estado asintiendo todo el rato, podemos ser persuadidos para aceptar al sugesti&oacute;n. Ahora, escuche atentamente a mi discurso pol&iacute;tico y ver&aacute; que las tres primeras frases son el "asentimiento" las tres siguientes son "truismos" y la &uacute;ltima es la sugesti&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">"Se&ntilde;oras y caballeros: ¿est&aacute;n ustedes preocupados por los precios de los alimentos? ¿Est&aacute;n cansados de las subidas de los carburantes? ¿Est&aacute;n asqueados de la inflaci&oacute;n descontrolada? Bien, saben que el Otro Partido consinti&oacute; una inflaci&oacute;n del 18% el pasado a&ntilde;o; saben que la criminalidad se ha incrementado en el 50% en todo el pa&iacute;s en los &uacute;ltimos doce meses, y saben que sus salarios a duras penas les permiten cubrir sus gastos. La respuesta para resolver esos problemas es elegirme a mi Jonh Jones, para el Senado de los EEUU".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Creo que ya han odio todas estas cosas anteriormente. Pero deben buscar tambi&eacute;n por lo que se llaman "Comandos Ocultos". Por ejemplo: al pronunciar palabras clave, el orador har&aacute; un gesto con la mano izquierda, que las investigaciones han demostrado que llegan mejor al cerebro derecho. Los pol&iacute;ticos de hoy en d&iacute;a, orientados a los medios de comunicaci&oacute;n son frecuentemente entrenados por una nueva clase de especialistas que usan todos y cada uno de los trucos - nuevos y antiguos - para manipularnos y hacernos aceptar a su candidato.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los conceptos y t&eacute;cnicas de Neuro-Linguistica est&aacute;n tan protegidos que he encontrado que incluso hablar p&uacute;blicamente de ello o publicar resultados por escrito puede estar sujeto a sanciones legales. Sin embargo el conocimiento Neuro-Linguistico est&aacute; al alcance de cualquiera que le dedique el tiempo necesario y pague el precio requerido. Es una de las m&aacute;s sutiles y poderosas formas de manipulaci&oacute;n a las que me he visto expuesto. Un buen amigo que asisti&oacute; recientemente a un seminario de Neuro-Linguistica se encontr&oacute; con que la mayor parte de las personas con las que habl&oacute; durante los descansos eran gente del gobierno.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra t&eacute;cnica acerca de la que estoy aprendiendo es incre&iacute;blemente resbaladiza; se denomina T&Eacute;CNICA DE INTERCALADO  y la idea es decir algo con palabras pero sembrar una impresi&oacute;n subconsciente de otra cosa en la mente de los oyentes y/o espectadores.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">D&eacute;jenme ponerles un ejemplo: Vamos a suponer que est&aacute; usted viendo a un comentarista de televisi&oacute;n que afirma lo siguiente: "El SENADOR JOHNSON est&aacute; ayudando a las autoridades a solucionar los est&uacute;pidos errores de las empresas que contribuyen a crear los problemas de basura nuclear". Suena como si fuera la exposici&oacute;n de un hecho, pero si el locutor enfatiza las palabras adecuadas, y especialmente si hace los adecuados gestos con las manos al pronunciar las palabras clave, le pueden dejar a usted con la sensaci&oacute;n de que el Senador Johnson es un est&uacute;pido. Ese es el mensaje subliminal de la afirmaci&oacute;n, y al locutor no se le puede acusar de nada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las t&eacute;cnicas de persuasi&oacute;n se usan tambi&eacute;n frecuentemente en asuntos menores con la misma efectividad. El vendedor de seguros sabe que puede conseguir su objetivo mucho m&aacute;s f&aacute;cilmente si consigue hacerle visualizar algo en su mente. Esa es la comunicaci&oacute;n con el lado derecho del cerebro. Por ejemplo, puede hacer una pausa en la conversaci&oacute;n, mirar despacio a su alrededor en su sal&oacute;n y decir: "¿Puede usted imaginarse esta preciosa casa quem&aacute;ndose hasta los cimientos?" ¡Por supuesto que usted puede! Ese es uno de sus temores inconscientes y, cuando usted es forzado a visualizarlo, es usted m&aacute;s proclive a dejarse manipular para adquirir una p&oacute;liza de seguros.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los Hare Krishnas, trabajando en los aeropuertos, usan lo que lo llamo  t&eacute;cnicas de SUSTO Y CONFUSI&Oacute;N para distraer al lado izquierdo del cerebro y comunicarse con el lado derecho. Mientras esperaba un avi&oacute;n, estuve observando como actuaba uno de ellos durante m&aacute;s de una hora. Usaba el m&eacute;todo de saltar delante de alguien. Inicialmente, su voz era fuerte y despu&eacute;s bajaba al llegar al punto de ofrecer un libro y pedir un donativo para la causa. Por regla general, cuando alguien est&aacute; asustado, cede inmediatamente. En este caso, la gente estaba asustada por la extra&ntilde;a apariencia, s&uacute;bita aparici&oacute;n y fuerte voz del devoto Hare Krishna. En otras palabras, la gente se o&iacute;a en estado alfa por seguridad, ya que no deseaban afrontar la realidad que ten&iacute;an delante. En estado alfa, eran mucho m&aacute;s sugestionables y cog&iacute;an el libro; en el momento en que ten&iacute;an el libro, se sent&iacute;an culpables y respond&iacute;an a la segunda sugesti&oacute;n: dar dinero. Estamos condicionados para que, si alguien nos da algo, tenemos que entregarle algo a cambio--en este caso, dinero. Mientras observaba este ajetreo, estaba lo suficientemente cerca para percibir en muchas de las personas afectadas un signo evidente de estado alfa: sus pupilas estaban dilatadas.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Programaci&oacute;n subliminal</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las se&ntilde;ales subliminales son sugestiones escondidas que solo su subconsciente puede percibir. Pueden ser auditivas, encondidas tras una m&uacute;sica, o visuales, esparcidas en una imagen o proyectadas en una pantalla tan rapidamente que usted no las ve conscientemente, o astutamente incorporadas en una imagen o dise&ntilde;o.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muchas se&ntilde;ales audio subliminales en cintas de reprogramaci&oacute;n contienen sugestiones verbales grabadas a bajo volumen . Pongo en duda la eficacia de esta t&eacute;cnica: si las se&ntilde;ales subliminales no pueden ser percibidas, no pueden ser eficaces, y por lo tanto, las se&ntilde;ales subliminales grabadas por debajo de umbral audible son inefectivas. La t&eacute;cnica m&aacute;s antigua de se&ntilde;ales subliminales audio usa una voz que sigue el volumen de la m&uacute;sica de modo que las se&ntilde;ales son imposibles de detectar sin un ecualizador param&eacute;trico. Pero este sistema est&aacute; patentado y, cuando quise desarrollar mi propia l&iacute;nea de cassettes subliminales, vi que era imposible negociar con el due&ntilde;o de la patente. Mi abogado consigui&oacute; copias de las patentes que entregu&eacute; a algunos buenos ingenieros de sonido de Hollywood, pidi&eacute;ndoles que crearan una nueva t&eacute;cnica. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Encontraron una manera de modificar y sintetizar psico-ac&uacute;sticamente las sugestiones de modo que se proyecten en el mismo tono y frecuencia que la m&uacute;sica, dando as&iacute; la impresi&oacute;n de ser parte de la m&uacute;sica. Pero encontramos que, usando este sistema, no hay modo de reducir varias frecuencias para detectar los mensajes subliminales. En otras palabras, aunque las sugestiones son escuchadas por la mente subconsciente, no pueden ser monitorizadas ni siquiera con el equipo m&aacute;s sofisticado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si nosotros fuimos capaces de descubrir esta t&eacute;cnica tan f&aacute;cilmente como lo hicimos, no quiero ni pensar lo sofisticados que han debido de llegar a ser estos sistemas, teniendo a disposici&oacute;n de los investigadores los fondos ilimitados del gobierno y de los publicistas. Tiemblo al pensar en la manipulaci&oacute;n propagand&iacute;stica y publicitaria a la que estamos expuestos diariamente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Simplemente no hay modo de saber lo que se esconde bajo la m&uacute;sica que estamos oyendo. Puede incluso que se esconda una segunda voz bajo que o&iacute;mos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las series de Wilson Bryan Key, Ph.D., acerca de anuncios subliminales y campa&ntilde;as pol&iacute;ticas ilustra muy bien el mal uso que se da a estos sistemas en muchas &aacute;reas, especialmente en anuncios escritos en los diarios, revistas y vallas publicitarias.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La gran pregunta es: ¿funcionan? Y yo le garantizo a usted que lo hacen. No solo por la respuesta de quienes ha usado mis cintas, sino por los resultados de programas como los mensajes subliminales que se ocultan tras la m&uacute;sica en los grandes almacenes. Se supone que el &uacute;nico mensajes es el de no robar: Una tienda de la costa oeste (de los Estados Unidos) refiri&oacute; un descenso del 37% en los primeros nueve meses de prueba.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un art&iacute;culo de 1987 en el bolet&iacute;n t&eacute;cnico "Bolet&iacute;n cerebro-mente" afirma que el 99% de nuestra actividad cognitiva puede ser "no consciente", seg&uacute;n el director del Laboratorio de Psicofisiolog&iacute;a </P>
<P ALIGN="JUSTIFY">Cognitiva de la Universidad de Illinois. El extenso trabajo acaba con esta afirmaci&oacute;n: "Estos hallazgos apoyan el uso de sugestiones subliminales como sugestiones grabadas en cinta para programas de adelgazamiento y el uso terapeutico de la Hipnosis y la programaci&oacute;n Neuro-Linguistica".</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Mal uso masivo</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No puedo contar muchas historias acerca de la programaci&oacute;n subliminal, pero en cambio puede dedicar mi tiempo en advertirles a ustedes de uso sutil de este tipo de programaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">He tenido la experiencia personal de estar sentado en un auditorio de Los Angeles con m&aacute;s de diez mil personas que se hab&iacute;an reunido para escuchar un una persona carism&aacute;tica. Veinte minutos despu&eacute;s de entrar en el auditorio, me di cuenta de que estaba entrando y saliendo en un estado de conciencia alterado. Quienes me acompa&ntilde;aron experimentaron lo mismo. Como se trata de nuestro trabajo, nos dimos cuenta de lo que estaba sucediendo, pero los que nos rodeaban no lo notaban. Observando cuidadosamente, lo que parec&iacute;an demostraciones espont&aacute;neas resultaron ser, de hecho, manipulaciones perfectas. El &uacute;nico m&eacute;todo que puedo imaginar que fue utilizado para crear el trance es una vibraci&oacute;n de 6 o 7 ciclos por segundo emitida hacia la habitaci&oacute;n a trav&eacute;s del sonido del aire acondicionado. Esta vibraci&oacute;n particular genera estado alfa, lo que hace a la audiencia altamente sugestionable. Del 10 al 25 por ciento de la poblaci&oacute;n es capaz de tener estados de conciencia alterados de manera son&aacute;mbula; para esas personas, las sugestiones del orador, si no son amenazadoras, pueden ser aceptadas cono "ordenes".</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Vibrato</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Esto me lleva a mencionar el VIBRATO. El vibrato es un efecto de tr&eacute;molo que emiten algunas voces o instrumentos musicales, y sus ciclos por segundo causan que la gente entre en un estado alterado de conciencia. En un periodo de la historia inglesa, a los cantantes cuyas voces conten&iacute;an un vibrato pronunciado no se les permit&iacute;a actuar en p&uacute;blico porque los oyentes entraban en estados alfa y ten&iacute;an fantas&iacute;as, a menudo de contenido sexual.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La gente que va a la &oacute;pera o disfruta oyendo a cantantes como Mario Lanza est&aacute;n familiarizados con este estado inducido por los cantantes.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">ELF</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora llevaremos los avisos un poco m&aacute;s lejos. Hay tambi&eacute;n ELF inaudibles (Extra Low Frecuency waves = Frecuencias Extra Bajas). Son de naturaleza electro magn&eacute;tica. Uno de los principales usos de los RLF es la comunicaci&oacute;n con los submarinos. El Dr. Andrija Puharich, un investigador muy respetado, puso en funcionamiento un experimento para advertir a los oficiales estadounidenses del uso que hac&iacute;an los rusos de los ELF. Unos voluntarios se "enchufaron" de modo que sus ondas cerebrales pudieran ser monitorizadas. Fueron sellados en una habitaci&oacute;n met&aacute;lica que no pod&iacute;a ser penetrada por ninguna se&ntilde;a normal.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces, Puharich envi&oacute; ELF a los voluntarios. Los ELF penetran la tierra y por supuesto las paredes met&aacute;licas. Quienes estaban dentro no pod&iacute;an saber si las se&ntilde;ales estaban siendo enviadas o no. Y Puharich vio las reacciones en los equipos de EEG: el 30% de las personas dentro de la habitaci&oacute;n fueron "pose&iacute;dos" por la se&ntilde;al ELF en 6 a 10 segundos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando digo "poseidos", quiero decir que su comportamiento sigui&oacute; las pautas establecidas para unas determinadas frecuencias. Ondas de 6 ciclos por segundo hac&iacute;an que los individuos se sintieran emocionalmente alterados y muy descontrolados. a 8.2 cilos, se sent&iacute;an optimistas...sentimientos elevados, como si hubieran estado haciendo meditaci&oacute;n trascendental de modo magistral tras un aprendizaje de a&ntilde;os. De 11 a 11.3 ciclos induc&iacute;an ondas de agitaci&oacute;n depresiva que llevaban a comportamiento amotinado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Neur&oacute;fono</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Dr. Patrick Flanagan es un amigo m&iacute;o personal. En los primeros 60, siendo un adolescente, Pat apareci&oacute; en la lista de los mejores cient&iacute;ficos del mundo en la revista Life. Entre sus mucho inventos estaba un aparato llamado Neur&oacute;fono: un instrumento electr&oacute;nico que puede programar sugestiones con &eacute;xito a trav&eacute;s del contacto directo con la piel. Cuando intent&oacute; patentar el aparato, el gobierno le pidi&oacute; que probara que funcionaba. Cuando lo hizo, La Agencia Nacional de Seguridad confisc&oacute; el Neur&oacute;fono. A Pat le llev&oacute; 10 a&ntilde;os de batalla legal conseguir su devoluci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Usando ese aparato, usted no ve ni oye nada; se aplica sobre la piel, que seg&uacute;n Pat es la principal fuente de sensaciones. La piel contiene m&aacute;s receptores para el calor, el tacto, dolor, vibraciones y campos el&eacute;ctricos que ninguna otra parte de la anatom&iacute;a humana.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En una de sus m&aacute;s recientes pruebas, Pat llev&oacute; a cabo dos seminarios para militares: un seminario una noche y otro a la siguiente, porque la habitaci&oacute;n no era lo bastante grande para acomodar a todos ellos a la vez. Como el primer grupo parec&iacute;a muy fr&iacute;o y sin respuesta, Patrick pas&oacute; todo el d&iacute;a siguiente haciendo una cinta de audio especial para pasarla en el segundo seminario. La cinta instru&iacute;a a la audiencia para que se comportara c&aacute;lidamente y para que sintieran hormigueos en las manos. La cinta se pas&oacute; a trav&eacute;s del neur&oacute;fono, que estaba conectado a un hilo conductor situado en el techo de la habitaci&oacute;n. No hab&iacute;a altavoces, no se pod&iacute;a o&iacute;r ning&uacute;n sonido, pero el mensaje lleg&oacute; con excito a los cerebros de la audiencia. Fueron c&aacute;lidos y receptivos y respondieron, de acierto con la programaci&oacute;n recibida, de maneras que no puedo relatar aqu&iacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuanto m&aacute;s aprendemos acerca del comportamiento de los seres humanos a trav&eacute;s de las avanzadas t&eacute;cnicas de investigaci&oacute;n de hoy en d&iacute;a, m&aacute;s aprendemos a controlar a los seres humanos. Y lo que m&aacute;s nos asusta es que el medio para apoderarse de todos nosotros ya est&aacute; en funcionamiento. El aparato de televisi&oacute;n de su sal&oacute;n y de su dormitorio est&aacute; haciendo mucho m&aacute;s que simplemente entretenerle.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Antes de seguir, d&eacute;jenme apuntar algo m&aacute;s acerca del estado alterado de la conciencia. Cuando usted entra en estado alterado de la conciencia, el lado derecho del cerebro toma el control, lo que hace que se segreguen los opiaceos propios del cuerpo humano: encefalinas y beta-endorfinas, quiicamente id&eacute;nticas al opio. En otras palabras, uno se siente bien...y uno quiere tener m&aacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Unas recientes pruebas llevadas a cabo por el investigador Herbert Krugman mostraron que, mientras mira la televisi&oacute;n, el cerebro del telespectador miestra una actividad del lado derecho que supera a la del izquierdo en dos a uno. Para decirlo m&aacute;s sencillamente: los televidentes est&aacute;n en estado alterado m&aacute;s a menudo que en estado normal. Est&aacute;n consiguiendo su raci&oacute;n de beta-endorfinas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para medir el grado de atenci&oacute;n, el psic&oacute;logo Thomas Mulholland, del hospital de veteranos de Bedford, Massachussets, conect&oacute; a j&oacute;venes televidentes a un aparato de EEG que estaba conectado a la TV y la apagaba cada vez que los cerebros de los ni&ntilde;os produc&iacute;an una mayor&iacute;a de ondas alfa. A pesar de que se les dijo a los ni&ntilde;os que estuvieran atentos, solo unos pocos pudieron mantener la TV encendida m&aacute;s de 30 segundos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muchos telespectadores est&aacute;n realmente hipnotizados. Hacer el trance m&aacute;s profundo es f&aacute;cil. Una manera sencilla es colocar un fotograma negro cada 32 fotogramas de la pel&iacute;cula que se proyecta. Esto crea un ritmo de 45 por minuto que solo es percibido por la mente subconsciente: </P>
<P ALIGN="JUSTIFY">el ritmo ideal para general una hipnosis profunda.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los anuncios o sugestiones que contienen este tipo de proyecci&oacute;n son aceptados m&aacute;s facilmente. El alto porcentaje de espectadores que tienen capacidades sonambulisticas pueden aceptar esas sugestiones como &oacute;rdenes, siempre que no pidan al espectador que haga algo contrario a su moral, su religi&oacute;n o su autoconservaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El medio para poseernos est&aacute; ah&iacute;. Para la edad de 16 a&ntilde;os, los ni&ntilde;os han pasado de 10.000 a 15.000 horas ante la televisi&oacute;n: eso es m&aacute;s tiempo del que pasan en el colegio. En la casa media, la televisi&oacute;n est&aacute; encendida una media de 6 horas y 44 minutos al d&iacute;a, con un incremento de </P>
<P ALIGN="JUSTIFY">9 minutos al a&ntilde;o durante la d&eacute;cada de los 70.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Actualmente es obvio que no est&aacute;n mejorando las cosas...nos movemos r&aacute;pidamente hacia el mundo en alfa, posiblemente muy parecido al "1984" de Orwell: pl&aacute;cido, ojos vidriosos y respondiendo obedientemente a las instrucciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un proyecto de investigaci&oacute;n llevado a cabo por Jacob Jacoby de la Universidad de Purdue, encontr&oacute; que de 2.700 personas probadas, el 90 por ciento entendieron mal cosas tan sencillas como os anuncios y  la serie "Barnaby Jones". Unos minutos despu&eacute;s de haberlo visto, el espectador medio contestaba mal de 23 a 36 % de las preguntas acerca de lo que hab&iacute;a mirado. Por supuesto ¡staban entrado y saliendo continuamente de un trance! Si usted entra en trance profundo, debe recibir instrucciones de recordar, de lo contrario olvidar&aacute; autom&aacute;ticamente.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Solo he tocado la punta del iceberg. Si se combinan mensajes subliminales bajo la m&uacute;sica, efectos visuales hipn&oacute;ticos, ritmos musicales mantenidos inductores de trances...tenemos un lavado de cerebro extremadamente efectivo. Cada hora que usted pasa delante de la TV es usted m&aacute;s sugestionable. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y, en caso de que piense que la ley no permite estas cosas, est&aacute; equivocado. ¡No lo hace! Hay un mont&oacute;n de gente poderosa que prefiere que las cosas se queden como est&aacute;n. ¿Tal vez tienen alg&uacute;n plan?</P></FONT></BODY>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

