<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Pirater&iacute;a
</FONT>
</H3>

<FONT color="#000000" face="arial" size=2>        
<P ALIGN=JUSTIFY>Desde la &eacute;poca de los 8 bits, comprar un programa original implicaba
un s&iacute;mbolo de estupidez, e incluso entre amigos siempre se le recriminaba
a aquel incauto que no se hab&iacute;a resistido a esperar la copia pirata,
que por otra parte siempre llegaba, y hab&iacute;a comprado el programa de forma legal.
Despu&eacute;s paso lo que pas&oacute;, y tan s&oacute;lo Dinamic nos ha 
quedado como recuerdo &quot;vivo&quot; (y por los pelos) de aquella maravillosa &eacute;poca 
<br>
<br>
El caso es que, en el mundo del software y sobre todo, en el del software
de entretenimiento, existe una mentalidad en la que no cabe o no se concibe
la compra de productos originales, incluso me atrevo a decir que muchos de
los jugadores empedernidos del mundo del PC no han visto en su vida lo que hay
dentro de una caja de un juego original.
<br>
<br>
Bien es cierto que no es todo oro lo que reluce y que pagar una elevada
cantidad de dinero por un juego que, en un principio, no sabes si te va a gustar,
es algo muy peligroso. Sin embargo, yo creo que ese argumento, el del &quot;pagar dinero
sin saber como es el juego&quot;, ya no se puede utilizar, m&aacute;xime si tenemos en cuenta, que cada vez hay
m&aacute;s revistas, m&aacute;s demos de los productos (entre otras cosas al propagarse
el concepto Shareware), v&iacute;deos, cat&aacute;logos, empieza ya a cobrar fuerza
la culturilla en el mundo del software, la gente reconoce ya las compa&ntilde;ias
que tienen prestigio y a los gur&uacute;s del software de entretenimiento, en
definitiva, cada vez el usuario tiene acceso a m&aacute;s y m&aacute;s informaci&oacute;n sobre este
o aquel producto antes de decidirse a gastar su dinero.
<br>
<br>
Por otro lado, mucha de la gente que piratera software de forma ilegal, sobre
todo con el t&iacute;pico CD-ROM plagado de juegos, s&oacute;lo encuentra uno o dos
t&iacute;tulos a los que realmente va a jugar, dejando el resto, bien por que
no tiene tiempo para jugar a todos o bien porque al final no le han llamado la atenci&oacute;n,
no le han resultados divertidos etc. Pues bien, yo creo que ese juego que
al final te resulta interesante, que juegas hasta acabartelo,merece que
se adquiera de forma legal y con ello pagar el esfuerzo de
un monton de programadores, grafistas, dise&ntilde;adores, m&uacute;sicos, guionistas, y
dem&aacute;s art&iacute;stas, que muy probablemente dependiendo de las, en la mayor&iacute;a de casos,
pocas ventas que consigan podr&aacute;n o no seguir elaborando juegos. Esto &uacute;ltimo es 
lo que ocurre y ha ocurrido siempre, si miramos al panorama nacional.
<br>
<br>
Con todo esto llegamos a una conclusi&oacute;n muy peligrosa: cada vez se har&aacute; m&aacute;s
dif&iacute;cil que nuevas compa&ntilde;ias del software de entretenimiento salgan a la luz,
ya que tan s&oacute;lo ser&aacute;n las gigantescas multinacionales las que puedan resistir,
dejando de lado a los verdaderos &quot;artesanos del software&quot;,
a no ser claro, que se empiece con un important&iacute;simo presupuesto, pero claro
eso es muy dificil, sobre todo si nos fijamos en nuestro pais, en donde la  
mayor&iacute;a de las distribuidoras no est&aacute;n dispuestas a poner tanto dinero y por si
fuera poco, no hay una mentalidad inform&aacute;tica de cara al entretenimiento
como puede existir en otros paises.
<br>
<br> 
Ahora mismo est&aacute;n a punto de estrenarse unas cuantas compa&ntilde;ias de software de entretenimiento
espa&ntilde;olas con productos que ir&aacute;n destinados tanto al panorama nacional como internacional, 
as&iacute; Rebel Act Studios, Hammer Tecnologies o Noria Works, est&aacute;n preparando los, podr&iacute;amos decir, 
juegos que podr&iacute;an iniciar la seg&uacute;nda &eacute;poca de oro en el software de entretenimiento (la primera
abarco la &eacute;poca de los 8 bits) dentro de nuestro pa&iacute;s. Pues bien,
estas compa&ntilde;ias han necesitado la inversi&oacute;n de cantidades de dinero, probablemente muy
rid&iacute;culas frente a muchas compa&ntilde;&iacute;as americanas o del resto de Europa, teniendo que trabajar cuatro
veces m&aacute;s, ya que las plantillas no pueden ser tan numerosas. <i>¿Qu&eacute; va a pasar?</i>, pues que
que su existencia depender&aacute; de las ventas de su PRIMER t&iacute;tulo, <i>¿Problema?</i>
la pirater&iacute;a en nuestro pais no s&oacute;lo puede acabar con ellas, sino que amenaza
con impedir la creaci&oacute;n de nuevas compa&ntilde;ias, en las cuales, no olvidemos, podr&iacute;amos
tener todos alguna oportunidad de trabajar en el futuro...
<br>
<br>
Muchos pensare&iacute;s que all&iacute; es m&aacute;s f&aacute;cil comprar el software original porque es
m&aacute;s barato, y yo os responder&eacute; que s&iacute;, es cierto que es m&aacute;s barato, pero recordar:
un &iacute;ndice bajo de pirater&iacute;a lleva NECESARIAMENTE una caida en los precios de
los productos.
<br>
<br>
En conclusi&oacute;n: Compra aquello que utilices de verdad y no piratees a las compa&ntilde;&iacute;as
espa&ntilde;olas, que lo &uacute;nico que vas a conseguir es tirar piedras contra t&uacute; propio
tejado en un futuro no muy lejano...
<br>
<BR>
</p>
<hr>
<p align=center>
<b>
Publicado en la secci&oacute;n de cartas del 
<I> Pa&iacute;s de Las Tentaciones</I>
</b>
</p>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



