<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Orientada a Objetos en C++</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>
<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Cap&iacute;tulo 5.<br> Jerarquía de clases y herencia en la práctica.
</H3>

<p align=justify>

Hasta ahora hemos tocado bastantes aspectos de forma puramente te&oacute;rica, tambi&eacute;n hemos dado nuestros primeros pasos construyendo programas en C++ que son capaces de aprovecharse de las ventajas que este leguaje nos dispensa frente al C tradicional. Es ahora ya de empezar a llevar a la pr&aacute;ctica todo el aspecto te&oacute;rico o, mejor dicho, toda la nueva forma de pensar que impregna la metodolog&iacute;a orientada a objetos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En este cap&iacute;tulo vamos a aprender a derivar clases y a utilizar la herencia en nuestros programas. Pronto veremos las grandes posibilidades que esto nos reporta para hacer dise&ntilde;os mucho m&aacute;s robustos y flexibles y, sobre todo, aprenderemos a ir pensado en C++ cosa fundamental para saber trabajar con la POO. Recordad que la metodolog&iacute;a orientada a objetos no es s&oacute;lo una nueva forma de programar es, sobre todo, una nueva forma de pensar.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Introducci&oacute;n a la jerarqu&iacute;a y herencia de clases</h4>
<P ALIGN="JUSTIFY">La derivaci&oacute;n de clases viene a significar crear una clase a la que denominamos <B>clase base</B>. En ella, definimos un conjunto de propiedades (atributos y m&eacute;todos) que consideramos que son los m&aacute;s generales y que no deber&iacute;an de faltar. Una vez que tengamos la seguridad de haber dado con la clase general que and&aacute;bamos buscando, podemos crear otra clase que, en cierto modo, supone una especializaci&oacute;n de la anterior. Como es una especializaci&oacute;n de la anterior, adem&aacute;s de las propiedades definidas para la clase base tendr&aacute; las suyas propias que servir&aacute;n para diferenciarla de la anterior y para hacer que consiga esa especializaci&oacute;n que buscamos. ¿Para hacer que tenga los atributos de la clase base tenemos que volver a escribir todo?. ¡NO!, s&oacute;lo hace falta heredar de la clase base los atributos que nos interesen. Lo &uacute;nico que tendremos que escribir nuevo ser&aacute;n los atributos que especializan a esta clase. A la clase que hereda de otra clase se le llama <B>clase derivada</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¡¡¡Arggg!!!, vaya l&iacute;o que te estar&aacute;s formando en la cabeza, ¿no?. Te recomiendo que eches un vistazo al gr&aacute;fico que voy a poner a continuaci&oacute;n y que luego vuelvas a leer la parrafada anterior.</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/poo51.gif"></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Deacuerdo?. Bueno, me supongo que no del todo as&iacute; que voy a intentar ir aclarando todo esto poco a poco explicando qu&eacute; son las <B>jerarqu&iacute;as</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando una clase se deriva de otra clase, llamada clase base, lo que hace es heredar un conjunto de funciones o m&eacute;todos y variables de la clase base. No se heredan todos. S&oacute;lo se heredan los elementos que est&eacute;n preparados para ser heredados. As&iacute;, si una funci&oacute;n o variable en la clase base est&aacute; declarada como privada no se podr&aacute; heredar desde la clase derivada, es decir, no podremos acceder a ella y si lo intentamos, obtendremos un error en tiempo de compilaci&oacute;n. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hasta ahora s&oacute;lo hemos puesto el ejemplo de dos clases. Una la llamamos clase base y otra clase derivada. La segunda hereda los m&eacute;todos y variables que no son declarados como privados en la clase base sin embargo, ¿puede la clase base ser heredada por m&aacute;s de una clase derivada?, ¿puede una clase derivada convertirse en clase base y que otras clases hereden de ella?. Ambas respuestas obtienen un gran S&Iacute;. Podemos tener una clase base y montones de clases derivadas. As&iacute; mismo, puede darse el caso de una clase derivada de una clase base y una tercera clase que toma a la clase derivada como su clase base, deriv&aacute;ndose de ella. Si esto lo llevamos a la pr&aacute;ctica iremos obteniendo una jerarqu&iacute;a de clases.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Un ejemplo?. Voy a poner un caso que bien podr&iacute;a darse para un sistema de generaci&oacute;n de personajes de un juego de rol (ahora bien, super primitivo...). Imaginaros que queremos hacer un sistema para la creaci&oacute;n de multitud de personajes. Estos personajes podr&aacute;n ser s&oacute;lo humanos. Al ser humanos s&oacute;lo existir&aacute;n dos sexos, hombre y mujer. Por otro lado, existen dos tipos de personajes: los Guerreros y los Magos. ¿C&oacute;mo podr&iacute;amos montarnos un sistema jer&aacute;rquico con todo estos datos?. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Est&aacute; claro que todos los personajes son humanos por lo tanto ser&iacute;a una buena idea partir de una clase llamada HUMANO que contuviera todos los atributos que tiene cualquier ser humano. Luego vemos que, al estar creando un sistema de generaci&oacute;n de personajes humanos, tenemos dos sexos independientes el del hombre y el de la mujer. Las diferencias son obvias pero no por ello hace falta crear dos clases distintas llamadas HOMBRE y MUJER pues no nos hacen falta tomar atributos exclusivos de los sexos para trabajar en la generaci&oacute;n de personajes. Basta con poner una variable en la clase HUMANO llamada sexo y dar el valor oportuno (por ejemplo si sexo se inicia con V significa que es un hombre y si se inicia con M significa que es una mujer. Internamente trabajaremos con 0 y 1). </P>
<P ALIGN="JUSTIFY">Lo que seguro necesita de clases nuevas es el tema de las dos especialidades de los personajes que podamos crear. Est&aacute; claro que tanto los guerreros como los magos son humanos. Vamos a preguntarnos a nosotros mismos para ver si  nos aclaramos las diferencias que pueden existir en cada uno de los personajes.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">¿Un guerrero tiene fuerza, inteligencia, destreza, energ&iacute;a, peso, sexo, edad y nombre?.</I></P> 
<P ALIGN="JUSTIFY">S&iacute;, y adem&aacute;s esto tambi&eacute;n lo tiene cualquier mago por lo tanto estas caracter&iacute;sticas ya han debido de ser incluidas en la clase HUMANO.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">¿Un guerrero utiliza un libro de hechizos para luchar?</I>. </P>
<P ALIGN="JUSTIFY">No, un guerrero s&oacute;lo puede utilizar armas. Pero un mago s&iacute; que puede utilizar libros de hechizos para luchar. Del mismo modo, un mago no puede utilizar armas para pelear.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">¿Un mago puede vestir armaduras?</I>. </P>
<P ALIGN="JUSTIFY">No, los magos s&oacute;lo pueden llevar t&uacute;nicas de tres colores: negro, rojo o blanco (te suena ¿no?). Adem&aacute;s, en el caso de los guerreros, esto s&iacute; pueden vestir armaduras pero no t&uacute;nicas y las armaduras pueden ser de cuero o simplemente nada (el típico Conan...).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Podr&iacute;amos seguir hasta desmenuzar totalmente a cada tipo de personaje pero, con estos datos, ya podemos saber que necesitamos dos clases que heredan de la clase base HUMANO. Estas clases ser&aacute;n la de GUERRERO y la de MAGO. La clase GUERRERO poseer&aacute; una variable llamada armas cuyo rango de valores podr&aacute; ir desde espadas a &quot;simples&quot; pu&ntilde;os mientras que el MAGO poseer&aacute; una variable llamada libro de hechizos que trabajar&aacute; con todos los distintos libros de hechizos que nosotros dise&ntilde;emos. As&iacute; mismo, la clase GUERRERO dispondr&aacute; de una variable llamada armadura que tomara los valores de cuero o nada, indicando que no tiene armadura,  y la clase MAGO dispondr&aacute; tambi&eacute;n de una variable similar llamada t&uacute;nica y su rango ser&aacute; el de t&uacute;nica roja, negra o blanca. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y, ahora, el dibujo esquema para aclarar todo. Aconstumbraros a trazar esquemas similares antes de comenzar a codificar. Es muy importante sentar las bases de un dise&ntilde;o, si este va a tener cierta envergadura, pues de lo contrario os ver&eacute;is modificando y ampliando vuestro programa hasta la eternidad. Est&aacute;is avisados, la metodolog&iacute;a orientada a objetos es as&iacute;... </P>
<P ALIGN="JUSTIFY">Ahora os pongo c&oacute;mo podr&iacute;a ser el esquema gr&aacute;fico (sencill&iacute;simo) de lo que aqu&iacute; se ha tratado de explicar:</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/poo52.gif"></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, si no est&aacute; m&aacute;s claro que antes si que deber&iacute;ais de apreciar, aunque sea de refil&oacute;n, lo que trato de mostraros con la jerarqu&iacute;a de clases. Trabajamos con especializaciones o derivaciones sucesivas de clases, vamos a poder utilizar toda la potencia del C++.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Ventajas de la utilizaci&oacute;n de clases derivadas.</h4>
<P ALIGN="JUSTIFY">Cualquiera que programe con la metodolog&iacute;a orientada a objetos utiliza la derivaci&oacute;n de clases. Es algo b&aacute;sico cuando hacemos programas extensos y que requieren de montones de datos para la especializaci&oacute;n. L&oacute;gicamente, se puede pasar por alto su aprovechamiento pero entonces, nos limitar&iacute;amos a programar en C (y rematadamente mal) pero utilizando estructuras y, para eso, s&oacute;lo aprendemos C++ como ampliaci&oacute;n del C y no como metodolog&iacute;a orientada a objetos. La principal importancia de la metodolog&iacute;a orientada a objetos radica en la posibilidad de utilizar el c&oacute;digo que otras personas han hecho y trabajar en equipo para llevar a cabo proyectos de gran envergadura. Cuando se programa para entornos como el Windows, por ejemplo, una de las cosas a las que nos tenemos que acostumbrar es a aprender a leer el c&oacute;digo que otras personas han hecho ya, a utilizar las clases ya dise&ntilde;adas y codificadas y a adaptarlas a nuestras necesidades. Esto implica crearnos una jerarqu&iacute;a propia a partir de algo que ya est&aacute; hecho por lo que se torna fundamental el aprender a pensar de esta nueva manera.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si queremos implementar un programa, debemos de ponernos antes delante de un papel y dise&ntilde;ar a mano los posibles m&oacute;dulos que vamos a necesitar y, una vez establecidos, desmenuzar esos m&oacute;dulos en jerarqu&iacute;as de clases. Esto nos va a permitir que, en un futuro, nuestro dise&ntilde;o sea totalmente ampliable y mejorable y que otras personas puedan aprovecharlo para trabajar. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Intenta ir m&aacute;s all&aacute; del ejemplo anteriormente establecido. Imagina que hay ahora una clase de guerreros distinta que adem&aacute;s tambi&eacute;n son magos. ¿Qu&eacute; har&iacute;as?. Crea una clase llamada GUERRERO_MAGO que herede de la clase GUERRERO y de la clase MAGO y ya est&aacute;. Tu personaje ahora podr&aacute; tener todos los atributos exclusivos de un ser humano, de un guerrero y de un mago. Esto es lo que nos ofrece la herencia y la jerarqu&iacute;a de clases, poder reutilizar c&oacute;digo de una forma inteligente. </P>
<P ALIGN="JUSTIFY"></P>
<h4>Un ejemplo </h4>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a ver, mediante un sencillo ejemplo, c&oacute;mo implementar la derivaci&oacute;n de una clase utilizando el concepto de herencia. Utilizaremos, para ello, el modelo ideado m&aacute;s atr&aacute;s, es decir, tendremos una clase base llamada HUMANO y de ella se derivar&aacute;n dos, la clase GUERRERO y la clase MAGO. En la clase HUMANO estar&aacute;n todos los datos b&aacute;sicos y que son comunes a los dos tipos de personajes (Guerreros y Magos) mientras que, en la clases ya respectivas, pondremos caracter&iacute;sticas &uacute;nicas y que les diferencian, como el caso de armas, hechizos, armaduras o t&uacute;nicas. ¡All&aacute; vamos!</P>
<P ALIGN="JUSTIFY"></P>
<pre>
<FONT FACE="ARIAL" SIZE=1>#<B>include</B> &lt;iostream.h&gt;

// Clase Base
<B>class</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Humano(); {}
&#9;<B>~</B>Humano(); {}

<B>private</B>:
&#9;// Hago excesivo uso del tipo int porque es un ejemplo
&#9;// en un caso real, aconstumbraros a utilizar el tipo <b>unsigned char</b>
&#9;// si vuestros valores no van a rebasar el rango 0-255
&#9;<B>char</B> *m_nombre;
&#9;<B>int</B> m_edad;
&#9;<B>int</B> m_peso;
&#9;<B>int</B> m_sexo;
&#9;<B>int</B> m_inteligencia;
&#9;<B>int</B> m_fuerza;
&#9;<B>int</B> m_destreza;
&#9;<B>int</B> m_energia;

<B>public</B>:
&#9;<B>void</B> PonNombre(<B>char</B> *nombre) { m_nombre = name; }
&#9;<B>void</B> PonEdad(<B>int</B> edad) { m_edad = edad; }
&#9;<B>void</B> PonSexo(<B>char</B> sexo) { if (sexo=='V') m_sexo =0; else m_sexo = 1; }
&#9;<B>void</B> PonInteligencia(<B>int</B> intel) { m_inteligencia = intel; }
&#9;<B>void</B> PonFuerza(<B>int</B> fuerza) { m_fuerza = fuerza; }
&#9;<B>void</B> PonDestreza(<B>float</B> destreza) { m_destreza = destreza; }
&#9;<B>void</B> PonEnergia (<B>int</B> energia) { m_energia = energia; }
&#9;<B>virtual</B> <B>void</B> PonInformacion(<b>void</b>);
};

// Primera clase derivada
<B>class</B> Guerrero <B>:</B> <B>public</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Guerrero() {}
&#9;<B>~</B>Guerrero() {}

<B>private</B>:
&#9;<B>int</B> m_tipoArma; // 0 manos 1 espada 
&#9;<B>int</B> m_tipoArmadura; // 0 nada 1 cuero 

<B>public</B>:
&#9;<B>void</B> PonArma(<B>int</B> arma) 
&#9;{ m_tipoArma = arma; }
&#9;<B>void</B> PonArmadura(<B>int</B> armadura) 
&#9;{ m_tipoAramadura = armadura; }
&#9;<B>void</B> PonInformacion(<b>void</b>);
};

//Segunda clase derivada
<B>class</B> Mago<B>:</B> <B>public</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Mago() {}
&#9;<B>~</B>Mago() {}
<B>private</B>:
&#9;<B>int</B> m_tipoLibroHechizos; // 0 ataque 1 curacion
&#9;<B>int</B> m_tipoTunica; // 0 blanca 1 roja 2 negra

<B>public</B>:
&#9;<B>void</B> PonLibroHechizos(<B>int</B> libro)
&#9;{ m_tipoLibroHechizos = libro; }
&#9;<B>void</B> PonTunica(<B>int</B> tunica)
&#9;{ m_tipoTunica = tunica; }
&#9;<B>void</B> PonInformacion(<b>void</b>);
};

// Ahora implementamos las funciones que no son
// inline

// M&eacute;todos de la clase Humano

<B>void</B> Humano<B>::</B>PonInformacion(<b>void</b>)
{
&#9;<B>cout</B> &lt;&lt; "\n Nombre: " &lt;&lt; m_nombre;
&#9;<B>cout</B> &lt;&lt; "\n Edad: " &lt;&lt; m_edad;
&#9;<B>switch</B>(m_sexo)
&#9;{
&#9;&#9;<B>case</B> 0:  <B>cout</B> &lt;&lt; "\n Sexo: Hombre"; <B>break</B>;  
&#9;&#9;<B>case</B> 1:  <B>cout</B> &lt;&lt; "\n Sexo: Mujer"; <B>break</B>;  
&#9;};
&#9;<B>cout</B> &lt;&lt; "\n Inteligencia: " &lt;&lt; m_inteligencia;
&#9;<B>cout</B> &lt;&lt; "\n Fuerza: " &lt;&lt; m_fuerza;
&#9;<B>cout</B> &lt;&lt; "\n Destreza: " &lt;&lt; m_destreza;
&#9;<B>cout</B> &lt;&lt; "\n Energ&iacute;a: " &lt;&lt; m_energia;
}

// M&eacute;todos de la clase Guerrero

<B>void</B> Guerrero<B>::</B>PonInformacion(<b>void</b>)
{
&#9;Humano::PonInformacion();
&#9;<B>switch</B>(m_tipoArma)
&#9;{
&#9;&#9;<B>case</B> 0:  <B>cout</B> &lt;&lt; "n Arma: Pu&ntilde;os"; <B>break</B>;  
&#9;&#9;<B>case</B> 1:  <B>cout</B> &lt;&lt; "\n Arma: Espada"; <B>break</B>;  
&#9;};
&#9;<B>switch</B>(m_tipoArmadura)
&#9;{
&#9;&#9;<B>case</B> 0:  cout &lt;&lt; "\n Armadura: Ninguna"; <B>break</B>;  
&#9;&#9;<B>case</B> 1:  cout &lt;&lt; "\n Armadura: Cuero"; <B>break</B>;  
&#9;};
}

// M&eacute;todos de la clase Mago

<B>void</B> Mago<B>::</B>PonInformacion(<b>void</b>)
{
&#9;Humano<B>::</B>PonInformacion();
&#9;<B>switch</B>(m_tipoLibroHechizo)
&#9;{
&#9;&#9;<B>case</B> 0:  <B>cout</B> &lt;&lt; "\n Libro: Hechizos de Ataque"; <B>break</B>;  
&#9;&#9;<B>case</B> 1:  <B>cout</B> &lt;&lt; "\n Libro: Hechizos de Curaci&oacute;n"; <B>break</B>;  
&#9;};
&#9;<B>switch</B>(m_tipoTunica)
&#9;{
&#9;&#9;<B>case</B> 0:  <B>cout</B> &lt;&lt; "\n T&uacute;nica: Blanca"; <B>break</B>;  
&#9;&#9;<B>case</B> 1:  <B>cout</B> &lt;&lt; "\n T&uacute;nica: Roja"; <B>break</B>;  
&#9;&#9;<B>case</B> 2:  <B>cout</B> &lt;&lt; "\n T&uacute;nica: Negra"; <B>break</B>;  
&#9;};
}

<B>int</B> main()
{
&#9;// Nota: Pese a que los nombres os sonar&aacute;n (o, al menos, ¡deber&iacute;an!)
&#9;// sus datos los he puesto casi sin mirar... as&iacute; que los puritanos
&#9;// de las novelas, disculpen ;-)

&#9;// Declaramos dos objetos.
&#9;// Uno de tipo Mago y otro de tipo Guerrero

&#9;Guerrero Caramon;
&#9;Mago Raistlin;

&#9;// Ponemos los datos de cada uno
&#9;
&#9;// Datos del guerrero
&#9;Caramon.PonNombre("Caramon");
&#9;Caramon.PonEdad(26);
&#9;Caramon.PonSexo('V');
&#9;Caramon.PonInteligencia(7);
&#9;Caramon.PonFuerza(8);
&#9;Caramon.PonDestreza(8);
&#9;Caramon.PonEnergia(100);
&#9;Caramon.PonArma(1);
&#9;Caramon.PonArmadura(0);

&nbsp;
&#9;// Datos del Mago
&#9;Raistlin.PonNombre("Raistlin");
&#9;Raistlin.PonEdad(26);
&#9;Caramon.PonSexo('V');
&#9;Raistlin.PonInteligencia(9);
&#9;Raistlin.PonFuerza(5);
&#9;Raistlin.PonDestreza(6);
&#9;Raistlin.PonEnergia(60);
&#9;Raistlin.PonLibroHechizos(0);
&#9;Raistlin.PonTunica(1);

&#9;// Ahora Ponemos los datos del Guerrero por pantalla
&#9;Caramon.PonInformacion();
&#9;// Ahora Ponemos los datos del Mago por pantalla
&#9;Raistlin.PonInformacion();

&#9;<B>return</B> 0;
}</FONT></pre>

<h4>Analizando el ejemplo</h4>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>¿Qu&eacute; tal lo veis?. Espero que se os hayan aclarado bastantes m&aacute;s cosas ahora que ten&eacute;is toda la teor&iacute;a codificada. Como pod&eacute;is observar, utilizamos la clase base HUMANO y, a partir de ella, derivamos las clases GUERRERO y MAGO. Esto da mucha potencia ya que tenemos todo lo b&aacute;sico en la clase base y creamos clases espec&iacute;ficas que se especializan, caso de las citadas GUERRERO y MAGO, ofreciendo esos datos u acciones concretas. Ser&iacute;a muy f&aacute;cil crear una clase arquero, ladr&oacute;n, bardo.... tan s&oacute;lo hay que derivar de la clase base y a&ntilde;adir esas caracter&iacute;sticas &uacute;nicas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A modo de recordatorio, os pongo la clase base HUMANO que establece todas las caracter&iacute;sticas b&aacute;sicas as&iacute; como los m&eacute;todos para trabajar con ellas. Ah&iacute; va:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1>// Clase Base
<B>class</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Humano(); {}
&#9;<B>~</B>Humano(); {}

<B>private</B>:
&#9;// Hago excesivo uso del tipo int porque es un ejemplo
&#9;// en un caso real, aconstumbraros a utilizar el tipo <b>unsigned char</b>
&#9;// si vuestros valores no van a rebasar el rango 0-255
&#9;<B>char</B> *m_nombre;
&#9;<B>unsigned char</B> m_edad;
&#9;<B>int</B> m_peso;
&#9;<B>int</B> m_sexo;
&#9;<B>int</B> m_inteligencia;
&#9;<B>int</B> m_fuerza;
&#9;<B>int</B> m_destreza;
&#9;<B>int</B> m_energia;

<B>public</B>:
&#9;<B>void</B> PonNombre(<B>char</B> *nombre) { m_nombre = name; }
&#9;<B>void</B> PonEdad(<B>int</B> edad) { m_edad = edad; }
&#9;<B>void</B> PonSexo(<B>char</B> sexo) { if (sexo=='V') m_sexo =0; else m_sexo = 1; }
&#9;<B>void</B> PonInteligencia(<B>int</B> intel) { m_inteligencia = intel; }
&#9;<B>void</B> PonFuerza(<B>int</B> fuerza) { m_fuerza = fuerza; }
&#9;<B>void</B> PonDestreza(<B>float</B> destreza) { m_destreza = destreza; }
&#9;<B>void</B> PonEnergia (<B>int</B> energia) { m_energia = energia; }
&#9;&#9;<B>virtual</B> <B>void</B> PonInformacion(<b>void</b>);
};
</pre></FONT>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>La clase derivada GUERRERO, hereda todas las funciones o m&eacute;todos y todas las variables o atributos de la clase base HUMANO. Adem&aacute;s, a&ntilde;ade dos funciones nuevas, dos variables nuevas y redefine una funci&oacute;n de la clase base, la funci&oacute;n <B>PonInformaci&oacute;n().</B> Es decir, la clase GUERRERO es la siguiente:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1>// Primera clase derivada
<B>class</B> Guerrero <B>:</B> <B>public</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Guerrero() {}
&#9;<B>~</B>Guerrero() {}

<B>private</B>:
&#9;<B>int</B> m_tipoArma; // 0 manos 1 espada 
&#9;<B>int</B> m_tipoArmadura; // 0 nada 1 cuero 

<B>public</B>:
&#9;<B>void</B> PonArma(<B>int</B> arma) 
&#9;{ m_tipoArma = arma; }
&#9;<B>void</B> PonArmadura(<B>int</B> armadura) 
&#9;{ m_tipoAramadura = armadura; }
&#9;<B>void</B> PonInformacion(<b>void</b>);
};</pre></FONT>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>Por su parte, la clase MAGO, viene a hacer algo similar. Hereda todas las funciones y variables p&uacute;blicas de la clase base HUMANO, al igual que la clase GUERRERO y, adem&aacute;s, a&ntilde;ade dos variables, dos funciones y redefine la, ya citada, funci&oacute;n <B>PonInformacion()</B> de la clase base. La clase MAGO es esta:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1>//Segunda clase derivada
<B>class</B> Mago<B>:</B> <B>public</B> Humano {
<B>public</B>:
&#9;// Constructor y destructor
&#9;Mago() {}
&#9;<B>~</B>Mago() {}
<B>private</B>:
&#9;<B>int</B> m_tipoLibroHechizos; // 0 ataque 1 curacion
&#9;<B>int</B> m_tipoTunica; // 0 blanca 1 roja 2 negra

<B>public</B>:
&#9;<B>void</B> PonLibroHechizos(<B>int</B> libro)
&#9;{ m_tipoLibroHechizos = libro; }
&#9;<B>void</B> PonTunica(<B>int</B> tunica)
&#9;{ m_tipoTunica = tunica; }
&#9;<B>void</B> PonInformacion(<b>void</b>);
};</pre></FONT>
<P ALIGN="JUSTIFY"></P>
<h4>¿C&oacute;mo declaramos, exactamente, una clase derivada?</h4>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>Vamos a mirar la cabecera de la clase GUERRERO que nos vale para ilustrar el proceso. Recordemos c&oacute;mo era:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1>// Primera clase derivada
<B>class</B> Guerrero <B>:</B> <B>public</B> Humano {
</pre></FONT>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si nos fijamos, despu&eacute;s de poner <B>class Guerrero</B>, ponemos dos puntos &quot;<B>:</B>&quot; y, despu&eacute;s, <B>public Humano. </B>Lo que debemos de hacer es declarar primero el nombre de la clase que, como todos sabemos, es Guerrero, despu&eacute;s los dos puntos &quot;:&quot; y, por &uacute;ltimo, lo m&aacute;s importante, debemos de poner el nombre de la clase de la que vamos a derivar o heredar anteponiendo el formato <B>public </B>o<B> private</B>. Estos son los dos &uacute;nicos especificadores de acceso que podemos poner a la hora de declarar una clase derivada. Con <B>public</B>, heredamos todos los elementos, tanto variables como funciones. Si pusi&eacute;ramos <B>private</B> como especificador de acceso, lo &uacute;nico que conseguir&iacute;amos ser&iacute;a hacer oculta una clase derivada del resto del programa pero, como esto no se suele utilizar (nosotros, en principio, no lo vamos a hacer), no se suele indicar, es decir, se suele declarar todo como public a la hora de derivar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Durante la utilizaci&oacute;n de los objetos Guerrero y Mago, utilizamos, mayormente, los m&eacute;todos de la clase base, esto es, durante el establecimiento del nombre, edad, sexo, inteligencia, fuerza, destreza o energ&iacute;a, lo que se hace es &quot;echar mano&quot; de los m&eacute;todos de la clase Humano y que son heredados. Sin embargo, m&eacute;todos como <B>PonArma()</B> o <B>PonTunica()</B>, por poner alg&uacute;n ejemplo, ya pertenecen exclusivamente a los objetos derivados, es decir, estos m&eacute;todos no se heredan de ninguna clase.</P>
<P ALIGN="JUSTIFY">Otro aspecto muy importante es el de la redefinici&oacute;n de funciones. Cuando redefinimos funciones lo que venimos a hacer es coger una funci&oacute;n ya hecha, que pertenece a una clase base, y a&ntilde;adirla una serie de caracter&iacute;sticas necesarias para el objeto derivado. Estas caracter&iacute;sticas pueden y suelen, ampliarlas.  El ejemplo m&aacute;s claro es el del m&eacute;todo <B>PonInformacion() </B>m&eacute;todo que ser&aacute; el que estudiemos a continuaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Redefiniendo funciones</h4>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>Retomando el p&aacute;rrafo anterior, el tema de la redefinici&oacute;n es una valiosa &quot;arma&quot; para poder concretar todo lo que heredamos a&uacute;n m&aacute;s. As&iacute;, en nuestros ejemplos, tanto la clase Guerrero como la clase Mago, hacen uso de la redefinici&oacute;n. Vamos a recordar c&oacute;mo era la funci&oacute;n <B>PonInformacion() </B>en la clase base:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1><B>void</B> Humano<B>::</B>PonInformacion(<b>void</b>)
{
&#9;<B>cout</B> &lt;&lt; "\n Nombre: " &lt;&lt; m_nombre;
&#9;<B>cout</B> &lt;&lt; "\n Edad: " &lt;&lt; m_edad;
&#9;<B>switch</B>(m_sexo)
&#9;{
&#9;&#9;<B>case</B> 0: <B>cout</B> &lt;&lt; "\n Sexo: Hombre"; <B>break</B>;  
&#9;&#9;<B>case</B> 1: <B>cout</B> &lt;&lt; "\n Sexo: Mujer"; <B>break</B>;  
&#9;};
&#9;<B>cout</B> &lt;&lt; "\n Inteligencia: " &lt;&lt; m_inteligencia;
&#9;<B>cout</B> &lt;&lt; "\n Fuerza: " &lt;&lt; m_fuerza;
&#9;<B>cout</B> &lt;&lt; "\n Destreza: " &lt;&lt; m_destreza;
&#9;<B>cout</B> &lt;&lt; "\n Energ&iacute;a: " &lt;&lt; m_energia;
}</pre></FONT>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>Se puede observar perfectamente que lo que hace este m&eacute;todo es volcar la informaci&oacute;n concerniente a las variables que contienen (o contendr&aacute;n) los valores acerca del nombre, edad, sexo, inteligencia, fuerza, destreza y energ&iacute;a del personaje. La pregunta viene ahora. Si un Guerrero o Mago, tiene estos datos, que los hereda y, adem&aacute;s, tiene otros que tambi&eacute;n deber&aacute; listar, ¿Tendremos que volver a escribir todo otra vez?. La respuesta es NO. Tan s&oacute;lo hace falta mirar a la funci&oacute;n PonInformacion() de la clase Guerrero o Mago. Echemos un vistazo a la clase Mago y, en concreto, a dicha funci&oacute;n:</P>
<P ALIGN="JUSTIFY"></P>
<pre><FONT FACE="ARIAL" SIZE=1><B>void</B> Mago<B>::</B>PonInformacion(<b>void</b>)
{
&#9;Humano<B>::</B>PonInformacion();
&#9;<B>switch</B>(m_tipoLibroHechizo)
&#9;{
&#9;&#9;<B>case</B> 0: <B>cout</B> &lt;&lt; "\n Libro: Hechizos de Ataque"; <B>break</B>;  
&#9;&#9;<B>case</B> 1: <B>cout</B> &lt;&lt; "\n Libro: Hechizos de Curaci&oacute;n"; <B>break</B>;  
&#9;};
&#9;<B>switch</B>(m_tipoTunica)
&#9;{
&#9;&#9;<B>case</B> 0: <B>cout</B> &lt;&lt; "\n T&uacute;nica: Blanca"; <B>break</B>; 
&#9;&#9;<B>case</B> 1: <B>cout</B> &lt;&lt; "\n T&uacute;nica: Roja"; <B>break</B>;  
&#9;&#9;<B>case</B> 2: <B>cout</B> &lt;&lt; "\n T&uacute;nica: Negra"; <B>break</B>;  
&#9;};
}</pre></FONT>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><FONT FACE="ARIAL" SIZE=2>Est&aacute; m&aacute;s o menos claro, ¿no?.  Lo que hacemos es llamar la funci&oacute;n definida en la clase base y que se encarga de listar los valores b&aacute;sicos anteriormente citados. Para ello, ponemos el nombre de la clase base, seguida de los dos puntos de resoluci&oacute;n de &aacute;mbito y, despu&eacute;s, el nombre de la funci&oacute;n, es decir, <B>Humano::PonInformacion(); </B>. Una vez hecho esto, definimos la parte de la funci&oacute;n que nos hace falta y que no es otra que la concerniente al listado de los valores &uacute;nicos de un Mago, esto es, tipo de libro de hechizos y tipo de t&uacute;nica, es decir, completamos funci&oacute;n <B>PonInformacion()</B> para que, adem&aacute;s de listar los datos b&aacute;sicos sin necesidad de reescribir las instrucciones (llamamos a la funci&oacute;n definida en la clase base), liste tambi&eacute;n los datos espec&iacute;ficos.</P>
<P ALIGN="JUSTIFY">Esto mismo es aplicable a la clase Guerrero.</P>
<P ALIGN="JUSTIFY"></P>
<h4>Y esto es todo por ahora</h4>
<P ALIGN="JUSTIFY">Creo que con este cap&iacute;tulo deber&iacute;a de haber quedado claro qu&eacute; es la herencia y c&oacute;mo implementarla en nuestros programas en C++. As&iacute; mismo, deber&iacute;a de comenzar a tomar fuerza el concepto que entra&ntilde;a programar con una metodolog&iacute;a orientada a objetos y es que, hasta que el programador no consigue pensar de esta nueva forma, es muy importante armarse de papel y l&aacute;piz y hacer un boceto de lo que deber&iacute;a de ser el dise&ntilde;o. Siempre lo agradecer&eacute;is cuando os met&aacute;is, en serio, a codificar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El pr&oacute;ximo n&uacute;mero hablaremos del Polimorfismo y se desvelará esa palabreja de nombre <b>virtual</b>. Hasta que os suene esa palabreja, ya est&aacute;is en condiciones de ir haciendo cosas algo m&aacute;s serias. ¿Por qu&eacute; no intent&aacute;is hacer un generador de personajes en plan serio?. Basta con dise&ntilde;arlo en papel, escribir sus clases, variables y m&eacute;todos. Si hac&eacute;is eso, y lo hac&eacute;is bien, aprovechar&eacute;is mucho m&aacute;s que si os lanz&aacute;is a codificar como locos. Rercordad que primero hay que saber dise&ntilde;ar. Luego ya vendr&aacute; lo de &quot;machacar&quot; el teclado.</P>
<P ALIGN="JUSTIFY"></P>
<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulad.htm"><font FACE="ARIAL"><B>[Curso de POO en C++]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

