<HTML>

<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>urso de Programación Orientada a Objetos en C++</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>
<FONT color="#000000" size=2 face="arial"><br><br><br>
<H3>
Cap&iacute;tulo 6.<br> Funciones virtuales: polimorfismo.
</H3>

<p align=justify>

En esta ocasi&oacute;n vamos abordar un concepto muy importante de la programaci&oacute;n orientada a objetos: el <B>polimorfismo</B>. Esta caracter&iacute;stica de la POO, permite que podamos construirnos m&eacute;todos para nuestras clase derivadas que parten de una misma clase base, para que adopten comportamientos totalmente distintos. Es un concepto realmente potente y que se lleva a cabo mediante la utilizaci&oacute;n de <B>funciones virtuales</B>. Nosotros ya las hemos utilizado. Si te acuerdas, en el cap&iacute;tulo anterior declar&aacute;bamos la clase que redefin&iacute;amos como virtual. ¡Hemos utilizado el polimorfismo y sin enterarnos!.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Una funci&oacute;n virtual es un mecanismo que permite a clases derivadas redefinir a las funciones de las clases base. Por tanto, hasta ahora, nos debemos de quedar con que el polimorfismo es una acci&oacute;n que se puede implementar en clases distintas pero que tienen en com&uacute;n el hecho de heredar de una clase base com&uacute;n. Dicho m&eacute;todo, pese a ser com&uacute;n para los objetos derivados, es tratado de forma distinta y, por tanto, dando resultados tambi&eacute;n diferentes dependiendo de con qu&eacute; clase lo invoquemos. ¿C&oacute;mo conseguirlo?. Para poder implementar el polimorfismo tenemos las funciones virtuales. Las funciones virtuales se definen en la clase base y son las que ser&aacute;n redefinidas, luego, en las clases derivadas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La declaraci&oacute;n de una funci&oacute;n virtual se consigue mediante la palabra clave virtual precediendo a la declaraci&oacute;n de la funci&oacute;n. Por ejemplo:</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">virtual</B> <B>void</B> PonInformacion(<B>void</B>);</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En este caso, hemos definido una funci&oacute;n virtual llamada <I>PonInformacion</I> que pertenece a una clase base y que podr&aacute; ser redefinida, completamente, en una clase derivada para que act&uacute;e de forma totalmente distinta a c&oacute;mo lo hace en la clase base. <B>Es muy importante que la funci&oacute;n de la clase base que vamos a redefinir lleve el identificador virtual</B> pues de lo contrario, la cosa no funcionar&aacute; como es de esperar. Veremos estos problemas m&aacute;s adelante.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A continuaci&oacute;n vamos a poner un ejemplo en el que, utilizando la funci&oacute;n de arriba, vamos a ver c&oacute;mo podemos hacer para que una clase que herede dicha funci&oacute;n y produzca resultados totalmente distintos a los que se han definido en la clase base para ella. As&iacute; mismo, utilizamos <I>new</I> y <I>delete</I> para refrescar la memoria (y nunca mejor dicho :-). Recordad que con <I>new</I> y <I>delete</I> podemos crear objetos (o variables) din&aacute;micamente y de forma muy sencilla.</P>
<P ALIGN="JUSTIFY"></P>

<Pre>#<B>include</B> &lt;iostream.h&gt;

<B>class</B> ClaseBase
<B>{
</B>// Esta es la clase base.
// Definimos una funci&oacute;n de miembro para la clase base
// que adem&aacute;s es virtual e &quot;inline&quot;

<B>public</B>:
<B>vitual void</B> PonInformacion(<B>void</B>) <B>{</B> <B>cout</B> &lt;&lt; &quot;\n¡Hola!&quot;; <B>}
</B>
<B>};
</B>
<B>class</B> ClaseDerivada : <B>public</B> ClaseBase
<B>{
</B>
// Hemos definido una clase derivada de la clase ClaseBase.
// Esta clase, va a utilizar el concepto de polimorfismo 
// redefiniendo por completo la funci&oacute;n  PonInformacion
// que hereda de la clase ClaseBase. Tambi&eacute;n es &quot;inline&quot;.

<B>public</B>:
<B>void</B> PonInformacion(<B>void</B>) <B>{</B> <B>cout</B> &lt;&lt; &quot;\n¡Adios!&quot;; <B>}
</B>
<B>};
</B>
<B>int</B> main(<B>void</B>)
<B>{
</B>
  ClaseBase *base = <B>new</B> ClaseBase; 
  ClaseDerivada *derivada = <B>new</B> ClaseDerivada;

  // Ahora llamamos a los m&eacute;todos de cada una para observar
  // que el resultado es distinto.

  base-&gt;PonInformacion();
  derivada-&gt;PonInformacion();

  <B>delete</B> base;
  <B>delete</B> derivada;

  <B>return</B> 0;
<B>}
</B></Pre>
<P ALIGN="JUSTIFY">Bueno, el resultado est&aacute; claro, ¿no?. Mientras que la clase declarada como <I>ClaseBase</I> e instanciada con <I>base</I>, pone en pantalla &quot;¡Hola!&quot;, la clase derivada, que ha redefinido la funci&oacute;n virtual <I>PonInformacion</I>, pone &quot;¡Adi&oacute;s!&quot;. Es un ejemplo, en definitiva, muy sencillo en el que se puede ver c&oacute;mo hacer que una funci&oacute;n ya definida en una clase base cambie totalmente seg&uacute;n nuestras necesidades: es el polimorfismo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra de las cosas que vimos en el cap&iacute;tulo anterior era el hecho de utilizar dentro de la funci&oacute;n de la clase derivada, a la funci&oacute;n virtual de la clase base. Si nosotros hubi&eacute;ramos implementado as&iacute; a la funci&oacute;n virtual de la clase derivada:</P>
<P ALIGN="JUSTIFY"></P>

<PRE><B>void</B> PonInformacion(<B>void</B>) 
<B>{ 
</B>// Suponemos que la declaraci&oacute;n es inline ya que si no fuera
// inline deber&iacute;amos de poner 
// void ClaseDerivada::PonInformacion(void)

ClaseBase<B>::</B>PonInformacion(); 
cout &lt;&lt; &quot;\n¡Adios!&quot;; 
<B>}
</B></PRE>

<P ALIGN="JUSTIFY">Cuando llam&aacute;ramos a la funci&oacute;n <I>PonInformacion</I>() por medio de la clase derivada, esto es, cuando hici&eacute;ramos:</P>
<P ALIGN="JUSTIFY"></P>
<PRE>derivada-&gt;PonInformacion();</PRE>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo que nos saldr&iacute;a por pantalla ser&iacute;a:</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><I>¡Hola!<BR>
¡Adios!</I></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En contraposici&oacute;n a lo que nos sale en el programa original en el que no llamamos a la funci&oacute;n de la clase base, es decir, en el ejemplo original saldr&iacute;a nada m&aacute;s ¡Adi&oacute;s!. Esto es as&iacute; porque dentro del cuerpo <I>PonInformacion</I>() que est&aacute; implementado en la clase <I>ClaseDerivada</I>, llamamos antes de nada a la funci&oacute;n de la clase base <I>ClaseBase</I> que se trata como una funci&oacute;n heredada m&aacute;s.</P>
<P ALIGN="JUSTIFY"></P>
<H4>Aclarando todo un poco</H4>
<P ALIGN="JUSTIFY">Si recuerdas el cap&iacute;tulo anterior del curso, habr&aacute;s observado que, en cierta forma, ya hemos utilizado el polimorfismo, es decir, en el anterior cap&iacute;tulo redefin&iacute;amos funciones miembro de una clase base utilizando sus caracter&iacute;sticas comunes a la clase derivada en la que trabaj&aacute;bamos pero a&ntilde;adiendo una serie de especificaciones extra para que &quot;adem&aacute;s se hiciera otra cosa&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hasta ahora hemos tratado funciones que son virtuales simples. Recordemos que una funci&oacute;n virtual es aquella que, habi&eacute;ndose declarado en una clase base, vuelve a declararse y a implementarse en una clase derivada, es decir, se redefine en la clase derivada. De esta forma, cuando el objeto instanciado a una clase derivada, llama a esa funci&oacute;n virtual, lo que se hace es llamar a la funci&oacute;n de la clase derivada no a la funci&oacute;n de la clase base (a no ser que, dentro de la funci&oacute;n de la clase derivada, se llame a la funci&oacute;n de la clase base). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El ejemplo cl&aacute;sico de utilizaci&oacute;n de funciones virtuales est&aacute; en el de crear una clase base llamada <I>Forma</I> con una funci&oacute;n de miembro para dibujar y de nombre <I>Dibujar</I>. Si nosotros creamos dos clases derivadas de la clase base <I>Forma</I> llamadas <I>Circulo</I> y <I>Rectangulo</I>, respectivamente, y redefinimos la funci&oacute;n virtual <I>Dibujar</I> en cada una de las clases base, cuando la llamemos desde cada una de las instancias a la funci&oacute;n <I>Dibujar</I>, el compilador sabr&aacute; a qu&eacute; funci&oacute;n llamar.</P>
<CENTER>
<TABLE><TD><IMG SRC="gif/poovir.gif"></TD></TABLE>
</CENTER>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cabe decir tambi&eacute;n, y esto es importante pues puede dar lugar a confusiones, que si tenemos una funci&oacute;n en una clase base que no est&eacute; marcada como virtual y despu&eacute;s creamos en una clase derivada otra funci&oacute;n con el mismo nombre los resultados no van a ser los esperados... Lo que har&aacute; el compilador ser&aacute; llamar directamente a la funci&oacute;n implementada en la clase base y pasar &quot;ol&iacute;mpicamente&quot; de la implementaci&oacute;n de la clase derivada. ¿y si, habiendo declarado una funci&oacute;n en la clase base como virtual, luego se nos olvida redefinirla en la clase derivada?. Bueno, en este caso, se llamar&aacute; a la funci&oacute;n de la clase base y no pasar&aacute; nada.</P>
<P ALIGN="JUSTIFY"></P>
<H4>Funciones virtuales puras implican clases abstractas.</H4>
<P ALIGN="JUSTIFY">Se puede decir que las funciones <B>virtuales puras</B> son aquellas que, para implementarse, han de ser redefinidas, es decir, que no s&oacute;lo tienen sino que <B><I>deben </B></I>ser redefinidas. Aquellas clases que tengan una funci&oacute;n virtual pura se denominan <B>clases abstractas</B><I> </I>y tienen la gran particularidad de que de ellas no se puede crear instancias u objetos.</P>
<P ALIGN="JUSTIFY">Quedamos, pues, en <B>que para crear una clase abstracta s&oacute;lo hace falta definir una funci&oacute;n virtual pura</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y c&oacute;mo definimos una funci&oacute;n virtual pura?. Para definir una funci&oacute;n virtual pura, tenemos que asignar a la funci&oacute;n un puntero NULL o, lo que es lo mismo, un valor 0. Suponiendo que queremos implementar una funci&oacute;n llamada <I>Forma</I> como virtual pura, deber&iacute;amos de poner as&iacute;:</P>
<P ALIGN="JUSTIFY"></P>
<PRE><B>virtual</B> <B>void</B> Forma() = 0;</PRE>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La clase que contenga una sola funci&oacute;n virtual pura pasa a ser una clase abstracta independientemente de que el resto de sus funciones no sean virtuales puras. Ya veis que f&aacute;cil es crear una funci&oacute;n virtual pura y que poder tienen al implicar tambi&eacute;n la creaci&oacute;n de una clase abstracta que, recordad, no puede ser nunca instanciada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Las funciones virtuales puras han de ser definidas cuando queramos crear una verdadera clase ra&iacute;z de una serie de clases derivadas ciertamente importante. No conviene abusar de esta caracter&iacute;stica del C++ a no ser que vuestro dise&ntilde;o lo necesite necesariamente y est&eacute;is delante de un proyecto con una complejidad notable. </P>
<P ALIGN="JUSTIFY"></P>
<H4>Conclusiones finales</H4>
<P ALIGN="JUSTIFY">Decir, finalmente, que las funciones virtuales se caracterizan por a&ntilde;adir una mayor cantidad e trabajo computacional y que, por tanto, es recomendable utilizar las prestaciones del polimorfismo, esto es, poner la palabra clave virtual a una funci&oacute;n, s&oacute;lo cuando estemos seguros de que esa funci&oacute;n va a ser redefinida. Tampoco es que se consuma mucho tiempo y se sobrecargue todo en exceso pero suele ser una pr&aacute;ctica com&uacute;n entre los que comienzan a trabajar m&aacute;s o menos en serio con el C++ utilizar prestaciones de la POO cuando no son necesarias. Si cuando lleves un tiempo codificando descubres que la funci&oacute;n declarada como virtual no va a ser redefinida quita la palabra clave virtual de la funci&oacute;n de miembro de la clase base.</P>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulad.htm"><font FACE="ARIAL"><B>[Curso de POO en C++]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

