<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia Internet</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>nformes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:pdpmeayk@lg.ehu.es">Koldobika Meso Ayerdi "Koldo"</A>
</b></FONT>
<br><br>

<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>Internet, un portal abierto a cualquiera. </H3><!-- PEGAR AQUI EL ARTICULO (se puede borrar la línea que viene a continuación) -->

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El Diccionario de la Real Academia Espa&ntilde;ola dispone de 6 acepciones para definir el concepto de "portal": 1. «Zagu&aacute;n o primera pieza de la casa, por donde se entra a las dem&aacute;s, y en la cual est&aacute; la puerta principal»; 2. «Pieza inmediata a la puerta de entrada en una casa de vecinos que sirve de paso para acceder a las distintas viviendas»; 3. «Soportal, atrio cubierto»; 4. «P&oacute;rtico de un templo o de un edificio suntuoso»; 5. «En algunas partes, puerta de la ciudad»; 6. «Nacimiento, bel&eacute;n».</P>
<P ALIGN="JUSTIFY">Sin embargo, el desarrollo de Internet nos ha facilitado algunas nuevas: «mega-sitio web que constituye el punto de inicio de la navegaci&oacute;n; lugar con multitud de servicios que se erige en referencia para el usuario de la red»; «Reorganizaci&oacute;n de los contenidos de la red para adecuarse a la demanda del <I>internauta</I> que est&aacute; llegando o a&uacute;n est&aacute; por venir». Aunque tambi&eacute;n signifique una reestructuraci&oacute;n de las organizaciones encaminada a lograr que una p&aacute;gina web sea la <I>home page</I> del mayor n&uacute;mero de usuarios y no precisamente de una manera eventual. Los "portales" se van a convertir en la segunda residencia de los <I>internautas</I>.</P>
<P ALIGN="JUSTIFY">Y es que hoy en d&iacute;a, el principal reto de muchas empresas que invierten miles de millones de pesetas en Internet radica en lograr que su p&aacute;gina web se convierta en lugar de inicio en la navegaci&oacute;n del mayor n&uacute;mero de usuarios de Internet, y no de forma ocasional, sino permanente. Para ello, se cre&oacute; el concepto de "portal", esa puerta de entrada de los asiduos de Internet tan codiciada por numerosas empresas que anualmente destinan grandes recursos a publicidad, servicios de valor a&ntilde;adido y otro tipo de tendencias que garanticen su poder de atracci&oacute;n.</P>
<P ALIGN="JUSTIFY">Pero ah&iacute; no queda todo, ya que no s&oacute;lo es necesario saber que muchas personas "pasan" por un lugar concreto, sino que lo que se desea es que esta gente permanezca y desarrolle la costumbre de hacer siempre lo mismo en cada ocasi&oacute;n. Pero a&uacute;n igual o m&aacute;s importante es que, mediante la recopilaci&oacute;n de datos sobre esos clientes, se les conozca mejor, lo que supone que se puedan mejorar los servicios que se ofrecen y se puedan adaptar los productos a sus necesidades y gustos con mayor precisi&oacute;n. Para ello, se ofrece infinidad de servicios gratuitos y tambi&eacute;n de pago para p&uacute;blicos m&aacute;s espec&iacute;ficos.</P>
<P ALIGN="JUSTIFY">Algunos de los casos m&aacute;s significativos son Yahoo! ( </FONT><A HREF="http://www.yahoo.com/"><FONT FACE="Arial" SIZE=2>www.yahoo.com</FONT></A><FONT FACE="Arial" SIZE=2> ), Lycos ( </FONT><A HREF="http://www.lycos.com/"><FONT FACE="Arial" SIZE=2>www.lycos.com</FONT></A><FONT FACE="Arial" SIZE=2> ) o Excite ( </FONT><A HREF="http://www.excite.com/"><FONT FACE="Arial" SIZE=2>www.excite.com</FONT></A><FONT FACE="Arial" SIZE=2> ), cuya tendencia es lograr captar la atenci&oacute;n del gran p&uacute;blico, no s&oacute;lo con sus ya tradicionales sistemas de b&uacute;squeda y directorios de webs sino ofreciendo la mayor lista posible de servicios que faciliten la vida del "navegante" en la red: correo electr&oacute;nico gratuito, servicios de noticias, asesor&iacute;a, etc. Incluso recientemente Yahoo!, el buscador m&aacute;s popular, ha puesto en marcha un servicio de informaci&oacute;n sobre la peque&ntilde;a empresa. Y para lograr todo esto se han buscado sinergias entre empresas e incluso algunas de estas empresas han iniciado pol&iacute;ticas agresivas de adquisici&oacute;n de empresas de <I>software</I> o servicios que den mayor funcionalidad a su web.</P>
<P ALIGN="JUSTIFY">Quiz&aacute;s una de las empresas de mayor importancia dentro de los "portales" es Netscape ( </FONT><A HREF="http://www.netscape.com/"><FONT FACE="Arial" SIZE=2>www.netscape.com</FONT></A><FONT FACE="Arial" SIZE=2> ). El que fuera gran triunfador de la primera &eacute;poca de Internet, y que parece quedar cada vez m&aacute;s arrinconado en su personal batalla con Microsoft ( </FONT><A HREF="http://www.microsoft.com/"><FONT FACE="Arial" SIZE=2>www.microsoft.com</FONT></A><FONT FACE="Arial" SIZE=2> ) por el mercado de los <I>navegadores</I>, ha dado un giro en su estrategia empresarial. En la actualidad, basa toda su pericia empresarial en reforzar la venta de <I>software</I> especializado para servidores Internet y en convertir su <I>home page</I> en el portal con m&aacute;s acceso de la red. Para ello, ofrece servicios como anuncios clasificados, correo electr&oacute;nico gratuito, p&aacute;ginas amarillas, b&uacute;squedas y directorios (gracias al acuerdo alcanzado con Excite), b&uacute;squedas por personas, etc. Por el momento, el n&uacute;mero de visitas se cuenta por millones diarias y los ingresos publicitarios se han multiplicado.</P>
<P ALIGN="JUSTIFY">Otras empresas que tambi&eacute;n est&aacute;n en disposici&oacute;n de ganar la guerra de los "portales" son los medios de comunicaci&oacute;n. Muchos de ellos poseen informaci&oacute;n de gran inter&eacute;s, sobre todo en &aacute;mbitos locales y especializados. Peri&oacute;dicos locales, publicaciones econ&oacute;micas o dirigidas a un sector profesional determinado, han iniciado sus estrategias de expansi&oacute;n y captaci&oacute;n de clientes por esta v&iacute;a. Su principal reto, aunque no exclusivo, la personalizaci&oacute;n. Ahora bien, para ello es necesario desarrollar herramientas que permitan adaptar la informaci&oacute;n que se ofrece a cada usuario, a sus preferencias, previamente definidas.</P>
<P ALIGN="JUSTIFY">Sin embargo, el verdadero <I>boom</I> de los "portales" en Internet est&aacute; por llegar. Llegado el momento, &eacute;stos sufrir&aacute;n una metamorfosis y tendr&aacute;n poco que ver con lo que hoy conocemos. Los m&aacute;s entendidos en el tema auguran que esta revoluci&oacute;n no tardar&aacute; m&aacute;s de dos a&ntilde;os en producirse. A&uacute;n as&iacute;, el futuro tambi&eacute;n se presenta lleno de incertidumbres, sobre todo en lo que respecta a c&oacute;mo ser&aacute;n las nuevas oleadas de usuarios.</P>
<P ALIGN="JUSTIFY">Lo que s&iacute; est&aacute; claro es que &eacute;stos buscar&aacute;n la facilidad de uso. Al mismo tiempo, disfrutar&aacute;n de nuevos avances tecnol&oacute;gicos y sobre todo de la penetraci&oacute;n de la banda ancha y de los nuevos servicios asociados a la misma. Esto no significa una amenaza para estos <I>sites</I>, pero si puede provocar un nuevo reparto de fuerzas en Internet, en cuyo caso los "portales" deber&aacute;n estar preparados para convertirse en "megaportales", compuestos a su vez por varios "portales" especializados; lugares capaces de "dirigir" el tr&aacute;fico de usuarios hacia zonas de servicios, productos, comercio y comunidad. Una especie de <I>ciberpara&iacute;so</I> donde todo est&eacute; al alcance del usuario.</P>
<P ALIGN="JUSTIFY">Las claves de para el buen funcionamiento de estos "megaportales" pasan por la sencillez del dise&ntilde;o y la capacidad de personalizaci&oacute;n, sin olvidar la diferenciaci&oacute;n, la tecnolog&iacute;a y una visi&oacute;n global.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Servicios que se ofrecen</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">En 1996, buscadores como Yahoo! y Altavista (www.altavista.com) comenzaron a ampliar sus <I>home pages</I> y a ofrecer unos interesantes servicios que bien poco ten&iacute;an que ver con su tradicional cometido: la b&uacute;squeda e informaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Empleando como "anzuelo" todos estos servicios de inter&eacute;s que el <I>internauta</I> buscaba por todos los rincones de la red invirtiendo gran cantidad de tiempo y, por tanto, dinero, se buscaba su fidelizaci&oacute;n. El objetivo era lograr que el usuario fijara la p&aacute;gina del "portal" como <I>home page</I> propia.</P>
<P ALIGN="JUSTIFY">Pero ¿qu&eacute; necesita una p&aacute;gina web para convertirse en "portal"? Seg&uacute;n lo visto en el mercado, mucho dinero, pero tambi&eacute;n disponer de una estructura que la haga atractiva para unos usuarios cada vez m&aacute;s exigentes. Por el momento, s&oacute;lo se puede echar un vistazo a la apuesta que las diferentes empresas han hecho en sus web para conocer la "anatom&iacute;a" de un "portal". Varios son los servicios que ofrecen:</P>
<OL>

<P ALIGN="JUSTIFY"><LI>Correo electr&oacute;nico gratuito. Se entiende que nunca debe faltar ya que lo primero que muchos <I>internautas</I> hacen al entrar en la red es comprobar su correo electr&oacute;nico. Microsoft lo sab&iacute;a y a principios de 1998 se hizo con HotMail ( </FONT><A HREF="http://www.hotmail.com/"><FONT FACE="Arial" SIZE=2>www.hotmail.com</FONT></A><FONT FACE="Arial" SIZE=2> ). El resto de "portales" ha fabricado su propio servicio de correo gratuito.</LI></P>
<P ALIGN="JUSTIFY"><LI>Informaci&oacute;n personalizada</LI></P></OL>

<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">3. Cibercomunidad. Chats, foros, etc. merecen un sitio especial en cualquier "portal", puesto que son los puntos de reuni&oacute;n virtual e intercambio de informaci&oacute;n entre los <I>internautas</I>.</P>
<P ALIGN="JUSTIFY">4. Informaci&oacute;n (datos financieros, noticias, etc.). Los contenidos son la baza fundamental de esta nueva estructura. Quien no los tiene los contrata, bien a una agencia de noticias -Yahoo! se nutre de Reuters ( </FONT><A HREF="http://www.online.reuters.com/"><FONT FACE="Arial" SIZE=2>www.online.reuters.com</FONT></A><FONT FACE="Arial" SIZE=2> )- o a un medio de comunicaci&oacute;n. Adem&aacute;s, la informaci&oacute;n tiene que seguir la actualidad desde todos los puntos de vista que interesen a los lectores y aprovechar la interactividad para ofrecer lo que no est&aacute; ala alcance de otros medios.</P>
<P ALIGN="JUSTIFY">5. Comercio electr&oacute;nico, para adquirir de casi todo en la red. America Online (AOL-www.aol.com ), por ejemplo, ofrece la posibilidad de comprar desde juguetes hasta "caprichos" electr&oacute;nicos, pasando por libros, flores, art&iacute;culos de belleza, etc.</P>
<P ALIGN="JUSTIFY">6. Herramientas de b&uacute;squeda eficaces. Hoy en d&iacute;a se hace imprescindible contar con un buscador. Si adem&aacute;s es de renombre, mejor. Los hay, incluso, quien tiene en su p&aacute;gina m&aacute;s de un motor de b&uacute;squedas.</P>
<P ALIGN="JUSTIFY">7. Directorios de informaci&oacute;n en Internet: juegos y pasatiempos para los que busquen un rato de ocio, programas, etc.</P>
<P ALIGN="JUSTIFY">8. Gu&iacute;as de informaci&oacute;n local. La programaci&oacute;n de televisi&oacute;n, el tiempo, el hor&oacute;scopo, etc. incluso un calendario, gu&iacute;as de restaurantes, farmacias de guardia, agencias de viaje...Cuanto m&aacute;s, mejor.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Situaci&oacute;n en Estados Unidos y Europa</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">En Estados Unidos ya se puede hablar de una masa cr&iacute;tica de usuarios que implica inversiones multimillonarias por parte de numerosas empresas. Ahora bien, Europa todav&iacute;a se encuentra muy por detr&aacute;s, ya que son muy pocas las empresas europeas que invierten importantes sumas de dinero en el desarrollo de "portales" y servicios verdaderamente &uacute;tiles para el usuario. De hecho, ninguna empresa europea forma parte de los grandes acuerdos firmados por entidades en la red. Todo ello supone que el <I>internauta</I> europeo "migra" al viejo continente en busca de servicios <I>on-line</I>.</P>
<P ALIGN="JUSTIFY">Recientemente, la consultora J&uacute;piter public&oacute; un estudio en el que establec&iacute;a un ranking con los webs europeos con m&aacute;s visitas. Entre los 25 primeros se encontraban 9 peri&oacute;dicos, 6 buscadores, 3 revistas, una cadena de televisi&oacute;n, un servicio de deportes, etc. si bien el primero de la lista era el centro comercial desarrollado por el servicio postal sueco. Dentro de esa lista se pod&iacute;an encontrar 5 webs espa&ntilde;oles: dos buscadores (OZU - www.ozu.com - y Ol&eacute; - </FONT><A HREF="http://www.ole.es/"><FONT FACE="Arial" SIZE=2>www.ole.es</FONT></A><FONT FACE="Arial" SIZE=2> ) y tres diarios (El Pa&iacute;s - </FONT><A HREF="http://www.elpais.es/"><FONT FACE="Arial" SIZE=2>www.elpais.es</FONT></A><FONT FACE="Arial" SIZE=2> -, Marca - </FONT><A HREF="http://www.recoletos.es/marca"><FONT FACE="Arial" SIZE=2>www.recoletos.es/marca</FONT></A><FONT FACE="Arial" SIZE=2> - y Expansi&oacute;n - </FONT><A HREF="http://www.recoletos.es/expansion"><FONT FACE="Arial" SIZE=2>www.recoletos.es/expansion</FONT></A><FONT FACE="Arial" SIZE=2> ).</P>
<P ALIGN="JUSTIFY">Ahora bien, muy pocos de estos servicios re&uacute;nen las caracter&iacute;sticas de un "portal", aunque muchos de ellos se acercan cada vez m&aacute;s a este concepto. Por el momento, todo apunta a que las empresas europeas de <I>software</I>, telef&oacute;nicas, etc. esperan pacientemente mientras reflexionan. Se trata de determinar cu&aacute;ndo invertir y cu&aacute;nto para convertirse en esos imanes de usuarios tan de moda hoy en d&iacute;a.</P>
<P ALIGN="JUSTIFY">Cabe se&ntilde;alar que la estrategia de bipolarizaci&oacute;n de "portales" europeo-americana presenta matices. La entrada de los americanos en Europa no se ha hecho en solitario. Lycos se ha asociado con el Grupo Bertelsmann ( </FONT><A HREF="http://www.bertelsmann.de/"><FONT FACE="Arial" SIZE=2>www.bertelsmann.de</FONT></A><FONT FACE="Arial" SIZE=2> ) y AOL crece a un gran ritmo en Francia, asociado a otra compa&ntilde;&iacute;a europea.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">En Espa&ntilde;a</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Hablar de la situaci&oacute;n de los "portales" en nuestro pa&iacute;s es volver a mencionar los t&oacute;picos de siempre. En la actualidad, hay algunos sitios que se perfilan como candidatos a "portal". Los m&aacute;s famosos son Teleline ( </FONT><A HREF="http://www.teleline.es/"><FONT FACE="Arial" SIZE=2>www.teleline.es</FONT></A><FONT FACE="Arial" SIZE=2> ), Ol&eacute;, Vilaweb ( </FONT><A HREF="http://www.vilaweb.com/"><FONT FACE="Arial" SIZE=2>www.vilaweb.com</FONT></A><FONT FACE="Arial" SIZE=2> ) o Tel&eacute;polis ( www2.telepolis.com ). Ol&eacute; acredita 4 millones de visitas mensuales, y Tel&eacute;polis afirma contar con medio mill&oacute;n de usuarios habituales.</P>
<P ALIGN="JUSTIFY">Sin embargo, la batalla por la audiencia se ha intensificado desde noviembre de 1998 con el desembarco en nuestro pa&iacute;s de Yahoo!. Pero hay no acaba la historia, ya que en marzo de este a&ntilde;o, Microsoft tiene previsto lanzar definitivamente la versi&oacute;n espa&ntilde;ola de su "portal", MSN, que ahora est&aacute; en fase de pruebas.</P>
<P ALIGN="JUSTIFY">Lycos ( </FONT><A HREF="http://www.es.lycos.de/"><FONT FACE="Arial" SIZE=2>www.es.lycos.de</FONT></A><FONT FACE="Arial" SIZE=2> ), por su parte, posibilita consultar las previsiones meteorol&oacute;gicas en Espa&ntilde;a e incluso en Europa a trav&eacute;s de su p&aacute;gina en Internet. Adem&aacute;s de este nuevo servicio, este conocido "portal" anunci&oacute; m&aacute;s novedades. En primer lugar, ha renovado su Gu&iacute;a de Empleo, donde se ofrece variada informaci&oacute;n para que buscar trabajo a trav&eacute;s de Internet resulte m&aacute;s sencillo. Tambi&eacute;n se estrena una nueva gu&iacute;a dedicada a la mujer, con una selecci&oacute;n de p&aacute;ginas y enlaces espec&iacute;ficos.</P>
<P ALIGN="JUSTIFY">Por si ello fuera poco, la versi&oacute;n espa&ntilde;ola del conocido buscador eligi&oacute; recientemente Prensa Digital ( </FONT><A HREF="http://www.prensadigital.com/"><FONT FACE="Arial" SIZE=2>www.prensadigital.com</FONT></A><FONT FACE="Arial" SIZE=2> ), una publicaci&oacute;n asociada a Noticias Intercom para inaugurar un nuevo servicio en su web. Este nuevo recurso est&aacute; presente en la <I>home page</I> bajo el ep&iacute;grafe "Titulares de Prensa" y permite a sus visitantes estar completamente al d&iacute;a de todo lo que publican sus diarios preferidos sin tener que consultarlos uno por uno.</P>
<P ALIGN="JUSTIFY">Al igual que ocurre con Prensa Digital, este nuevo servicio presenta, en su pantalla inicial, el titular m&aacute;s destacado de cada secci&oacute;n conformando una portada. Desde esta misma p&aacute;gina inicial es posible acceder a las diferentes secciones que figuran en cualquier medio donde se recopilan los principales art&iacute;culos por estos medios ese d&iacute;a.</P>
<P ALIGN="JUSTIFY">Sin duda, se trata de un sistema tremendamente innovador ya que facilita mucho la tarea de mantenerse informado y evita uno de los principales males del medio <I>on-line</I>, la p&eacute;rdida de tiempo que produce la b&uacute;squeda de informaci&oacute;n. Asimismo, como actualiza sus contenidos a trav&eacute;s de diversas b&uacute;squedas a lo largo del d&iacute;a, es posible tener siempre disponible la &uacute;ltima noticia que publican los principales medios espa&ntilde;oles <I>on-line</I>.</P>
<P ALIGN="JUSTIFY">Pero ah&iacute; no acaba todo, ya que paralelamente Ciudades Netr&oacute;polis ( </FONT><A HREF="http://www.supernetro.com/"><FONT FACE="Arial" SIZE=2>www.supernetro.com</FONT></A><FONT FACE="Arial" SIZE=2> ) suscribi&oacute; un acuerdo de colaboraci&oacute;n con el buscador Lycos por el que el "portal" de Lycos para nuestro pa&iacute;s ve&iacute;a enriquecidos sus contenidos delicados al ocio y al tiempo libre.</P>
<P ALIGN="JUSTIFY">La informaci&oacute;n de Netr&oacute;polis se suministran semanalmente e incluye sugerencias de cine, teatro, arte y sitios para comer y beber, de Madrid, Barcelona y Valencia. Asimismo, hay cr&iacute;ticas de los &uacute;ltimos estrenos cinematogr&aacute;ficos y de la escena teatral, de las mejores exposiciones de arte y de los sitios m&aacute;s sugerentes para salir a comer, cenar o tomar una copa.</P>
<P ALIGN="JUSTIFY">Los planes inmediatos de expansi&oacute;n de Ol&eacute; pasan por el mercado latinoamericano y las alianzas con otros buscadores europeos, agrupados en la plataforma AllEurope ( </FONT><A HREF="http://www.alleurope.com/"><FONT FACE="Arial" SIZE=2>www.alleurope.com</FONT></A><FONT FACE="Arial" SIZE=2> ), que pretende competir comercialmente con los grandes buscadores americanos.</P>
<P ALIGN="JUSTIFY">A principios de 1999, Lycos Bertelsmann y Netscape firmaron un acuerdo de colaboraci&oacute;n por el que Lycos suministrar&aacute; el contenido de sus gu&iacute;as web al "portal" de Netscape Netcenter en Espa&ntilde;a. De esa manera, los usuarios de Netcenter pueden utilizar los mejores directorios y contenidos organizados en diferentes catagor&iacute;as como empleo, mujr, ocio, prensa, viajes, etc.</P>
<P ALIGN="JUSTIFY">En lo que se refiere a b&uacute;squedas, ambas compa&ntilde;&iacute;as tambi&eacute;n tienen previsto colaborar. De hecho, el sistema de b&uacute;squeda de Netscape en el "portal" Netcenter est&aacute; accionado por el sistema de Lycos, lo que significa que emplea la tecnolog&iacute;a de &eacute;sta &uacute;ltima para buscar en la red.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">All Europe</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Son cinco aliados, cinco grandes buscadores (de Francia, Alemania, Italia, Noruega y Espa&ntilde;a) que se han propuesto convertirse en el "megaportal" europeo, para defenderse de la creciente popularidad de los "portales" americanos en Europa. Son las p&aacute;ginas m&aacute;s visitadas de cada pa&iacute;s, y entre los cinco participantes sirven m&aacute;s de 40 millones de p&aacute;ginas al mes.</P>
<P ALIGN="JUSTIFY">De momento en AllEurope est&aacute;n reunidos Ol&eacute;, de Espa&ntilde;a; Nomade de Francia ( </FONT><A HREF="http://www.nomade.fr/"><FONT FACE="Arial" SIZE=2>www.nomade.fr</FONT></A><FONT FACE="Arial" SIZE=2> ); Virgilio, de Italia (www.virgilio.it); Web.de, de Alemania ( </FONT><A HREF="http://www.web.de/"><FONT FACE="Arial" SIZE=2>www.web.de</FONT></A><FONT FACE="Arial" SIZE=2> ) y Sol, de Noruega, Suecia y Dinamarca. Los responsables del proyecto aseguran que en pr&oacute;ximos fechas se unir&aacute; al grupo uno de los buscadores brit&aacute;nicos, para ampliar la oferta al mundo anglosaj&oacute;n.</P>
<P ALIGN="JUSTIFY">Los buscadores de Internet europeos de mayor presencia local en sus respectivos pa&iacute;ses se han aliado en la plataforma AllEurope, una de las m&aacute;s importantes sobre publicidad y comercio electr&oacute;nico de la red. Los integrantes de la alianza europea se intercambian informaci&oacute;n sobre los <I>internautas</I> de cada pa&iacute;s, sus gustos y sus h&aacute;bitos, si bien lo m&aacute;s importante es la creaci&oacute;n de un &uacute;nico contacto publicitario. De hecho, basta con llamar al departamento de publicidad de uno de estos "portales" para que la campa&ntilde;a se pueda distribuir en toda Europa.</P>
<P ALIGN="JUSTIFY">La presidencia del grupo ser&aacute; rotatoria, y en el primer periodo que se prolongar&aacute; seis meses la presidencia ha reca&iacute;do en Gilles Ghesqui&egrave;re, presidente de Nomade. "Estamos seguros de que nuestra web se va a convertir en el punto de referencia para todas las empresas que quieran tener presencia no s&oacute;lo en un pa&iacute;s sino en toda Europa, e incluso ser&aacute; un buen lugar para las compa&ntilde;&iacute;as norteamericanas que quieran entrar en el mercado europeo". ha asegurado Ghesqui&egrave;re.</P>
<P ALIGN="JUSTIFY">De esta manera AllEurope se convierte en la plataforma m&aacute;s importante de publicidad y de comercio electr&oacute;nico de Europa para la Red y su ventaja m&aacute;s importante respecto a buscadores como Yahoo! o los propios de cada pa&iacute;s es que se tiene la posibilidad de ofrecer campa&ntilde;as de comunicaci&oacute;n a escala europea, lo que la convierte en "una de las pocas alianzas que ofrece una competencia s&oacute;lida y real a los principales motores de b&uacute;squeda europeos" Y con capacidad para competir con los buscadores norteamericanos.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Algunos acontecimientos recientes</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Seg&uacute;n un estudio realizado en marzo de 1998 por Forrester Research, Altavista, America Online, Excite, Infoseek ( </FONT><A HREF="http://www.infoseek.com/"><FONT FACE="Arial" SIZE=2>www.infoseek.com</FONT></A><FONT FACE="Arial" SIZE=2> ), Lycos, Microsoft, Netscape, Snap ( </FONT><A HREF="http://www.snap.com/"><FONT FACE="Arial" SIZE=2>www.snap.com</FONT></A><FONT FACE="Arial" SIZE=2> ) y Yahoo!, que aglutinan el 15% del tr&aacute;fico actual en Internet, constitu&iacute;an los principales candidatos a convertirse en grandes "portales". Sin embargo, el estudio finalizaba con la afirmaci&oacute;n de que s&oacute;lo tres &oacute; cuatro de estos sitios ganar&iacute;an la todav&iacute;a incipiente batalla de los "portales" y se repartir&iacute;an, en el a&ntilde;o 2002, el 20% del tr&aacute;fico de la red. America Online, Yahoo! y Microsoft cumplen todos los requisitos para llevarse el gato al agua.</P>
<P ALIGN="JUSTIFY">1. America Online: AOL es el paradigma de la estructura de "portal". A finales de noviembre de 1998 sorprend&iacute;a con la compra de Netscape Communications. 610.000 millones de d&oacute;lares a cambio de la marca de Internet.</P>
<P ALIGN="JUSTIFY">Recientemente, AOL ha decidido vender su participaci&oacute;n en el motor de b&uacute;squeda Excite por haber sido comprado por AT Home. Al parecer, AOL, que obtendr&aacute; 500 millones de d&oacute;lares por la venta del 9,5% del capital, perdi&oacute; su inter&eacute;s por Excite tras ser &eacute;ste comprado por su competidor en el mercado de acceso a Internet en Estados Unidos. AT Home adquiri&oacute; el buscador en una operaci&oacute;n de intercambio de acciones valorada en 6.700 millones de d&oacute;lares.</P>
<P ALIGN="JUSTIFY">Con una base consolidada de 14 millones de usuarios, AOL se frota las manos ante las posibilidades de negocio que les esperan en los dem&aacute;s mercados <I>intern&aacute;uticos</I> del globo, menos evolucionados -virtualmente hablando- que el estadounidense.</P>
<P ALIGN="JUSTIFY">Pero ah&iacute; no acaba todo, ya que a principios de 1999, los responsables de Netscape y AOL dieron un nuevo paso para afrontar en condiciones la llamada "batalla de los portales" en Internet, con la alianza firmada con la comunidad virtual eBay (www.ebay.com), por la que se incluyen sus contenidos en el NetCenter (www.netcenter.com) de la propia Netscape.</P>
<P ALIGN="JUSTIFY">eBay naci&oacute; en 1995 con la vocaci&oacute;n de favorecer el encuentro de personas en Internet con aficiones similares y se ha llegado a convertir en la actualidad en una de las mayores comunidades virtuales donde el coleccionismo de todo tipo de objetos es el nexo com&uacute;n de los que se acercan a sus p&aacute;ginas. Libros, discos, sellos, monedas, antig&uuml;edades, etc., tienen cabida en esta curiosa comunidad que cuenta con miles de seguidores.</P>
<P ALIGN="JUSTIFY">El NetCenter, concebido en sus or&iacute;genes como un centro de informaci&oacute;n para los usuarios del paquete de comunicaciones de Netscape Communicator, se ha convertido con el tiempo en un completo "portal" con todo tipo de informaci&oacute;n, y que recibe diariamente decenas de miles de visitas; as&iacute; como una pieza clave en la estrategia de AOL y Netscape para dominar el mercado de Internet.</P>
<P ALIGN="JUSTIFY">La primera unidad transfronteriza de AOL fue inaugurada hace tres a&ntilde;os en Alemania en colaboraci&oacute;n con el potente Grupo Bertelsmann. Pero la consolidaci&oacute;n definitiva del AOL fuera de Estados Unidos lleg&oacute; con la adquisici&oacute;n de Compuserve a principios de 1998, cuando se alcanz&oacute; el mill&oacute;n de usuarios. Por lo que parece, estas cifras alianzas y adquisiciones han funcionado a las mil maravillas, captando clientes hasta llegar a esta cifra.</P>
<P ALIGN="JUSTIFY">Seg&uacute;n Steve Case, CEO de AOL, "el medio interactivo est&aacute; creciendo r&aacute;pidamente de forma internacional y se est&aacute; convirtiendo en indispensable para la vida cotidiana". Para Bob Pittman, COO de AOL, el crecimiento fuera de Estados Unidos muestra que AOL ya es una marca reconocida mundialmente.</P>
<P ALIGN="JUSTIFY">Este a&ntilde;o, AOL deber&aacute; lanzar un servicio en ingl&eacute;s y chino en Hong Kong en colaboraci&oacute;n con la China Internet Corporation (CIC), y se espera que empiece a fructificar la alianza con el potente Grupo Cisneros -firmada a finales de 1998-, que cuenta con gran presencia en el audiovisual latinoamericano.</P>
<P ALIGN="JUSTIFY">En pleno juicio contra Microsoft, a principios de 1999, se produjo un hecho que puede convertirse en un arma de doble filo. Al parecer, AOL anunci&oacute;, contra todo pron&oacute;stico, la renovaci&oacute;n del contrato con Microsoft para que sus 16 millones de abonados en todo el mundo sigan empleando el navegador de Bill Gates.</P>
<P ALIGN="JUSTIFY">La decisi&oacute;n, aparentemente muy positiva desde el punto de vista econ&oacute;mico para la compa&ntilde;&iacute;a que ahora se sienta en el banquillo de los acusados, tiene una doble lectura porque, seg&uacute;n Microsoft, es un regalo "envenenado". Desde la compa&ntilde;&iacute;a presidida por Bill Gates, se asegur&oacute; que AOL tiene "razones pol&iacute;ticas" para seguir apoyando el navegador de Microsoft y no el que ya le pertenece, el de Netscape. Al parecer, si AOL hubiera cambiado al navegador de Netscape, su cuota de mercado habr&iacute;a balado al 30%.</P>
<P ALIGN="JUSTIFY">Ahora bien, recientemente, el Gobierno de EEUU ha retrasado el permiso de a compra de Netscape por AOL. De hecho, a principios del mes de marzo del presente a&ntilde;o se anunci&oacute; que la Comisi&oacute;n de Valores Mobiliarios y Cambio (SEC) de EEUU hab&iacute;a decidido alargar el plazo para estudiar la operaci&oacute;n. De cualquier manera, los directivos de Netscape se apresuraron a enviar un mensaje de tranquilidad a sus accionistas, puesto que si finlamente no se aprobase la compra, AOL perder&iacute;a una gran oportunidad para beneficiarse de important&iacute;simas tecnolog&iacute;as vitales para su expansi&oacute;n, y que ahora posee Netscape.</P>
<P ALIGN="JUSTIFY">2. Yahoo!: En muchos &aacute;mbitos es considerado el representante de la red. Y lo es, sobre todo, por su audiencia: 30 millones de <I>internautas</I>. El buscador m&aacute;s utilizado de Internet dedica gran parte de su <I>home page</I> al &iacute;ndice tem&aacute;tico en el que se clasifican sus b&uacute;squedas. Sin embargo, el resto de servicios cobra cada d&iacute;a m&aacute;s importancia. Yahoo! se encamina hacia la estructura de "portal" dando lo mismo que los otros: informaci&oacute;n, servicio, b&uacute;squedas, etc.</P>
<P ALIGN="JUSTIFY">De hecho, a principios de 1999, Yahoo! lleg&oacute; a un acuerdo para adquirir la comunidad virtual Geocities (www.geocities.com) a trav&eacute;s de un intercambio de acciones. La operaci&oacute;n, que intercambi&oacute; 0,3384 acciones de Yahoo! por cada una de Geocities, significa un valor aproximado de 3.570 millones de d&oacute;lares. Con esta operaci&oacute;n es posible que se genere el mayor <I>website</I> de la red al unirse los que son el primer y el tercer webs m&aacute;s visitados de Internet.</P>
<P ALIGN="JUSTIFY">Mediante esta operaci&oacute;n, Yahoo! se beneficia de las particularidades del servicio de Geocities, el <I>hosting</I> gratuito de p&aacute;ginas web personales, y las comunidades virtuales y chats que lo componen. Con ello, Yahoo! se rode&oacute; de nuevas armas para competir en el cada vez m&aacute;s complejo y competitivo sector de los "portales" web.</P>
<P ALIGN="JUSTIFY">3. Microsoft. Se quiere convertir en el "portal" por excelencia: llegar al mayor n&uacute;mero posible de usuarios mediante una diversificaci&oacute;n de "portales". Por ello, y consciente de que le faltan los dos servicios m&aacute;s importantes de la nueva estructura -las noticias y los buscadores- se ha lanzado a firmar acuerdos que suplan esas carencias.</P>
<P ALIGN="JUSTIFY">4. Recientemente, Wasnet, S.L., la empresa creadora de LatinMail ( </FONT><A HREF="http://www.latinmail.com/"><FONT FACE="Arial" SIZE=2>www.latinmail.com</FONT></A><FONT FACE="Arial" SIZE=2> ) y LatinChat (www.latinchat.com), anunci&oacute; su deseo de empezar a utilizar en adelante la marca <I>Latinred.net</I> para su nuevo portal, en el que adem&aacute;s de servicio de correo gratuito y chat, incluir&aacute; servicios como "clasificados", "postales", y "f&uacute;tbol", que hoy tienen dominio propio.</P>
<I><P ALIGN="JUSTIFY">Latinred.net</I> parte de dos activos l&iacute;deres en la actualidad: LatinMail, con casi un mill&oacute;n de cuentas de correo, seg&uacute;n asegura la propia empresa, y LatinChat, que es el chat hispanohablante con mayor n&uacute;mero de participantes. Asimismo, tambi&eacute;n dispone de otros "atractivos" para el usuario de Internet: Clasificados (www.usados.net), Postales (postales.latinmail.com), Futbolman&iacute;a ( </FONT><A HREF="http://www.futbolmania.com/"><FONT FACE="Arial" SIZE=2>www.futbolmania.com</FONT></A><FONT FACE="Arial" SIZE=2> ) y Tableros (http://207.153.197.58:81/eshare/server?action=105).</P>
<P ALIGN="JUSTIFY">Wasnet, S.L. mantiene desde mediados de diciembre de 1998 conversaciones para la venta de sus sitios webs al Grupo Cisneros, aliado con AOL para actuar en los pa&iacute;ses hispanohablantes.</P>
</FONT><B><FONT FACE="Arial"><P ALIGN="JUSTIFY">Algunas curiosidades</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La aparici&oacute;n y posterior desarrollo de los "portales" ha dado lugar a un sinf&iacute;n de curiosidades, algunas de las cuales merecen ser mencionadas.</P>
<P ALIGN="JUSTIFY">Los millonarios de todo el mundo tendr&aacute;n en breve un portal exclusivo donde podr&aacute;n obtener informaci&oacute;n sobre c&oacute;mo gastar su fortuna. Los productores de la Millonaire Magazine ( </FONT><A HREF="http://www.millonaire.com/"><FONT FACE="Arial" SIZE=2>www.millonaire.com</FONT></A><FONT FACE="Arial" SIZE=2> ) pusieron en funcionamiento a finales de enero de este a&ntilde;o un portal para los ricos y famosos, donde se encuentra disponible todo tipo de informaci&oacute;n para esta elite; los recursos van desde una tienda virtual de art&iacute;culos de lujo hasta subastas virtuales de objetos raros, pasando por anuncios clasificados de yates y coches de lujo. Este <I>website</I> dispone asimismo de un servicio de e-mail gratuito con direcciones del tipo nombre@millonaire.com.</P>
<P ALIGN="JUSTIFY">Por otro lado, la empresa Weather Labs ( </FONT><A HREF="http://www.weatherlabs.com/"><FONT FACE="Arial" SIZE=2>www.weatherlabs.com</FONT></A><FONT FACE="Arial" SIZE=2> ), perteneciente al grupo Digital Courier Technologies, ha anunciado que est&aacute; poniendo a punto un "portal" meteorol&oacute;gico. En la actualidad, esta empresa ya ofrece informaciones meteorol&oacute;gicas a varios "portales" de la red -como Excite, Netcenter o Snap-. El nuevo <I>website</I> cuenta con recursos de personalizaci&oacute;n y ya ha empezado a buscar patrocinadores en los segmentos del turismo, deportes, entretenimiento y televisi&oacute;n.</P>
<P ALIGN="JUSTIFY">Del mismo modo, Centropolis Interactive, el nuevo brazo de producci&oacute;n de pel&iacute;culas y televisi&oacute;n de Centropolis Entertainment, anunci&oacute; durante el primer trimestre de 1999 la creaci&oacute;n de su primer "Gateway para Sci-Fi en web" en la direcci&oacute;n www.centropolis.com.</P>
<P ALIGN="JUSTIFY">El "portal" est&aacute; dise&ntilde;ado para proporcionar a los entusiastas de la ciencia ficci&oacute;n informaci&oacute;n y noticias espec&iacute;ficas del g&eacute;nero y completas gu&iacute;as de entretenimiento sobre la materia, bien en web o en medios f&iacute;sicos. La decisi&oacute;n de crear el "portal" se debi&oacute; a la enorme popularidad de la revista impresa que ya edita la empresa, <I>EON</I> (www.EONmagazine.com) y a las solicitudes de fans de otras producciones de Centropolis como <I>Godzilla, Independence Day </I>y <I>Stargate</I>.</P>
<P ALIGN="JUSTIFY">Un caso m&aacute;s reciente el es de Dominiuris.com, primer recurso de informaci&oacute;n jur&iacute;dica de habla hispana en la red. Esta p&aacute;gina que aborda desde la perspectiva jur&iacute;dica una instituci&oacute;n tan importante para la Internet actual como son los nombres de dominio, ofreciendo todo ello al p&uacute;blico sin tener que pagar. En esta p&aacute;gina, heredera de una p&aacute;gina personal creada en 1997, el navegante podr&aacute; encontrar informaci&oacute;n b&aacute;sica sobre qu&eacute; es exactamente el nombre de dominio y la importancia que presentan. Del mismo modo, podr&aacute; tener cumplida informaci&oacute;n de los &uacute;ltimos acontecimientos de relevancia, consultando <I>El Bolet&iacute;n de Nombres de Dominio</I>.</P></FONT><P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="inet.htm"><font FACE="ARIAL"><B>[Macedonia Internet]</B></font></a> <hR>
<A HREF="ineta.htm"><font FACE="ARIAL"><B>[Informes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA INTERNET</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

