<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>rupos de desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>


<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face="arial"><br><br><br>

<H3>Pyro Studios</H3>
<P align="justify">

Seguimos con el apartado dedicado a las compa&ntilde;&iacute;as espa&ntilde;olas que en estos momentos est&aacute;n intentado llevar hacia delante el panorama del videojuego en nuestro pa&iacute;s. En esta ocasi&oacute;n vamos a hablar y coincidiendo con el lanzamiento a nivel mundial de su primer trabajo, de la que es, posiblemente, la casa m&aacute;s profesionalizada que existe en nuestro pa&iacute;s: <B>Pyro Studios</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pyro Studios, ha sido una compa&ntilde;&iacute;a que, desde su creaci&oacute;n, ha pasado de puntillas entre todos nosotros. Muy probablemente este hecho se deba a la pol&iacute;tica de publicidad con la que se han querido dar a conocer. A diferencia de Rebel Act, la gente de Pyro ha &quot;empezado a mover los hilos&quot; a 3 o 4 meses vista del lanzamiento de uno de los juegos m&aacute;s importantes no s&oacute;lo de la historia en nuestro pa&iacute;s (ya oigo &quot;murmullos&quot; que dicen que el que m&aacute;s) sino del panorama internacional.</P>
<P ALIGN="JUSTIFY"></P>
<h4>¿Qui&eacute;nes son Pyro Studios?</h4>
<P ALIGN="JUSTIFY">La primera vez que o&iacute; hablar de Pyro fue por medio de los inevitables &quot;rumores&quot;. Peque&ntilde;as notas de &quot;prensa&quot; en las revistas nacionales que hablaban de la aparici&oacute;n inminente de una nueva empresa de soft de videojuegos en nuestro pa&iacute;s, cuchicheos, etc. Ahora bien, no fue hasta bien entradas las navidades cuando tuve la oportunidad de empezar a &quot;conocer&quot; de verdad a la gente que estaba tras Pyro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Hombre, si te dicen que uno de sus responsables es nada menos que <B>Gonzalo Su&aacute;rez</B>, ex - miembro de <B>Opera</B> y creador de juegos m&iacute;ticos de 8 bits pues ya empiezas a interesarte mucho m&aacute;s sobre todo lo que pueda haber detr&aacute;s. Por fin, cuando descubres que Pyro es una casa creada y financiada por <B>Proein</B> (ahora mismo una de las distribuidoras m&aacute;s importantes de nuestro pa&iacute;s y es que... ¡c&oacute;mo ha cambiado Proein de lo que era a lo que es!. Es, sencillamente, incre&iacute;ble), con un capital inicial que pasa holgadamente los 100 millones de pts <B>s&oacute;lo </B>para la realizaci&oacute;n de este proyecto y con una plantilla propia de una casa multinacional Yankee pues ¿qu&eacute; quer&eacute;is que os diga...?. Esto promete.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y vaya que si promete. Pyro Studios est&aacute; formado por un total de 18 programadores, 14 grafistas, 5 dise&ntilde;adores creativos y 2 m&uacute;sicos m&aacute;s el director de Pyro, <B>Ignacio P&eacute;rez-Dolset</B>. Como pod&eacute;is ver estamos hablando de algo muy serio. As&iacute; que, por favor, vamos a relajarnos porque lo que hay detr&aacute;s de Pyro Studios tiene mucha tela... jam&aacute;s hab&iacute;amos tenido en nuestro pa&iacute;s, ni siquiera en la &eacute;poca de los 8 bits, una casa de soft con mayor proyecci&oacute;n internacional, plantilla tan profesional y capaz de desarrollo tan elevada. Se&ntilde;ores, estamos ante una casa que promete poner el panorama de los juegos de estratega patas arriba en breve con un juego llamado <B>&quot;Commandos: Behind the Enemy Lines&quot;,</B> que presume ser el creador de un g&eacute;nero que, pese a que no es del todo nuevo, s&iacute; que va a ser llevado a su m&aacute;xima expresi&oacute;n, el de <B>la t&aacute;ctica en tiempo real</B>, que promete, en definitiva, alzarse como uno de los lanzamientos m&aacute;s espectaculares a nivel internacional durante este a&ntilde;o... </P>
<P ALIGN="JUSTIFY"></P>
<h4>Una plantilla soberbia</h4>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Uno de los principales problemas a los que se puede enfrentar una casa desarrolladora es, sin duda, el tema del trabajo en &quot;equipo&quot; y m&aacute;s si miramos nuestro pa&iacute;s. El hecho de que la programaci&oacute;n en Espa&ntilde;a siempre ha sido llevada por peque&ntilde;os grupos de gente que en la mayor&iacute;a de los casos no superaba el n&uacute;mero de dos programadores y un grafista, es de sobra conocido. Imaginaros ahora que, arrastrando esa forma de trabajo de la &eacute;poca de los 8 bits, intentamos construir, en la situaci&oacute;n en la que se encuentra el mercado internacional ahora, una nueva empresa. Los equipos para producir algo que pueda realmente competir con lo que &quot;hay ah&iacute; fuera&quot; es necesariamente de un n&uacute;mero elevado de personas, encontr&aacute;ndonos o, mejor dicho, top&aacute;ndonos con el tema del trabajo en equipos amplios. &quot;Reeducar&quot; las t&eacute;cnicas de trabajo de los programadores, artistas gr&aacute;ficos, personal de sonido, dise&ntilde;adores, etc que configuran un equipo de desarrollo de videojuegos, es vital si lo que queremos es que quede algo compacto y coherente como resultado final.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En todos estos aspectos, el trabajo que se ha tenido que desarrollar dentro de Pyro para realizar una selecci&oacute;n de personal no s&oacute;lo capacitado para trabajar al tan alto nivel exigido en el mercado actual sino que sepa tambi&eacute;n &quot;acatar&quot; las reglas que deben de imperar en todo equipo de dise&ntilde;o, programaci&oacute;n, etc, ha sido uno de los principales obst&aacute;culos con los que Pyro ha tenido que enfrentarse.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pese a que podemos contar un total de <B>45</B> <B>personas</B> que trabajan al un&iacute;sono como aut&eacute;nticos motores de la empresa, se ha tenido que imponer, necesariamente una coordinaci&oacute;n en cada uno de los frentes m&aacute;s importantes dentro de la creaci&oacute;n de un videojuego que son: la <B>coordinaci&oacute;n gr&aacute;fica</B>, <B>la de programaci&oacute;n</B> y, c&oacute;mo no, la m&aacute;s importante, la de <B>direcci&oacute;n global</B>. En cada uno de los frentes, Pyro est&aacute; demostrando dar una lecci&oacute;n de profesionalidad tanto en el panorama desarrollador espa&ntilde;ol como en aquellos paises que se piensan que en Espa&ntilde;a a&uacute;n nos dedicamos a ir a los toros por las tardes...</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">
<center><table>
<td><img src="jpg/pyro3.jpg" ></td>
<tr><td><center><b><FONT color="#000000" size=1 face=arial>Pantalla de Commandos</font></b></center></td>
</table></center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Como citaba anteriormente, 3 son las coordinaciones globales que rigen a Pyro. La primera y m&aacute;s importante es la llevada a cabo por <B>Ignacio</B>  <B>P&eacute;rez</B> que se encarga de realizar las labores de director general de proyecto. Esta tarea es de vital importancia pues es ah&iacute; d&oacute;nde se toman las decisiones m&aacute;s importantes a la hora de &quot;dirigir&quot; el conjunto global de trabajo, dictando de forma concisa qu&eacute; es lo que se debe hacer y qu&eacute; es lo que no se debe hacer, c&oacute;mo realizar las cosas, establecer los l&iacute;mites del dise&ntilde;o y &quot;arropar&quot; al conjunto de Pyro otorg&aacute;ndoles confianza. Por otro lado, <B>Gonzalo</B> <B>Su&aacute;rez</B> se encarga de llevar la parte vital de cualquier videojuego, esto es, la coordinaci&oacute;n de un equipo completo de programadores. Est&aacute; claro que Gonzalo es una de las mejores bazas de Pyro. Su veteran&iacute;a en estas lides, como ya apuntaba al comienzo del art&iacute;culo, datan de los 8 bits por lo que, una vez m&aacute;s, volvemos al factor com&uacute;n de los sellos que est&aacute;n naciendo en Espa&ntilde;a en estos momentos tales como Pyro o Hammer y es que, pese a que la casa es nueva, el alma es la de un &quot;viejo lobo de mar&quot;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otra de las bazas important&iacute;simas con las que cuenta Pyro, es su nutrido grupo de artistas gr&aacute;ficos. Sinceramente creo que si no est&aacute;n los mejores de Espa&ntilde;a poco falta. Es una aut&eacute;ntica delicia contemplar las pantallas de &quot;Commandos&quot; y ver la calidad ensombrecedora de estas. Sinceramente, uno de los factores por los que &quot;Commandos&quot; se va a convertir en un &eacute;xito seguro va a ser, sin duda, por la calidad gr&aacute;fica del mismo. Pese a que la jugabilidad del producto promete ser alt&iacute;sima, como veremos m&aacute;s adelante, las pantallas que ya est&aacute;n circulando en numerosas publicaciones est&aacute;n siendo deslumbrantes.</P>
<P ALIGN="JUSTIFY">
Toda la &quot;culpa&quot; de ello la tiene, como es l&oacute;gico, el equipo art&iacute;stico de &quot;Commandos&quot; que, bajo la coordinaci&oacute;n de <B>Jorge</B> <B>Blanco</B>, ha dotado al producto de una de las calidades gr&aacute;ficas m&aacute;s sobresalientes que uno puede recordar en un juego de este tipo. Tan s&oacute;lo hay que echar un vistazo a productos de la competencia y de tem&aacute;tica similar, para ver c&oacute;mo el primer t&iacute;tulo de Pyro los &quot;machaca&quot; al primer vistazo. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En estos tres campos que he descrito es d&oacute;nde vamos a ver a una casa siempre ganadora. Han conseguido unir a un conjunto de trabajo que realiza sus tareas de forma acorde a como lo debe de hacer un aut&eacute;ntico equipo. El resultado es una calidad gr&aacute;fica que se acopla a una jugabilidad muy elevada junto a un interfaz sencillo pero que no por ello &quot;simplifica&quot; o convierte al producto en algo mediocre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como pod&eacute;is comprobar ya nos encontramos en Pyro ese toque de profesionalidad real que, quiz&aacute;s, siempre se echaba en falta dentro del panorama nacional. Gente que se dedique &uacute;nica y exclusivamente a realizar videojuegos y, adem&aacute;s, pensando como factor principal, en el mercado internacional. Ah&iacute; est&aacute; la clave, si me permit&iacute;s, de una casa que demuestra seguridad en s&iacute; misma y disposici&oacute;n ganadora, en crear pensando &quot;a lo grande&quot;. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT>
<h4>Commandos. ¿El mejor juego hecho nunca en Espa&ntilde;a?.</h4>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Es cierto que las cosas ahora ya no son como las de antes y que catalogar un juego como el &quot;<I>mejor de..</I>&quot; no es algo ya factible debido a que cada t&iacute;tulo ha tenido su momento, su &eacute;poca y su p&uacute;blico. Sin embargo, bien es cierto que este juego, Commandos, a&uacute;n sin haberlo probado puede colocarse como el mejor juego desarrollado en lo que podr&iacute;a considerarse tercera etapa del software de entretenimiento. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De la &eacute;poca de los 8 bits tenemos grandes t&iacute;tulos que son cl&aacute;sicos y que nadie con un m&iacute;nimo de sentido com&uacute;n se atrever&iacute;a a desplazar de sus puestos, merecidos puestos y de honor por muy bueno que sea un t&iacute;tulo sacado en el presente. Son los cl&aacute;sicos y como cl&aacute;sicos hay que tratarlos. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En cuanto a la segunda etapa, la de transici&oacute;n a los 16 bits, nos encontramos con una toma de contacto, por parte de las casas desarrolladoras, con equipos mucho m&aacute;s potentes como el Amiga, el Atari o los primeros compatibles con EGA. Aprender a desarrollar de un modo distinto a como se ven&iacute;a haciendo con los micros de 8 bits no fue f&aacute;cil y muchas casas perdieron pronto todo el prestigio que hab&iacute;an ganado en los principios de la inform&aacute;tica de entretenimiento. Durante esta segunda etapa aparecieron grandes dise&ntilde;adores que permitieron el nacimiento de nuevos g&eacute;neros como fue el caso de Peter Molyneux y su Populous, nuevas formas de llevar a cabo las aventuras tradicionales a sistemas gr&aacute;ficos y &quot;m&aacute;s intuitivos&quot; (y no voy a entrar en pol&eacute;mica porque no es el cometido de este reportaje), liderados, entre otros, por Ron Gilbert, etc. Dicha &eacute;poca tambi&eacute;n tiene t&iacute;tulos que no pueden ser reemplazados porque supusieron en su momento una forma de abrir nuevos caminos en d&oacute;nde explorar, investigar y, sobre todo, crear.</P>
<P ALIGN="JUSTIFY"></P>

<center><table>
<td><img src="jpg/pyro4.jpg" ></td>
</table>
</center>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

<P ALIGN="JUSTIFY">En la actualidad estamos ante una situaci&oacute;n que es pura locura comercial. Las casas desarrolladoras s&oacute;lo se mueven por lo que pueda ser rentable, por lo que pueda hacerlas ganar dinero seguro. Por eso, cuando sabes que un t&iacute;tulo puede romper los moldes por los que atraviesa el soft actual es cuando te entran unas ganas incre&iacute;bles de contemplar las caracter&iacute;sticas del programaba en cuesti&oacute;n. Commandos tiene esa ventaja. Este t&iacute;tulo est&aacute; recubierto de un &quot;misterio&quot; en cuanto a la forma de plantear la estrategia con respecto a sus m&aacute;s directos competidores, haci&eacute;ndose un producto realmente irresistible para el jugador exigente y maduro. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El que una casa de soft se salga de dichas normas que rigen el soft actual, dejando a un lado la actitud &quot;borreguil&quot; que impregna a la gran mayor&iacute;a de las &quot;grandes&quot; casas, es digno de todos los elogios. Commandos va a cumplir esta premisa. El primer t&iacute;tulo de Pyro, como ya apuntaba casi al comienzo de este art&iacute;culo, va a estar repleto de montones de detalles que le sit&uacute;an en una posici&oacute;n &uacute;nica dentro de los juegos que puedan encontrarse dentro del mismo g&eacute;nero en que se mueve.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Commandos se perfila como un juego de <B>estrategia</B> <B>t&aacute;ctica</B>. El cometido del juego va a ser llevar un grupo de 4 soldados especializados en tareas muy espec&iacute;ficas, para ir realizando sucesivas misiones. La gran novedad se encuentra en que, realmente, necesitamos de una serie de acciones conjuntas por parte de todo el equipo que compondr&aacute; Commandos, es decir, durante el juego, habr&aacute; que coordinar tantos los movimientos de los cuatro personajes y en tiempo real. Es aqu&iacute; donde vamos a encontrar la principal novedad de este juego. Commandos no es el t&iacute;pico juego de estrategia que podemos ver en cualquier estante de una tienda especializada, Commandos es un juego que incorpora ideas ya antiguas y que ven&iacute;an de t&iacute;tulos como el &quot;Shadowlands&quot; de Dommark o el Syndicate de Bullfrog pero mucho m&aacute;s depuradas, estudiadas, desarrolladas, adornadas, investigadas, en definitiva, <B>reinventadas</B>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No voy a cometer el error de ofreceros un preview en este art&iacute;culo, ni hacer un an&aacute;lisis de todo lo que nos depara por ver porque cuando me puse ha idear este peque&ntilde;o reportaje me plantee hablar de Pyro y sus repercusiones en el mercado nacional e internacional. Centr&aacute;ndome en los an&aacute;lisis personales y no en c&oacute;mo ser&aacute; Commandos ya que eso es algo que, todos los que est&aacute;is leyendo este art&iacute;culo, sab&eacute;is de sobra. </P>
</FONT><FONT SIZE=2>
</FONT>
<h4>Reflexiones finales</h4>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Antes de dar por concluido este corto pero intenso reportaje sobre esta &quot;nueva&quot; casa desarrolladora querr&iacute;a recalcar algunos puntos arriba expuestos y realizar una serie de reflexiones personales ante lo que puede significar Pyro para la industria del soft de entretenimiento en Espa&ntilde;a.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN=justify>
Para empezar, Pyro no es una casa que ha salido de la nada. Pyro es una casa que se ha creado con mentalidad ganadora, con una gran cantidad de dinero y con unos objetivos bien claros: entrar en los primeros puestos de las listas internacionales. Y esto no son meras opiniones personales. Todos los que tuvimos ocasi&oacute;n de escuchar la entrevista que se hizo en el programa de radio &quot;Game 40&quot; pudimos comprobar como el mismisimo Gonzalo Su&aacute;rez se encargaba de afirmar tal suposici&oacute;n: <B>&quot;<I>Nuestro objetivo es entrar en los primeros puestos de las listas internacionales&quot;</I>. </P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/pyro5.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><P ALIGN=justify>
Otros de los detalles que no podemos dejar de pasar por alto es lo que hay detr&aacute;s de Pyro. Tenemos que detenernos a analizar el hecho de que Pyro est&aacute; sustentado por una distribuidora como Proein. Una casa de distribuci&oacute;n que, de ser humilde en todo lo que dur&oacute; la &eacute;poca de los 8 bits y comienzos de los 16 bits, se ha convertido por m&eacute;ritos propios en una de la casas m&aacute;s importantes de distribuci&oacute;n (por no decir la que m&aacute;s), de nuestro pa&iacute;s. Sus contactos con el resto de casas del extranjero y su conocimiento del funcionamiento de la industria del videojuego, son unas bazas incre&iacute;bles para el futuro &eacute;xito de los t&iacute;tulos que salgan de la factor&iacute;a Pyro. El hecho m&aacute;s inmediato ha sido el conseguir una distribuci&oacute;n a nivel internacional a cargo de <B>Eidos, </B>una de las casa distribuidoras – desarrolladoras m&aacute;s importantes del mundo y que ya da muchas pistas de lo que puede venir con Commandos...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Otro de los detalles realmente incre&iacute;bles es leer que el equipo de Pyro est&aacute; formado por un total de 45 personas entre programadores, grafistas, dise&ntilde;adores, m&uacute;sicos, etc <B>fijos</B>. Esto es, si mis informaciones no me fallan, sin duda el equipo m&aacute;s grande que existe en una casa de desarrollo en Espa&ntilde;a tanto en la actualidad como cuando pod&iacute;amos competir en el mercado de los 8 bits. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De Commandos, en definitiva, depende la credibilidad de esta casa de soft nacional. Yo creo que van a conseguir, muy posiblemente, el mejor juego de estratega del presente a&ntilde;o y que, despu&eacute;s de Commandos, empezar&aacute;n a salir programas de un estilo muy similar. Originalidad, calidad gr&aacute;fica y frescura son adjetivos que no le faltan, desde luego. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de Commandos, se est&aacute;n preparando dos t&iacute;tulos m&aacute;s. El primero de ellos se denomina, por ahora, <B>Cimmeria </B>un <I>Wargame </I>en 3D que, en palabras del propio Ignacio P&eacute;rez en una entrevista concedida a una conocida revista on-line, norteamericana, aseguraba que iba a mezclar detalles de t&iacute;tulos como <I>War Hammer y Myth: The Fallen Lord</I>. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero lo que sin duda me ha llamado poderosamente la atenci&oacute;n, fue lo que dej&oacute; caer en esa misma entrevista... <B>&quot;Nuestro tercer t&iacute;tulo ser&aacute; un nuevo g&eacute;nero pero... lo siento, no puedo desvelar nada sobre &eacute;l porque se trata de nuestro mejor secreto. Prometo que ser&aacute; un juego revolucionario con el engine m&aacute;s potente que jam&aacute;s se ha visto&quot;.</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Da gusto volver a sentarse delante de tu ordenador, leer una revista especializada y descubrir que Espa&ntilde;a vuelve a ser lo que era en la industria del videojuego... Desde Macedonia un gran abrazo a toda la gente que forma Pyro Studios porque est&aacute;is consiguiendo, con vuestra forma de trabajar, que muchos de nosotros a&uacute;n podamos tener la seguridad de seguir &quot;luchando&quot; por vivir de lo que m&aacute;s nos gusta... ¡crear!. </P>
</FONT>


<br><br>
<hr>


<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegoso]</B></font></a> <hR>
<A HREF="dhispc.htm"><font FACE="ARIAL"><B>[Grupos de Desarrollo]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

