<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Quake II.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Id Software.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Arcade 3D.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 89%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/lq2.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">
Quake 2 est&aacute; programado por id Software (y distribuido en Espa&ntilde;a por Proein). Supongo que no os cuento nada nuevo pues, ¿qui&eacute;n no conoce a los creadores de la Doom y posteriores?. Tan s&oacute;lo esto ya ser&iacute;a raz&oacute;n suficiente para comprar este juego, pero a&uacute;n as&iacute; vamos a llevar un an&aacute;lisis minucioso que nos llevar&aacute; a comprobar que no hay sorpresas, y que el juego efectivamente merece la pena, aunque posea alg&uacute;n peque&ntilde;o defectillo. Veamos en qu&eacute; mejora Quake 2 a su predecesor. </P>
<B><P ALIGN="JUSTIFY">Argumento</B>: ¡Quake 2 tiene argumento!. Por una vez en id, tenemos unos objetivos que cumplir en cada misi&oacute;n que van m&aacute;s all&aacute; de fundir todo lo que se mueva. Adem&aacute;s, &eacute;ste argumento viene en un manual bien realizado y no en 5 l&iacute;neas en un fichero README.TXT. Adem&aacute;s, algo sin precedentes en id, este argumento viene complementado por una bonita intro del juego que nos pondr&aacute; algo m&aacute;s en situaci&oacute;n. De forma resumida, el juego est&aacute; situado en el futuro, en el momento en que una raza alien&iacute;gena, los strogg, est&aacute;n devastando la Tierra, y se est&aacute;n llevando a muchos humanos, a los cuales les convierten en parte de su raza (al estilo Borg) y... Bueno, vosotros mismos lo ver&eacute;is. El caso es que se consigue descubrir el planeta base desde el que los strogg se est&aacute;n transportando all&iacute;, y se manda una divisi&oacute;n de marines a destruir el objetivo, entre ellos t&uacute;. Curiosamente, al descender al planeta, tan s&oacute;lo t&uacute; resistes bien el aterrizaje, con lo que el destino de la raza humana queda en tus manos. ¿Resulta familiar?. Bueno, tampoco hab&iacute;a que pedir un argumento para ganar un Oscar ;). </P>
<B><P ALIGN="JUSTIFY">Gr&aacute;ficos</B>: id se distingue por dar grandes saltos cualitativos entre juego y juego (por supuesto, contando Doom 2 como una ampliaci&oacute;n de Doom). As&iacute;, pueden verse bien aplicadas todas las t&eacute;cnicas probadas por John Carmack en GLQuake (alpha blending, bilinear filtering, etc). Los gr&aacute;ficos de Quake 2 con una tarjeta normal son buenos, pero los gr&aacute;ficos con una tarjeta aceleradora 3D, sencillamente, no tienen comparaci&oacute;n. Particularmente la luz coloreada es lo que da ese ambiente tan incre&iacute;ble al juego. Los screenshots no llegan a dar una idea real del juego, pero valgan estos como prueba para ver las diferencias entre tener una tarjeta aceleradora o no. En ellas est&aacute; el futuro: <BR>
</FONT>&nbsp; </P><center>
<TABLE CELLSPACING=0 BORDER=0 >
<TR><TD VALIGN="left">
<P ALIGN="CENTER"><IMG SRC="jpg/quake1.jpg" ></TD>
<TD VALIGN="right">
<P ALIGN="CENTER"><IMG SRC="jpg/quake2.jpg" ></TD>
</TR></TABLE></center>
<FONT color="#000000">
<P ALIGN="JUSTIFY">Adem&aacute;s, podemos ver en 16 bits de color los cielos y las <I>skins</I> de los jugadores, si tenemos un ordenador potente. Las skins (pieles) son el aspecto que mostramos a los dem&aacute;s jugadores en medio de una partida. Es de agradecer que podamos personalizar si queremos parecernos a Spiderman o a uno de los Men in Black, por poner un par de ejemplos ;). </P>
<B><P ALIGN="JUSTIFY">Sonidos y M&uacute;sica</B>: Los sonidos est&aacute;n realmente bien hechos. Todos ellos son muy apropiados, desde los propios (salto, dolor) y los de los enemigos (muertes ;) a los que hacen las armas, el viento, el agua... En particular los del BFG o el Railgun al <I>destrozar</I> a un enemigo pueden causar adicci&oacute;n ;). </P>
<P ALIGN="JUSTIFY">En cuanto a la m&uacute;sica, aunque es m&aacute;s ca&ntilde;era y pega mejor con el juego que la del Quake, pocos llegar&aacute;n con ella puesta al final del juego, pues aburre pronto y no deja oir otros sonidos importantes. Menos a&uacute;n la mantendr&aacute;n en modo Deathmatch. </P>
<B><P ALIGN="JUSTIFY">Extensionabilidad</B>: Al igual que Quake, Quake 2 puede extenderse por todas partes. As&iacute;, podemos cambiar los gr&aacute;ficos del juego, las texturas, los sonidos, nuestro propio aspecto externo, e incluso nuestra forma (el otro d&iacute;a jugu&eacute; usando uno de los tent&aacute;culos de Maniac Mansion ;). Pero adem&aacute;s hay algo que merece la pena mencionar. En Quake se pod&iacute;an programar diferentes modos de juego mediante un lenguaje interpretado creado por John Carmack, llamado QuakeC (basado evidentemente en el C). As&iacute;, los geeks que se met&iacute;an manuales y m&aacute;s manuales pod&iacute;an programar algunos de los mods m&aacute;s exitosos, como Capture the Flag o TeamFortress. Ahora, ya no ser&aacute; necesario empollar tanto, pues John Carmack ha hecho el interface del juego con el jugador en C puro, es decir, que las modificaciones son librer&iacute;as din&aacute;micas (DLLs) normales y corrientes. Tan s&oacute;lo es cuesti&oacute;n de coger las fuentes, cambiar lo que queramos y compilar. Otro punto m&aacute;s a favor de Quake 2. </P>
<B><P ALIGN="JUSTIFY">Jugabilidad</B>: Esta secci&oacute;n se divide f&aacute;cilmente en dos partes. La primera es el modo Single Player, que ha experimentado una gran mejora respecto de Quake. El buen trabajo de los dise&ntilde;adores y las diferentes misiones (destruir un arma, cortar el paso de un tren) dan mucha m&aacute;s variedad, mientras que en Quake nos hab&iacute;amos aburrido tras el primer episodio (y quedaban otros tres). Adem&aacute;s, ahora las misiones est&aacute;n agrupadas en grupos de tres o cuatro niveles entre los que podemos movernos libremente, lo que le da m&aacute;s credibilidad al juego. </P>
<P ALIGN="JUSTIFY">En cuanto al aspecto multijugador, el m&aacute;s importante de cara a la <I>vida</I> del juego, tambi&eacute;n hay mejoras, y muchas. Para empezar, las armas est&aacute;n mucho m&aacute;s equilibradas, con lo que no se ver&aacute;n cosas como las batallas por el lanzamisiles en el Quake, la &uacute;nica arma realmente efectiva. Ahora hay 5 o 6 armas que causan estragos en manos de un jugador experimentado, aumentando el n&uacute;mero de intercambios de disparos posibles entre dos o m&aacute;s jugadores. Adem&aacute;s, hay detalles nuevos, como algunos objetos a usar (silenciador, armadura de energ&iacute;a), o el hecho de que cuando corremos se puedan oir nuestros pasos, lo que fuerza a pensar un poco m&aacute;s nuestra estrategia en partidas de uno contra uno. Tambi&eacute;n queda curiosa la inclusi&oacute;n de los taunts, posturas que podemos usar para saludar al enemigo o para picarle ;). Adem&aacute;s, al igual que Quake, numerosos parches le dar&aacute;n (de hecho ya lo hacen) sangre nueva al juego, con lo que tenemos Quake 2 para rato, como m&iacute;nimo hasta que llegue Quake 3. </P>
<br><br>
<CENTER><TABLE><td>
<center><img src="jpg/pq2.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<center>
<b>Id vuelve a poner su ritmo.<br>
</b>
</center></td>
</table></center>
<p align = justify>
<br><br>

<B><P ALIGN="JUSTIFY">Puntos Negros</B>: El juego en s&iacute; apenas tiene puntos negros. El &uacute;nico problema que tiene es que no se vendi&oacute; acabado. En parte por la presi&oacute;n de los fans y en parte por la de Activision, distribuidora de Quake 2 en EEUU y a la que interesaba que el juego saliera para navidad (se vende mucho m&aacute;s), el juego sali&oacute; antes de lo que deber&iacute;a. As&iacute;, el modo multijugador ten&iacute;a numerosos bugs (algunos de ellos costaba creer que no se hubieran corregido), y no estaban incluidos ni los mapas deathmatch ni el modo de juego cooperativo. Cierto que los que estamos en Internet nos hemos podido despu&eacute;s bajar unos parches con esos contenidos que dejan nuestro Quake 2 a punto de caramelo (eso s&iacute;, contribuyendo a llenar los bolsillos de nuestra amant&iacute;sima Timof&oacute;nica), pero eso es algo que tendr&aacute;n m&aacute;s dif&iacute;cil los que no est&aacute;n conectados, pues id suele ser estricto con ciertas revistas, y algunos de sus ficheros s&oacute;lo permite que se pasen por v&iacute;a electr&oacute;nica. </P>
<P ALIGN="JUSTIFY">La cosa es, ¿deber&iacute;a haber esperado id a completar el juego?. En estos dos meses que habr&iacute;a tardado hemos jugado bastante y se agradece, pero eso no quita que id debiera tener un mejor equipo de betatesters (los jugadores no estamos para eso), y que no deber&iacute;an decir que el juego saldr&aacute; "cuando est&eacute; hecho", como dice Carmack, si luego resulta que sale y NO est&aacute; hecho. </P>
<B><P ALIGN="JUSTIFY">En resumen</B>: No dej&eacute;is que os enga&ntilde;e esta &uacute;ltima secci&oacute;n. Quake 2 es ahora mismo lo mejor que hay en el mercado en el g&eacute;nero FPS, y mover&aacute; mucho m&aacute;s, como m&iacute;nimo hasta que salgan los juegos de la competencia (Unreal, SiN). Si ten&eacute;is acceso a una red local o una buena conexi&oacute;n internet, no lo dud&eacute;is y compradlo. S&oacute;lo por las partidas multijugador merece la pena, y la gran variedad de modos proporcionados por los programadores aficionados proporcionar&aacute;n muchas horas de diversi&oacute;n. <BR>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadeb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

