<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>omentarios de Libros</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A href="mailto:ramis@lettera.net">Pablo Vázquez "Ramis"</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>
<H3>
<FONT color="#000000" face="arial">
"El Manifiesto Negro" y "El Negociador". <br>De Frederick Forsyth
</FONT>
</H3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>

Cambiando un poco las formas utilizadas en esta peque&ntilde;a secci&oacute;n de Macedonia, esta vez comentaremos dos novelas en un mismo art&iacute;culo, son &quot;<B>El Manifiesto Negro</B>&quot; y &quot;<B>El Negociante</B>&quot;, ambas de <B>Frederick Forsyth</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Frederick Forsyth naci&oacute; en Ashford, en el condado ingl&eacute;s de Kent, en 1938. Tras trabajar en la BBC entre 1965 y 1967, cubri&oacute; como periodista independiente la guerra de Biafra (1968 - 1970), experiencia que reflej&oacute; en el libro de &quot;The Biagra Story&quot;. Su primera novela, &quot;Chacal&quot;, se public&oacute; en 1971 y constituy&oacute; un &eacute;xito mundial. La misma acogida ha tenido sus obras posteriores, entre las que destacan &quot;Odessa&quot;, &quot;Los Perros de la Guerra&quot;, &quot;El Emperador&quot;, &quot;La Alternativa del Diablo&quot;, &quot;El Cuarto Protocolo&quot;, &quot;El Negociador&quot;, &quot;El Manipulador&quot;, &quot;El Pu&ntilde;o de Dios&quot; y &quot;El Manifiesto Negro&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La principal raz&oacute;n que nos ha llevado a comentar ambas novelas a la avez es su inmenso parecido en tem&aacute;tica, forma de redacci&oacute;n y de estructuraci&oacute;n, am&eacute;n de otros peque&ntilde;os detalles.</P>
<P ALIGN="JUSTIFY">Para empezar, comentaremos un poco por encima de qu&eacute; tratan ambas novelas:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN=JUSTIFY>&quot;<B>El Negociador</B>&quot; narra el secuestro y el posterior asesinato del hijo del presidente de los Estados Unidos, para acabar con la desactivaci&oacute;n del grupo de terroristas que lo llev&oacute; a cabo y la de los magnates que idearon tal atentado. La novela se divide en dos partes: la primera es la que corresponde al secuestro, negociaci&oacute;n y el asesinato (con que acaba dicha parte), y la segunda que es la persecuci&oacute;n y ejecuci&oacute;n de los terroristas, para terminar desenmascarando a los magnates.
<P ALIGN="JUSTIFY">La principal figura de la novela es un ex-agente de la CIA que al fina de su carrera se dedica a negociar e secuestros. Pero despu&eacute;s de un fracaso se retir&oacute;. Ahora son la CIA y el servicio de inteligencia de Inglaterra (pa&iacute;s donde se llev&oacute; a cabo el secuestro) los que le piden ayuda. Tras fracasar en el &uacute;ltimo momento emprende la caza y captura de todos los causantes de dicha barbaridad.</LI></P></UL>
<P ALIGN="JUSTIFY"></P>
<UL>
<LI><P ALIGN=JUSTIFY>&quot;<B>El Manifiesto Negro</B>&quot; es una historia que cuenta la ca&iacute;da del l&iacute;der pol&iacute;tico ruso mejor colocado para ser nombrado presidente, a trav&eacute;s de loas urnas. Todo comienza con el robo de un manifiesto en el que expresa lo que realmente har&aacute; cuando llegue al poder, una idea id&eacute;ntica a la de Hitler. Dicho manifiesto cae en manos de la embajada brit&aacute;nica en Mosc&uacute; y tras investigar para demostrar su autenticidad (lo que consiguen a trav&eacute;s de 3 muertes) lo dan a conocer a los Estados Unidos. Al tratarse de un l&iacute;der pol&iacute;tico, a nivel gubernamental ambos pa&iacute;ses se &quot;lavan las manos&quot; y ha de ser un a poderosa ONG la que decida enviar a su ex-agente de la CIA, con un peque&ntilde;o equipo de hombres experimentados, a Mosc&uacute; para empezar una campa&ntilde;a de desacreditaci&oacute;n de dicho l&iacute;der pol&iacute;tico.  Acaba todo con un final muy espectacular.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Aunque las historias son diferentes es posible ver muchas similitudes ya que ambas se adentran en el mundo del espionaje y contraespionaje; utilizan nombres de los l&iacute;deres pol&iacute;ticos de Estados Unidos, Gran Breta&ntilde;a y Rusia (Gorbachov, Thatcher) y miembros directivos de la CIA, KGB y el SIS; ambas cuentan con un ex-agente CIA como h&eacute;roe de la novela y, por supuesto, ambas tiene un final bastante &quot;bueno&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como curiosidad a nivel de tem&aacute;tica resaltaremos que en &quot;El Manifiesto Negro&quot; la acci&oacute;n se desarrolla durante el a&ntilde;o 1999. Al estar al final de siglo, es curioso como bastantes autores est&aacute;n utilizando tal fecha en sus &uacute;ltimas novelas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A nivel de estructuraci&oacute;n, y como ya hemos comentado en el caso de &quot;El Negociador&quot;, ambos libros est&aacute;n divididos en dos partes. En el caso de &quot;El Manifiesto Negro&quot; la primera parte cuenta el robo de dicho manifiesto y c&oacute;mo la Guardia Negra de Kom&aacute;rov (l&iacute;der del UFP) &quot;ajusticia&quot; a los culpables. A la vez que cuenta esto, narra desde 1983 a 1994 la historia de la CIA y el contraespionaje con Rusia, a trav&eacute;s del agente que luego es enviado para acabar con Kom&aacute;rov. En la segunda parte, durante 1999, se cuentan las peripecias del agente par desacreditar al l&iacute;der del UFP.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Es destacable el hecho de que en las primeras partes de ambos libros se cuenten historias paralelas, es decir, se entremezcla trozos de una con trozos de otra (en el caso de &quot;El Negociador&quot; cuenta el secuestro por un lado y los quehaceres de los magnates para pagar a los secuestradores). En ambos casos esta manera de estructurar la novela es perjudicial para el lector ya que no es f&aacute;cil seguir el desarrollo de la historia con tanto salto de un lado para otro.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A nivel l&eacute;xico son libros que no tienen ninguna dificultad para la lectura, porque si bien tienen alguna palabra t&eacute;cnica (como por ejemplo, descripci&oacute;n o nombre de alg&uacute;n arma) no se necesita ser nadie para poderlos leer y disfrutar. Solo hace falta ponerse. Como &uacute;ltimo detalle resaltaremos que esta forma de escribir y esta tem&aacute;tica no es, ni mucho menos, la &uacute;nica de Forsyth, como ha demostrado en  &quot;Odessa&quot;, por ejemplo.</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioa.htm"><font FACE="ARIAL"><B>[Comentarios de Libros]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


