<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>icci&oacute;n</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:mafer@ctv.es">Mar&iacute;a Dolores Fern&aacute;ndez</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
La P&aacute;gina Siguiente
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Encubierta por la densa vegetaci&oacute;n que conquist&oacute; el jard&iacute;n, en otro tiempo bien cuidado y provisto de formas caprichosas, a&uacute;n es posible percibir entre el amasijo de piedra y vegetal, la silueta de lo que en su d&iacute;a fue una gran mansi&oacute;n, construida a principios de este siglo por el t&iacute;o abuelo de mi mujer, a su regreso de las Am&eacute;ricas, tras su estancia de m&aacute;s de treinta a&ntilde;os en la Isla de Cuba.</P>
<P ALIGN="JUSTIFY">Tengo que confesar que debido a las malas o, m&aacute;s precisamente, nulas relaciones que siempre he mantenido con mi familia pol&iacute;tica, nunca me he preocupado por el patrimonio que los mismos dejaron a mi esposa como legado, hasta el momento presente en que un c&uacute;mulo de circunstancias, principalmente econ&oacute;micas, me ha tra&iacute;do hasta aqu&iacute;. Siempre me ha gustado conocer los detalles de mis propios asuntos, as&iacute; que antes de contratar los servicios de una agencia inmobiliaria, para la venta de la casa decid&iacute; valorarla por m&iacute; mismo. Desde luego el enclave era perfecto, un lugar hermoso y tranquilo, alterado &uacute;nicamente por el paso de una carretera bordeando la zona baja de la finca.</P>
<P ALIGN="JUSTIFY">Tras la primera mirada, no me sorprendi&oacute; en absoluto la estructura exterior de la casa, encajaba perfectamente con la personalidad de sus creadores, expresando a la perfecci&oacute;n la idea inicial de se&ntilde;or&iacute;o y prepotencia que a buen seguro tuvieron en mente cuando decidieron levantarla. Mi primera sensaci&oacute;n fue una mezcla de curiosidad y temor. La primera se debi&oacute; a la gran variedad de objetos que se encontraban en el recibidor, los cuales no me era posible percibir con nitidez a causa de la escasa luz que los grandes ventanales recib&iacute;an en aquellos momentos unido al abandono y la intensa labor realizada por peque&ntilde;os ar&aacute;cnidos y otros &quot;bichos&quot; poco agradables.</P>
<P ALIGN="JUSTIFY">Poco a poco me fue posible satisfacer mi curiosidad revisando habitaci&oacute;n por habitaci&oacute;n de la casa, sin reparar en nada de manera excepcional, excepto la biblioteca, la cual me agrad&oacute; sobremanera. Realmente me encontraba en una estancia sumamente acogedora, con grandes ventanales y estanter&iacute;as de madera que llenaban las paredes de principio a fin. Para acceder a las repisas mas altas, se hab&iacute;a instalado una gran escalera que se deslizaba por unos peque&ntilde;os ra&iacute;les incrustados en suelo y techo. En el centro de la estancia una gran mesa de caoba a buen seguro hab&iacute;a sido soporte de largas horas de lectura y estudio. Desde ni&ntilde;o siempre he sido aficionado a la lectura, de manera que el hallazgo me sorprendi&oacute; gratamente cuando comprob&eacute; la antig&uuml;edad de los libros, ya que me encontraba en presencia de verdaderos manuscritos; grandes vol&uacute;menes ajados y polvorientos que por primera vez estaban a punto de desvelar el enigma que me tiene despierto a estas horas de la madrugada y que no logro apartar de mis pensamientos.</P>
<P ALIGN="JUSTIFY">En los d&iacute;as siguientes centr&eacute; mis esfuerzos en la realizaci&oacute;n de un inventario de bienes muebles que se encontraban en la casa con objeto de entreg&aacute;rselo a un conocido empresario dedicado a la compra-venta de antig&uuml;edades y por cierto viejo amigo m&iacute;o que se hab&iacute;a mostrado muy interesado. Por supuesto, no inclu&iacute; en esta relaci&oacute;n los vol&uacute;menes m&aacute;s antiguos de la biblioteca, sino que me dispuse a embalarlos cuidadosamente para llev&aacute;rmelos a mi partida.</P>
<P ALIGN="JUSTIFY">Realizando mec&aacute;nicamente esta actividad al paso que ojeaba los libros r&aacute;pidamente, sumido en la monoton&iacute;a de ver pasar m&uacute;ltiples hojas plagadas de letras, mis manos se detuvieron en una de ellas, en la que las palabras hab&iacute;an sido sustituidas por dibujos, al pie de los cuales, pod&iacute;an encontrarse unas peque&ntilde;as anotaciones que a penas me era posible entender por estar escritas en franc&eacute;s antiguo, conocimientos de los cuales mi memoria hab&iacute;a tomado unas largas vacaciones.</P>
<P ALIGN="JUSTIFY">Uno de los dibujos reproduc&iacute;a una embarcaci&oacute;n con una sierra en su proa embistiendo unas cadenas que soportaban dos torres.</P>
<P ALIGN="JUSTIFY">El segundo de ellos en la p&aacute;gina posterior era un hermoso sol de oro, realizado con peque&ntilde;as l&aacute;minas del mismo material.</P>
<P ALIGN="JUSTIFY">Extra&ntilde;amente la p&aacute;gina siguiente aparec&iacute;a casi en blanco, apenas unos peque&ntilde;os bocetos rellenaban el espacio. Sin embargo no estaban ausentes las anotaciones a pie de p&aacute;gina.</P>
<P ALIGN="JUSTIFY">La verdad es que no le hubiera prestado mayor importancia al asunto, excepto por la firma que figuraba al final del escrito y que desvelaba la identidad de su autor; M. Nostradamus. No sal&iacute;a de mi asombro; ten&iacute;a en mis manos un manuscrito de m&aacute;s de cuatrocientos a&ntilde;os de antig&uuml;edad del profeta m&aacute;s importante de la civilizaci&oacute;n europea. Miles de preguntas acudieron entonces a mi mente. ¿Donde estaba la p&aacute;gina siguiente? ¿C&oacute;mo hab&iacute;a llegado a manos de mis parientes el manuscrito? ¿Ser&iacute;a junto con los muebles tra&iacute;dos de Cuba o m&aacute;s bien el pago en especie de alg&uacute;n asunto de los que mi familia pol&iacute;tica acostumbraba a realizar?</P>
<P ALIGN="JUSTIFY">No obstante la importancia de mi hallazgo, el cansancio del viaje y las largas horas sin dormir, consiguieron sumirme en un suave sopor, precedente de un sue&ntilde;o del que no despert&eacute; en muchas horas. Llegado el alba, mi primera inquietud fue encontrar la respuesta a la p&aacute;gina en blanco, a&uacute;n a costa de dejar al margen mis restantes compromisos.</P>
<P ALIGN="JUSTIFY">Cuando me dispon&iacute;a a salir de casa, todo se qued&oacute; en un intento infructuoso debido a mi mala cabeza. No encontraba las llaves, si bien no me sorprendi&oacute;; siempre he sido el rey de los duplicados.</P>
<P ALIGN="JUSTIFY">En efecto, mis neuronas no son todo lo eficaces que yo desear&iacute;a pero suplo este defecto con la previsi&oacute;n. Al instalarme en la casa hice un duplicado de las llaves, el cual introduje en una bonita caracola —estrombo— que se encontraba sobre una mesa del vest&iacute;bulo y que a&uacute;n no hab&iacute;a empaquetado junto con el resto de los enseres por descuido. ¿Como no?</P>
<P ALIGN="JUSTIFY">En el momento de recoger las llaves, comprob&eacute; que en el interior de la caracola se albergaban siete ejemplares de las mismas y yo s&oacute;lo conoc&iacute;a la procedencia de una de ellas. ¿Y las otras seis? Mis dudas pronto se disiparon al extraer el &uacute;ltimo juego de llaves, de la zona m&aacute;s estrecha del molusco, la pulsera de mi reloj se abri&oacute; quedando atrapado en su interior. En su rescate obtuve una recompensa, siete relojes aparecieron ante mis ojos en un instante. Repet&iacute; la operaci&oacute;n con otros objetos, obteniendo el mismo resultado; el objeto original multiplicado por siete.</P>
<P ALIGN="JUSTIFY">Por &uacute;ltimo y guiado por mi instinto materialista, dej&eacute; caer unas monedas y la multiplicaci&oacute;n fue al instante, de modo que aument&eacute; mis ingresos al tiempo que comprend&iacute; el origen de la fortuna de mis queridos parientes. ¡Que f&aacute;cil resultar&iacute;a de esa manera adquirir casas, fincas, pagar y abusar de la mano de obra, comprar cualquier otro bien material e incluso el silencio!</P>
<P ALIGN="JUSTIFY">Sin olvidar este nuevo hallazgo decid&iacute; centrar mis esfuerzos en la resoluci&oacute;n de los motivos que verdaderamente me inquietaban en aquel momento; el problema era encontrar asesoramiento para la traducci&oacute;n de aquellas l&iacute;neas que tanto se me resist&iacute;an. De lo que s&iacute; estaba seguro es que no tendr&iacute;a problema para satisfacer los honorarios del int&eacute;rprete, por cortes&iacute;a de la casa o mejor dicho de la caracola. Dicho y hecho, en un per&iacute;odo de siete d&iacute;as el servicio de correos transport&oacute; la soluci&oacute;n hasta mi buz&oacute;n.</P>
<P ALIGN="JUSTIFY">La tercera p&aacute;gina describ&iacute;a la escena de un &aacute;rbol a cuyos costados se encontraban dos leones, el del lado diestro alzado a su copa y el del siniestro cabeza abajo.</P>
<P ALIGN="JUSTIFY">A todo esto se a&ntilde;ad&iacute;a; &quot;Esta ser&aacute; la configuraci&oacute;n del escudo&quot;. Evidentemente, no se trataba de otra cosa que la descripci&oacute;n de un escudo. De nuevo me result&oacute; imprescindible recopilar informaci&oacute;n al respecto, esta vez por m&iacute; mismo, en varios tomos de her&aacute;ldica, que revis&eacute; con tes&oacute;n hasta que mi esfuerzo obtuvo recompensa.</P>
<P ALIGN="JUSTIFY">La descripci&oacute;n del escudo encajaba perfectamente con el correspondiente a un concejo de la zona norte de Espa&ntilde;a, de car&aacute;cter preeminentemente residencial e industrial configurado a partir de la d&eacute;cada de los a&ntilde;os cincuenta y poseedor de bellos parajes naturales, el de mayor inter&eacute;s nacido parad&oacute;jicamente de manera artificial. Se trata de un embalse, donde pueden observarse numerosas especies acu&aacute;ticas, adem&aacute;s de practicar distintos deportes como el pirag&uuml;ismo.</P>
<P ALIGN="JUSTIFY">¿Qu&eacute; ten&iacute;a hasta ahora? Solamente una cosa; M. Nostradamus mediante la descripci&oacute;n del escudo hac&iacute;a referencia a es lugar, pero evidentemente, ten&iacute;a que haber algo m&aacute;s. El puzle estaba incompleto y yo quer&iacute;a seguir jugando. Comenc&eacute; a estudiar la obra de Nostradamus hasta que en una de sus centurias descubr&iacute;.</P>

<I><P ALIGN="CENTER">&quot;En el lugar del escudo<BR>
la tierra se abrir&aacute;<BR>
y lo llegado del otro universo<BR>
quedar&aacute; en descubierto.<BR>
El primer rayo de luna del d&iacute;a vig&eacute;simo cuarto<BR>
del sexto mes restando cuatro a&ntilde;os del nuevo siglo<BR>
lo cubrir&aacute;,<BR>
y ser&aacute; la noche m&aacute;s larga,<BR>
la noche infinita para todo el planeta&quot;.</P>

</I><P ALIGN="JUSTIFY">Analic&eacute; estas l&iacute;neas largo tiempo, parec&iacute;an anunciar un terremoto, o un movimiento s&iacute;smico que dejaba ver algo llegado de otro universo ¿Un terremoto que descubrir&iacute;a un meteorito? ¿o una nave? No lo s&eacute;. Pero parece que cuando la luz de la luna repose sobre ello, tendr&aacute; efectos nefastos para todo el planeta.</P>
<P ALIGN="JUSTIFY">Tras estos acontecimientos aqu&iacute; me encuentro, analizando todas las posibilidades; pero lo que m&aacute;s me preocupa es la &uacute;ltima cuarteta de la predicci&oacute;n de M. Nostradamus; la cual parece ser el gran castigo a mi curiosidad.</P>

<I><P ALIGN="CENTER">&quot;Perm&iacute;tase a quien lean estos versos<BR>
ponderar su significado<BR>
que ni la masa de mortales ni<BR>
los iletrados los conozcan<BR>
y quienes as&iacute; lo hicieren<BR>
poseyeren todo lo bueno que desearen<BR>
y a cambio paguen este don con ---&quot;.</P>

</I><P ALIGN="JUSTIFY">¡Otra vez la p&aacute;gina en blanco!; algo importante est&aacute; a punto de suceder en pocos d&iacute;as a toda la humanidad y a m&iacute; en particular y los avatares del destino han permitido que yo conozca lo que va a ocurrir.</P>
<P ALIGN="JUSTIFY">Tendr&eacute; que comunicarlo a las autoridades, si bien prefiero hacerlo por escrito por un doble motivo; mi capacidad de expresi&oacute;n oral no es todo lo correcta que yo desear&iacute;a y adem&aacute;s me quedo m&aacute;s tranquilo pues pase lo que pase <B>T&uacute;</B> te acabas de hacer solidario conmigo, al leer las l&iacute;neas como yo lo hice.</P>
<P ALIGN="JUSTIFY">Nos espera un mismo destino en todo lo bueno y en ese otro que no conocemos, pero que sin duda M. Nostradamus siempre supo que compartir&iacute;amos.</P>
<P ALIGN="JUSTIFY">Mientras tanto yo seguir&eacute; buscando la p&aacute;gina siguiente.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisa.htm"><font FACE="ARIAL"><B>[Ficci&oacute;n]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







