<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>icci&oacute;n</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:guticr@arrakis.es">Agust&iacute;n Cernuda del R&iacute;o</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
El Sexo de los &Aacute;ngeles
</H3>

<table>
<tr><td>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="right">If I only had a brain...<BR>
<I>El Espantap&aacute;jaros, en El mago de Oz<BR>
</I>[........................]<BR>
<I>Eduardo Manostijeras</P></I>
</font>
</td></tr>
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Cuando consegu&iacute; los peque&ntilde;os cartones blancos, me dirig&iacute; r&aacute;pidamente a mi habitaci&oacute;n. En algunos de ellos, s&oacute;lo en algunos, hab&iacute;a peque&ntilde;os dibujos realizados a l&aacute;piz; dibujos que pr&aacute;cticamente no se apreciaban, a no ser que uno supiera que estaban all&iacute; —como era mi caso—. Yo quer&iacute;a conservar en mi poder aquellos dibujos, contemplarlos cuando quisiera. Pero sab&iacute;a que no era el &uacute;nico. Cuando me dispon&iacute;a a esconderlos en mi estanter&iacute;a, o&iacute; que alguien se acercaba con cierta prisa. Claro, era Heather.</P>
<P ALIGN="JUSTIFY">Pude verla a trav&eacute;s de la rendija de la puerta. Evidentemente, ven&iacute;a a buscar los cartones; ya no pod&iacute;a ocultarlos, ella los hab&iacute;a entrevisto en mi mano. Pero intent&eacute; ganar tiempo cerrando el pestillo.</P>
<P ALIGN="JUSTIFY">Heather es menuda, delgada, fr&aacute;gil; quiz&aacute;s deber&iacute;a llamarse Audrey, porque es el mismo tipo de chica que Audrey Hepburn. Su pelo es negro y liso, y lo lleva siempre corto, al estilo ese que se ha dado en llamar gar&ccedil;on. Pero le gusta utilizar ropa azul marino, leotardos oscuros y botas militares. Esta vez no era una excepci&oacute;n; Heather compon&iacute;a una bonita armon&iacute;a entre el azul oscuro de sus ropas, la claridad de su piel y el negro casi brillante del pelo, los ojos, los leotardos y las botas. Es realmente endiablado el trato con Heather.</P>
<P ALIGN="JUSTIFY">Yo intent&eacute; r&aacute;pidamente guardar los cartones, pero record&eacute; que ella ya los hab&iacute;a visto. Llamaba a la puerta. Decid&iacute; intentar una jugada de magia barata; apartar&iacute;a los cartones pintados, los echar&iacute;a detr&aacute;s de los libros del estante, y le dar&iacute;a a Heather los cartones en blanco. Con eso quiz&aacute;s se fuese contenta. Ella sab&iacute;a que yo hab&iacute;a cogido los cartones, pero no sab&iacute;a que algunos de ellos estuviesen pintados. Tampoco sab&iacute;a exactamente cu&aacute;ntos cartones eran en total. No notar&iacute;a unos pocos de diferencia. Pero me resultaba muy dif&iacute;cil seleccionarlos con una sola mano, y es que con la otra sujetaba la puerta que Heather empujaba ya con fuerza. Evitando que se me cayesen al suelo, nerviosamente, continu&eacute; buscando; not&eacute; que Heather se decid&iacute;a a coger carrera para derribar la puerta, y r&aacute;pidamente apoy&eacute; la espalda en el armario y los dos pies contra ella, sujet&aacute;ndola fuertemente. Heather comenz&oacute; a empujar, y la puerta se doblaba bajo el esfuerzo como si fuese de goma. De seguir as&iacute;, Heather la romper&iacute;a, y me decid&iacute; a abrir.</P>
<P ALIGN="JUSTIFY">¡Heather!, le dije, ¡espera! Voy a quitar el pestillo. En ese peque&ntilde;o momento de tregua, mientras abr&iacute;a la puerta arroj&eacute; los cartones a lugar seguro, tras esa colecci&oacute;n de literatura que jam&aacute;s ha le&iacute;do nadie en mi casa. Quiz&aacute;s he olvidado decir que Heather es una nota musical. No, no pienses en que tiene forma de nota musical. Heather es una chica. Pero a la vez, es una nota musical, concretamente una negra, y adem&aacute;s yo estoy seguro de que la mayor&iacute;a de las veces es una nota de piano. Es una chica pero en ocasiones ejerce de nota. En fin, yo creo que est&aacute; bastante claro.</P>
<P ALIGN="JUSTIFY">Abr&iacute; finalmente la puerta, y con todo el disimulo posible, le di a Heather los cartones, pero advert&iacute; con profundo fastidio que hab&iacute;a escondido los cartones blancos y le hab&iacute;a dado los ilustrados. Por supuesto, los ilustrados eran muy pocos para que el enga&ntilde;o saliese bien, y aunque Heather sigui&oacute; sin ver los dibujos, dijo que ten&iacute;a que haber m&aacute;s cartones. Resignado, le di el resto, ya que no me serv&iacute;an para nada. Quer&iacute;as esconderlos, ¿eh?, me dijo. ¿Por qu&eacute; haces siempre estas cosas?</P>
<P ALIGN="JUSTIFY">Derrotado, comprend&iacute; que no pod&iacute;a seguir m&aacute;s tiempo sin explic&aacute;rselo todo a Heather. Con un gesto de resignaci&oacute;n, me encog&iacute; de hombros, suspir&eacute; y me dispuse a hablar; me sent&eacute; en el suelo. Ella hizo lo mismo. Dej&oacute; los cartones a su derecha, cerca de la puerta. Como tantas otras veces, me cogi&oacute; la cabeza y la apoy&oacute; en su regazo, jugueteando con el pelo. Creo, lector, que tendr&eacute; que ser m&aacute;s preciso contigo en esto tambi&eacute;n. A menudo Heather coge mi cabeza y juega con ella cuando hablamos, pero lo que quiero decir es que mi cabeza se separa de mi cuerpo. Es decir, yo contin&uacute;o viendo desde el mismo punto de vista que antes, mi voz se emite desde mi cuerpo igual que antes, y yo pienso en el mismo sitio que antes; pero mi cuerpo est&aacute; decapitado, es Heather quien tiene la cabeza. Yo puedo as&iacute; ver mi propia cara, y a veces pienso: ¡Necesito un afeitado! Pero lo interesante es que, aunque la cabeza est&eacute; frente a m&iacute;, yo no pienso ni veo ni hablo desde ella, sino desde mi cuerpo. Parece que la cabeza no sirve para nada, adem&aacute;s de para llevar la cara. Bueno, el caso es que me decid&iacute; a cont&aacute;rselo todo a Heather. No sab&iacute;a c&oacute;mo empezar, y mi primera frase fue: La verdad es que no s&eacute; por d&oacute;nde empezar.</P>
<P ALIGN="JUSTIFY">Heather, que pese a todo siempre ha sido muy comprensiva, se adelant&oacute; un poco —quiz&aacute;s para facilitarme las cosas—, y dijo en tono de cierta disculpa:</P>
<P ALIGN="JUSTIFY">— Es que no siempre puedo estar en la misma l&iacute;nea del pentagrama, mi vida es as&iacute;. A veces te encuentras alteraciones, sostenidos, bemoles...</P>
<P ALIGN="JUSTIFY">— ...Becuadros... (complet&eacute; yo, haciendo ver que comprend&iacute;a su posici&oacute;n)</P>
<P ALIGN="JUSTIFY">— Eso, becuadros... (asinti&oacute; ella para reforzar el entendimiento, aunque no pensaba mencionar el becuadro, ¡ah, si todo fuese tan f&aacute;cil como los becuadros!) y tengo que situarme un poco m&aacute;s arriba o m&aacute;s abajo, aunque no quiera. Aunque s&oacute;lo sea durante un comp&aacute;s.</P>
<P ALIGN="JUSTIFY">Roto el hielo, iba por fin a atacar todo aquel monolito que guardaba en mi interior, todas las cosas que quer&iacute;a explicarle a Heather y no hab&iacute;a sabido, el porqu&eacute; de mi comportamiento hurtando los cartones... Y en aquel momento, precisamente, entr&oacute; en la habitaci&oacute;n mi sobrino preferido, preguntando si estaba all&iacute; no s&eacute; qu&eacute; cosa. Puede que un cintur&oacute;n. Heather tuvo la delicadeza de poner mi cabeza mirando hacia la puerta para que pudiese ver qui&eacute;n entraba, ella nunca recordaba que no era necesario, que yo no ve&iacute;a por esos ojos. Ante aquella interrupci&oacute;n, me enfurec&iacute;, y le grit&eacute; a mi sobrino: ¡Pero c&oacute;mo va a estar aqu&iacute;! ¿Por qu&eacute; tienes t&uacute; que entrar en esta habitaci&oacute;n, si aqu&iacute; s&oacute;lo hay cosas m&iacute;as? Est&aacute;s interrumpiendo, ¡l&aacute;rgate!</P>
<P ALIGN="JUSTIFY">Mi sobrino se fue, no sin antes dirigirme un gesto de desprecio o de burla, a buscar su cintur&oacute;n a otro sitio. ¡Pero cierra la puerta!, le grit&eacute;. Como ya se hab&iacute;a ido, fue Heather quien se levant&oacute; a cerrar. Cuando se sent&oacute; de nuevo, las cosas estaban tan dif&iacute;ciles como antes del comienzo.</P>
<P ALIGN="JUSTIFY">Hab&iacute;a que romper el hielo de nuevo, por otro sitio. Yo decid&iacute; traspasar la pelota al campo de Heather, como si fuese ella quien hubiese empezado a sincerarse, cuando en realidad hab&iacute;a sido exactamente al rev&eacute;s:</P>
<P ALIGN="JUSTIFY">— Bueno, yo entiendo lo de las alteraciones, entiendo que no lo tienes nada f&aacute;cil. Entiendo que siempre tengas que estar muy alerta para que te encuentren en tu sitio en el momento en que te reclamen. Pero para m&iacute; tampoco es f&aacute;cil llevarme bien contigo.</P>
<P ALIGN="JUSTIFY">— S&iacute;, ya s&eacute; que es as&iacute;, pero no puedo evitarlo. Espero que me perdones, pero ya sabes que no est&aacute; en mi mano. Sin embargo, eso no justifica las travesuras en que te metes siempre. Por ejemplo, esto de los cartones. No acabo de entenderlo. ¿Quieres hablar de ello? ¿Por qu&eacute; te comportas de un modo tan extra&ntilde;o?</P>
<P ALIGN="JUSTIFY">Bueno, hab&iacute;a ca&iacute;do en la trampa, al menos a medias, y me hab&iacute;a dado pie para continuar hablando. Me encog&iacute; de hombros con la vista en el suelo, suspir&eacute;... Creo que esto ya lo hab&iacute;a hecho antes de sentarnos, pero no importaba. Heather acariciaba mi pelo, o mejor, el pelo de mi cabeza, que hab&iacute;a adoptado una expresi&oacute;n de placidez entre sus manos. En aquel momento la envidi&eacute;, dese&eacute; que no se separase tan f&aacute;cilmente, y que en realidad Heather me estuviese acariciando a m&iacute;, y yo tuviese mi cabeza apoyada en su regazo, y el resto de mi cuerpo estuviese a continuaci&oacute;n del cuello. Aquello habr&iacute;a facilitado las cosas. Heather me miraba a los ojos, aunque lo cierto es que no s&eacute; c&oacute;mo sab&iacute;a con tal exactitud d&oacute;nde estaban, puesto que mi cabeza visible la ten&iacute;a ella.</P>
<P ALIGN="JUSTIFY">— Mira, Heather, yo... (Heather hab&iacute;a cerrado mal la puerta de la habitaci&oacute;n, y aunque normalmente eso me pone furioso, no es as&iacute; cuando quien cierra mal es Heather) ...Yo no s&eacute; c&oacute;mo decirte esto... Resulta que hace tiempo vi por casualidad unos dibujos muy tenues, que... (La puerta, que siempre hab&iacute;a estado mal equilibrada, comenz&oacute; a abrirse poco a poco) ...que alguien debi&oacute; de hacer con un l&aacute;piz bastante duro, posiblemente del cuatro... Sabes, ser amigo de una nota es maravilloso, pero a veces tambi&eacute;n le hace a uno sentirse un poco confuso, o desatendido... (La puerta ya estaba totalmente abierta) ...Espero que tus jefes no te culpen de la falta de los cartones, pero bueno, seguramente saben que fui yo quien se los llev&oacute;, y cuando los devuelvas, incluso se sentir&aacute;n contentos contigo... (Empec&eacute; a darme cuenta de que Heather no comprend&iacute;a nada, y la verdad, yo no estaba consiguiendo explicarme tampoco con gran fluidez) ...Yo... (As&iacute; no iba a ninguna parte) ...Yo...Es que yo...</P>
<P ALIGN="JUSTIFY">R&aacute;pidamente, lanc&eacute; mi mano hacia los cartones, para cogerlos y salir corriendo. Incluso consegu&iacute; hacerme con ellos, pero Heather, que es extraordinariamente &aacute;gil, lleg&oacute; antes a la puerta y la cerr&oacute; ante m&iacute;, poni&eacute;ndose delante. No me dio tiempo a frenar, y todos mis kilos se fueron contra ella con un ¡Blam! de la puerta, convirti&eacute;ndola en un bocadillo humano. Los cartones se me cayeron, y ella dijo ¡Ay! Un poco avergonzado por haberla espachurrado, y conociendo su apariencia fr&aacute;gil, d&iacute; un paso atr&aacute;s y le dije: ¿Est&aacute;s bien? Ella sac&oacute; entonces su adorable genio de ni&ntilde;o orgulloso, y dijo, mientras se colocaba la ropa y el pelo: ¡Pues claro que estoy bien!,¿qu&eacute; te crees? Anda, dame esos cartones, voy a llevarlos a su sitio antes de que sigas haciendo el idiota. Seguiremos hablando m&aacute;s tarde.</P>
<P ALIGN="JUSTIFY">Yo recog&iacute; mi cabeza, que se hab&iacute;a quedado en el centro de la habitaci&oacute;n con expresi&oacute;n de sorpresa, y la puse en su lugar. Mientras, Heather recogi&oacute; los cartones y se fue —yo ten&iacute;a esperanza de que se le despistara el cart&oacute;n que qued&oacute; casi totalmente bajo el armario, pero ni por esas, ¡menudo lince es!—. Estaba como siempre, arrepinti&eacute;ndome de no haber elegido las palabras adecuadas, cuando de repente me entraron unas ganas locas de re&iacute;r. ¡Pobre Heather, cuando la aplast&eacute; contra la puerta parec&iacute;a un pollo mareado! Despu&eacute;s de todo, me hab&iacute;a quedado sin cartones, pero aquel apret&oacute;n con Heather hab&iacute;a merecido la pena. Y no lo cambio por nada del mundo.</P>
<P ALIGN="RIGHT"><I>Eduardo Manostijeras Evidentemente</I></P>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisa.htm"><font FACE="ARIAL"><B>[Ficci&oacute;n]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







