<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>icci&oacute;n</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:auryn@retemail.es">Alejandro Santacreu "Auryn"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
El Caballo en el Establo
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">He dormido mal, francamente mal. Ayer anunciaron tormenta, alerta B dijeron, debido al aparato el&eacute;ctrico si no recuerdo mal. Empez&oacute; all&aacute; a las cuatro de la ma&ntilde;ana, las puertas temblaban al comp&aacute;s de las ventanas haciendo imposible cualquier sue&ntilde;o o descanso.</P>
<P ALIGN="JUSTIFY">Me levant&eacute; y tom&eacute; un valium, ahora me arrepiento, siempre me pasa lo mismo cuando lo tomo, me hundo en el m&aacute;s profundo de los descansos y cuando logro despertarme paso unos minutos interminables en el umbral de la vigilia.</P>
<P ALIGN="JUSTIFY">A&uacute;n no tengo tacto sensible, noto las s&aacute;banas punzantes bajo mi espalda, tampoco el olfato responde a la realidad, me llegan olores demasiado intensos que no logro distinguir.</P>
<P ALIGN="JUSTIFY">Comienzo a mover los p&aacute;rpados, ¡Ah, por fin! S&oacute;lo es una mancha desenfocada y tenue pero ya es algo. </P>
<P ALIGN="JUSTIFY">La imagen se aclara cobrando nitidez a medida que los sentidos se agudizan, ahora la mancha oscura se ve alargada, jurar&iacute;a que estriada. ¡Se mueve! Es un balanceo, desde luego no es la l&aacute;mpara de mi dormitorio. Ha desaparecido, no s&eacute; d&oacute;nde…</P>
<P ALIGN="JUSTIFY">¡Qu&eacute; golpe! Casi un latigazo, mi cuerpo responde ante la agresi&oacute;n y consigo erguirme, me tambaleo y caigo en un mullido colch&oacute;n que tampoco es el m&iacute;o.</P>
<P ALIGN="JUSTIFY">La realidad palpable de un establo, acude a mi mente en tropel: olor animal, montones de heno esparcidos y otros ordenados en grandes pacas al fondo, vigas de madera formando el esqueleto, s&oacute;lida estructura sin duda.</P>
<P ALIGN="JUSTIFY">En medio reina la apacible silueta de un corcel blanco, propietario de la ondulada mancha alargada que acab&oacute; por despertarme: su cola, contrasta con su color oscuro, casi negro, frente al blanco marfil del resto del cuerpo. </P>
<P ALIGN="JUSTIFY">La sombra del valium pesa sobre mi mente impidiendo el paso a los pensamientos racionales, no s&eacute; si es un sue&ntilde;o pero no estoy en condiciones de negarlo, sue&ntilde;o o ¿realidad?, debo despertarme completamente para averiguarlo.</P>
<P ALIGN="JUSTIFY">Tengo que salir, este olor penetrante me aturde, el aroma intenso y concentrado del heno me emborracha.</P>
<P ALIGN="JUSTIFY">Busco una salida, me acerco a lo que parece la puerta y corro el travesa&ntilde;o de madera, empujando con todas mis fuerzas apenas si consigo que la madera cruja. </P>
<P ALIGN="JUSTIFY">¡Idiota! La puerta se abre hacia dentro, ahora s&iacute;.</P>
<P ALIGN="JUSTIFY">No diviso el Sol, pero es de d&iacute;a. Debe de estar amaneciendo a mis espaldas.</P>
<P ALIGN="JUSTIFY">Tambale&aacute;ndome bajo los efectos de la droga salgo al exterior para contemplar un espl&eacute;ndido paisaje. Verdes campos, humedecidos por el roc&iacute;o se extienden infinitos ante m&iacute;. Doy un traspi&eacute;s y comienzo a rodar ladera abajo. Me levanto aturdido y consigo divisar al fondo una forma angulosa que recuerda vagamente a un tejado. La colina lateral a la del establo es m&aacute;s alta, asciendo por su falda con la esperanza de divisar con mayor claridad la estructura. Poco a poco, a medida que voy subiendo, va dibuj&aacute;ndose la forma de un palacete que se encuentra a unos quinientos metros. Dos o tres pisos y con una gran base posee enormes ventanales orientados al Sol que comienza a arrancarles cegadores destellos.</P>
<P ALIGN="JUSTIFY">Surgida de la nada veo avanzar hacia m&iacute; a una mujer ataviada con un recargado vestido de terciopelo, o quiz&aacute;s sea otra tela pesada, con ese estilo y corte t&iacute;pico de las pel&iacute;culas del medievo; aunque si lo miro bien este atuendo tiene algo de sideral, exageradas hombreras azul marino de corte vertical y pu&ntilde;os dorados vueltos hacia arriba contribuyen a esta opini&oacute;n.</P>
<P ALIGN="JUSTIFY">No distingo bien el rostro, oculto bajo el reborde colgante de un lujoso parasol, pero las formas y el movimiento delatan a una mujer entrada en a&ntilde;os no obstante libre de achaques, la cadencia de sus andares a&uacute;n conserva agilidad y determinaci&oacute;n demostradas a cada paso.</P>
<P ALIGN="JUSTIFY">Pasa por mi lado y no parece reparar en mi presencia.</P>
<P ALIGN="JUSTIFY">— ¡Ejem! Perd&oacute;n se&ntilde;ora, sabr&iacute;a decirme si…</P>
<P ALIGN="JUSTIFY">La mujer se gira sobresaltada. Su brusco movimiento me hace retroceder tropezando con una piedra que no hab&iacute;a visto, yo sentado semiaturdido y ella mir&aacute;ndome con ojos desorbitados y saltones que resaltan sus numerosas arrugas, ahora visibles, d&aacute;ndole a su rostro un aspecto demacrado. El parasol ca&iacute;do al suelo rueda tranquilamente en medio de la tensa escena. Todo su cuerpo tiembla y la respiraci&oacute;n se percibe entrecortada con ritmo creciente.</P>
<P ALIGN="JUSTIFY">Se para, as&iacute;, de repente, ni ojos en blanco ni suspiro de desmayo, literalmente tiesa. Con gestos tranquilos me acerco a ella lentamente, su mirada perdida no me sigue, sin aproximarme ni un solo cent&iacute;metro m&aacute;s de lo necesario le doy un golpecito en el hombro, quiz&aacute;s as&iacute; reaccione. Pero no, simplemente se mueve un poco y finalmente sus rodillas se desbloquean dej&aacute;ndola caer haciendo el mismo ruido que har&iacute;a un saco de huesos si pudiera desmayarse.</P>
<P ALIGN="JUSTIFY">Ahora ya no cabe duda, una situaci&oacute;n tan disparatada solo puede ser fruto de un sue&ntilde;o.</P>
<P ALIGN="JUSTIFY">Como desconozco el terreno en el que me muevo y ni en sue&ntilde;os como este optar&iacute;a por hacer la respiraci&oacute;n artificial a semejante adefesio centenario, opto por cogerla en brazos y llevarla hacia el palacete de donde sin duda procede.</P>
<P ALIGN="JUSTIFY">Caminados los cientos de metros que nos separaban de la entrada, bajo a la se&ntilde;ora de mis brazos sosteni&eacute;ndola de pi&eacute; con un brazo al tiempo que con el otro llamo a la aldaba.</P>
<P ALIGN="JUSTIFY">Pasados unos segundos sin respuesta vuelvo a coger a la se&ntilde;ora en brazos para buscar una entrada accesible. Dando un gran rodeo llego a la parte trasera del palacio, all&iacute; se hallan levantadas peque&ntilde;as casas de madera desperdigadas sin orden aparente, aproximadamente una veintena.</P>
<P ALIGN="JUSTIFY">Busco una entrada secundaria y la encuentro, la puerta trasera de lo que tiene toda la pinta de ser las cocinas, entro confiado, sin temor alguno voy investigando numerosas salas, todas vac&iacute;as, completamente deshabitas por todo mueble o adorno, empiezo a creer que este sitio est&aacute; abandonado.</P>
<P ALIGN="JUSTIFY">Por fin alcanzo una estancia de techo doble, con grandes estanter&iacute;as llenas de libros por todo adorno aparte de un par de sillones victorianos. No tengo que pensarlo, tumbo a la se&ntilde;ora en uno y yo me dejo caer en el otro invadido por una sensaci&oacute;n desagradable de interminable cansancio. Poco a poco el sue&ntilde;o se va apoderando de m&iacute;.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Casi de forma involuntaria me levanto corriendo en direcci&oacute;n al cuarto de ba&ntilde;o.</P>
<P ALIGN="JUSTIFY">El espejo me devuelve un yo sucio de tierra y con manchas verdes de hierba en el pijama.</P>
<P ALIGN="JUSTIFY">De forma compulsiva me lavo la cara y con miedo me voy quitando la toalla de la cara con la esperanza de que el reflejo sea otro.</P>
<P ALIGN="JUSTIFY">La cara se ve limpia pero las manchas me gritan acusadoras su presencia desde la tela.</P>
<P ALIGN="JUSTIFY">Vuelvo corriendo al dormitorio, pero todo esta en orden, solo yo me siento fuera de lugar.</P>
<P ALIGN="JUSTIFY">El reloj de pulsera indica las 8:20, poco tiempo para vestirse y llegar al trabajo. Sin pensarlo me desvisto y visto con el traje de dependiente, vuelvo al aseo sin mirar al espejo, con terror descubro como en el peine van quedando atrapados peque&ntilde;os retales de heno.</P>
<P ALIGN="JUSTIFY">En una exhalaci&oacute;n salgo del piso y voy a por el coche, algo no cuadra, en realidad nada me cuadra.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Aprovecho el descanso de las dos y media para acudir al lavabo de empleados, echo el cerrojo de la puerta e intento relajar el pulso que toda la ma&ntilde;ana se ha mantenido al borde del infarto, taquicardia absoluta. Mi rostro aparece descompuesto, casi irreconocible en una mueca seria de obsesionado jugador de p&oacute;quer, intento sonre&iacute;r pero no puedo... no puede ser, ¡s&iacute; sonr&iacute;o! Pero el espejo no me devuelve la imagen de mi gesto forzado, mi yo del espejo se separa del fondo del lavabo acerc&aacute;ndose a la superficie del espejo. </P>
<P ALIGN="JUSTIFY">— ¿Asustado? — yo mismo me hablo desde el espejo.</P>
<P ALIGN="JUSTIFY">— ¡¿Qu&eacute;?! — mi voz suena lejana y agrietada por el miedo.</P>
<P ALIGN="JUSTIFY">— Duerme.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Casi de forma involuntaria me levanto corriendo en direcci&oacute;n al cuarto de ba&ntilde;o.</P>
<P ALIGN="JUSTIFY">El espejo me devuelve un yo limpio de tierra y sin manchas verdes de hierba en el pijama.</P>
<P ALIGN="JUSTIFY">De forma compulsiva me lavo la cara y con miedo me voy quitando la toalla de la cara con la duda de que el reflejo quiz&aacute;s vuelva a ser otro.</P>
<P ALIGN="JUSTIFY">La cara se ve limpia y las manchas ya no me gritan acusadoras su presencia desde la tela.</P>
<P ALIGN="JUSTIFY">Vuelvo corriendo al dormitorio, todo esta en orden, s&oacute;lo yo sigo sinti&eacute;ndome fuera de lugar.</P>
<P ALIGN="JUSTIFY">El reloj de pulsera indica las 8:20, poco tiempo para vestirse y llegar al trabajo. Sin pensarlo me desvisto y visto con el traje de dependiente, vuelvo al aseo, el de mi apartamento, y miro el espejo con la confianza de que ya no hay nada que temer de mi reflejo, pero la mueca seria e inexpresiva vuelve a estar all&iacute;, retrocedo, la sangre se congela en mis venas y mi cerebro yace dentro del cr&aacute;neo, completamente destrozado.</P>
<P ALIGN="JUSTIFY">— ¿Asustado? — es exactamente la misma voz del aseo del trabajo, solo que ahora la mueca inexpresiva se corva hasta alcanzar una sonrisa siniestra. </P>
<P ALIGN="JUSTIFY">—¿Qu&eacute;…, qu&eacute; es esto? ¿Es un sue&ntilde;o verdad? ¡Es un sue&ntilde;o! — grito hist&eacute;rico.</P>
<P ALIGN="JUSTIFY">En una exhalaci&oacute;n salgo del piso y me voy a por el coche, algo no cuadra, en realidad nada me cuadra.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Son las dos y media y el aseo del trabajo me llama, ese espejo maldito me chilla que acuda y yo camino hacia la puerta del servicio queri&eacute;ndolo sin desearlo. No puedo enfrentarme a esto, me voy a volver loco si es que no lo estoy ya. Toda la ma&ntilde;ana se ha vuelto a repetir, incluso ahora estoy caminando de nuevo hacia esa puerta que ahora me espanta. Los clientes los adivinaba antes de que entraran, ya es la segunda vez y los mismos individuos acuden a mi mostrador como si la "otra" ma&ntilde;ana, no hubiera existido jam&aacute;s. Lo &uacute;nico diferente es que jurar&iacute;a haber adivinado una sonrisa id&eacute;ntica a la del espejo del apartamento en los rostros de los clientes al marcharse. </P>
<P ALIGN="JUSTIFY">He llegado a la puerta, mi mano gira el pomo y entro, la saliva se petrifica en mi garganta impidi&eacute;ndome tragar, los m&uacute;sculos agarrotados me hacen girar. El espejo de nuevo frente a m&iacute; pero por fin yo mismo en el espejo, tal y como debe ser. </P>
<P ALIGN="JUSTIFY">No se porque pero la tranquilidad me invade al volver a verme en el espejo. Me apoyo suspirando en la pared retirando tranquilo la mirada.</P>
<P ALIGN="JUSTIFY">— No cantes victoria.</P>
<P ALIGN="JUSTIFY">La voz sarc&aacute;stica empotra todo mi ser en un violento impacto, arrinconado al fondo de la consciencia. Mi cuello gira instant&aacute;neamente en una sacudida y esa imagen terror&iacute;fica m&iacute;a, la sonrisa siniestra y la mirada torva, me contemplan desde el plano del espejo.</P>
<P ALIGN="JUSTIFY">— No hay salida, no hay salida, no hay salida… </P>
<P ALIGN="JUSTIFY">La voz ya conocida y temida nace involuntariamente del interior de mi materia gris, dentro de m&iacute; percibo como abre la caja de mis miedos y sin poder evitarlo recoge mis pensamientos acariciando con malicia el codiciado objeto de su b&uacute;squeda, su ser envuelve el miedo que siento hacia &eacute;l y lo ingiere vorazmente consiguiendo as&iacute; que renazca para poder engullirlo en mayor cantidad cerrando un c&iacute;rculo infernal. Mi miedo hacia &Eacute;l se deforma y se ensancha hasta aturdirme transform&aacute;ndome en un zumbido agudo y fr&aacute;gil que acaba por crujir y despedazarse.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Como si no hubiera respirado jam&aacute;s el aire de una gran bocanada llena mis pulmones.</P>
<P ALIGN="JUSTIFY">He vuelto a la biblioteca de los sillones victorianos, la se&ntilde;ora del traje estrafalario se despereza sacudi&eacute;ndose su desmayo con un r&aacute;pido movimiento de cabeza. Abre los ojos y me mira inexpresiva, se levanta y ahora su voz si delata el miedo que valientemente ha conseguido que sus ojos no trasmitan.</P>
<P ALIGN="JUSTIFY">— ¡T&uacute;! ¡Eres t&uacute;, demonio! ¡M&aacute;tame! ¿Has venido a eso, no? ¡Adelante!</P>
<P ALIGN="JUSTIFY">— ¿C&oacute;mo? — nunca he matado ha nadie, ¿qu&eacute; inter&eacute;s tendr&aacute; esta se&ntilde;ora en que cambie esa buena costumbre?</P>
<P ALIGN="JUSTIFY">— ¡No me enga&ntilde;as, eres t&uacute;, estoy segura! ¡Ni el tiempo infinito me har&iacute;a olvidar esa mirada!.</P>
<P ALIGN="JUSTIFY">— Creo que me confunde con otra persona, yo no quiero matar a nadie. – "desde luego que no", pens&eacute;.</P>
<P ALIGN="JUSTIFY">La vieja muda la expresi&oacute;n temerosa de sus ojos hacia un sentimiento total de confusi&oacute;n.</P>
<P ALIGN="JUSTIFY">— Ver&aacute;, yo no s&eacute; que hago aqu&iacute;, solo tom&eacute; un valium, me despert&eacute;, usted se desmay&oacute;, yo me dorm&iacute;, y… ¡todo es tan confuso!</P>
<P ALIGN="JUSTIFY">¡El espejo! Su recuerdo se hab&iacute;a esfumado al volver a la biblioteca para volver ahora evocado por mi memoria.</P>
<P ALIGN="JUSTIFY">— ¡No! —grito — ¡Esto no puede ser!</P>
<P ALIGN="JUSTIFY">Camino hacia la anciana y la sacudo por los hombros.</P>
<P ALIGN="JUSTIFY">— ¿Qu&eacute; pasa? ¡D&iacute;gamelo! — no pudiendo soportar la incertidumbre ni un segundo m&aacute;s.</P>
<P ALIGN="JUSTIFY">Su rostro se relaja para adoptar una expresi&oacute;n compasiva de eterna comprensi&oacute;n.</P>
<P ALIGN="JUSTIFY">— ¡Oh, perdona! Lo siento por ti eres nuevo y acabas de llegar, te ha tra&iacute;do &Eacute;l, pero… ¡Te pareces tanto! Quiz&aacute;s… </P>
<P ALIGN="JUSTIFY">— ¡Usted tambi&eacute;n! ¿Verdad? ¡¿Por qu&eacute; no habla de forma que yo pueda entenderla?! ¿Qui&eacute;n es &Eacute;l, es el del espejo? </P>
<P ALIGN="JUSTIFY">— S&iacute;. — s&oacute;lo su afirmaci&oacute;n bast&oacute; para derrotarme, ahora era yo qui&eacute;n se desmayaba presa del desconcierto y de ese miedo que ya me sab&iacute;a viejo.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">De nuevo en el lavabo del trabajo, sentado en el suelo apoyado en la pared, si solo me atreviera a mirarme en el espejo descubrir&iacute;a, si es que no est&aacute; &Eacute;l, lo descompuesto de mi rostro. Demasiadas emociones en muy poco tiempo. Noto como una nausea sube por las paredes del es&oacute;fago y se derrama en mi boca. El mareo engendra sensaciones deformadas, toda la habitaci&oacute;n se tambalea como un barco en alta mar y a cada oleada se me hace m&aacute;s dif&iacute;cil enfocar la mirada. De nuevo la inconsciencia.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Odio, odio hacia &Eacute;l. Despu&eacute;s de desmayarme en el lavabo vuelvo a este sal&oacute;n, junto a la vieja. Ahora la nausea me ha abandonado y por primera vez desde que empez&oacute; todo me siento completamente despierto. Sin titubear pregunto.</P>
<P ALIGN="JUSTIFY">— ¿&Eacute;l me necesita o solo quiere torturarme?</P>
<P ALIGN="JUSTIFY">— Yo soy tu cordura, lo &uacute;nico real que puedas palpar aqu&iacute;…</P>
<P ALIGN="JUSTIFY">— ¿D&oacute;nde es "aqu&iacute;"? — interrumpo.</P>
<P ALIGN="JUSTIFY">— Aqu&iacute; es tu mente…</P>
<P ALIGN="JUSTIFY">— Entonces esto solo es un sue&ntilde;o, nada tengo que temer ¿No?</P>
<P ALIGN="JUSTIFY">— S&iacute; y no, nunca nadie ha podido viajar dentro de su propia mente sin que yo le abandonara, el tuyo es un caso especial.</P>
<P ALIGN="JUSTIFY">— No... no ent... </P>
<P ALIGN="JUSTIFY">— T&uacute; eres, o mejor dicho te sostienes gracias a la conciencia, normalmente solo puedes adivinarme vagamente en algunos sue&ntilde;os especiales que "vosotros" ten&eacute;is en contadas ocasiones.</P>
<P ALIGN="JUSTIFY">— ¿No me has dicho que esto no es un sue&ntilde;o?.</P>
<P ALIGN="JUSTIFY">— S&iacute; y no te repito, es un sue&ntilde;o imposible, esc&uacute;chame bien, t&uacute; tienes unos estados de consciencia d&eacute;bil debido a que hace muchos a&ntilde;os mi complemento, la locura, se separ&oacute; de m&iacute; y desde entonces yo me he ido debilitando. El hecho de que t&uacute; consciencia sea la que te mantenga unido al mundo real hace que al debilitarse &eacute;sta tu caigas aqu&iacute;, en la inconsciencia.</P>
<P ALIGN="JUSTIFY">— No entiendo nada — la nausea le estaba volviendo.</P>
<P ALIGN="JUSTIFY">— Esa nausea que sientes yo tambi&eacute;n la noto porque formo parte de ti y porque es mi complemento el que la provoca, no soporta vivir sin m&iacute; y quiere acabar contigo para terminar con esta situaci&oacute;n.</P>
<P ALIGN="JUSTIFY">— ¡Que me importa morir si estoy loco!</P>
<P ALIGN="JUSTIFY">— ¡No, no debes decir eso! Piensa que yo no solo soy tu cordura sino que soy com&uacute;n al resto de las personas que habitan este mundo, sin nosotros, es decir: la consciencia y la inconsciencia, la cordura y la locura, el mundo dejar&iacute;a de existir para vosotros, caer&iacute;ais en el infierno de la locura donde &Eacute;l reina.</P>
<P ALIGN="JUSTIFY">— De acuerdo... pero yo s&oacute;lo quiero despertar... o volver – el cansancio me invade.</P>
<P ALIGN="JUSTIFY">— Debes pensar en esto como en un mecanismo, si una rueda se para ya nada funciona. T&uacute; estabas arriba sostenido en el espacio real por t&uacute; d&eacute;bil consciencia, cedi&oacute; desestabilizada por la separaci&oacute;n de mi complemento, la locura, dej&aacute;ndote caer en la inconsciencia permanente, el campo en el que todos convivimos sin saberlo, t&uacute; sigues existiendo porque yo todav&iacute;a tengo fuerzas para mantenerte cuerdo y alejado de &Eacute;l, pero cuando estas fuerzas me fallen absorbidas por las suyas t&uacute; te unir&aacute;s a &Eacute;l haci&eacute;ndole m&aacute;s poderoso y permitiendo a la locura reinar en este campo, el de la inconsciencia, com&uacute;n a todas las personas.</P>
<P ALIGN="JUSTIFY">— Entonces, si todo esto es un "campo" como t&uacute; has dicho ¿Qu&eacute; es este palacio?</P>
<P ALIGN="JUSTIFY">— Forman parte de m&iacute; y de ti, simboliza tu mente, las habitaciones vac&iacute;as que has visto son apartados que han muerto con mi flaqueza y las chozas de fuera son tus recuerdos, vestigios de tu consciencia maltrecha, debes ir con &Eacute;l y hacer que vuelva conmigo, de esta forma yo podr&eacute; elevarte de nuevo a la realidad reparando la tela de tu consciencia.</P>
<P ALIGN="JUSTIFY">— No entiendo como puedo lograrlo.</P>
<P ALIGN="JUSTIFY">— Ve hacia &Eacute;l, intentar&aacute; entrar en ti y t&uacute; deber&aacute;s resistir su ataque lo suficiente como para que &Eacute;l se convenza de que no esta todo acabado, que no tiene que destruirte, debes hacerle comprender que el reinar en soledad le consumir&aacute; a &Eacute;l igual que a m&iacute;, entonces yo podr&eacute; aprovechar la ocasi&oacute;n para unirnos de nuevo.</P>
<P ALIGN="JUSTIFY">— Sigo sin comprender como puedo acercarme, le temo.</P>
<P ALIGN="JUSTIFY">— El caballo en el establo representa tu valor, el veh&iacute;culo, monta en &eacute;l para volver a la realidad, el te esperar&aacute; en el espejo, es importante que tus miedos no te acompa&ntilde;en en el viaje de vuelta porque te convertir&iacute;an en un v&iacute;nculo por el que acceder a m&iacute;, tu posees la llave que mantiene cerrada la puerta, esa llave es el valor que no debe arrebatarte en el enfrentamiento, yo solo puedo defenderme a trav&eacute;s de ti, no puedo encararme con &Eacute;l hasta que no le hayas preparado para la uni&oacute;n, de lo contrario me destruir&iacute;a.</P>
<P ALIGN="JUSTIFY">Carente de toda consciencia no puedo recapacitar sobre lo que me rodea, me dirijo hacia el establo ni voluntaria ni involuntariamente, simplemente me desplazo impulsado por mi vieja cordura que ahora noto a mi alrededor, ha cambiado su manifestaci&oacute;n de anciana por otra inmaterial que me envuelve d&aacute;ndome seguridad a cada paso que me acerca al establo.</P>
<P ALIGN="JUSTIFY">Abro la puerta, el caballo se encuentra ante m&iacute;, tranquilo. Lo monto e instant&aacute;neamente me encuentro fuera, galopando hacia mi destino, mi gesta por recuperar el orden en el Universo del pensamiento humano. </P>
<P ALIGN="JUSTIFY">Un rayo me deslumbra, cuando por fin puedo abrir los ojos, contemplo como un caballo id&eacute;ntico al que monto se aproxima hacia m&iacute;, siento una sensaci&oacute;n de inseguridad a mis espaldas, me habla del temor haci&eacute;ndome apretar las manos a la crin del caballo para impedir que siga acerc&aacute;ndome a ese "otro" caballo que he comenzado a temer.</P>
<P ALIGN="JUSTIFY">— Es el miedo del que te habl&eacute;, &Eacute;l lo env&iacute;a para poder alcanzarnos a los dos, d&eacute;jalo atr&aacute;s, ign&oacute;ralo, si no existe en ti no podr&aacute; — es la cordura susurr&aacute;ndome desde el interior.</P>
<P ALIGN="JUSTIFY">Aflojo la tensi&oacute;n de mis manos sobre las crines hincando simult&aacute;neamente los talones en los costados del caballo el cual resopla y redobla su esfuerzo. Expulso de m&iacute; esa sensaci&oacute;n de miedo y encaro el caballo que hacia nosotros se aproxima, descubro que en realidad es nuestro reflejo en una infinita pared de cristal que pone fin a los campos de la inconsciencia. En un instante nos fundimos sinti&eacute;ndome catapultado hacia la realidad.</P>
<P ALIGN="CENTER">* * * * *</P>
<P ALIGN="JUSTIFY">Estoy de pie en el aseo del trabajo, tranquilo, mirando la pared que se encuentra frente al espejo. Me siento perfectamente, la cordura flota en m&iacute; record&aacute;ndome m&iacute; misi&oacute;n.</P>
<P ALIGN="JUSTIFY">— Es el momento — su voz me infunde valor reforzando mi defensa.</P>
<P ALIGN="JUSTIFY">En un movimiento giro mi cuerpo enfrent&aacute;ndome al espejo. &Eacute;l est&aacute; ah&iacute; con su sonrisa y su mirada perdida pero esta vez no me asusta, el miedo no est&aacute; conmigo. Permanecemos inm&oacute;viles durante un inacabable momento.</P>
<P ALIGN="JUSTIFY">Se abalanza sobre m&iacute; atravesando el espejo, penetrando en el mundo real, el miedo vuelve con &Eacute;l y yo siento como empieza a infiltrarse por mi piel.</P>
<P ALIGN="JUSTIFY">— ¡Resiste, no es real…! — grita la cordura.</P>
<P ALIGN="JUSTIFY">Su grito me devuelve el valor expulsando el miedo que hab&iacute;a comenzado a penetrar, ahora soy yo quien le empujo dentro del espejo d&aacute;ndome cuenta de que en realidad nunca sali&oacute; de all&iacute; porque la cordura no me dej&oacute; creerlo. Su sonrisa se descompone, su expresi&oacute;n sarc&aacute;stica se borra y justo en ese instante siento como la cordura tiende un puente hacia el espejo fusion&aacute;ndose en &Eacute;l y con &Eacute;l, recuperando la unidad perdida. </P>
<P ALIGN="JUSTIFY">Ahora una mujer joven me contempla desde el espejo inexpresiva.</P>
<P ALIGN="JUSTIFY">— Gracias, has encontrado la salida, ahora, despierta…&#9;</P>
<P ALIGN="JUSTIFY">Es lo &uacute;ltimo que o&iacute; antes de encontrarme mirando la l&aacute;mpara de mi dormitorio. Me levanto y miro por la ventana viendo como la vida hormiguea sobre el asfalto, gente entrando y saliendo de los comercios, ni&ntilde;os con sus mochilas acudiendo al colegio, unos obreros reparando un poste derribado por la tormenta nocturna y yo sinti&eacute;ndome mejor que nunca invadido por un bienestar que inconscientemente me sabe a cordura.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisa.htm"><font FACE="ARIAL"><B>[Ficci&oacute;n]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







