<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>iencia-ficci&oacute;n</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fern&aacute;ndez "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Futuro Imperfecto.<br>
Cap&iacute;tulo 1. Noche de Viernes.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Era una noche como otra cualquiera. Las luces de la ciudad creaban fantasmales sombras de colores al colarse por las rendijas de la persiana, pero Ra&uacute;l no pod&iacute;a darse cuenta de ello, absorto como estaba ante la pantalla de su terminal. Como todos los d&iacute;as, m&aacute;s o menos a esta hora, estaba conversando con sus compa&ntilde;eros en uno de los nuevos espacios virtuales de recreo de MundoNet.</P>
<P ALIGN="JUSTIFY">A Ra&uacute;l le gustaban mucho estos nuevos servicios de la red mundial, ya que le permit&iacute;an escoger entre m&uacute;ltiples representaciones de lugares que hab&iacute;an existido en la realidad hac&iacute;a muchos a&ntilde;os. Hab&iacute;a visitado la ciudad de Roma en la &eacute;poca de esplendor del Imperio, la Grecia antigua y muchos otros pero, al final, el que m&aacute;s le hab&iacute;a atra&iacute;do era aqu&eacute;l en el que se encontraba ahora y que no dejaba de visitar a diario desde que lo descubriera unos meses atr&aacute;s. Era una hermosa reproducci&oacute;n de un poblado celta en las monta&ntilde;as del noroeste espa&ntilde;ol que, sin &eacute;l saber por qu&eacute;, le embargaba de sentimientos nost&aacute;lgicos. Que Ra&uacute;l supiera, nunca hab&iacute;a estado en lugar semejante, pero no pod&iacute;a evitar una sensaci&oacute;n de familiaridad cada vez que paseaba virtualmente por esos hermosos bosques.</P>
<P ALIGN="JUSTIFY">Durante sus estancias en estos parajes era el &uacute;nico momento del d&iacute;a en que se sent&iacute;a, aunque fuera m&iacute;nimamente, libre y a gusto. Poco a poco, se hab&iacute;a ido formando un peque&ntilde;o grupo de personas que, como Ra&uacute;l, disfrutaban de unos momentos de tranquilidad y animada conversaci&oacute;n en marco tan singular y, a los que, sin darse cuenta, empezaba a considerar amigos. Eran las primeras personas en su vida con las que compart&iacute;a algo m&aacute;s que una fugaz relaci&oacute;n de uno o dos d&iacute;as y, probablemente, los &uacute;nicos con los que hab&iacute;a sentido que encajaba. Ten&iacute;an esperanzas y sue&ntilde;os comunes y, al igual que Ra&uacute;l, encontraban que aquel bello paisaje mitigaba en parte esas inquietudes.</P>
<P ALIGN="JUSTIFY">Muchas veces, Ra&uacute;l no pod&iacute;a reprimir el deseo de conocerles en persona, aunque sab&iacute;a que esto era totalmente imposible. La red estaba monitorizada por las autoridades y no se permit&iacute;a intercambiar informaci&oacute;n privada entre los usuarios. Sab&iacute;a que los &uacute;nicos momentos que disfrutar&iacute;an juntos deb&iacute;an tener lugar en aquel paisaje virtual contenido en la memoria de qui&eacute;n sabe cu&aacute;l de los miles de nodos servidores de MundoNet que hab&iacute;a repartidos por todo el globo.</P>
<P ALIGN="JUSTIFY">Era viernes, eso lo sab&iacute;a, pero hac&iacute;a mucho que el d&iacute;a de la semana no significaba nada, que era solamente un nombre en un calendario. Ra&uacute;l no pod&iacute;a recordarlo, ya que a&uacute;n no hab&iacute;a nacido cuando el acontecimiento se produjo pero, como el resto de los chicos de su edad, lo hab&iacute;a estudiado en las clases de historia. Corr&iacute;a el a&ntilde;o 2025 cuando, en virtud de los nuevos avances tecnol&oacute;gicos en materia de rob&oacute;tica e inteligencia artificial, la mano de obra humana dej&oacute; de ser necesaria y, por tanto, fue abolido el trabajo. Por supuesto, no fue algo que se acometiera de la noche a la ma&ntilde;ana pero, paulatinamente, los &uacute;ltimos obreros fueron retirados de las f&aacute;bricas y reemplazados por sistemas automatizados de producci&oacute;n. Finalizada la tercera d&eacute;cada del siglo XXI todos los habitantes estaban en sus casas cobrando un salario sin tener que hacer nada para gan&aacute;rselo. El Estado se encargaba de que a nadie le faltara lo imprescindible. Se volvi&oacute; a un r&eacute;gimen socialista pero esta vez construido mediante la revoluci&oacute;n de la tecnolog&iacute;a, y no mediante la revoluci&oacute;n de las ideas.</P>
<P ALIGN="JUSTIFY">Por supuesto, los cient&iacute;ficos segu&iacute;an existiendo, pero salvo &eacute;stos, el resto de las profesiones hab&iacute;a desaparecido progresivamente. Incluso si alguien ten&iacute;a el deseo de dedicar su vida a la investigaci&oacute;n, no se trataba de una decisi&oacute;n personal. La &uacute;ltima Ley de Ordenamiento Educativo del a&ntilde;o 2047 cambi&oacute; profundamente los viejos m&eacute;todos de ense&ntilde;anza. Puesto que ya no era necesaria la especializaci&oacute;n profesional, todos los conocimientos que los j&oacute;venes adquir&iacute;an a partir de entonces se limitaban a la historia, lengua y muy b&aacute;sicas nociones de matem&aacute;ticas, f&iacute;sica y otras ciencias. Aquellos que demostraban cierta capacidad innata para el razonamiento abstracto eran observados de manera especial y, de &eacute;stos, s&oacute;lo los m&aacute;s brillantes eran elegidos para la carrera cient&iacute;fica. Todos los dem&aacute;s segu&iacute;an con la educaci&oacute;n normal hasta alcanzar la edad de la emancipaci&oacute;n, que se hab&iacute;a fijado en los 15 a&ntilde;os, momento a partir del cual se convert&iacute;an en civiles de pleno derecho y abandonaban las escuelas para vivir de forma independiente.</P>
<P ALIGN="JUSTIFY">Ra&uacute;l a&uacute;n pod&iacute;a recordar los d&iacute;as en que su abuelo le contaba historias de como era el mundo en el siglo XX, antes de aquella revoluci&oacute;n industrial que todo lo cambi&oacute;. Lo que m&aacute;s le fascinaba era cuando le hablaba de los tiempos m&aacute;s lejanos, cuando en la d&eacute;cada de los 80 su abuelo era tan joven como &eacute;l entonces y empez&oacute; a asistir al colegio. Le dec&iacute;a lo nervioso que se hab&iacute;a sentido ante sus nuevos compa&ntilde;eros y profesores, los juegos a los que se entregaban despreocupadamente en el recreo, en resumen, lo feliz que hab&iacute;a sido su infancia.</P>
<P ALIGN="JUSTIFY">Aunque por aquel entonces Ra&uacute;l contaba s&oacute;lo cinco a&ntilde;os de edad, recordaba esas conversaciones como si de ayer mismo se tratara. Qui&eacute;n le iba a decir a &eacute;l que, tan solo tres a&ntilde;os despu&eacute;s, en el fat&iacute;dico a&ntilde;o 2047, las autoridades vendr&iacute;an a buscarlo a casa y se lo llevar&iacute;an, como a tantos otros de su edad, a una de aquellas horribles escuelas, totalmente informatizadas y deshumanizadas...</P>
<P ALIGN="JUSTIFY">—Ra&uacute;l, ¿sigues ah&iacute;? —la voz de Elena, que proven&iacute;a del altavoz de su terminal, le sac&oacute; del ensimismamiento en que se encontraba.</P>
<P ALIGN="JUSTIFY">—S&iacute;, perdona, sigo aqu&iacute;. Estaba recordando.</P>
<P ALIGN="JUSTIFY">—¿Otra vez pensando en tu abuelo? —le dijo ella suavemente, tratando de no parecer curiosa, sino simplemente cordial.</P>
<P ALIGN="JUSTIFY">—Supongo que s&iacute;, &uacute;ltimamente pienso mucho en &eacute;l. Incluso he empezado a tener sue&ntilde;os en los que estamos juntos de nuevo, como cuando yo era ni&ntilde;o.</P>
<P ALIGN="JUSTIFY">—No deber&iacute;as dejar que eso te obsesione. Pertenece al pasado, y lo mejor que puedes hacer es tratar de olvidarlo —el tono de voz de Elena empezaba a demostrar preocupaci&oacute;n.</P>
<P ALIGN="JUSTIFY">—Tienes raz&oacute;n, pero creo que es m&aacute;s f&aacute;cil decirlo que hacerlo.</P>
<P ALIGN="JUSTIFY">En realidad, aquellos sue&ntilde;os se repet&iacute;an insistentemente desde hac&iacute;a meses, pero hasta ahora no hab&iacute;a reunido el valor para confes&aacute;rselo a Elena. La apreciaba mucho, y no quer&iacute;a cargarla con sus propios problemas. Si algo le hab&iacute;a ense&ntilde;ado esta sociedad era a no depender de nadie, a valerse por s&iacute; mismo en lo emocional. Ahora empezaba a pensar que quiz&aacute;s eso no fuera bueno, que necesitaba desahogarse con alguien y, por primera vez desde que perdiera el contacto con su abuelo, hab&iacute;a una persona dispuesta a escucharle y darle su apoyo y comprensi&oacute;n.</P>
<P ALIGN="JUSTIFY">—¡El se&ntilde;or optimista ha hablado de nuevo! —ironiz&oacute; Elena, sabiendo que esto har&iacute;a reaccionar a Ra&uacute;l—. ¿Sabes que empiezas a cansarme con tus constantes lamentos?</P>
<P ALIGN="JUSTIFY">&Eacute;l sab&iacute;a que ella bromeaba, pero se hizo el ofendido y no contest&oacute;. Prosiguieron unos instantes de silencio, hasta que ella lo rompi&oacute; de nuevo.</P>
<P ALIGN="JUSTIFY">—¿Vas a quedarte ah&iacute; como un pasmarote sin decir nada? Debes estar haci&eacute;ndote viejo, porque ya no sabes aguantar una broma.</P>
<P ALIGN="JUSTIFY">—¿Otra vez discutiendo? Parec&eacute;is uno de aquellos matrimonios del siglo pasado, todo el d&iacute;a a la gre&ntilde;a.</P>
<P ALIGN="JUSTIFY">Quien hab&iacute;a hablado era Salvador, otro de los habituales de sus tertulias nocturnas, que acababa de unirse a ellos ascendiendo la ladera hasta el banco de piedra (virtual, por supuesto) en el que se hallaban sentados.</P>
<P ALIGN="JUSTIFY">—¡Vaya susto nos has dado! No te hab&iacute;amos o&iacute;do llegar —dijo Ra&uacute;l, una vez repuesto de la sorpresa.</P>
<P ALIGN="JUSTIFY">—Cierto. ¿Es que nadie te ha ense&ntilde;ado modales, Salva? —le apoy&oacute; Elena, m&aacute;s divertida que molesta.</P>
<P ALIGN="JUSTIFY">—Si yo no hubiera aparecido —se defendi&oacute; Salvador—, habr&iacute;ais seguido con vuestra absurda pelea. Deber&iacute;ais estarme agradecidos por haberos interrumpido. Y, por cierto, ¿como empez&oacute; todo esta vez?</P>
<P ALIGN="JUSTIFY">Elena no sab&iacute;a si cont&aacute;rselo o no, ya que Ra&uacute;l se mostraba a veces muy reservado. Esper&oacute; unos momentos y, viendo que &eacute;l no empezaba a dar una excusa para salir del paso, decidi&oacute; contarle la verdad a Salvador. Bien mirado, hablar de ello pod&iacute;a ser precisamente lo que Ra&uacute;l necesitaba.</P>
<P ALIGN="JUSTIFY">—Ra&uacute;l me estaba contando que &uacute;ltimamente ha empezado a tener sue&ntilde;os en los que aparece su abuelo —dijo ella, por fin.</P>
<P ALIGN="JUSTIFY">—Eso suena como algo m&iacute;stico, ¿no? Alg&uacute;n tipo de se&ntilde;al del destino —dijo Salvador, con su habitual escepticismo.</P>
<P ALIGN="JUSTIFY">—Puedes burlarte de m&iacute; todo lo que quieras. No te culpo; yo en tu lugar pensar&iacute;a que me estoy volviendo loco —replic&oacute; Ra&uacute;l, un poco dolido.</P>
<P ALIGN="JUSTIFY">—No te lo tomes as&iacute; —contest&oacute; Salvador—. Cu&eacute;ntanos lo que ocurre en esos sue&ntilde;os y, tal vez, podamos ayudarte.</P>
<P ALIGN="JUSTIFY">—S&iacute;, cu&eacute;ntanoslo —le inst&oacute; Elena—. Te har&aacute; bien hablar de ello con tus amigos. Porque somos tus amigos, ¿verdad?</P>
<P ALIGN="JUSTIFY">Ra&uacute;l dud&oacute; unos instantes si acceder o no. Con Elena todo era m&aacute;s f&aacute;cil, pero Salvador era diferente, m&aacute;s anal&iacute;tico. Sab&iacute;a que le har&iacute;a ahondar en la ra&iacute;z de sus sentimientos y no estaba seguro de estar preparado para ello. Finalmente decidi&oacute; que ya iba siendo hora de enfrentarse con los fantasmas del pasado.</P>
<P ALIGN="JUSTIFY">—Esta bien —dijo Ra&uacute;l con un suspiro—, os lo contar&eacute;. Y s&iacute;, os considero mis amigos.</P>
<P ALIGN="JUSTIFY">Tras una breve pausa para ordenar sus pensamientos, Ra&uacute;l comenz&oacute; su relato:</P>
<P ALIGN="JUSTIFY">—Ver&eacute;is, lo primero que me extra&ntilde;a es que en estos sue&ntilde;os yo tengo mi edad actual, 26 a&ntilde;os, sin embargo mi abuelo est&aacute; exactamente igual que lo recuerdo la &uacute;ltima vez que le vi. Estamos sentados juntos en su viejo sof&aacute;, como en las charlas que ten&iacute;amos cuando yo era ni&ntilde;o, y me dice muchas cosas que no puedo comprender. Hasta ahora he sido incapaz de recordar sus palabras exactas, aunque el mismo sue&ntilde;o ya se ha repetido varias veces. Tengo la sensaci&oacute;n de que es algo importante y resulta muy frustrante no poder acordarme pero, cuando despierto, a medida que recupero la consciencia, sus palabras se me escapan como el agua entre los dedos.</P>
<P ALIGN="JUSTIFY">—¿De verdad crees que esos sue&ntilde;os puedan tener alg&uacute;n significado oculto? —dijo Elena cuando Ra&uacute;l hubo terminado.</P>
<P ALIGN="JUSTIFY">—No estoy totalmente seguro, pero no pienso parar hasta averiguarlo —afirm&oacute; Ra&uacute;l, convencido.</P>
<P ALIGN="JUSTIFY">—Bueno, chico, ya sabes que estamos a tu disposici&oacute;n para cualquier cosa que necesites —intervino Salvador—. Yo, particularmente, me muero de ganas de verme envuelto en una aventura que me saque de esta monoton&iacute;a.</P>
<P ALIGN="JUSTIFY">—Gracias, Salva —replic&oacute; Ra&uacute;l—. No me olvidar&eacute; de ti; s&eacute; que te encanta meterte en l&iacute;os. Pero basta ya de hablar de este tema, contadme que tal os ha ido el d&iacute;a.</P>
<P ALIGN="JUSTIFY">—¿Estas de broma? —chill&oacute; Salvador— ¿Crees que puede haber muchas novedades viviendo en una de estas malditas tumbas de hormig&oacute;n que ahora llaman ciudades? Comer y dormir es todo a lo que puede uno aspirar en estos d&iacute;as. Yo no le llamo a eso vivir.</P>
<P ALIGN="JUSTIFY">—Y ni siquiera le permiten a uno relacionarse con personas de verdad. Lo &uacute;nico que tenemos es este suced&aacute;neo de realidad en MundoNet —se quej&oacute; Elena amargamente.</P>
<P ALIGN="JUSTIFY">—Lo mejor ser&aacute; que nos retiremos a descansar —dijo Ra&uacute;l. Faltan solamente unos minutos para el toque de queda. Y ya sab&eacute;is que la &uacute;ltima vez nos sancionaron con una semana sin conexi&oacute;n.</P>
<P ALIGN="JUSTIFY">—De acuerdo —dijo Elena—. ¿Ma&ntilde;ana a la misma hora?</P>
<P ALIGN="JUSTIFY">—Y en el mismo sitio —aprob&oacute; Salvador.</P>
<P ALIGN="JUSTIFY">Ra&uacute;l desconect&oacute; su terminal, d&aacute;ndole vueltas a&uacute;n a las &uacute;ltimas palabras de sus amigos. Era triste, pero ten&iacute;an raz&oacute;n. A finales del siglo XX, el ansia por los descubrimientos cient&iacute;ficos hab&iacute;a sido enorme. La gente pensaba que la tecnolog&iacute;a los har&iacute;a m&aacute;s felices pero, finalmente, hab&iacute;a resultado todo lo contrario. Ahora, m&aacute;s de medio siglo despu&eacute;s, las enfermedades hab&iacute;an desaparecido. Las v&iacute;ricas eran controladas mediante poderosos medicamentos, y las hereditarias estaban eliminadas gracias al proceso de selecci&oacute;n gen&eacute;tica que se llevaba a cabo antes de permitir un nacimiento. El propio Ra&uacute;l fue de los &uacute;ltimos en ser concebidos de forma natural. Poco despu&eacute;s, a principios del 2040 se hab&iacute;an perfeccionado los &uacute;teros artificiales y se hab&iacute;a sometido a todas las mujeres f&eacute;rtiles a un proceso de esterilizaci&oacute;n. Esto, unido al sistema educativo que ya llevaba varios a&ntilde;os de implantaci&oacute;n, acab&oacute; por destruir totalmente el concepto tradicional de familia, sustituido por el del individuo.</P>
<P ALIGN="JUSTIFY">Pero la peor de las consecuencias que trajo la tecnolog&iacute;a fue, sin duda, el escape de m&uacute;ltiples dep&oacute;sitos subterr&aacute;neos de residuos radiactivos. Esto contamin&oacute; irreversiblemente los cursos de agua y, de &eacute;stos, la contaminaci&oacute;n pas&oacute; a la atm&oacute;sfera. Las lluvias &aacute;cidas y las nubes radiactivas hab&iacute;an acabado poco a poco con toda la vida animal y vegetal. Solo unos pocos cientos de millones de personas hab&iacute;an podido sobrevivir gracias a la construcci&oacute;n de ciudades subterr&aacute;neas; las &quot;tumbas de hormig&oacute;n&quot;, como las sol&iacute;a llamar Salvador. Salir al exterior era una lejana esperanza en estos momentos; todo lo que pod&iacute;an hacer era consolarse con las simulaciones de ordenador de los verdes paisajes de anta&ntilde;o.</P>
<P ALIGN="JUSTIFY">Aturdido por estos l&uacute;gubres pensamientos, Ra&uacute;l decidi&oacute; acostarse y tratar de relegarlos al olvido por medio del descanso, as&iacute; que oprimi&oacute; el bot&oacute;n que expulsaba la cama oculta en la pared de su habitaci&oacute;n y se dispuso a dormir. Esta vez iba a tomar medidas para que, si el sue&ntilde;o se repet&iacute;a, no le volviera a ocurrir lo mismo de otras veces.</P>
<hr>
<ul>
<li><a href="rdhfut01.htm">Cap&iacute;tulo 1. Noche de viernes.</a></li>
<li><a href="rdhfut02.htm">Cap&iacute;tulo 2. La reuni&oacute;n.</a></li>
<li>Cap&iacute;tulo 3. El sue&ntilde;o se repite.</li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisc.htm"><font FACE="ARIAL"><B>[Ciencia-ficci&oacute;n]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







