<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>iencia-ficci&oacute;n</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fern&aacute;ndez "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Futuro Imperfecto.<br>
Cap&iacute;tulo 2. La reuni&oacute;n.
</H3></font>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Una figura se deslizaba entre las sombras de la noche. Las calles de la ciudad estaban totalmente desiertas, cosa perfectamente comprensible, ya que hac&iacute;a varias horas que el toque de queda hab&iacute;a enviado a los escasos viandantes a sus casas. El castigo por infringir esta norma era demasiado elevado para que nadie se arriesgara. Tampoco hab&iacute;a muchos alicientes en la sociedad del 2065 para abandonar el cub&iacute;culo que llamaban apartamento; ni a esta hora de la noche ni a ninguna otra. Las restricciones de espacio en las ciudades subterr&aacute;neas eran tan notorias que la &uacute;nica diversi&oacute;n que se pod&iacute;a disfrutar era alguna que otra escapada virtual a alguno de los para&iacute;sos recreados en las memorias inform&aacute;ticas de MundoNet.</P>
<P ALIGN="JUSTIFY">Gabriel avanzaba con cautela, para no ser descubierto por los robots de vigilancia. Estos nunca se hab&iacute;an distinguido por su extrema inteligencia y lo cierto era que jam&aacute;s hasta el momento hab&iacute;a tenido problema para esquivarlos pero, como bien sab&iacute;a, confiarse era el primer paso para cometer un error que pusiera en serio peligro toda la operaci&oacute;n. A veces le daba por pensar que era precisamente esta clandestinidad la que le ayudaba a conservarse en tan buena forma, a pesar de que ya no era ni mucho menos un cr&iacute;o.</P>
<P ALIGN="JUSTIFY">Resultaba bastante extra&ntilde;o mirar hacia arriba y contemplar un firmamento nocturno plagado de estrellas cuando sab&iacute;a que se encontraba varios cientos de metros bajo la superficie de la Tierra. Era una mera simulaci&oacute;n, por supuesto, pero bastante buena, ya que incluso el titilar de los astros estaba perfectamente imitado. Observar este espect&aacute;culo le hac&iacute;a recordar los tiempos en que las aut&eacute;nticas estrellas a&uacute;n pod&iacute;an ser vistas en cualquier noche despejada; una de sus aficiones cuando era ni&ntilde;o y, acompa&ntilde;ado de su padre, pasaba horas enteras con su telescopio aprendiendo los nombres de estrellas y constelaciones.</P>
<P ALIGN="JUSTIFY">Sumido en estos pensamientos casi hab&iacute;a llegado ya a su destino. En frente estaba situado el bloque de apartamentos E-328, al que se dirig&iacute;a. Se escabull&oacute; silenciosamente por la puerta entreabierta —algo fuera de lo com&uacute;n a esas horas, en circunstancias normales— y se encamin&oacute; al ascensor.</P>
<P ALIGN="JUSTIFY">—Nombre y n&uacute;mero de planta para identificaci&oacute;n de voz, por favor —dijo el ascensor con tono monocorde.</P>
<P ALIGN="JUSTIFY">Gabriel extrajo una grabadora del bolsillo de su chaqueta y oprimi&oacute; el bot&oacute;n de reproducci&oacute;n.</P>
<P ALIGN="JUSTIFY">—H&eacute;ctor Salgado, planta 74 —dijo la voz que proven&iacute;a del diminuto aparato.</P>
<P ALIGN="JUSTIFY">—Gracias, se&ntilde;or Salgado. Y buenas noches —replic&oacute; el ascensor.</P>
<P ALIGN="JUSTIFY">A los pocos segundos la puerta se abri&oacute; dando paso a un estrecho pasillo que se extend&iacute;a hacia ambos lados. Gabriel guard&oacute; la grabadora y sali&oacute; del ascensor. Se dirigi&oacute; hacia la derecha pasando por delante de varias puertas hasta llegar a la que le interesaba. Puso el pulgar derecho en el esc&aacute;ner de huellas y, tras una breve comprobaci&oacute;n, la puerta del apartamento 74-H se abri&oacute; ante &eacute;l.</P>
<P ALIGN="JUSTIFY">—Pasa, Gabriel, te estabamos esperando —dijo una voz desde el interior—. ¿Alg&uacute;n problema para llegar hasta aqu&iacute;?</P>
<P ALIGN="JUSTIFY">—Hola, H&eacute;ctor —replic&oacute; el reci&eacute;n llegado—. Ninguno, como de costumbre. Esas latas de conservas son tan tontas que no me ver&iacute;an aunque pasara delante de sus narices dando volteretas.</P>
<P ALIGN="JUSTIFY">—T&uacute; siempre con ese sentido del humor tan peculiar —ri&oacute; H&eacute;ctor ante el comentario—. Vamos, no perdamos m&aacute;s tiempo.</P>
<P ALIGN="JUSTIFY">Gabriel sigui&oacute; a su anfitri&oacute;n hasta una habitaci&oacute;n contigua, donde ya les esperaban sentadas otras tres personas. A dos de ellos ya los conoc&iacute;a; se trataba de Raquel y Jacobo. &Eacute;l era ingeniero de conocimiento y ella bioqu&iacute;mica; ambos hab&iacute;an estado involucrados en esta locura desde el principio, al igual que &eacute;l mismo. H&eacute;ctor, que era experto en redes de computadoras —sobre todo en saltarse los sistemas de seguridad de las mismas—, se hab&iacute;a unido posteriormente y hab&iacute;a probado ser una ayuda inestimable para sortear los estrictos controles de MundoNet cuando era necesario. A la tercera, una mujer alta, de pelo casta&ntilde;o y que rondar&iacute;a los cincuenta, no la hab&iacute;a visto nunca, aunque ya supon&iacute;a su identidad, al haber sido informado de que un nuevo miembro se un&iacute;a al grupo. Su incorporaci&oacute;n era uno de los motivos de la reuni&oacute;n, si bien no el principal.</P>
<P ALIGN="JUSTIFY">—Gabriel, te presento a Alicia —dijo H&eacute;ctor.</P>
<P ALIGN="JUSTIFY">Ella se levant&oacute; y le estrech&oacute; la mano cort&eacute;smente.</P>
<P ALIGN="JUSTIFY">—Gabriel es nuestro &quot;jefe de operaciones&quot;, por llamarlo de alg&uacute;n modo —prosigui&oacute; H&eacute;ctor, dirigi&eacute;ndose a Alicia—. Y un estupendo ingeniero en rob&oacute;tica, adem&aacute;s.</P>
<P ALIGN="JUSTIFY">—Como todos sab&eacute;is ya —continu&oacute; H&eacute;ctor—, Alicia es nuestra nueva compa&ntilde;era. Su especialidad es la electr&oacute;nica y su colaboraci&oacute;n ser&aacute; muy valiosa, como pod&eacute;is suponer. Y ahora, lo mejor ser&aacute; que comencemos a tratar el tema que nos ha reunido aqu&iacute; esta noche. Gabriel, puedes comenzar cuando quieras.</P>
<P ALIGN="JUSTIFY">—Bien... —comenz&oacute; &eacute;ste, haciendo una pausa para organizar sus ideas—. Gracias a los canales de comunicaci&oacute;n que H&eacute;ctor ha conseguido abrir en MundoNet hemos podido entrar en contacto con Paloma, una vieja compa&ntilde;era m&iacute;a de la Universidad que ahora reside en Nueva Atenas. Parece ser que tiene informaci&oacute;n vital sobre lo que est&aacute; pasando y desea unirse a nosotros; incluso me ha llegado a insinuar que su vida puede correr serio peligro si no desaparece inmediatamente de escena. Como ya llevamos tiempo planeando, y esto no hace m&aacute;s que acelerar un poco las cosas, es necesario establecer una forma segura de desplazarnos entre una ciudad y otra sin despertar sospechas. No har&aacute; falta que os mencione que los portales de teletransporte est&aacute;n altamente vigilados, por lo que necesitaremos credenciales cient&iacute;ficas falsas y motivos de viaje comprobables. He pensado que Raquel, como &uacute;nica cient&iacute;fica en activo de nosotros, podr&iacute;a arreglarlo todo para conseguir dos pases de viaje a Nueva Atenas para dentro de dos d&iacute;as a nombre de un par de integrantes del equipo de su laboratorio, un hombre y una mujer. Alicia falsificar&aacute; las tarjetas de identidad y H&eacute;ctor se encargar&aacute; de borrar todo rastro de Paloma en los registros censales. La traer&eacute; de regreso dentro de tres d&iacute;as y entonces nos reuniremos para planificar los pr&oacute;ximos pasos que debemos dar. ¿Alguna pregunta?</P>
<P ALIGN="JUSTIFY">—¿Tienes alguna idea de qu&eacute; tipo de informaci&oacute;n puede ser la que posee Paloma? —inquiri&oacute; Jacobo.</P>
<P ALIGN="JUSTIFY">—No me ha querido dar ning&uacute;n detalle hasta que hablemos personalmente, pero es lo suficientemente importante como para tener a las autoridades detr&aacute;s de ella queriendo eliminarla.</P>
<P ALIGN="JUSTIFY">—No estoy segura de poder conseguir esos pases sin que nadie lo note —dijo Raquel—. Ya sab&eacute;is lo estrictos que son los controles a la entrada y salida del laboratorio.</P>
<P ALIGN="JUSTIFY">—Tienes que hacerlo —le exhort&oacute; Gabriel—, ya que no hay tiempo para avisar a Paloma de un cambio de planes. Confiamos en tu ingenio para este trabajo.</P>
<P ALIGN="JUSTIFY">Pasaron unos instantes en total silencio hasta que, viendo que nadie ten&iacute;a m&aacute;s dudas sobre su misi&oacute;n, Gabriel volvi&oacute; a tomar la palabra.</P>
<P ALIGN="JUSTIFY">—Si nadie tiene m&aacute;s preguntas, eso es todo por hoy. Ma&ntilde;ana nos volveremos a ver aqu&iacute; a la misma hora para ultimar todos los detalles.</P>
<P ALIGN="JUSTIFY">Dicho esto, se fueron levantando y, con intervalos de separaci&oacute;n de unos minutos, uno a uno fueron abandonando el apartamento de H&eacute;ctor para dirigirse a los suyos. Gabriel esper&oacute; a que se fueran todos los dem&aacute;s y entonces se dirigi&oacute; a H&eacute;ctor.</P>
<P ALIGN="JUSTIFY">—Te noto preocupado —le dijo—. ¿Qu&eacute; te ocurre?</P>
<P ALIGN="JUSTIFY">—¿Por qu&eacute; estamos haciendo esto? ¿Por qu&eacute; arriesgamos nuestras vidas por un ideal?</P>
<P ALIGN="JUSTIFY">—¿La libertad de volver a regir nuestros destinos no te parece raz&oacute;n suficiente? Volver a tener una familia, hijos a los que poder educar y ver crecer. Poder elegir una profesi&oacute;n por uno mismo y trabajar en lugar de estar todo el d&iacute;a encerrado en casa viendo pasar tu vida en vano. Tener la esperanza de volver a ver la luz del sol y de ba&ntilde;arse en el oc&eacute;ano. Quiz&aacute; para nosotros es ya tarde, tu y yo somos viejos, pero, ¿que hay del futuro? ¿no te importa lo que le pase a los dem&aacute;s? ¿quieres ver como la humanidad agoniza en un mundo sin esperanzas, sin ilusiones?</P>
<P ALIGN="JUSTIFY">—S&iacute;, todo eso es cierto pero, a veces, me pregunto si tenemos la m&aacute;s m&iacute;nima posibilidad de conseguirlo o si ser&aacute;n solamente sue&ntilde;os inalcanzables —argument&oacute; H&eacute;ctor.</P>
<P ALIGN="JUSTIFY">—Debemos intentarlo, al menos.</P>
<P ALIGN="JUSTIFY">Ambos quedaron en silencio y, poco despu&eacute;s, Gabriel se march&oacute; tambi&eacute;n, dejando a H&eacute;ctor solo con sus pensamientos.</P>
<hr>
<ul>
<li><a href="rdhfut01.htm">Cap&iacute;tulo 1. Noche de viernes.</a></li>
<li><a href="rdhfut02.htm">Cap&iacute;tulo 2. La reuni&oacute;n.</a></li>
<li>Cap&iacute;tulo 3. El sue&ntilde;o se repite.</li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisc.htm"><font FACE="ARIAL"><B>[Ciencia-ficci&oacute;n]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







