<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:beren@ciudad.com.ar">Miguel Ángel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Britannia en tiempos de Pagan
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY"></FONT><B><P ALIGN="JUSTIFY">Capitulo 1: &quot;Los Preparativos&quot;</P>
</B><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;Soy una curandera, recu&eacute;rdalo. Yo no soy un mago de verdad&quot;</P>
<P ALIGN="JUSTIFY">&quot;Eso no importa, vieja amiga. El poder esta contigo, y es poder lo que necesitamos, sin embargo, podr&iacute;a elegir manifestarse. Yo soy mago, tan bien lo sabes como yo, y ser&eacute; yo quien enfoque el hechizo. Nosotros... yo... se lo debo, nada menos. Mi magia seguir&iacute;a in&uacute;til si no fuera por &eacute;l, quien puso fin a mi locura.&quot;</P>
<P ALIGN="JUSTIFY">&quot;De acuerdo, cien veces de acuerdo!. Nosotros... nosotros... se lo debemos, le debemos tanto como nuestros poderes nos permitan entregarle.&quot; Ella sonr&iacute;o. &quot;Despu&eacute;s de todo, fue cuando viaje con el que te conoc&iacute;, vieja amiga.&quot;</P>
<P ALIGN="JUSTIFY">Con una sonrisa burlona, su amiga respondi&oacute;, &quot;Tu realmente eres un caso perdido en mi mente!&quot;</P>
<P ALIGN="JUSTIFY">&quot;Dime entonces, antes de que pierda la compostura, cuando y donde.&quot;</P>
<P ALIGN="JUSTIFY">&quot;Nos reuniremos en el circulo de piedras cercano a mi casa. Nos reuniremos en el momento que las dos lunas sean nuevas, pero no en los d&iacute;as cercanos.&quot;</P>
<P ALIGN="JUSTIFY">&quot;Eso es perfecto, ninguno de los invitados a la ceremonia llegar&iacute;a a tiempo si lo hici&eacute;ramos de esa manera.&quot;</P>
<P ALIGN="JUSTIFY">&quot;Es verdad, hay tiempo suficiente para todos para llegar, y para compartir&quot;</P>
<P ALIGN="JUSTIFY">&quot;Todos magos?&quot;</P>
<P ALIGN="JUSTIFY">&quot;No, todos amigos!&quot;</P>
<P ALIGN="JUSTIFY">&quot;Veo el brillar de las estrellas, acaso ha llegado el momento en que partir&aacute;s?&quot;</P>
<P ALIGN="JUSTIFY">&quot;Si, esa es la verdad. Ahora ve y busca a todos nuestros compa&ntilde;eros&quot;</P>
<P ALIGN="JUSTIFY">&quot;Que tengas un buen viaje, Mariah&quot;</P>
<P ALIGN="JUSTIFY">&quot;Eso espero yo tambi&eacute;n, Jaana. Te ver&eacute; en un mes, cuando, destino mediante, llamaremos al Avatar a casa!&quot;</P>
<P ALIGN="CENTER"><BR>
 -------------------------------------------------------------------------</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El Sol comenz&oacute; a bajar hacia el horizonte, tornando las nubes rojas. El Barco &quot;Virtud&quot; corta las olas como un cuchillo, mientras deja tras de s&iacute; el puerto de Fuerte de la Serpiente.</P>
<P ALIGN="JUSTIFY">&quot;Tendremos que ir hacia el este, casi hasta la Isla del Avatar, y luego giraremos hacia el norte, para evitar pasar por la Isla de los Bucaneros&quot;</P>
<P ALIGN="JUSTIFY">&quot;Asumo que el Capit&aacute;n Selene realmente sabe lo que esta haciendo. Al menos tenemos un buen viento para comenzar la jornada.&quot;</P>
<P ALIGN="JUSTIFY">&quot;Muy cierto&quot;.</P>
<p align="justify">Un momento de silencio mientras los dos hombres observan el atardecer.</P>
<p align="justify">&quot;Lo creas o no, Geoffrey, nunca me he aventurado tan lejos.&quot;</P>
<p align="justify">&quot;A Moonglow?&quot;</P>
<p align="justify">&quot;No, Si he estado en Moonglow varias veces, por ejemplo, durante la b&uacute;squeda de Lord British. No, yo me refer&iacute;a a la Isla del Avatar.</P>
<p align="justify">&quot;En verdad? Yo cre&iacute;a que hab&iacute;ais visitado el lugar durante la misma aventura&quot;</P>
<p align="justify">&quot;No, nos separamos antes, y no pude acompa&ntilde;ar al Avatar a ese lugar&quot;<BR>
&quot;Yo ya he estado all&iacute;, pero tu ya lo sabes, verdad?&quot;</P>
<p align="justify">&quot;S&iacute;, lo s&eacute;. C&oacute;mo es?&quot;</P>
<p align="justify">Geoffrey se ri&oacute;. &quot;Cu&aacute;ndo, Sentri?. La primera vez que fui, era un pantano maloliente, con criaturas que escup&iacute;an veneno a todos lados. Me intern&eacute; en la profundidad de la monta&ntilde;a, donde los bichos salen a tus pies por doquier, y las grietas en el suelo expelen humos y fuego que quema la carne. En el centro de todo eso se encuentra el Gran Abismo Estigio, donde el Avatar destruyo la calavera de Mondain, y donde encontr&oacute; el Codex de la Sabidur&iacute;a&quot;.</P>
<p align="justify">&quot;A&ntilde;os despu&eacute;s se volvi&oacute; un lugar mucho mas clemente y piadoso, con el altar del Codex, hasta que este fue lanzado al limbo, durante todo el asunto del falso profeta.&quot;</P>
<p align="justify">&quot;Ahora me han dicho que incluso un pueblo ha nacido all&iacute;. Sin embargo, nunca he estado all&iacute;.&quot;</P>
<p align="justify">Ahora toda la luz del sol hab&iacute;a desaparecido. Los dos miraban a la luna reflejarse en el mar, y meditaban.</P>
<p align="justify">Mucho tiempo despu&eacute;s, Sentri habl&oacute;:</P>
<p align="justify">&quot;Entonces, Porque nosotros?&quot;</P>
<p align="justify">&quot;No creo entenderte, a que te refieres?&quot;</P>
<p align="justify">&quot;Bueno, a ti casi te entiendo. Tu fuiste su amigo antes de que siquiera fuese Avatar. Luego, tu te convertiste en el capit&aacute;n de la Marina Real de Lord British, pero yo?. Yo ca&iacute; en todo esto mas que nada por ser amigo de Dupre. Adem&aacute;s, este es un ritual m&aacute;gico para traerlo a casa. Nosotros somos hombres de lucha, porque tambi&eacute;n fuimos convocados?&quot;</P>
<p align="justify">Geoffrey sonri&oacute;. &quot;Te he visto luchar, Sentri. Tu no le temes a nada. Pero, a tu pregunta, lo primero que no debes olvidar es que no solo el Avatar espera ser tra&iacute;do a casa, pero sus queridos amigos tambi&eacute;n, incluido tu amigo Dupre.&quot;</P>
<p align="justify">Sentri asinti&oacute; y sonri&oacute;. &quot;Es verdad, lo que me recuerda que le ped&iacute; al capit&aacute;n Selene que me permitiera cargar en la bodega el mejor alcohol de Jhelom&quot;</P>
<p align="justify">&quot;S&iacute;? Desear&iacute;a que no me lo hubieses dicho!. Si este viaje es lo suficientemente largo, quiz&aacute;s me tiente a probarlo... pero, para continuar, realmente crees que todo esto es seguro? Es verdad que todos los que vamos a participar lo hemos mantenido en secreto, pero en caso de que algo falle, nosotros estaremos all&iacute; para cuidar a nuestros amigos cuando todav&iacute;a est&eacute;n vulnerables. Recuerda que aunque la Hermandad no exista mas, el Guardi&aacute;n aun puede tener aliados aqu&iacute;. Adem&aacute;s, ser&aacute; algo grato para ellos ser recibidos por todos sus amigos.&quot;</P>
<p align="justify">&quot;Piensa en eso, Sentri, yo, por lo menos, ya me voy a dormir.&quot;</P>
<p align="justify">Con eso, Geoffrey se fue, dejando a Sentri contemplar las olas...</P>

<P ALIGN="CENTER"><BR>
 -------------------------------------------------------------------------</P>

<p align="justify">&quot;Un Poliz&oacute;n!?&quot; El Capit&aacute;n Gargan grito. &quot;Traigan a esa maldita rata marina aqu&iacute; mismo!&quot; Su primer oficial asinti&oacute; y abandono r&aacute;pidamente la cabina. El Capit&aacute;n se sent&oacute;, y luego saco un peque&ntilde;o frasco plateado con un liquido amarronado, lo verti&oacute; en un vaso, y lo bebi&oacute;. Sinti&oacute; el calor en sus labios. Ya hab&iacute;a sido un d&iacute;a pesado, y ahora esto.</P>
<p align="justify">&quot;Capit&aacute;n?&quot;</P>
<p align="justify">&quot;Tr&aacute;elo aqu&iacute;, Ian.&quot;</P>
<p align="justify">La puerta se abri&oacute; y luego entro el primer oficial arrastrando a un peque&ntilde;o, quiz&aacute;s de 12 a&ntilde;os de edad, con cabello rubio y ojos azules, muy temerosos.</P>
<p align="justify">&quot;Bien, chico, que significa esto? Qui&eacute;n diablos te crees que eres?&quot;</P>
<p align="justify">&quot;Se&ntilde;or? Mi nombre es Spark, se&ntilde;or. No quise traerle ning&uacute;n problema. Pero yo... yo... necesito llegar a Moonglow. Puedo ser &uacute;til, se&ntilde;or... limpiare los pisos o lo que sea, por favor, no me abandone!&quot;</P>
<p align="justify">&quot;Por Deceit, chico, me pones en una dif&iacute;cil situaci&oacute;n.&quot; Miro mas de cerca al ni&ntilde;o. &quot;Espera! Spark! Han pasado dos d&iacute;as desde que nos embarcamos, que has comido desde entonces?</P>
<p align="justify">&quot;Algunas viandas que he tra&iacute;do conmigo abordo, se&ntilde;or, eso es todo.&quot;</P>
<p align="justify">&quot;Demonios!. Sr. Fenderson, vaya y tr&aacute;igale algo para comer.&quot;</P>
<p align="justify">Ian Fenderson estuvo de acuerdo y sali&oacute; de la habitaci&oacute;n, dej&aacute;ndolos solos.</P>
<p align="justify">&quot;Te recuerdo, chico.&quot;</P>
<p align="justify">&quot;S&iacute;?&quot;</P>
<p align="justify">&quot;Por supuesto. He estado navegando por muchos a&ntilde;os, pero nunca olvido cosas que hayan pasado. Y menos cierto evento de hace tres a&ntilde;os, cierto asesinato en Trinsic, y recuerdo quien fue el ni&ntilde;o que se convirti&oacute; en hu&eacute;rfano por eso.&quot;</P>
<p align="justify">&quot;Y yo recuerdo quien resolvi&oacute; el asesinato. Tu viajaste con el un tiempo, verdad?. Y ahora quieres viajar a Moonglow. Bueno. Considerando quienes son mis otros pasajeros, aparecen preguntas en mi cabeza que quiz&aacute;s nunca tengan respuesta.&quot;</P>
<p align="justify">Entonces Gargan lo miro derecho a los ojos. </P>
<p align="justify">&quot;Porque no te propusiste para trabajar antes de que sali&eacute;ramos del puerto?&quot;</P>
<p align="justify">&quot;Me entere de este barco demasiado tarde, se&ntilde;or. Casi no logro llegar.&quot;</P>
<p align="justify">&quot;Si claro, y adem&aacute;s, yo podr&iacute;a haber dicho que no, verdad?&quot;</P>
<p align="justify">&quot;No, no, es que...&quot;</P>
<p align="justify">&quot;No importa. A partir de este momento, eres un tripulante mas de mi barco, chico. Mi primer oficial volver&aacute; en cualquier momento con la comida. Se lo informare entonces. Y por cierto, trata de no sorprenderte demasiado cuando te encuentres, de nuevo, si es que los rumores son ciertos, con nuestro pasajero m&aacute;s importante.&quot;</P>
<p align="justify">&quot;Y quien seria &eacute;l, se&ntilde;or?&quot;</P>
<p align="justify">El Capit&aacute;n Gargan se lo dijo.</P>
<p align="justify">Los ojos de Spark destellaron asombrados.<BR>

<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







