<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 11. Venganza.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Ese d&iacute;a, como de costumbre, volvieron juntos Orein y Lorien de su trabajo en el pueblo, pero no encontraron a Aradriel. En su lugar, dej&oacute; una nota en donde explicaba que hab&iacute;a ido al bosque que hab&iacute;a cerca de las monta&ntilde;as. </P>
<P ALIGN="JUSTIFY">Al leer la nota, Orein pens&oacute; en la historia de Serind&euml;l. No pudo evitarlo, pero una sensaci&oacute;n de angustia le invadi&oacute;. </P>
<P ALIGN="JUSTIFY">De repente, alguien comenz&oacute; a golpear la puerta con mucha fuerza.</P>
<P ALIGN="JUSTIFY">–<I> ¡Eh!, s&eacute; que est&aacute;is ah&iacute; </I>–grit&oacute; alguien– <I>¡Venga, salid fuera!</P>
<P ALIGN="JUSTIFY">– ¡Padre! </I>–grit&oacute; Lorien, aterrada al reconocer la voz.</P>
<P ALIGN="JUSTIFY">Y Orein que tambi&eacute;n la reconoci&oacute;, le dijo: </P>
<P ALIGN="JUSTIFY">– <I>Tranquil&iacute;zate. Esperemos a ver si se harta y se va.</P>
</I><P ALIGN="JUSTIFY">– <I>¡Vamos, salid!</I> –inquiri&oacute; de nuevo la voz–. <I>Os he seguido y no me marchar&eacute; hasta que os haya dado lo que os merec&eacute;is.</P>
</I><P ALIGN="JUSTIFY">–<I> ¡Vete!</I> –grit&oacute; Lorien deseando que Aradriel estuviera all&iacute; con ellos, mirando asustada al rostro severo que hab&iacute;a adoptado su padre.</P>
<P ALIGN="JUSTIFY">– <I>Ha debido esperar a que se marchase Aradriel. Ha tenido que estar espi&aacute;ndonos </I>–le dijo &eacute;ste.</P>
<P ALIGN="JUSTIFY">– <I>¿Pero c&oacute;mo sab&iacute;a que estaba aqu&iacute;?</I> –le pregunt&oacute; Lorien sin razonar la pregunta, dej&aacute;ndose llevar por la situaci&oacute;n.</P>
<P ALIGN="JUSTIFY">– <I>¡Dej&eacute;monos de tonter&iacute;as, Lorien! ¡Todo el pueblo lo sabe! </I>–le respondi&oacute; abruptamente su padre, m&aacute;s de lo que se propon&iacute;a. Y Lorien se ech&oacute; a llorar sobre el pecho de Orein, mientras que el hombre tuvo que decidirse a actuar. A pesar de que ten&iacute;a el sentimiento de que estaba siendo v&iacute;ctima de lo que no se atrev&iacute;a a aceptar: la maldad de sus Dioses.</P>
<P ALIGN="JUSTIFY">– <I>Hija, tengo que salir</I> –le dijo con amargura y a la vez severidad en su voz, mientras que Lorien, al o&iacute;r estas palabras, levantaba su mirada y miraba con ojos suplicantes a su padre–. <I>T&uacute; qu&eacute;date aqu&iacute; y no salgas pase lo que pase... tienes que promet&eacute;rmelo.</P>
<P ALIGN="JUSTIFY">– Pero...</P>
<P ALIGN="JUSTIFY">– ¡Prom&eacute;temelo! </I>–le dijo apart&aacute;ndola de s&iacute; y sujet&aacute;ndola fuertemente por los hombros, demostrando m&aacute;s decisi&oacute;n de una sola vez, que la que us&oacute; en toda su vida.</P>
<P ALIGN="JUSTIFY">– <I>Est&aacute; bien </I>–asinti&oacute; Lorien bajando la cabeza, abrumada hasta tal punto por la actitud de su padre y la situaci&oacute;n, que no se detuvo a pensar en lo que estaba diciendo–. <I>Te lo prometo.</P>
</I><P ALIGN="JUSTIFY">Orein solt&oacute; a su hija durante un segundo, y la abraz&oacute;. Pero la muchacha sinti&oacute; algo extra&ntilde;o, como una ola de calor y de amargura. Su padre le dijo s&oacute;lo dos palabras que la pusieron en un estado de &aacute;nimo impert&eacute;rrito a todo lo dem&aacute;s que pudiera suceder. Le dijo que la quer&iacute;a. </P>
<P ALIGN="JUSTIFY">Se estaba despidiendo de ella. Y sali&oacute; fuera, cerrando tras de s&iacute; la puerta de la entrada.</P>
<P ALIGN="JUSTIFY">– <I>¡Qu&eacute; bien!, as&iacute; que por fin te decidiste a salir </I>–dijo Morth–<I> ¿Qu&eacute; te parece mi cara? ¿Ahora no est&aacute; &eacute;l, verdad? Quiero pagarte por lo que me hizo.</P>
</I><P ALIGN="JUSTIFY">– <I>Se ha marchado </I>–dijo Orein– <I>y por tu bien te aconsejo que te vayas antes de que vuelva. T&uacute; no tienes ni idea de qui&eacute;n es &eacute;l.</P>
</I><P ALIGN="JUSTIFY">– <I>Oh s&iacute;, claro. ¿crees que me vas a asustar? Por su culpa tengo la cara desfigurada y t&uacute; vas a pagar por &eacute;l</I> –y se lanz&oacute; sobre Orein comenzando una terrible pelea. </P>
<P ALIGN="JUSTIFY">Orein, aunque era fuerte, ya estaba debilitado por el paso de los a&ntilde;os. Pero ten&iacute;a la suficiente entereza como para vencer a Morth. Ya no luchaban por lo que pas&oacute; en el pasado. Luchaban por su vida. </P>
<P ALIGN="JUSTIFY">Tras varios minutos de desenfrenada pelea, Morth se dio cuenta de que no pod&iacute;a ganarle al hombre que ten&iacute;a enfrente, el cual se atrev&iacute;a a no dejarse vencer por &eacute;l. Y viendo su inferioridad, en el momento en que Orein se lanzaba desesperadamente sobre &eacute;l, para arrebatarle el sentido, sac&oacute; un cuchillo de su cintura y se lo clav&oacute; en el pecho. </P>
<P ALIGN="JUSTIFY">El hombre cay&oacute; sin vida a sus pies. </P>
<P ALIGN="JUSTIFY">Entonces se oy&oacute; un grito y, seguidamente, un disparo.</P>
<P ALIGN="JUSTIFY">Morth se gir&oacute; y se acerc&oacute; a la casa, tambale&aacute;ndose, al parecer sin ser consciente de que estaba herido de muerte, y cay&oacute; ante la puerta.</P>
<P ALIGN="JUSTIFY">En ella se encontraba Lorien con el arma en sus manos y la mirada perdida por el terror de lo que hab&iacute;a sucedido.</P>
<P ALIGN="JUSTIFY">Tir&oacute; el arma y corri&oacute; hacia su padre, sin darse cuenta siquiera de que a su paso, Morth intent&oacute; agarrarle un tobillo sin &eacute;xito.</P>
<P ALIGN="JUSTIFY">Cuando lleg&oacute; hasta el cuerpo de su padre, mir&oacute; el cuchillo incrustado en el pecho. Justo en el coraz&oacute;n. Lorien se arrodill&oacute; sobre su padre y le sujet&oacute; la cabeza entre sus manos, y entre sollozos, como una ni&ntilde;a peque&ntilde;a, la agitaba temblorosamente para que se despertase. </P>
<P ALIGN="JUSTIFY">Tras unos segundos en los que por fin acept&oacute; el hecho de que su padre estaba muerto, hundi&oacute; la cabeza de su padre entre su melena, y llor&oacute; sobre el rostro del &uacute;nico ser que le quedaba en la vida.</P>
<P ALIGN="JUSTIFY">Un sonido de dolor le lleg&oacute; desde muy cerca, y crey&oacute; que era su padre, pero no era as&iacute;. Levant&oacute; sobresaltada la cabeza, y mir&oacute; de nuevo el cuchillo. </P>
<P ALIGN="JUSTIFY">La situaci&oacute;n y sus trastocados sentidos, le indujeron la idea de que hab&iacute;a sido su padre el que hab&iacute;a gemido, y cogi&oacute; el cuchillo y se lo arranc&oacute;. La sangre comenz&oacute; a manar m&aacute;s profusamente, y Lorien, extasiada, crey&oacute; en el acceso de locura que la invadi&oacute;, que si deten&iacute;a la hemorragia, revivir&iacute;a a su padre. Sin pens&aacute;rselo, puso las dos manos sobre la herida, intentando contener la sangre. Pero &eacute;sta, tan tibia y viscosa que imped&iacute;a detenerla, continuaba manando para horror de la mujer.</P>
<P ALIGN="JUSTIFY">Lorien gritaba. Empujaba con las dos manos sobre la herida. Sent&iacute;a la muerte de su padre sobre sus propias manos. Notaba el calor de la muerte en la sangre de su padre. Y el trastorno aument&oacute;. Agarr&oacute; un borde de su vestido, y con una fuerza incre&iacute;ble, lo rasg&oacute;. Consigui&oacute; poner la tela arrancada sobre el pecho de su padre, pero de nada serv&iacute;a. Y como si lentamente saliera de una especie de letargo, se empez&oacute; a dar cuenta de que ten&iacute;a los brazos y las manos completamente llenas de sangre. De la sangre de su padre.</P>
<P ALIGN="JUSTIFY">– <I>¡Ahora sabr&aacute;s qu&eacute; es lo que yo he sentido durante tantos a&ntilde;os!</I> –le grit&oacute; fren&eacute;ticamente Morth, mientras intentaba llegar hasta ella, que con las &oacute;rbitas de los ojos desencajadas, se miraba las manos te&ntilde;idas de rojo.</P>
<P ALIGN="JUSTIFY">Entonces, Lorien lo mir&oacute;. Lo mir&oacute; y no lo reconoci&oacute; como lo que era, sino como un monstruo al que hab&iacute;a que matar. Lo atraves&oacute; con un odio tan intenso, que Morth se tambale&oacute; al conseguir ponerse en pie. Tan intenso que la luz de Seriant que los iluminaba, se volvi&oacute; negra, sucia. Esa exacerbaci&oacute;n del sentimiento del odio, inund&oacute; los alrededores como si todos los muertos de todos los tiempos demostrasen lo que sent&iacute;an por sus creadores, y de hecho, as&iacute; fue. </P>
<P ALIGN="JUSTIFY">La muerte se asust&oacute; de tal manera que los cad&aacute;veres de todo el planeta se unieron al mudo grito. Los habitantes del pueblo de Eslariot y de todos los pueblos del mundo, quedaron mudos, embargados por la c&oacute;lera y la rabia, que sin saber por qu&eacute;, sintieron de repente. </P>
<P ALIGN="JUSTIFY">Y ese dolor destilado por el odio, se convirti&oacute; en un clamor por la venganza. Y lo sintieron hasta los mism&iacute;simos Dioses. Y Dharmsqui llor&oacute;. Llor&oacute; porque se hab&iacute;a equivocado. Y sus hermanos se alejaron de &eacute;l. Porque ten&iacute;an miedo de su reacci&oacute;n. Se espantaron por lo que vieron y sintieron. Algunos incluso llegaron a avergonzarse de hasta d&oacute;nde hab&iacute;an llegado. Otros se ocultaron en su infinito poder para que nadie los viera temer. Ninguno qued&oacute; indiferente. Ninguno supo qu&eacute; estaba pasando. Y ninguno olvid&oacute;.</P>
<P ALIGN="JUSTIFY">Mientras tanto, Lorien estaba de rodillas mirando el cuchillo y Morth estaba casi a su altura.</P>
<P ALIGN="JUSTIFY">Un rayo atraves&oacute; su mente, una idea le fue inducida desde fuera, como respuesta a lo que deb&iacute;a hacer. Entonces cogi&oacute; el cuchillo que su padre tuvo clavado, y se abalanz&oacute; sobre el asesino. </P>
<P ALIGN="JUSTIFY">Morth, con los ojos desencajados por el terror, al ver que la hoja de acero se incrustaba en su cuerpo, sujet&oacute; a su agresora, pero perdi&oacute; el equilibrio y cayeron ambos al suelo. Lorien consigui&oacute; incorporarse lo suficiente para encaramarse hasta la altura del pecho del ser que ten&iacute;a que matar. El hombre no atin&oacute; a pararle las manos, y volvi&oacute; a sentir el acero en sus entra&ntilde;as. Pero Lorien no se content&oacute; con esto. Deseaba m&aacute;s. </P>
<P ALIGN="JUSTIFY">Cuando le incrust&oacute; el cuchillo en el pecho, consigui&oacute; aferrarlo con las dos manos, sin importarle que las u&ntilde;as de su enemigo se le clavaran en los brazos, intentando apartarla.</P>
<P ALIGN="JUSTIFY">No sent&iacute;a el dolor, s&oacute;lo el odio, y con una incre&iacute;ble rabia que aliment&oacute; sus fuerzas, tir&oacute; del cuchillo hacia abajo y le abri&oacute; el pecho.</P>
<P ALIGN="JUSTIFY">Morth a&uacute;n permanec&iacute;a vivo. La muerte no pod&iacute;a alcanzarle a&uacute;n. Estaba amedrentada por lo que sinti&oacute;. El ser que yac&iacute;a con el cuerpo desgarrado, se aferr&oacute; a&uacute;n m&aacute;s a los brazos de la bestia que lo mutilaba, pero a ella no le importaban las u&ntilde;as clavadas hasta los huesos. Ella consigui&oacute; elevar de nuevo el arma, y volvi&oacute; a descargarla sobre el despojo que ya hab&iacute;a dejado caer los brazos. &Eacute;ste sent&iacute;a c&oacute;mo se le escapaba la vida, mientras ve&iacute;a c&oacute;mo Lorien no cesaba de apu&ntilde;alarlo, y hasta que Morth no se movi&oacute; m&aacute;s, Lorien continu&oacute; acuchill&aacute;ndolo sin saber lo que estaba haciendo. Hasta que por fin lo abord&oacute; la muerte.</P>
<P ALIGN="JUSTIFY">Y tan r&aacute;pidamente como le vino la idea, se dio cuenta de lo que hab&iacute;a hecho. Mir&oacute; horrorizada la mano que sosten&iacute;a el arma, y la dej&oacute; caer de su ensangrentada mano. Luego mir&oacute; al cuerpo que yac&iacute;a sobre ella, y descubri&oacute; que el pecho de Morth estaba mutilado, desgarrado por todos los sitios. Y retrocediendo a rastras como un animal herido, se alej&oacute; del muerto a la vez que volv&iacute;a a centrar su atenci&oacute;n en el otro cuerpo. </P>
<P ALIGN="JUSTIFY">Se levant&oacute; a trompicones, completamente cubierta por la sangre, y al llegar a &eacute;l, se derrumb&oacute; sin poder dejar de expresar su dolor. </P>
<P ALIGN="JUSTIFY">Comenz&oacute; a llorar.</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







