<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 5. Historias.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Orein estaba sentado junto a la puerta, en el lugar en donde dec&iacute;a que se encontraba mejor que en cualquier otro sitio. Mientras, el Sol se estaba asomando como desde el d&iacute;a de su creaci&oacute;n, escalando las monta&ntilde;as que a&uacute;n conservaban las nieves del invierno, nieves que a&uacute;n resist&iacute;an su calor, que cada d&iacute;a iba ganando m&aacute;s fuerza, pero que hab&iacute;an perdido la solidez y la frialdad de los d&iacute;as de invierno. De esta forma, los reflejos de los rayos del Sol, asemejaban rayos multicolores al refractarse en las figuras que se conformaban en la monta&ntilde;a. Toda una belleza, pero teniendo que apartar la mirada de la Monta&ntilde;a Maldita, para apreciarla.</P>
<P ALIGN="JUSTIFY">Pas&oacute; una hora, y todo el mundo ya estaba despierto. Ya hab&iacute;an desayunado los tres, y Aradriel intent&oacute; despedirse de sus anfitriones, pero Orein le ofreci&oacute; quedarse el tiempo que quisiera. Y ante la insistencia de Aradriel de no querer hacerles contrariar sus costumbres, decidieron que se quedar&iacute;a, pero que tendr&iacute;a que trabajar en la casa para evitar que pudieran crearse rumores en el pueblo. Rumores que aunque casi siempre son infundados, las malas gentes gustan de ellos para da&ntilde;ar a las personas que odian..., o temen y creen odiar. As&iacute;, al final accedi&oacute;, y durante todo el d&iacute;a se dedic&oacute; a arreglar peque&ntilde;os desperfectos que hab&iacute;an sido abandonados desde hac&iacute;a muchos a&ntilde;os, al ser una casa muy grande y que requer&iacute;a muchos cuidados para que los atendieran s&oacute;lo dos personas. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Al anochecer, Lorien y su padre volvieron de sus trabajos en el pueblo. Tuvieron mucho cuidado de evitar los sitios por los que Morth y sus amigos frecuentaban, pero no vieron se&ntilde;ales de ninguno de ellos. Aunque lo que s&iacute; notaron, y sobre todo Lorien, fue el hecho de que a su paso, los normales murmullos se elevaban al verla pasar, y se tornaban en roncos cuchicheos cuando se alejaba de ellos. Lorien no quiso comentar nada de esto a su padre, pero no hac&iacute;a falta, Orein ya hab&iacute;a notado la tirantez en el trato con las pocas personas que a&uacute;n le hablaban.</P>
<P ALIGN="JUSTIFY">Se dispusieron a cenar. </P>
<P ALIGN="JUSTIFY">Durante el transcurso de &eacute;sta, conversaron sobre diversos temas, y Orein le pidi&oacute; a Aradriel que le dijese de d&oacute;nde ven&iacute;a, y aunque no se atrev&iacute;a, lo que de verdad quer&iacute;a saber era qu&eacute; pas&oacute; exactamente el d&iacute;a anterior, puesto que a&uacute;n recordaba el miedo que pas&oacute; ante la presencia de Aradriel, antes de que &eacute;ste se volviese y les preguntase si estaban bien.</P>
<P ALIGN="JUSTIFY">Aradriel le cont&oacute; lo mismo que a Lorien: que hab&iacute;a estado viajando desde hac&iacute;a mucho tiempo; pero consigui&oacute; desviar la conversaci&oacute;n hacia su conocimiento sobre la etimolog&iacute;a de los nombres. Y Orein se sinti&oacute; maravillado cuando Lorien le cont&oacute; c&oacute;mo hab&iacute;a averiguado el nombre de su madre, aunque se not&oacute; en el rostro del anciano, que le dol&iacute;a recordar el nombre de Lien. </P>
<P ALIGN="JUSTIFY">Tambi&eacute;n le cont&oacute; Lorien la historia del Sauce Llor&oacute;n, como una ni&ntilde;a que le ense&ntilde;a orgullosa un peque&ntilde;o trofeo a su padre, pidi&eacute;ndole disculpas t&iacute;midamente a Eradil / Aradriel por haberla contado tan mal, seg&uacute;n ella.</P>
<P ALIGN="JUSTIFY">Orein escuch&oacute; la historia tan perplejo como lo hiciera Lorien, sin poder dar cr&eacute;dito a lo que o&iacute;a, y en m&aacute;s de una ocasi&oacute;n, estando a punto de decirle a su hija que se detuviera por sus blasfemias. Pero la propia historia, y el suceso que le aconteci&oacute; el d&iacute;a anterior, le fueron abriendo a&uacute;n m&aacute;s, una peque&ntilde;a luz que iluminaba su oscuro desconocimiento. Y no dijo nada, ni pregunt&oacute; nada.</P>
<P ALIGN="JUSTIFY">Al final, ante los ruegos de ambos, puesto que Orein deseaba, ansiaba conocer m&aacute;s sobre esas cosas prohibidas, Aradriel accedi&oacute; a contar otra. Una de las muchas que conoc&iacute;a, y que un d&iacute;a, aprendi&oacute; de un anciano ciego que contaba a su vez historias por una m&iacute;sera cena y un lugar caliente donde dormir. Y aunque Orein se daba perfecta cuenta de que Aradriel evitaba ciertos temas, disfrut&oacute; con el relato; algo tan nuevo y a la vez tan inusitado para &eacute;l, que se sent&iacute;a como un ni&ntilde;o al que su abuelo sentaba en sus rodillas. Pero no para aguantar sus batallitas, sino para sumirlo en una neblina de fantas&iacute;as, de cuentos de hadas y de perversos magos, y sentir orgulloso que su abuelo le dedica toda su atenci&oacute;n. </P>
<P ALIGN="JUSTIFY">Y por el temor se fue desvaneciendo tanto en &eacute;l como en su hija, y comenzaron a tener preguntas que hacer, para desesperaci&oacute;n de Aradriel. Esa historia se llamaba, La Amistad de dos guerreros. Y comenzaba as&iacute;:</P>
<P ALIGN="JUSTIFY">&lt;&lt; En una de las muchas batallas que se libraron en la Segunda Creaci&oacute;n, un ej&eacute;rcito de hombres hab&iacute;a sido aniquilado casi en su totalidad por las implacables fuerzas de los centuriones negros del Este. &gt;&gt;</P>
<P ALIGN="JUSTIFY">– <I>¿La Segunda Creaci&oacute;n? </I>–se atrevi&oacute; a preguntar por fin Orein.</P>
<P ALIGN="JUSTIFY">– <I>¿Y qu&eacute; son los centuriones negros? </I>–se le uni&oacute; Lorien con su curiosidad.</P>
<P ALIGN="JUSTIFY">Aradriel, que se vio interrumpido y asaltado de repente, por dos absurdas preguntas, mir&oacute; primero a Orein, y luego a Lorien, y al ver que sus rostros no reflejaban ignorancia, sino inter&eacute;s por lo desconocido, les respondi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>La Segunda Creaci&oacute;n es el nombre que se le da a una de las tres &eacute;pocas que se han sucedido en nuestra historia </I>–y mirando a Lorien, suavizando su expresi&oacute;n inapreciablemente–, <I>y los Centuriones Negros eran los hijos de LorGroud, un ser casi invencible, que no pod&iacute;a ser herido ni por la espada ni por la magia, pero que al final cay&oacute; como todos los dem&aacute;s. </P>
</I><P ALIGN="JUSTIFY">Padre e hija se miraron embelesados, como si les hubiesen descubierto una maravilla.</P>
<P ALIGN="JUSTIFY">Se quedaron en silencio, y Aradriel lo aprovech&oacute; para continuar.</P>
<P ALIGN="JUSTIFY">«Los pocos que hab&iacute;an conseguido escapar del antes orgulloso ej&eacute;rcito de Naugrim, estaban reuni&eacute;ndose en un valle pr&oacute;ximo a las monta&ntilde;as, donde se hab&iacute;a librado la cruenta batalla un d&iacute;a antes. Entre ellos se encontraba Sinder, un joven guerrero que fue obligado por la venganza, a unirse a la guerra entre humanos y bestias. Venganza alimentada por el recuerdo del asesinato de toda su familia.</P>
<P ALIGN="JUSTIFY">Naugrim, el Se&ntilde;or del malogrado ej&eacute;rcito, se encontraba all&iacute;. Estaba ileso, pero con el uniforme desgarrado, la espada mellada y la cota de acero sagrado llena de sangre sardar. Intentaba por todos los medios a su alcance reorganizar lo que quedaba de sus tropas, cuando vio a Sinder.»</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; luchaban los hombres contra esos... monstruos?</I> –volvi&oacute; a interrumpirle Orein.</P>
<P ALIGN="JUSTIFY">Aradriel, visiblemente enfadado, neg&aacute;ndose a aceptar la situaci&oacute;n del pueblo, le respondi&oacute; bastante contrariado:</P>
<P ALIGN="JUSTIFY">– <I>Porque eran o ellos o nosotros. Ten&iacute;a que ser as&iacute;.</P>
</I><P ALIGN="JUSTIFY">La tajante y escueta respuesta, oblig&oacute; a Orein a tener que pensar en esas palabras, sin hacer caso al enfado del joven. Adem&aacute;s, se estaba divirtiendo.</P>
<P ALIGN="JUSTIFY">Aradriel continu&oacute;:</P>
<P ALIGN="JUSTIFY">–<I> Como iba diciendo, Naugrim vio a…</P>
<P ALIGN="JUSTIFY">– ¿Cuantos a&ntilde;os ten&iacute;a Sinder? </I>–se le escap&oacute; a Lorien, que dijo el nombre de Sinder, tan bajo que se perdi&oacute; en el aire, al ver la furibunda mirada que Aradriel le lanz&oacute;.</P>
<P ALIGN="JUSTIFY">– <I>¡Veinticinco! </I>–le dijo el interrumpido–<I> ¿Puedo continuar?</P>
</I><P ALIGN="JUSTIFY">–<I> S&iacute;, claro</I> –se disculp&oacute; Lorien, quien no se amedrent&oacute; por la actitud de su nuevo amigo, y deseando saber m&aacute;s para volver a preguntarle.</P>
<P ALIGN="JUSTIFY">Aradriel lo volvi&oacute; a intentar.</P>
<P ALIGN="JUSTIFY">«Naugrim, el jefe de todos ellos, vio a Sinder. Que ten&iacute;a veinticinco a&ntilde;os.</P>
<P ALIGN="JUSTIFY">– <I>¡Eh, muchacho! Coge tus armas y re&uacute;nete con los dem&aacute;s </I>–, le grit&oacute; al verle inactivo.</P>
<P ALIGN="JUSTIFY">Entonces, el joven que estaba sentado en una gran roca con las manos apoyadas en la empu&ntilde;adura de su espada, le mir&oacute; y dijo:</P>
<P ALIGN="JUSTIFY">– <I>Lo siento, mi Se&ntilde;or, pero no puedo obedecerle.</P>
</I><P ALIGN="JUSTIFY">Al escuchar estas palabras, Naugrim se qued&oacute; perplejo porque nunca se hab&iacute;a atrevido alguien a desobedecerle. Y conteni&eacute;ndose la ira que se hab&iacute;a formado en su interior, m&aacute;s por la desesperada situaci&oacute;n en que se encontraban que por su car&aacute;cter, le grit&oacute; de nuevo:</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute; has dicho? ¡No creo que este sea un momento para bromear, muchacho!</I> –y m&aacute;s calmado, a&ntilde;adi&oacute;– <I>Olvidar&eacute; tus palabras si haces inmediatamente lo que te he ordenado. Tenemos todos muchas preocupaciones. Deber&iacute;as darte cuenta de la situaci&oacute;n en que estamos</I>.»</P>
<P ALIGN="JUSTIFY">– <I>¡Qu&eacute; persona tan insoportable! </I>–intervino de nuevo Orein–. <I>Qu&eacute; persona tan engre&iacute;da. ¿Qui&eacute;n se cre&iacute;a que era?</P>
</I><P ALIGN="JUSTIFY">Aradriel, mir&oacute; resignado al techo, fij&aacute;ndose moment&aacute;neamente en las junturas de los tablones que estaban comenzando a desprenderse, y asumiendo que podr&iacute;a intentar repararlas.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;</I> –a&ntilde;adi&oacute; Lorien–. <I>Pobre muchacho.</P>
</I><P ALIGN="JUSTIFY">–<I> En la guerra</I> –intervino Aradriel–, <I>se debe obedecer al que manda. Le guste o no a quien sea. Algunas veces las &oacute;rdenes eran duras y dif&iacute;ciles de entender, pero como casi siempre, los que estaban al mando eran personas que se lo merec&iacute;an, hab&iacute;a que aceptarlas sin rechistar </I>–y para acabar su lecci&oacute;n, dijo desganadamente–.<I> Por eso se enfad&oacute; Naugrim.</P>
</I><P ALIGN="JUSTIFY">Orein abri&oacute; la boca como en un gesto de comprensi&oacute;n, y Lorien frunci&oacute; el entrecejo para dar a conocer su oposici&oacute;n al comportamiento de Naugrim.</P>
<P ALIGN="JUSTIFY">Aradriel volvi&oacute; a retomar la historia.</P>
<P ALIGN="JUSTIFY">«Tras las "insoportables" palabras del incomprendido Naugrim, Sinder, mirando gravemente a su se&ntilde;or, le confes&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>No. Lo siento. No lo har&eacute;. Tengo que volver.</P>
</I><P ALIGN="JUSTIFY">–<I> ¿Volver? ¿Ad&oacute;nde? </I>–le grit&oacute; otra vez, el hombre, casi sin poder contener su desesperaci&oacute;n y a punto de perder los pocos nervios que a&uacute;n le quedaban.</P>
<P ALIGN="JUSTIFY">– <I>A buscar a mi amigo. A&uacute;n no ha vuelto y no puedo irme dej&aacute;ndolo atr&aacute;s.</P>
</I><P ALIGN="JUSTIFY">Esa fue la respuesta contundente de Sinder. Respuesta que Naugrim encaj&oacute; dolorosamente. Entonces, algo m&aacute;s calmado, como si hubiera comprendido su actitud por la contestaci&oacute;n de Sinder, le pregunt&oacute; en tono condescendiente:</P>
<P ALIGN="JUSTIFY">–<I> ¿Cu&aacute;ndo lo viste por &uacute;ltima vez?</P>
<P ALIGN="JUSTIFY">– Cuando nos atacaron la &uacute;ltima noche, en la monta&ntilde;a que da a este valle. Donde tuvimos que retirarnos.</P>
</I><P ALIGN="JUSTIFY">Y como comprendiendo el dolor que sent&iacute;a, e intentando hacerle comprender la verdad, Naugrim, el Caballero del Rey vencido, le dijo:</P>
<P ALIGN="JUSTIFY">–<I> Lo siento muchacho, pero no creo que ninguno de los que a&uacute;n no est&eacute;n aqu&iacute;, permanezca todav&iacute;a con vida. Ni siquiera los grandes magos han podido escapar de la avalancha arrasadora de bestias y brujos traidores que nos atac&oacute; anoche.</P>
</I><P ALIGN="JUSTIFY">Esperaba que estas palabras, duras pero ciertas, le bastasen para hacerle comprender. Pero lejos de esto, Sinder suspir&oacute;, demostrando que ya era consciente de este hecho, y le respondi&oacute; con resignaci&oacute;n en sus palabras:</P>
<P ALIGN="JUSTIFY">– <I>Lo s&eacute;, pero a&uacute;n as&iacute; tengo que ir.</P>
</I><P ALIGN="JUSTIFY">Y acabando su respuesta, se levant&oacute; y comenz&oacute; a caminar hacia la monta&ntilde;a en la que perdi&oacute; a su amigo. </P>
<P ALIGN="JUSTIFY">Naugrim no sab&iacute;a qu&eacute; hacer. Si lo reten&iacute;a lo tendr&iacute;a que hacer por la fuerza y se ganar&iacute;a para siempre el odio del muchacho; y si lo dejaba marchar lo perder&iacute;a para siempre: acabar&iacute;an con su vida sin ninguna duda.</P>
<P ALIGN="JUSTIFY">Mientras pensaba en esto, mir&oacute; en la direcci&oacute;n en que se hab&iacute;a marchado Sinder, pero ya era demasiado tarde. Se estaba alejando.</P>
<P ALIGN="JUSTIFY">– <I>"No volver&aacute; jam&aacute;s"</I> –asinti&oacute; Naugrim para s&iacute; mismo–. <I>"No pude hacer otra cosa..." </I>–y sonriendo mientras miraba la lejana silueta del joven, a&ntilde;adi&oacute;– <I>¡Suerte!</I>»</P>
<P ALIGN="JUSTIFY">– Al final no era tan malo ¿¡No!? –fue esta vez Aradriel, quien se interrumpi&oacute; a s&iacute; mismo, al ver que Lorien lo iba a intentar de nuevo.</P>
<P ALIGN="JUSTIFY">– <I>No</I> –dijo avergonz&aacute;ndose un poco, la muchacha.</P>
<P ALIGN="JUSTIFY">–<I> Creo que puedo entender a ese hombre</I> –le dijo Orein–.<I> Ten&iacute;a una responsabilidad, y ten&iacute;a que comportarse as&iacute;.</P>
<P ALIGN="JUSTIFY">– "¡Vaya!" </I>–pens&oacute; Aradriel–. <I>"¡Si lo entiende!"</P>
</I><P ALIGN="JUSTIFY">– <I>¿De verdad era tan peligroso el que se marchase solo?</I> –le pregunt&oacute; Lorien, con una entonaci&oacute;n de verdadero inter&eacute;s, y lejos ya de la simple curiosidad.</P>
<P ALIGN="JUSTIFY">Aradriel suspir&oacute;, pero esta vez, no con resignaci&oacute;n, sino con temor por lo que les iba a revelar, y que en vista de sus preguntas, no pod&iacute;an conocer.</P>
<P ALIGN="JUSTIFY">– <I>En esa batalla, o hablando m&aacute;s generalmente, en esa guerra, una de las cuatro que hubo, murieron m&aacute;s de dos millones de seres. Y m&aacute;s de la mitad eran humanos.</P>
</I><P ALIGN="JUSTIFY">Orein lo mir&oacute; sorprendido, y Lorien se sobresalt&oacute;.</P>
<P ALIGN="JUSTIFY">– <I>¿Un mill&oacute;n de personas?, ¿muertas por una guerra? </I>–le pregunt&oacute; estupefacto, Orein.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;</I> –le respondi&oacute; Aradriel–. <I>Por eso le dije antes que eran o ellos o nosotros. Si no hubi&eacute;ramos ganado en esa ocasi&oacute;n, el resto de la humanidad hubiera sucumbido totalmente... y ahora nosotros no estar&iacute;amos aqu&iacute;.</P>
</I><P ALIGN="JUSTIFY"> Se mantuvieron en un tenso silencio, y Aradriel lo intent&oacute; vencer, continuando la historia.</P>
<P ALIGN="JUSTIFY">«Hab&iacute;an pasado dos d&iacute;as desde que Sinder se fuera, cuando uno de los vig&iacute;as grit&oacute;, alarmando a todos los que a&uacute;n permanec&iacute;an con vida.</P>
<P ALIGN="JUSTIFY">–<I> ¡Por all&iacute; viene un humano!</P>
</I><P ALIGN="JUSTIFY">Y Naugrim se asom&oacute; por la empalizada y se sorprendi&oacute; por lo que vio. </P>
<P ALIGN="JUSTIFY">Un pat&eacute;tico despojo humano ven&iacute;a apoy&aacute;ndose en la espada, y ten&iacute;a todo el cuerpo lleno de heridas y ensangrentado. Apenas consegu&iacute;a dar dos pasos sin tener que recuperar el resuello, como si fuera un decr&eacute;pito anciano que sube una escalera y no ceja en su empe&ntilde;o a costa de su propia vida.</P>
<P ALIGN="JUSTIFY">Naugrim mir&oacute; en derredor. Llam&oacute; a los vig&iacute;as y les pregunt&oacute; si pod&iacute;an ver alguna se&ntilde;al del enemigo, y ante las respuestas negativas, orden&oacute; que salieran dos hombres para ir a recogerlo. Cuando los hombres volvieron con el cuerpo sin sentido entre sus brazos, Naugrim vio al hombre, y no pudo creer lo que ve&iacute;a.</P>
<P ALIGN="JUSTIFY">Era Sinder.</P>
<P ALIGN="JUSTIFY">Sin fuerzas y sin consciencia, lo llevaron a la tienda de los heridos. Entonces Naugrim fue a su lado, y le dijo al verle abrir los ojos:</P>
<P ALIGN="JUSTIFY">– <I>Nunca hubiera imaginado que regresar&iacute;as... ¿Encontraste a tu amigo?</P>
</I><P ALIGN="JUSTIFY">Sinder trag&oacute; un poco de agua que le ofrecieron, pero su garganta se neg&oacute; a aceptarlo, y la expuls&oacute; a la vez que varios hilillos de sangre asomaban por las comisuras de sus labios. Tras recuperarse un poco, le respondi&oacute; quejosamente.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;</I> –y con amargura concluy&oacute;– <I>Pero ha muerto.</P>
</I><P ALIGN="JUSTIFY">Y Naugrim entre col&eacute;rico y comprensivo le dijo con dureza:</P>
<P ALIGN="JUSTIFY">– <I>No deb&iacute;a de hab&eacute;rtelo permitido. Por mi culpa he perdido a dos hombres en lugar de uno. ¿De qu&eacute; te ha servido ir a buscarle, si lo sab&iacute;as? ¿Por qu&eacute; lo hiciste?</I></P>
<P ALIGN="JUSTIFY">Y con un gemido de dolor que le hizo cerrar los ojos, trat&oacute; de responderle, mas no pudo en ese momento. Tras unos instantes los abri&oacute;, y estaban llenos de l&aacute;grimas que revelaban una mezcla de angustia, de dolor, pero a la vez de descanso en su coraz&oacute;n, y dijo:</P>
<P ALIGN="JUSTIFY">– <I>Porque cuando lo encontr&eacute; estaba en un monte lleno de &aacute;rboles muy altos. En el centro de un bosque... ¡y estaba vivo! Y cuando despert&oacute; por &uacute;ltima vez, unos segundos antes de morir me dijo con felicidad en su mirada:  </P>
<P ALIGN="JUSTIFY">– Te estaba esperando. Sab&iacute;a que vendr&iacute;as. Ahora ya puedo morir en paz, pero siento haberte hecho venir, amigo m&iacute;o. No tendr&iacute;amos que haber hecho esta promesa.</I></P>
<P ALIGN="JUSTIFY">– <I>No lo sientas</I> –le dije–.<I> Yo no me arrepiento. Nos juramos amistad para siempre y yo no pod&iacute;a fallarte. No pod&iacute;a dejarte si hubiera habido la m&aacute;s m&iacute;nima posibilidad de que estuvieras vivo. ¿C&oacute;mo pod&iacute;a dejar de buscarte?</P>
</I><P ALIGN="JUSTIFY">– <I>Gracias por ser mi amigo</I> –me respondi&oacute;–. <I>Te esperar&eacute; en el otro mundo donde se dice que los Dioses no tienen poder sobre las vidas, y uno puede ser por fin feliz. Adi&oacute;s, amigo</I>–. – <I>Y cerr&oacute; los ojos para no abrirlos nunca m&aacute;s en este mundo.</P>
</I><P ALIGN="JUSTIFY">Tras contarle esto, le dijo a Naugrim:</P>
<P ALIGN="JUSTIFY">– <I>Por eso no pod&iacute;a fallarle</I> –y subiendo el tono de voz y demostrando a la vez m&aacute;s ira y rabia en sus palabras– <I>¿Entiende? ¡No pod&iacute;a fallarle a mi amigo! ¿Y si lo hubiera podido salvar? ¡¿C&oacute;mo hubiera podido vivir sabiendo que podr&iacute;a haber estado esper&aacute;ndome?!</P>
</I><P ALIGN="JUSTIFY">Y tras una sonrisa en los labios de Sinder, Naugrim mir&oacute; la Luna, que hab&iacute;a aparecido entre las monta&ntilde;as, y rog&oacute; por &eacute;l. </P>
<P ALIGN="JUSTIFY">Despu&eacute;s de algunos segundos, cerr&oacute; los ojos que miraban hacia la Luna, del cuerpo sin vida. Del cuerpo del joven que muri&oacute; a su lado. Que muri&oacute; con la amistad de su amigo en el coraz&oacute;n.</P>
<P ALIGN="JUSTIFY">Y ese fue el final.»</P>
<P ALIGN="JUSTIFY">Cuando Aradriel concluy&oacute; esta historia, el silencio que estuvo agazapado, esperando a que las palabras de Aradriel se esfumasen, apareci&oacute; de nuevo inund&aacute;ndolo todo.</P>
<P ALIGN="JUSTIFY">Orein miraba, desde su Butaca y a trav&eacute;s de la ventana, la Monta&ntilde;a; perdi&eacute;ndose sus pensamientos en su tit&aacute;nica altitud. </P>
<P ALIGN="JUSTIFY">Lorien sonre&iacute;a ligeramente, como si ella fuera la que la hubiera contado, orgullosa porque su padre hab&iacute;a podido o&iacute;rla. Pero Orein no sab&iacute;a si esa historia pod&iacute;a aceptarla como verdadera, aunque como un cuento val&iacute;a la pena escucharla. </P>
<P ALIGN="JUSTIFY">Para casi todos los habitantes del pueblo de Eslariot, restos del antiguo reino y ciudad de Eslariot, el pasado que se remontase a m&aacute;s de una vida de humano, era como algo nebuloso. Ni siquiera se ten&iacute;a en cuenta. Y ahora, este joven, lo recordaba como algo real y que una vez existi&oacute;. Como si fuera algo normal y que hubiera sucedido ayer.</P>
<P ALIGN="JUSTIFY">– <I>"¿Tan ciegos hemos estado?"</I> –se pregunt&oacute;, extra&ntilde;&aacute;ndose a s&iacute; mismo por la pregunta.– <I>"Nunca me hab&iacute;a planteado el que en el pasado hubieran sucedido cosas que nos hubieran determinado nuestro presente." ¡Es incre&iacute;ble! </I>–dijo por fin, elevando sus pensamientos sin darse cuenta.</P>
<P ALIGN="JUSTIFY">Lorien lo mir&oacute; extra&ntilde;ada, y Aradriel se qued&oacute; un poco perplejo. Tras un segundo de indecisi&oacute;n por parte de todos, Aradriel le pregunt&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>¿El qu&eacute; es incre&iacute;ble, la historia?</P>
<P ALIGN="JUSTIFY">– No... bueno..., s&iacute;</I> –le respondi&oacute; Orein d&aacute;ndose cuenta de que hubiera sido mejor haber contenido sus palabras–. <I>Hasta ahora ni siquiera hab&iacute;a sido consciente de que hab&iacute;a existido el pasado– </I>le dijo francamente, pero llev&aacute;ndose la mano a la cabeza, como para disimular su desconocimiento.</P>
<P ALIGN="JUSTIFY">Aradriel se qued&oacute; totalmente perplejo por la absurda respuesta de Orein, pero al momento record&oacute; la situaci&oacute;n del pueblo, y sus preguntas.</P>
<P ALIGN="JUSTIFY">–<I> Entonces, ¿no sab&eacute;is nada del pasado?, ¿no sab&eacute;is de d&oacute;nde vienen las gentes que fundaron este pueblo?, ¿ni siquiera sab&eacute;is por qu&eacute; esa nefasta monta&ntilde;a os sume diariamente en el temor?</P>
</I><P ALIGN="JUSTIFY">Lorien y Orein se quedaron abrumados por tantas preguntas que ni siquiera hubieran sido capaces de plantearse. No sab&iacute;an nada de lo que estaba preguntando Aradriel. Se dieron cuenta, aunque poco a poco, de que hab&iacute;an estado sumidos en una inconsciencia total, sobre todo cuando Aradriel les pregunt&oacute;, sin poder creer a su vez que ellos desconoc&iacute;an que exist&iacute;a un pasado, si ni siquiera conoc&iacute;an el motivo por el que a la Luna se la llamaba Seriant. Lorien fue la primera en hablar. Se acord&oacute; de la historia del Sauce Llor&oacute;n, y comenz&oacute; a asociar algunas cosas. </P>
<P ALIGN="JUSTIFY">– <I>¿Seriant era la esposa del hombre que estaba en el &aacute;rbol?– </I>le pregunt&oacute; a Aradriel con la convicci&oacute;n de que estaba diciendo una tonter&iacute;a.</P>
<I><P ALIGN="JUSTIFY">– Lo hubiera sido si los Dioses no se hubieran interpuesto </I>–fue la tajante respuesta del joven.</P>
<P ALIGN="JUSTIFY">A Lorien se le eriz&oacute; el bello de los brazos y sinti&oacute; un s&uacute;bito escalofr&iacute;o, al reconocer por fin que hab&iacute;an pasado todas las cosas que Aradriel le hab&iacute;a contado, y al darse cuenta de que todo eso estaba en contra de sus creencias en los Dioses. Dioses, divinidades que s&oacute;lo tra&iacute;an el bien a sus vidas y que castigaban s&oacute;lo a quienes se comportaban perversamente. Qu&eacute; ideas tan confrontadas se cotejaron en su mente.</P>
<P ALIGN="JUSTIFY">– <I>¿De qu&eacute; est&aacute;is hablando?</I> –pregunt&oacute; Orein, a&uacute;n fascinado por todas las perspectivas que se estaban abriendo en su apagada mente–<I> ¿De esa historia del Sauce que contaste antes, Lorien?</P>
</I><P ALIGN="JUSTIFY">Hasta ese momento, para Orein, la historia del Sauce era un cuento para ni&ntilde;os, pero tambi&eacute;n sinti&oacute; una intranquilidad al siquiera pensar que pod&iacute;a haber sido cierta.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, padre </I>–le respondi&oacute; Lorien, y ahora dirigi&eacute;ndose a Aradriel le pregunt&oacute; ansiosa por saber m&aacute;s cosas–<I> ¿Y por qu&eacute; se le llama a la Luna, Seriant?</P>
</I><P ALIGN="JUSTIFY">– <I>Esa es otra historia del pasado </I>–le respondi&oacute; cansinamente Aradriel.</P>
<P ALIGN="JUSTIFY">A Lorien no le gust&oacute; la respuesta, y frunciendo el ce&ntilde;o le dijo:</P>
<P ALIGN="JUSTIFY">– <I>¿Y qui&eacute;n era ese hombre que estaba en el sauce?, ¿por qu&eacute; estaba all&iacute;?.</P>
</I><P ALIGN="JUSTIFY">Aradriel tuvo que responder, Lorien lo miraba demasiado fijamente.</P>
<P ALIGN="JUSTIFY">–<I> Ese hombre era uno de los m&aacute;s afamados guerreros de la Segunda Creaci&oacute;n. Fue uno de los componentes de los Caballeros de la Magia, la elite de los soldados del Rey de Eslariot. En una de las batallas, muri&oacute;, pero antes perjur&oacute; contra los Dioses, aunque en ese momento, al &uacute;nico al que pertenec&iacute;a era a Dharmsqui. Seriant se suicid&oacute; por &eacute;l. Pasaron muchas cosas como para contarlas a la ligera.</P>
</I><P ALIGN="JUSTIFY">– <I>Pues tienes que cont&aacute;rmelas, ¿verdad padre? </I>–a&ntilde;adi&oacute; Lorien, para reforzar su petici&oacute;n. </P>
<P ALIGN="JUSTIFY">Orein que estaba ensimismado en sus propios pensamientos, sali&oacute; de ellos y le dijo al joven:</P>
<P ALIGN="JUSTIFY">– <I>¡Por supuesto! Nos encantar&iacute;a que nos contaras todo lo que sabes </I>–Aradriel exhal&oacute; un afectado suspiro–<I> pero ser&aacute; ma&ntilde;ana. Ahora debemos acostarnos. Ya es tarde</I> –dijo mirando el reloj de pared que ten&iacute;a frente a &eacute;l. Pero aunque estaba deseoso de saber m&aacute;s, en realidad quer&iacute;a quedarse s&oacute;lo para pensar y ordenar sus ideas, puesto que aquella noche, le hab&iacute;an puesto en jaque todas las ideas preconcebidas que aceptaba desde siempre por imposici&oacute;n de la cultura de su pueblo.</P>
<P ALIGN="JUSTIFY">Y Aradriel, aliviado moment&aacute;neamente, aunque sabedor de que de &eacute;sta no se escapaba, se despidi&oacute; y se alej&oacute; r&aacute;pidamente para evitar que se arrepintiera su anfitri&oacute;n de su decisi&oacute;n.</P>
<P ALIGN="JUSTIFY">Lorien se qued&oacute; desilusionada. </P>
<P ALIGN="JUSTIFY">– <I>¡¿Por qu&eacute; hay que esperar hasta ma&ntilde;ana?!</I> –le dijo severamente a su padre, cuando se march&oacute; el muchacho.</P>
<P ALIGN="JUSTIFY">Pero Orein le sonri&oacute; ligeramente, sumido en sus pensamientos. Y Lorien se march&oacute; enfadada, afectada como a una ni&ntilde;a a la que se le niega algo y no est&aacute; acostumbrada a las negativas. </P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







