<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 12. Despedida.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Largo rato despu&eacute;s, lleg&oacute; Aradriel. Estaba casi ahogado por la fren&eacute;tica carrera que emprendi&oacute; al percibir los obscenos estertores que asolaron la tierra, por el llanto de Dharmsqui. </P>
<P ALIGN="JUSTIFY">Se encontr&oacute; con el resultado de lo que hab&iacute;a pasado. </P>
<P ALIGN="JUSTIFY">En el suelo yac&iacute;an dos cuerpos sin vida, y Lorien llorando junto a su padre. </P>
<P ALIGN="JUSTIFY">Se qued&oacute; como petrificado mirando la absurda escena, como si hubiera sido sacada de cualquier demon&iacute;aco relato.</P>
<P ALIGN="JUSTIFY">– <I>¡No!</I> –consigui&oacute; musitar al fin. Y acerc&aacute;ndose tan r&aacute;pido como pudo a Lorien al recuperar el movimiento de sus miembros, le dijo sin ning&uacute;n acierto:</P>
<P ALIGN="JUSTIFY">– <I>¡Lorien! ¿Qu&eacute; ha pasado?</P>
</I><P ALIGN="JUSTIFY">Y la joven, al ver a alguien conocido, al ver que alguien a quien no odiaba, sino todo lo contrario, hab&iacute;a vuelto, se levant&oacute; y se abraz&oacute; desoladamente al muchacho que miraba con consternaci&oacute;n el cuerpo de Orein.</P>
<P ALIGN="JUSTIFY">– <I>Est&aacute; muerto</I> –le dijo entre sollozos la desconsolada Lorien.</P>
<P ALIGN="JUSTIFY">Lorien estaba ba&ntilde;ada en sangre. Estaba marcada por lo que hab&iacute;a hecho.</P>
<P ALIGN="JUSTIFY">El joven nada supo hacer para aliviar su dolor. Pero consigui&oacute; apartarla de all&iacute; y llevarla dentro de la casa mientras le contaba lo que hab&iacute;a sucedido.</P>
<P ALIGN="JUSTIFY">Ella estaba completamente agotada y sin ganas de vivir, y a Aradriel le cost&oacute; much&iacute;simo convencerla de que ya no pod&iacute;a hacer nada por su padre, que se ten&iacute;a que acostar y descansar. La ayud&oacute; a limpiarse la sangre, y percibi&oacute; que no estaba con una persona l&uacute;cida, sino con una especie de marioneta que hac&iacute;a todo lo que se le dec&iacute;a.</P>
<P ALIGN="JUSTIFY">Y cuando consigui&oacute; que se durmiera entre sollozos, sali&oacute; al encuentro de los dos muertos. </P>
<P ALIGN="JUSTIFY">Primero mir&oacute; con repugnancia el maltrecho cad&aacute;ver de Morth, y su asco se torn&oacute; ira al ver su lacerado rostro. Decidi&oacute; esconderlo y confi&oacute; en que nadie se hubiera enterado de lo que hab&iacute;a pasado esa noche. Llev&oacute; el cuerpo al bosque, y all&iacute; lo enterr&oacute; y puso fin a su existencia sobre la tierra.</P>
<P ALIGN="JUSTIFY">Volvi&oacute;, cada vez m&aacute;s consternado, al lugar donde a&uacute;n estaba Orein, y decidi&oacute; enterrarlo al lado de su casa, donde sab&iacute;a que reposaban los restos de su mujer y de su hijo.</P>
<P ALIGN="JUSTIFY">Aunque le cost&oacute; un inmenso trabajo, consigui&oacute; limpiar la sangre que cubr&iacute;a el empedrado de la entrada.</P>
<P ALIGN="JUSTIFY">Por fin entr&oacute; a la casa, y se derrumb&oacute; sobre una silla. All&iacute; se qued&oacute; dormido, hasta que la penumbra que preced&iacute;a al amanecer, le despert&oacute; sus sentidos alarmados, que todav&iacute;a no se hab&iacute;an vuelto a acostumbrar al extra&ntilde;o suceso de todas las ma&ntilde;anas.</P>
<P ALIGN="JUSTIFY">Se levant&oacute; dolorosamente por la postura en que se qued&oacute; dormido y fue al cuarto de Lorien. </P>
<P ALIGN="JUSTIFY">La muchacha estaba echada de lado sobre la cama. Su larga melena se desparramaba sobre las s&aacute;banas, ti&ntilde;&eacute;ndolas de un profundo color negro. Ten&iacute;a las mejillas ardiendo y los contornos de los ojos hinchados. Hab&iacute;a estado toda la noche llorando, incluso en sue&ntilde;os.</P>
<P ALIGN="JUSTIFY">No la quiso despertar, pero ella abri&oacute; lentamente sus torturados y negros ojos, y al ver el rostro de Aradriel, supo que lo que hab&iacute;a pasado no fue una pesadilla, sino que continuaba a&uacute;n.</P>
<I><P ALIGN="JUSTIFY">– No te levantes</I> –le dijo Aradriel–. <I>Qu&eacute;date acostada. Yo me he ocupado de todo.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Qu&eacute; has hecho? </I>–le pregunt&oacute; Lorien, incorpor&aacute;ndose, sin aceptar las palabras del joven. </P>
<P ALIGN="JUSTIFY">–<I> Los he enterrado... a los dos</I> –y al ver que Lorien se levantaba y se dirig&iacute;a hacia la puerta, se interpuso entre ella y la salida de la habitaci&oacute;n. </P>
<P ALIGN="JUSTIFY">Los ojos de Lorien se volvieron a humedecer e intent&oacute; golpear con ambos pu&ntilde;os el pecho de Aradriel, pero al llegar hasta el cuerpo del joven, la fuerza cedi&oacute; y su amigo le sujet&oacute; las mu&ntilde;ecas firmemente, forz&aacute;ndola a que le mirase a los ojos.</P>
<P ALIGN="JUSTIFY">– <I>Tienes que sobreponerte a esto</I> –le dijo sin poder mantener firme su voz–. <I>Nadie debe saber lo que ha pasado aqu&iacute; </I>–y al ver que la muchacha intentaba decir algo, solt&oacute; una de sus mu&ntilde;ecas, y puso t&iacute;midamente un dedo en sus labios–. <I>No digas nada. Morth ha desaparecido para siempre, y tu padre descansa junto al resto de tu familia.</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;</I> –dijo Lorien sujetando a su vez la mano que ten&iacute;a Aradriel sobre sus labios–. <I>Toda mi familia –</I>y apartando la mirada hacia otro lado–.<I> Ya no hay nadie m&aacute;s. Tambi&eacute;n se lo tuvieron que llevar a &eacute;l. ¿Por qu&eacute;, Aradriel? ¿Por qu&eacute;...?</P>
</I><P ALIGN="JUSTIFY">Aradriel no sab&iacute;a qu&eacute; decirle, puesto que esas mismas preguntas se las hizo &eacute;l hace much&iacute;simo tiempo. Much&iacute;simo antes de que Lorien naciera. Y como entonces, no supo responder.</P>
<P ALIGN="JUSTIFY">–<I> No lo s&eacute;</I> –le dijo francamente–. <I>Ni creo que haya nadie que lo sepa. Pero tienes que aguantar y ser fuerte ante Ellos </I>–y aumentando una ira que lo  corro&iacute;a–.<I> Lo que s&iacute; s&eacute; es qui&eacute;n es el culpable. Ellos lo hicieron.</P>
</I><P ALIGN="JUSTIFY">Lorien sab&iacute;a que era verdad. Que ten&iacute;a que ser as&iacute;. Y lentamente, acerc&oacute; su cuerpo al de Aradriel, buscando su consuelo, buscando su ayuda.</P>
<P ALIGN="JUSTIFY">Y all&iacute; se quedaron durante largo rato. El uno abrazado al otro.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Los tristes y lentos d&iacute;as en que se convirtieron sus vidas, avanzaron inexorablemente, y los murmullos de la desaparici&oacute;n de Morth y del hecho de que ni Lorien ni su padre ven&iacute;an ya a trabajar al pueblo, se hicieron eco en todos los habitantes de Eslariot.</P>
<P ALIGN="JUSTIFY">Algunos curiosos, no teniendo nada mejor que hacer, se acercaron furtivamente a la casa de Lorien, y all&iacute; pudieron observar que hab&iacute;a una tumba m&aacute;s. Y al conseguir ver por entre las ventanas a Lorien y al extranjero, y no apreciar ninguna presencia de Orein, volvieron al pueblo, alimentando de nuevo el motivo de las cr&iacute;ticas.</P>
<P ALIGN="JUSTIFY">Afortunadamente, la tumba de Morth no se encontr&oacute;. Y aunque algunos intentaron relacionar la muerte de Orein con la desaparici&oacute;n de Morth, apenas tom&oacute; fuerza, puesto que los furtivos comentarios que se convirtieron en torrentes de conversaciones, se centraron en afirmar que todo lo que hab&iacute;a pasado era culpa de la venida de ese extra&ntilde;o. Y desearon que se fuera, a&uacute;n con m&aacute;s fuerza que antes.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Aradriel no pod&iacute;a verla as&iacute;. Estaba completamente inconsolable. Ya no sab&iacute;a qu&eacute; hacer por ella. Ni siquiera atend&iacute;a ya cuando le intentaba contar una de las pocas historias alegres que conoc&iacute;a. Ni siquiera sonri&oacute; cuando le cont&oacute; c&oacute;mo uno de los h&eacute;roes del pasado aprendi&oacute; a luchar en la m&aacute;s famosa taberna de la ciudad de Eslariot, "El Poney Hostiador".</P>
<P ALIGN="JUSTIFY">Lorien estaba la mayor parte del tiempo junto a la tumba de su padre, sin fuerzas para hacer otra cosa. </P>
<P ALIGN="JUSTIFY">Y Aradriel, sin poder hacer nada por ella para aliviarle el dolor, decidi&oacute; hacer algo a lo que siempre hab&iacute;a temido.</P>
<P ALIGN="JUSTIFY"> Decidi&oacute; realizar un sacrificio por ella. </P>
<P ALIGN="JUSTIFY">Le dijo a Lorien que se iba. </P>
<P ALIGN="JUSTIFY">– <I>Me voy</I> –le dijo con la mayor dulzura que era capaz de poner en sus palabras.</P>
<P ALIGN="JUSTIFY">Lorien levant&oacute; la mirada desde la tumba de su padre hasta los ojos del joven. Y esos ojos verdes reflejaban dolor. Sobre todo por ella, pero tambi&eacute;n por &eacute;l mismo. Y casi como si a Lorien no le importase nada en el mundo, le dijo adi&oacute;s.</P>
<P ALIGN="JUSTIFY">– <I>Volver&eacute;. Volver&eacute; muy pronto </I>–le dijo al ver que la joven volv&iacute;a a prestar toda su atenci&oacute;n a la tumba de su padre.</P>
<P ALIGN="JUSTIFY">Y no queriendo alargar m&aacute;s ese momento, se arrodill&oacute; junto a ella, la abraz&oacute; fugazmente, y se fue. Parti&oacute; acord&aacute;ndose de lo que se prometi&oacute; a s&iacute; mismo el d&iacute;a en que Lorien fue a buscarlo en una noche de tormenta. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Pasaron otros pocos d&iacute;as y Aradriel estaba en la cima de una monta&ntilde;a con la mirada hacia el cielo. </P>
<P ALIGN="JUSTIFY">– <I>Estoy cansado... estoy demasiado cansado</I> –dijo en voz muy baja, como queriendo compartir su tristeza, pero sin atreverse a hacerlo.</P>
<P ALIGN="JUSTIFY">Era de noche y pod&iacute;a ver a Seriant que estaba oculta en parte por una gran monta&ntilde;a cubierta de nieve, que brillaba con su luz. Lo que all&iacute; ocurri&oacute; s&oacute;lo lo supo &eacute;l, pero en cierto momento posterior a su vida, se pudo saber lo siguiente:</P>
<P ALIGN="JUSTIFY">–<I> Habl&oacute; con ellos. Y ninguno se dign&oacute; a hacerle caso, salvo uno. Fue Dharmsqui qui&eacute;n accedi&oacute; a escucharle. Entonces le explic&oacute; lo que hab&iacute;a pasado, aunque era innecesario, puesto que &Eacute;l ya lo sab&iacute;a. Y tambi&eacute;n le cont&oacute; lo que quer&iacute;a hacer. Ella ser&iacute;a quien ganase con el cambio, y &eacute;l quien saliera perdiendo. El humano crey&oacute; que esto fue lo que sirvi&oacute; para que aceptase, pero el verdadero motivo nunca lo supo. Nunca pudo saber que ese Dios, al igual que otros muchos, estaba arrepentido.</P>
</I><P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">En una noche posterior, Lorien estaba sentada en la entrada de su casa, donde le gustaba hacerlo a Orein. Junto a ella estaba la Butaca de su padre, ya para siempre vac&iacute;a. Todo estaba en silencio salvo por el canto de los grillos. Entonces, pudo ver a los lejos una sombra que se iba acercando y que, tras unos momentos, consigui&oacute; reconocer.</P>
<P ALIGN="JUSTIFY">– <I>Hola, Lorien</I> –dijo Aradriel esperanzadamente, al llegar a su altura–, <I>como te dije, he vuelto. </P>
</I><P ALIGN="JUSTIFY">Lorien lo mir&oacute; con unos ojos casi inexpresivos, por el exceso del dolor, e intentando sonre&iacute;rle, pero fracasando en el intento, le pregunt&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; has vuelto?</P>
</I><P ALIGN="JUSTIFY">Aradriel no se esperaba esta pregunta, y a modo de defensa aleg&oacute;:</P>
<I><P ALIGN="JUSTIFY">– Por ti... ¿Est&aacute;s preparada?</I> –a&ntilde;adi&oacute; tras unos segundos de silencio. </P>
<P ALIGN="JUSTIFY">–<I> ¿Para qu&eacute;?</I> –pregunt&oacute; Lorien sorprendida, y a&ntilde;adi&oacute; sin ning&uacute;n atisbo de ilusi&oacute;n– <I>¿Qu&eacute; es lo que esperas de m&iacute;?</P>
</I><P ALIGN="JUSTIFY">–<I> S&oacute;lo quiero ayudarte</I> –se defendi&oacute; Aradriel, como si Lorien le estuviera acusando de algo–. <I>Han aceptado lo que les he ofrecido</I> –confes&oacute; por fin–<I> y a cambio me han concedido un deseo... Ven conmigo.</I> </P>
<P ALIGN="JUSTIFY">Y le ofreci&oacute; su mano. </P>
<P ALIGN="JUSTIFY">Lorien le mir&oacute; perpleja. Tras un momento, se levant&oacute; y se la acept&oacute;, march&aacute;ndose juntos y perdi&eacute;ndose en la oscuridad. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Cuando llegaron a una zona del r&iacute;o, sin ninguna pregunta que remediara el silencio, Aradriel le dijo a Lorien:</P>
<P ALIGN="JUSTIFY">– <I>&Eacute;sta es mi promesa. Ten confianza en m&iacute;. Cierra los ojos y, cuando te diga, salta hacia el agua.</P>
</I><P ALIGN="JUSTIFY">–<I> Pero... </I>–intent&oacute; protestar Lorien.</P>
<P ALIGN="JUSTIFY">– <I>Por favor, conf&iacute;a en m&iacute; </I>–la interrumpi&oacute; Aradriel.</P>
<P ALIGN="JUSTIFY">– <I>Est&aacute; bien </I>–acept&oacute; la muchacha, perdida su mirada en la sinceridad de los extra&ntilde;os ojos verdes de su amigo.</P>
<P ALIGN="JUSTIFY">Se cogieron de la mano, y cuando Aradriel se lo dijo, ambos saltaron a las aguas del r&iacute;o. </P>
<P ALIGN="JUSTIFY">Y desaparecieron en &eacute;l.</P>
<P ALIGN="JUSTIFY">Lorien abri&oacute; los ojos y no pudo creer lo que vio. Estaba en el mundo que ella conoc&iacute;a, pero algo le dec&iacute;a que no era as&iacute;. Quiz&aacute;s fuese la luz que se reflejaba en todas las cosas que exist&iacute;an sobre esa tierra, o las brisas que corr&iacute;an entre los &aacute;rboles, o los animales que se encontraban a la vista de todos sin temor a los humanos.</P>
<P ALIGN="JUSTIFY">– <I>¿D&oacute;nde estamos?</I> –le pregunt&oacute; a Aradriel, alegrada ligeramente su alma por el espect&aacute;culo que se desplegaba ante ella.</P>
<P ALIGN="JUSTIFY">– <I>No lo s&eacute; ciertamente</I> –reconoci&oacute; Aradriel, y sonri&eacute;ndole al mirar por encima del hombro de Lorien, concluy&oacute;–, <I>pero si te das la vuelta, podr&aacute;s ver algo que te har&aacute; muy feliz.</P>
</I><P ALIGN="JUSTIFY">Lorien mir&oacute; tras de s&iacute; y lo que vio, le llen&oacute; el coraz&oacute;n de felicidad. La profunda tristeza desapareci&oacute; de golpe, y la sorpresa la desbord&oacute;.</P>
<P ALIGN="JUSTIFY"> A unos pocos metros de ella, vio lo que nunca dej&oacute; de so&ntilde;ar, y llorando de alegr&iacute;a se volvi&oacute; de nuevo al joven y le dijo emocionada:</P>
<P ALIGN="JUSTIFY">–<I> Gracias, ¡gracias! </I>–y corri&oacute; hacia las personas que la estaban esperando. Se abrazaron como si nunca m&aacute;s se volvieran a ver, como pidiendo perd&oacute;n por no haberlo hecho antes, y habiendo estado dese&aacute;ndolo durante toda la eternidad.</P>
<P ALIGN="JUSTIFY">Tras unos minutos, Lorien se volvi&oacute; hacia su amigo, y le indic&oacute; que se acercara.</P>
<P ALIGN="JUSTIFY">Aradriel lo hizo, y mir&oacute; a la mujer cuya felicidad se marcaba en sus ojos.</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n mir&oacute; a las otras personas, pero no pod&iacute;an verlo a &eacute;l.</P>
<P ALIGN="JUSTIFY">– <I>¿C&oacute;mo... c&oacute;mo pudiste hacer esto? </I>–le dijo Lorien sin poder contener las l&aacute;grimas que ahora eran de felicidad; tan en contraste con su desesperaci&oacute;n de hac&iacute;a pocos minutos.</P>
<P ALIGN="JUSTIFY">– <I>No te preocupes por eso</I> –le dijo tiernamente Aradriel–, <I>yo te lo promet&iacute;, bueno, me lo promet&iacute;... lo que tienes aqu&iacute; es lo &uacute;nico que importa.</P>
</I><P ALIGN="JUSTIFY">– <I>Gracias... por todo</I> –le agradeci&oacute; Lorien con los negros ojos nublados por las l&aacute;grimas. Entonces se fij&oacute; de nuevo en los extra&ntilde;os ojos verdes de su amigo, y tras una sonrisa en sus labios a&ntilde;adi&oacute;, no sin un ligero desaz&oacute;n–. <I>Te deseo que alg&uacute;n d&iacute;a te re&uacute;nas con ella... y se cumpla tambi&eacute;n tu sue&ntilde;o</I> –y el muchacho sonri&oacute; tambi&eacute;n–. <I>No s&eacute; c&oacute;mo lo has logrado, pero te estar&eacute; eternamente agradecida.</P>
</I><P ALIGN="JUSTIFY">Y se ech&oacute; en los brazos del joven, que tambi&eacute;n lloraba. </P>
<P ALIGN="JUSTIFY">Tras unos segundos, se separ&oacute; de &eacute;l y d&aacute;ndole un beso en la mejilla, pero deseando algo m&aacute;s, termin&oacute; diciendo:</P>
<P ALIGN="JUSTIFY">– <I>Gracias Aradriel... gracias Eradil </I>–a&ntilde;adi&oacute; condescendiente, como compartiendo un secreto con el muchacho–. <I>Por una vez dar&eacute; gracias a los Dioses por haberme permitido conocerte.</P>
</I><P ALIGN="JUSTIFY">Y tras mirarlos de nuevo a todos, tuvo tiempo durante un segundo de mirar el rostro de Lorien. Sus profundos ojos negros brillaban, y la brisa hac&iacute;a ondular su larga y negra melena sobre sus hombros.</P>
<P ALIGN="JUSTIFY">– <I>Adi&oacute;s, Lorien</I> –le dijo en un susurro.</P>
<P ALIGN="JUSTIFY">– <I>Adi&oacute;s,... amigo m&iacute;o </I>–le respondi&oacute; Lorien.</P>
<P ALIGN="JUSTIFY">Aradriel le sonri&oacute;, e intent&oacute; girarse. Pero Lorien lo detuvo, y mir&aacute;ndole a los ojos, le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Siento algo dentro de m&iacute;, que me hace saber que no volver&eacute; a verte nunca m&aacute;s </I>–y baj&oacute; la mirada, avergonzada. Pero al momento, la volvi&oacute; a elevar, y termin&oacute; dici&eacute;ndole–. <I>T&uacute; sabes lo que yo he llegado a sentir. Y yo s&eacute; que nunca hiciste nada para causarlo. Pero no lo pude evitar... D&eacute;jame al menos un &uacute;ltimo recuerdo.</P>
</I><P ALIGN="JUSTIFY">Y lo abraz&oacute; con una intensidad que abrum&oacute; a Aradriel. Que lo hizo entristecer por la despedida, a&uacute;n m&aacute;s.</P>
<P ALIGN="JUSTIFY">Lorien, tras unos segundos se apart&oacute;. Aradriel le sonri&oacute; por &uacute;ltima vez. Se gir&oacute;, y se alej&oacute; lentamente. Cuando lleg&oacute; al lugar en que los dos aparecieron en ese mundo, mir&oacute; a Lorien,  que lo estaba esperando y miraba a su vez hacia el lugar donde &eacute;l estaba, y les dijo adi&oacute;s con la mano. Lorien hizo lo mismo, y el muchacho que tuvo dos nombres, desapareci&oacute; lentamente. Se desvaneci&oacute;, confundi&eacute;ndose con el paisaje, para no volver a verlo nunca m&aacute;s. Para llevarse una parte del coraz&oacute;n de Lorien. </P>
<P ALIGN="JUSTIFY">Pero ella sab&iacute;a que era un imposible, aunque la alegr&iacute;a no se turb&oacute; por esto.</P>
<P ALIGN="JUSTIFY">Ella y las personas que la acompa&ntilde;aban, pudieron, no vivir, sino existir, a salvo de sus Dioses. </P>
<P ALIGN="JUSTIFY">Lorien y quienes lo acompa&ntilde;aban, pronto olvidaron al muchacho, puesto que en ese lugar, s&oacute;lo las alegr&iacute;as ten&iacute;an existencia. Juntos, caminaron hacia unas monta&ntilde;as que se encontraban muy cerca, en donde destacaba una por su impresionante altura. Pero que no amenazaba a quien la osase mirar, sino que invitaba a que subiesen a su cima, y poder contemplar el inmenso bosque que dominaba todo lo visible. En donde crec&iacute;an los m&aacute;s numerosos y antiguos, los Robles, y tambi&eacute;n en gran n&uacute;mero estaban las Secoyas con sus gigantescas ramas y sus extra&ntilde;as ra&iacute;ces, y los Pinos con su elegancia, junto a los Abetos y su dulzura, los Tilos y la belleza de sus hojas, los Abedules y la blancura de sus troncos, y los delgad&iacute;simos Eucaliptos. Pero por encima de todos ellos destacaban los Sauces. Y en ese lugar nunca existi&oacute; un Sauce Llor&oacute;n.</P>
<P ALIGN="JUSTIFY">Y hacia ese lugar se dirigieron, Lorien, su padre, su hermano... y Lien.</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







