<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 9. Un error.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">– <I>¡Aradriel!, la comida ya est&aacute; lista.</P>
</I><P ALIGN="JUSTIFY">Lorien volvi&oacute; a llamarlo, pero no contestaba.</P>
<P ALIGN="JUSTIFY">Sali&oacute; fuera de la casa, y escuch&oacute; lo que se tem&iacute;a. Los martilleos no hab&iacute;an cesado de repiquetear durante toda la tarde.</P>
<P ALIGN="JUSTIFY">Rode&oacute; la casa, y all&iacute; lo encontr&oacute; de nuevo. Estaba completamente extenuado, pero al ver a Lorien, se incorpor&oacute; de golpe, y muy orgulloso, le mostr&oacute; la viga de hierro completamente recta.</P>
<P ALIGN="JUSTIFY">– <I>¿C&oacute;mo lo has hecho?</I> –le pregunt&oacute; encantada, al muchacho.</P>
<P ALIGN="JUSTIFY">– <I>La he calentado hasta que ha cedido</I> –le confes&oacute; Aradriel, a la vez que le indicaba con un gesto de la mano la fragua que hab&iacute;a hecho.</P>
<P ALIGN="JUSTIFY">– <I>Muy bien</I> –asinti&oacute; Lorien–,<I> ahora prep&aacute;rate para comer.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Tan pronto? </I>–exclam&oacute; Aradriel, extra&ntilde;&aacute;ndose.</P>
<P ALIGN="JUSTIFY">Y Lorien, algo desilusionada durante un segundo, le respondi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, vamos.</P>
</I><P ALIGN="JUSTIFY">Y se alej&oacute; r&aacute;pidamente, para atender la sart&eacute;n que a&uacute;n ten&iacute;a en el fuego.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Lorien, desde que regres&oacute; con su padre, del pueblo, estuvo toda la tarde en la cocina.</P>
<P ALIGN="JUSTIFY">Orein se alarm&oacute; cuando su hija le pidi&oacute; que le dejase hacer la cena, pero ante la rabieta de la muchacha nada pudo hacer. Se encogi&oacute; de hombros, y se resign&oacute; a perderse la suculenta comida que hab&iacute;a pensado prepararse.</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute; ibas a preparar esta noche?</I> –le pregunt&oacute; Lorien, cuando vio que su padre se alejaba sigilosamente.</P>
<P ALIGN="JUSTIFY">Orein, que estaba a la altura de la puerta, mir&oacute; al techo compadeci&eacute;ndose de s&iacute; mismo, y al darse la vuelta para encararse con su hija, la vio tan decidida, que no tuvo m&aacute;s remedio que sonre&iacute;rle, e intentar salvar lo que se pudiera.</P>
<P ALIGN="JUSTIFY">–<I> ¡As&iacute; no!</I> –le gritaba una y otra vez. Orein estaba desesperado, pero la ilusi&oacute;n inusitada con que su hija lo estaba intentando, le hac&iacute;an contenerse y no echarle la comida por encima de la cabeza–. <I>Tienes que ponerlo cuando el aceite est&eacute; caliente, o si no, se pega ¿ves?</I> –le dijo mientras intentaba separar la carne del metal.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, s&iacute;, pero tu enc&aacute;rgate de avisarme cuando el horno est&eacute; listo</I> –le apart&oacute; Lorien, mientras tomaba la paleta de manos de su entrometido padre.</P>
<P ALIGN="JUSTIFY">– <I>¡¿Pero qu&eacute; haces?! </I>–le grit&oacute; Orein, cuando vio que echaba la verdura chorreando de agua, sobre el aceite hirviendo, a la vez que de un tir&oacute;n alejaba a su hija del chisporroteante aceite saltimbanqui.</P>
<P ALIGN="JUSTIFY">–<I> ¡Me est&aacute;s poniendo nerviosa! ¡D&eacute;jame sola!</I> –le grit&oacute; desesperada, al comprender que la verdura estar&iacute;a esa noche, un poco m&aacute;s negra y crujiente que de costumbre.</P>
<P ALIGN="JUSTIFY">– <I>¡Vale!</I> –le respondi&oacute; Orein, enojado–. <I>Arr&eacute;glatelas como puedas. Yo me voy –</I>y se fue, dejando a su culinaria hija.</P>
<P ALIGN="JUSTIFY">– <I>"¡No me hace falta ayuda!"</I> –se dijo Lorien a s&iacute; misma, para darse &aacute;nimos, mientras intentaba despegar la carne quemada por un lado y cruda por el otro, a la vez que se acordaba de que en el horno hab&iacute;a metido algo, que hac&iacute;a muchos minutos que ya estaba casi listo.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">– <I>¡Ya podemos empezar!</I> –dijo alegremente Lorien, torci&eacute;ndole la boca a su padre, cuando &eacute;ste mir&oacute; hacia el techo y se encomend&oacute; a sus arraigados Dioses.</P>
<P ALIGN="JUSTIFY">Comenzaron a comer. Desde luego, la mesa no ten&iacute;a mala pinta; unas preciosas tiras negras que cruj&iacute;an nada m&aacute;s verlas, pretendiendo ser pimientos; unas incre&iacute;bles hogazas de pan, elevadas hasta una altura inusual, as&iacute; como su color; unos min&uacute;sculos y chorreantes filetes, medianamente crudos por un lado, y carbonizados por otro. Y el toque final de la sopa. </P>
<P ALIGN="JUSTIFY">Ten&iacute;a un buen sabor, a pesar del exceso de sal, y se hubiera podido tragar a no ser que la pasta estaba completamente dura, y la guarnici&oacute;n demasiado recocida.</P>
<P ALIGN="JUSTIFY">Pero nadie dijo nada. Lorien apenas prob&oacute; bocado, puesto que se dedic&oacute; a observar a su padre, frunci&eacute;ndole la frente cada vez que levantaba la cabeza del plato, o no llenaba lo suficiente su cuchara.</P>
<P ALIGN="JUSTIFY">Aradriel, aunque hab&iacute;a comido cosas peores, se extra&ntilde;&oacute; mucho de que la comida hubiera cambiado tan radicalmente. Orein, hasta ese momento hab&iacute;a sido un experto cocinero. </P>
<P ALIGN="JUSTIFY">Pero ahora todo estaba intragable. As&iacute; que, para no herir a su anfitri&oacute;n, se lo trag&oacute; todo humildemente, deseando que el d&iacute;a siguiente se encontrase el hombre un poco m&aacute;s acertado. </P>
<P ALIGN="JUSTIFY">– <I>"¡Esto est&aacute; mal&iacute;simo!"</I> –se grit&oacute; a s&iacute; mismo mientras tragaba lo m&aacute;s r&aacute;pidamente que se lo permit&iacute;a la compostura, para que el paladar no se enterase– <I>"¿Pero por qu&eacute; le habr&aacute; salido tan mal la comida a Orein?"</P>
</I><P ALIGN="JUSTIFY">No se acordaba de que esa noche, ser&iacute;a Lorien quien le hiciese la cena... por &eacute;l.</P>
<P ALIGN="JUSTIFY">Acabaron muy tarde de comer. Y cuando Lorien se descuid&oacute;, Orein se levant&oacute; y pidiendo disculpas a Aradriel a la vez que evitaba mirar a su hija, se alej&oacute; r&aacute;pidamente en direcci&oacute;n hacia la cocina.</P>
<P ALIGN="JUSTIFY">– <I>"¡Agua! ¡Agua!"</I> –iban gritando sus sentidos, mientras se perd&iacute;a por el corredor.</P>
<P ALIGN="JUSTIFY">Aradriel mir&oacute; a Orein, hasta que &eacute;ste desapareci&oacute;. Entonces, suspir&oacute; y mir&oacute; hacia donde estaba sentada Lorien, esperando compartir el alivio que sent&iacute;a al poder dejar de comer la intragable comida. Pero se encontr&oacute; con que Lorien lo miraba fijamente, con la expresi&oacute;n de quien desea hacer una pregunta y no se atreve.</P>
<P ALIGN="JUSTIFY">Al final, se decidi&oacute;, pero cuando estaba a punto de preguntarle, cuando hab&iacute;a conseguido armarse de valor para hacerlo, escuch&oacute; las palabras de Aradriel, que hicieron morir en sus labios, sus pensamientos.</P>
<P ALIGN="JUSTIFY">– <I>¿Le pasa algo a tu padre?</I> –le pregunt&oacute; confidencialmente, esperando obtener una respuesta negativa. Y la obtuvo.</P>
<P ALIGN="JUSTIFY">– <I>No</I> –le respondi&oacute; extra&ntilde;ada, Lorien–<I> ¿Por qu&eacute; lo preguntas?, ¿le has notado algo?</I> –a&ntilde;adi&oacute; mientras retorc&iacute;a en sus manos un pa&ntilde;o de tela, esperando volver a armarse de valor para intentar de nuevo su pregunta.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, ver&aacute;s</I> –le dijo sonriente, Aradriel, para que la joven no se lo tomara a mal–. <I>Es que... –y solt&oacute; una carcajada.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Qu&eacute;?</I> –le dijo Lorien, a la vez que se re&iacute;a tambi&eacute;n, sin saber por qu&eacute;.</P>
<P ALIGN="JUSTIFY">– <I>Perdona que te lo diga. Espero que no te molestes</I> –le confes&oacute; Aradriel entre sonrisas–, <I>es que la comida estaba mal&iacute;sima</I> –y volvi&oacute; a re&iacute;rse delante de Lorien–. <I>En los pasados d&iacute;as, todo hab&iacute;a estado muy bueno, pero lo de hoy es demasiado</I> –continuaba dici&eacute;ndole a Lorien, sin fijarse en la cara de asombro de la mujer–.<I> No es por nada. Pero es la peor cena que he comido en mucho tiempo.</P>
</I><P ALIGN="JUSTIFY">Intent&oacute; soltar otra risa, pero un trozo de tela le golpe&oacute; el rostro. Cuando cay&oacute; de su cara, pudo ver estupefacto, que Lorien se levantaba de golpe, y mientras lo miraba con unos ojos desencajados por la mala idea, no atinaba a soltarle el insulto adecuado. Tras unos segundos en que la rabia no la dejaba hablar, solt&oacute; un delicado rugido, y se fue, tomando las escaleras, con unas zancadas tan grandes que parec&iacute;an que iban a hundir el suelo con sus pisadas.</P>
<P ALIGN="JUSTIFY">Aradriel la mir&oacute;. La mir&oacute; hasta que se perdi&oacute; entre las sombras de las escaleras. Despu&eacute;s, a&uacute;n absorto y con la boca abierta con la expresi&oacute;n de quien no sabe qu&eacute; ha pasado, se dio cuenta de que Orein ven&iacute;a por el pasillo. Junt&oacute; los labios, para no parecer un tonto, y se qued&oacute; en silencio, recapacitando en qu&eacute; hab&iacute;a pasado.</P>
<P ALIGN="JUSTIFY">– <I>He o&iacute;do a Lorien</I> –dijo Orein al entrar en la habitaci&oacute;n en que se encontr&oacute; a un confundido Aradriel–.<I> ¿Qu&eacute; ha pasado?</I> –le pregunt&oacute; al verlo.</P>
<P ALIGN="JUSTIFY">– <I>No... no lo s&eacute;</I> –le respondi&oacute; Aradriel.</P>
<P ALIGN="JUSTIFY"> Y Orein, d&aacute;ndose cuenta de golpe, de la posibilidad, le pregunt&oacute; entre alarmado y divertido:</P>
<P ALIGN="JUSTIFY">– <I>¿No le habr&aacute;s dicho nada de la comida, verdad?</P>
</I><P ALIGN="JUSTIFY">Aradriel asinti&oacute; con la cabeza, sin comprender a&uacute;n.</P>
<P ALIGN="JUSTIFY">– <I>¡Pero hombre!, ¿por qu&eacute; lo has hecho?</I> –le pregunt&oacute; Orein, olvidando su car&aacute;cter durante un momento, y conteniendo las risas.</P>
<P ALIGN="JUSTIFY">– <I>Yo s&oacute;lo le pregunt&eacute; el por qu&eacute; le hab&iacute;a salido a usted la cena tan mala. No s&eacute; por qu&eacute; se ha puesto as&iacute;.</P>
</I><P ALIGN="JUSTIFY">– <I>Si yo no he sido quien la ha preparado </I>–y como comprendiendo la reacci&oacute;n de su hija, a&ntilde;adi&oacute;– <I>¿No sab&iacute;as que ha sido ella quien lo ha hecho todo?</P>
</I><P ALIGN="JUSTIFY">– <I>¡No!</I> –grit&oacute; alarmado, Aradriel– <I>¡Yo no lo sab&iacute;a!</I> –aleg&oacute; a modo de protesta.</P>
<P ALIGN="JUSTIFY">–<I> Pues creo que se ha enfadado mucho</I> –le confes&oacute; Orein, mientras miraba hacia la parte superior de las escaleras, que se encontraban tras Aradriel.</P>
<P ALIGN="JUSTIFY">&Eacute;ste, durante todo ese tiempo, no se acord&oacute;, puesto que cuando Lorien se ofreci&oacute; a prepararle la cena, casi no la escuch&oacute;, pero su parte oculta si la oy&oacute;. Y ahora se lo rememor&oacute;.</P>
<P ALIGN="JUSTIFY">&lt;&lt;<I>No. No tiene importancia... Ma&ntilde;ana har&eacute; yo la comida. Casi nunca la hago, puesto que mi padre ese d&iacute;a se queda sin comer. Siempre dice que me sale todo mal, pero te preparar&eacute; m&aacute;s temprano la mejor cena que hayas probado.</I>&gt;&gt;</P>
<P ALIGN="JUSTIFY">–<I> "¿No te has dado cuenta?"</I> –le pregunt&oacute; su voz interior, reproch&aacute;ndole su falta de atenci&oacute;n–<I>Lo siento. Creo que le he hecho da&ntilde;o</I> –le revel&oacute; a Orein.</P>
<P ALIGN="JUSTIFY">Ahora, Orein comprendi&oacute;. Supo el motivo por el que su hija se hab&iacute;a tomado tantas molestias para intentar hacerlo todo bien... a pesar de los resultados.</P>
<P ALIGN="JUSTIFY">– <I>Creo que deber&iacute;as intentar disculparte... aunque no lo hayas hecho a prop&oacute;sito</I> –le dijo al cabizbajo Aradriel. E intentando quitarle importancia al asunto, a&ntilde;adi&oacute; entre sonrisas que intentaba compartir–. <I>Si no lo haces ahora, tendr&aacute;s que aguantarla de mal humor, durante todo el d&iacute;a de ma&ntilde;ana... y te advierto que puede ser terrible</I> –concluy&oacute; sonri&eacute;ndole a Aradriel, al ver que &eacute;ste tambi&eacute;n relajaba sus rasgos.</P>
<P ALIGN="JUSTIFY">Aradriel se levant&oacute;, y se dirigi&oacute; hacia las oscuras escaleras mientras Orein lo observaba.</P>
<P ALIGN="JUSTIFY">–<I>"Pobrecito"</I> –se re&iacute;a Orein para s&iacute; mismo.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Lorien, que ya se le hab&iacute;a pasado el enfado inicial, no sab&iacute;a si ahora deb&iacute;a de continuar enojada, o por el contrario, hac&eacute;rselo pagar, o peor a&uacute;n echarse sobre la cama y llorar.</P>
<P ALIGN="JUSTIFY">No quer&iacute;a reconocerlo, pero esta &uacute;ltima alternativa era la que m&aacute;s necesitaba.</P>
<P ALIGN="JUSTIFY">– <I>"¿Por qu&eacute; se ha comportado as&iacute;?"</I> –se pregunt&oacute; a s&iacute; misma–. <I>"¡No cre&iacute;a que pudiera hacerme esto! ¡¿Qui&eacute;n se ha cre&iacute;do que..."</P>
</I><P ALIGN="JUSTIFY">– <I>¿Lorien?</I> –escuch&oacute; que una voz joven la llamaba a trav&eacute;s de la puerta.</P>
<P ALIGN="JUSTIFY">–<I> ¡D&eacute;jame!</I> –le grit&oacute; enojada.</P>
<P ALIGN="JUSTIFY">– <I>Quiero hablar contigo</I> –le dijo la afectada voz–. <I>Deseo no haberte... Quiero pedirte perd&oacute;n por lo que he dicho.</P>
</I><P ALIGN="JUSTIFY">– <I>¡No te disculpes!</I> –le volvi&oacute; a gritar Lorien–. <I>Ten&iacute;as toda la raz&oacute;n. Todo estaba mal hecho. Nada se pod&iacute;a comer</I> –Y rompi&oacute; a llorar.</P>
<P ALIGN="JUSTIFY">– <I>Lorien...</I> –dijo en un desventurado susurro, al o&iacute;r a la muchacha sollozar–.<I> &Aacute;breme.</P>
</I><P ALIGN="JUSTIFY">–<I> No. ¡Vete y d&eacute;jame!</I> –le volvi&oacute; a gritar, pero esta vez con la voz quebrada.</P>
<P ALIGN="JUSTIFY">–<I> Est&aacute; bien</I> –acept&oacute; Aradriel–.<I> Aunque no valgan las excusas, tienes que saber que yo no me acordaba de que tu ibas a preparar la cena. Lo siento. Espero que me perdones... y te doy mi palabra de que si lo hubiera sabido, me lo habr&iacute;a comido todo, incluso lo que ha sobrado... Hasta ma&ntilde;ana</I> –termin&oacute; de decir, mientras escuch&oacute; c&oacute;mo se abr&iacute;a lentamente la puerta de la habitaci&oacute;n de Lorien, y &eacute;sta se asomaba, inundando con una tenue luz, la penumbra del pasillo que hab&iacute;a permanecido a oscuras hasta entonces.</P>
<P ALIGN="JUSTIFY">– <I>¿Dices eso de verdad?</I> –le pregunt&oacute; Lorien, cuyo rostro apenas se distingu&iacute;a de la oscuridad.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;. Yo no lo sab&iacute;a</I> –reconoci&oacute; de nuevo Aradriel.</P>
<P ALIGN="JUSTIFY">Lorien suspir&oacute; ligeramente. </P>
<P ALIGN="JUSTIFY">– <I>Bueno, entonces creo que yo tambi&eacute;n debo pedirte perd&oacute;n. No he debido comportarme as&iacute;... como una ni&ntilde;a... Espero que ma&ntilde;ana se haya olvidado todo esto. </P>
</I><P ALIGN="JUSTIFY">Y al entrever que el joven le sonre&iacute;a, se despidi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Buenas noches.</P>
</I><P ALIGN="JUSTIFY">– <I>Hasta ma&ntilde;ana, Lorien.</P>
</I><P ALIGN="JUSTIFY">Y Aradriel se alej&oacute; por el oscuro pasillo, guiado por sus penetrantes ojos que deshac&iacute;an la oscuridad.</P>
<P ALIGN="JUSTIFY">– <I>"¡Qu&eacute; idiota eres!"</I> –se increp&oacute; Lorien a s&iacute; misma–.<I> "¡Mira que reconocer delante de &eacute;l, que eres una ni&ntilde;a!, ¡Idiota!"</P>
</I><P ALIGN="JUSTIFY">Pero al menos, se le pas&oacute; el disgusto.</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







