<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 1. Seriant.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Era el amanecer. El oscuro amanecer de esas tierras. </P>
<P ALIGN="JUSTIFY">La Luna que iluminaba las vidas de los humanos durante las horas de oscuridad, tambi&eacute;n conocida como Seriant, todav&iacute;a estaba muy alta cuando el Sol apenas hab&iacute;a asomado por las monta&ntilde;as del Este. </P>
<P ALIGN="JUSTIFY">El principio de la Primavera estaba muy cercano, pero el Invierno a&uacute;n se resist&iacute;a a dejarse vencer y, a lo lejos en el Oeste, se pod&iacute;a ver en el horizonte una oscura l&iacute;nea de nubes. Nubes que alcanzadas por la luz del Sol hac&iacute;an ver el l&iacute;mite entre el cielo y la tierra como algo irreal, continuamente cambiante por las diferentes tonalidades que tomaban los rayos de luz al atravesarlas, e inexplicablemente para quienes lo observaban, presagio de algo que pod&iacute;a suceder..., pero sin convicci&oacute;n de que fuera bueno.</P>
<P ALIGN="JUSTIFY">Hac&iacute;a ya mucho tiempo que los rituales de agradecimiento a los Dioses por el fin de la Noche que daba paso al D&iacute;a, se hab&iacute;an olvidado. Ya nadie se arrodillaba durante unos instantes para agradecer que la Noche terminaba y la Luz de la Vida o del Sol les era devuelta una vez m&aacute;s. Aunque algunos a&uacute;n manten&iacute;an la costumbre de agradecer la salida de Seriant que les tornaba la Oscuridad en la Noche.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Los rayos del Sol ya empezaban a abrirse camino entre la bruma que se hab&iacute;a formado, cuando a lo lejos se oy&oacute; un aullido, el de un lobo. </P>
<P ALIGN="JUSTIFY">Desde hac&iacute;a muchos, much&iacute;simos a&ntilde;os hab&iacute;an casi desaparecido del mundo por la irracional persecuci&oacute;n de los hombres. Pero esa ma&ntilde;ana se volvi&oacute; a o&iacute;r de nuevo la llamada de un lobo. </P>
<P ALIGN="JUSTIFY">Las antiguas leyendas casi olvidadas ya, y mantenidas &uacute;nicamente por los m&aacute;s viejos para contarlas en las reuniones, y sentir que la gente les escucha durante unos momentos, relataban historias sobre lobos en las que sobre todo eran reflejados como seres que estaban rodeados siempre por extra&ntilde;os hechos, despertando el odio y la incomprensi&oacute;n hacia ellos, y siendo el culpable de su desaparici&oacute;n. </P>
<P ALIGN="JUSTIFY">Una de esas historias que, aunque distorsionada por los a&ntilde;os, a&uacute;n era un fiel reflejo de la realidad, contaba que el motivo por el que los lobos aullaban y con su sonido aterrorizaban las almas de los temerosos de los Dioses, era para comunicar a sus hermanos que ese territorio le pertenec&iacute;a a &eacute;l, advirtiendo que ser&iacute;an capaces de matar a quien quisiera arrebat&aacute;rselo. Pero en muy pocas ocasiones, y sin que nadie supiera de d&oacute;nde proven&iacute;a ese conocimiento, cuando un lobo se encontraba s&oacute;lo o sent&iacute;a el dolor en su alma, expresaban su tristeza aull&aacute;ndole a la Luna. Entonces se produc&iacute;a un hecho ins&oacute;lito en la Naturaleza ya que sus ojos se cubr&iacute;an de l&aacute;grimas. Nadie lo cre&iacute;a, y mucho menos el que alguien lo hubiera presenciado para contarlo, y si fuera verdad, nadie sab&iacute;a porqu&eacute; lloraban. S&oacute;lo se ten&iacute;a la certeza de que cuando aullaban lo hac&iacute;an dirigi&eacute;ndose a Seriant, como si ella les estuviera escuchando.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Los aullidos continuaron, pero cada vez con m&aacute;s intensidad y desesperaci&oacute;n, hasta que todos los sonidos se detuvieron de golpe con el &uacute;ltimo gemido del lobo. </P>
<P ALIGN="JUSTIFY">Entonces Lorien se despert&oacute; sobresaltada. R&aacute;pidamente se levant&oacute; de la cama y abriendo la ventana se asom&oacute; y mir&oacute; las cumbres todav&iacute;a nevadas, que comenzaban a deslumbrar por el reflejo del sol. Aunque esperaba encontrar algo sin saber qu&eacute;, nada distinto pudo ver, pero sab&iacute;a que hab&iacute;a escuchado un sonido que no era acostumbrado o&iacute;r en esas tierras. Recordaba que mientras dorm&iacute;a, un sonido lejano y apagado iba despertando su consciente y le hac&iacute;a sentir una sensaci&oacute;n de angustia, porque lo que escuch&oacute; era una voz que desprend&iacute;a una profunda tristeza, que a medida que se iba percibiendo mejor, parec&iacute;a como si contase una historia, lenta y triste, hasta que de improviso termin&oacute; con un terrible final.</P>
<P ALIGN="JUSTIFY">El aire fr&iacute;o de las monta&ntilde;as entraba libremente en la habitaci&oacute;n, pero aunque Lorien lo sent&iacute;a, era como si lo percibiese de lejos, como si todav&iacute;a no hubiera despertado del todo, y lentamente y sin saber el motivo, dirigi&oacute; sus negros ojos desde las monta&ntilde;as, hasta el cielo del Norte, donde se pod&iacute;a ver todav&iacute;a claramente, y en todo su esplendor, a Seriant. </P>
<P ALIGN="JUSTIFY">Durante un rato estuvo asomada a la ventana. </P>
<P ALIGN="JUSTIFY">Se sent&iacute;a como en un sue&ntilde;o, sin percibir completamente la realidad. </P>
<P ALIGN="JUSTIFY">Despu&eacute;s, se acerc&oacute; a la cama y se volvi&oacute; a acostar. Todav&iacute;a quedaban varias horas para levantarse, ya que era el d&iacute;a de los Dioses, y aunque pudo volver a dormirse, s&oacute;lo consigui&oacute; tener unos sue&ntilde;os extra&ntilde;os e intranquilos, los cuales se olvidan completamente al despertar, pero que sabemos que han existido por la sensaci&oacute;n que nos dejan.</P>
<P ALIGN="JUSTIFY">Eso era todo lo que pod&iacute;a recordar del sue&ntilde;o, la sensaci&oacute;n de algo extra&ntilde;o que hab&iacute;a pasado.</P>
<P ALIGN="JUSTIFY">Mientras tanto, los hombres y mujeres que tambi&eacute;n escucharon los aullidos, que hab&iacute;an madrugado y se encontraban fuera de sus casas, corrieron a ellas cerrando tras de s&iacute; todas las puertas y ventanas, asegurando los cerrojos y confiando en que los temores desaparecieran cuando el Sol dominase por completo las sombras de la Noche.</P>
<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







