<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Esta es mi historia.</P>
<P ALIGN="JUSTIFY">Esta es la vida que me dieron.</P>
<P ALIGN="JUSTIFY">Yo no lo ped&iacute;, pero fui creada. El motivo no lo s&eacute;, aunque creo que para servirles en Su juego... al igual que el resto de la humanidad. </P>
<P ALIGN="JUSTIFY">Durante mi vida mortal Les obedec&iacute;. Luego, durante mi vida de castigo, tambi&eacute;n. </P>
<P ALIGN="JUSTIFY">Siempre tuve miedo de Ellos, tal como quer&iacute;an. Siempre Les rogu&eacute; por mi existencia, tal como deseaban. Muy pocos se opusieron, y ninguno sobrevivi&oacute;. Casi ninguno se enfrent&oacute; a Ellos, pero al menos me hicieron ver que era mejor morir y no temer, que vivir con temor. </P>
<P ALIGN="JUSTIFY">Creo que he conseguido hacer lo &uacute;nico que me ha hecho sentir feliz. Espero por el bien de ellos que as&iacute; sea. </P>
<P ALIGN="JUSTIFY">Esto est&aacute; escrito para que los que vengan sepan que se puede luchar, que no se debe ceder. Esto se debe conocer para que al menos quede testimonio de que alguien se opuso a Sus deseos... aunque ya no viva para demostrarlo.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Al principio de todo, estaban Ellos, los Dioses.</P>
<P ALIGN="JUSTIFY">Nadie Los cre&oacute;, simplemente exist&iacute;an, y a partir de Ellos todo lo dem&aacute;s fue creado. </P>
<P ALIGN="JUSTIFY">Muchos piensan que aun siendo Dioses, deb&iacute;an de haber sido creados a su vez por alguien m&aacute;s poderoso. Eso nadie lo sabe, pero si as&iacute; fuese, se equivoc&oacute; en su creaci&oacute;n. </P>
<P ALIGN="JUSTIFY">No eran nada material, tangible, sino una presencia que se sent&iacute;a simplemente como algo superior a cualquier entendimiento. No se Les pod&iacute;a ver ni tocar, solamente soportar Su poder. Eran muchos, el n&uacute;mero nadie lo sabe, pero de lo que s&iacute; qued&oacute; constancia fue de sus creaciones, porque el motivo que daban a entender de Su vida era el de crear, aunque tambi&eacute;n el de destruir. </P>
<P ALIGN="JUSTIFY">Durante toda la eternidad crearon y destruyeron mundos para liberar Su poder, mundos repletos de seres distintos, de todas las clases imaginables, tanto las m&aacute;s bellas como las m&aacute;s monstruosas criaturas. Seres que imploraban una oportunidad para seguir viviendo, porque a cambio de haber sido creados, deb&iacute;an de obedecerlos, aunque el entendimiento que pose&iacute;an algunos, les mostrase lo atroz de lo que deb&iacute;an hacer en el nombre de sus Dioses. </P>
<P ALIGN="JUSTIFY">A Ellos les gustaba crear unas vidas para que &eacute;stas, temerosas de ellos, les rogasen por su existencia. Y cuando se cansaban de su creaci&oacute;n, la destru&iacute;an sin el m&aacute;s m&iacute;nimo remordimiento, haciendo que los millones de voces de s&uacute;plica de sus criaturas se perdieran en la infinidad del Universo sin ser escuchadas siquiera por misericordia. Porque Ellos no sab&iacute;an nada de bondad ni de compasi&oacute;n.</P>
<P ALIGN="JUSTIFY">Casi todos los Dioses obraban por igual y todos sol&iacute;an crear lo mismo; aunque unos m&aacute;s que otros disfrutaban entreg&aacute;ndoles el pensamiento a sus creaciones, para que pudieran aprender, para que pudieran temer y saber lo que es obedecer la voluntad de su Dios. </P>
<P ALIGN="JUSTIFY">Con el pasar de la eternidad, algunos Dioses fueron distingui&eacute;ndose entre s&iacute;, llegando a adoptar comportamientos que, a fuerza de imponer a sus criaturas, asimilaban para S&iacute; mismos. </P>
<P ALIGN="JUSTIFY">Pero el motivo por el cual estos Dioses disfrutaban creando y destruyendo, nadie podr&iacute;a entenderlo. No lo hac&iacute;an por maldad, durante los primeros tiempos, sino que, faltos de sentimientos, no consideraban que aniquilar un mundo completo con todos su seres fuese algo indigno. Pero ese continuo comportamiento y esa adopci&oacute;n de los detalles de sus creaciones, hizo que tambi&eacute;n Ellos fueran aprendiendo y aceptando los sentimientos de sus obras, aunque Unos m&aacute;s que Otros. </P>
<P ALIGN="JUSTIFY">En un lento proceso, la mayor&iacute;a dej&oacute; de construir para destruir, y simplemente cre&oacute;. As&iacute;, Algunos disfrutaban creando la materia inerte: la geograf&iacute;a de un planeta, sus minerales, sus costas, sus valles y monta&ntilde;as; Otros por el contrario, creaban las aguas del mar, de los r&iacute;os y de los lagos, as&iacute; como su vida interior; y Otros se inclinaban por los seres vivos como los &aacute;rboles, y la vida vegetal en conjunto. Pero la mayor&iacute;a creaban seres que poblaban esos mundos, que ten&iacute;an el don de la inteligencia y que pod&iacute;an moverse por s&iacute; mismos con una &uacute;nica idea en sus mentes y motivo de su vida, la destrucci&oacute;n de los que no eran sus semejantes.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">En uno de esos mundos como en muchos otros, infinidad de seres fueron entregados a la vida. Cada Dios cre&oacute; una especie distinta, reflejo de Sus pensamientos, que deb&iacute;a imponerse a las creaciones de sus hermanos. Muchos de esos seres eran abominables, solamente pensaban en destruir y arrasar todo lo que exist&iacute;a a su alrededor. </P>
<P ALIGN="JUSTIFY">De esta forma Se divert&iacute;an, pero uno de esos Dioses a quien llamaron Dharmsqui, no tan perverso como Sus semejantes y ablandado por el paso del tiempo, cre&oacute; una raza un poco distinta a las dem&aacute;s. Les dio una apariencia no tan monstruosa para nuestros ojos, aunque s&iacute; compart&iacute;an con sus hermanos de creaci&oacute;n su odio por los que no pertenec&iacute;an a su misma raza. </P>
<P ALIGN="JUSTIFY">Pero esa falta de fiereza tanto en apariencia como en esp&iacute;ritu, har&iacute;a que pronto fueran barridos de su mundo y, ante las burlas de sus hermanos, Dharmsqui, en un acto de ira fue a destruirlos.</P>
<P ALIGN="JUSTIFY">Pero ese Dios, por muy ablandado que se hubiera vuelto con el paso del tiempo, aunque &eacute;ste para Ellos no exist&iacute;a, reprimi&oacute; su primer impulso. Y para vengarse de esas burlas, les concedi&oacute; a su creaci&oacute;n en lugar de su destrucci&oacute;n, algo que ninguno de sus hermanos le perdon&oacute;.</P>
<P ALIGN="JUSTIFY">Este Dios, a su manera, le tom&oacute; afecto a su obra y le concedi&oacute; una fuerza que los convirti&oacute; en invencibles: una m&iacute;nima expresi&oacute;n del poder de su creador. Estos seres fueron llamados humanos, y a esa fuerza la llamaron Magia.</P>
<P ALIGN="JUSTIFY">En ese planeta todos los Dioses crearon su parte, y tras infinitos siglos de pr&aacute;ctica, la diversidad de la vida que fue engendrada hizo que fuese la m&aacute;s magn&iacute;fica creaci&oacute;n de todas las que se hicieron hasta entonces. Era un mundo donde la Naturaleza creada permit&iacute;a a sus habitantes crecer sin su hostilidad. Muchas, much&iacute;simas de las cosas eran maravillosas y se relacionaban con armon&iacute;a. </P>
<P ALIGN="JUSTIFY">Seg&uacute;n nos revelaron, era el mundo m&aacute;s bello que jam&aacute;s se hubiera creado; el escenario ideal para la cruenta lucha que mantendr&iacute;an los elegidos en representar a sus Dioses. Criaturas con el &uacute;nico premio de seguir existiendo s&oacute;lo para destruir a sus contrarios y obtener la benevolencia de su Dios. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Una vez finalizado todo hasta el m&aacute;s m&iacute;nimo detalle, todas las razas fueron despertadas en la Primera Creaci&oacute;n, y les fue comunicado el precio de sus vidas: deber&iacute;an conquistar su mundo y exterminar a todas las dem&aacute;s razas, a cambio de poder existir hasta que Sus deseos lo permitiesen. La vencedora ser&iacute;a adoptada por todos los dem&aacute;s Dioses.</P>
<P ALIGN="JUSTIFY">Tras el mensaje de sus Deidades, comenz&oacute; la lucha por la supervivencia. </P>
<P ALIGN="JUSTIFY">Y para que siempre tuvieran presentes a qui&eacute;nes les deb&iacute;an su existencia, y como una muestra de Su poder, crearon la fuente de la luz fuera del propio planeta. </P>
<P ALIGN="JUSTIFY">Crearon una estrella fuera de su alcance y de su entendimiento, la cual a la vez que les daba la luz, los inundaba con su calor. Esa estrella fue revelada con el nombre de Sol. Pero no siempre la tendr&iacute;an presente, sino que tras un periodo de tiempo, era oscurecida para mostrarles que la luz que recib&iacute;an de &eacute;l y los iluminaba, pod&iacute;a serles arrebatada como su propia vida... y sumirlos en la oscuridad. </P>
<P ALIGN="JUSTIFY">As&iacute; se cre&oacute; el D&iacute;a y naci&oacute; la Oscuridad, convirti&eacute;ndose en la pesadilla de todos. Todas esas criaturas, cuando se encontraban faltos de esa luz, se sum&iacute;an en un sufrimiento que no desaparec&iacute;a hasta que el Sol era mostrado de nuevo. Pero Dharmsqui no olvid&oacute; a sus protegidos, porque eran los m&aacute;s d&eacute;biles de coraz&oacute;n y de sentimientos. Por esto, para la Oscuridad les cre&oacute; la Luna, la cual un d&iacute;a la humanidad le dar&iacute;a el nombre de Seriant. De esta forma les comunicaba que hab&iacute;a alguien que si se lo merec&iacute;an podr&iacute;a ayudarles. </P>
<P ALIGN="JUSTIFY">Pero &Eacute;l tambi&eacute;n era un Dios. No pod&iacute;a enfrentarse a todos Sus hermanos, y tuvo que ceder concediendo que les fuera ocultada a su capricho, para que los humanos no se olvidasen de lo que tambi&eacute;n eran. </P>
<P ALIGN="JUSTIFY">Y as&iacute; desaparec&iacute;a la Oscuridad y nac&iacute;a la Noche cuando sal&iacute;a la Luna. </P>
<P ALIGN="JUSTIFY">Tras el paso de los siglos, las guerras se fueron sucediendo y los humanos que al principio no eran rivales para ninguna raza, poco a poco comenzaron a ser temidos. Temidos porque algo que no pod&iacute;an comprender comenz&oacute; a crecer en ellos, y lo usaron para protegerse primero, y para atacar despu&eacute;s. As&iacute;, tras un lento despertar de ese poder, los humanos fueron aprendiendo a dominar lo que todos y cada uno de ellos llevaban en su interior, unos con mayor fuerza que otros, pero que resultaba letal para sus enemigos. </P>
<P ALIGN="JUSTIFY">El tiempo pasaba y ninguno de los hermanos de Dharmsqui estaba complacido. Ve&iacute;an c&oacute;mo poco a poco Sus criaturas iban desapareciendo una tras otra bajo el poder de esos humanos. Y ayudados al final por una raza traidora a su Dios, la Primera Creaci&oacute;n fue exterminada.</P>
<P ALIGN="JUSTIFY">Los Dioses se reunieron para decidir qu&eacute; se iba a hacer, puesto que aunque la raza vencedora fue la humana, su victoria fue producto de la traici&oacute;n de otra raza. Y aunque ning&uacute;n Dios se atrev&iacute;a a confesarlo ante Su hermano Dharmsqui, no aceptaban que la victoria estuviera basada en el uso de la Magia. As&iacute;, ante la falta de entendimiento y el recelo entre los Hermanos, volvieron a crear otros seres m&aacute;s temibles y fieros que los anteriores, denomin&aacute;ndose esa nueva era como la Segunda Creaci&oacute;n, en la que ya no eran todos contra el resto del mundo, sino que los unieron en una causa com&uacute;n contra los humanos. Pero esta vez no estar&iacute;an tan desprotegidos como antes. </P>
<P ALIGN="JUSTIFY">A los l&iacute;deres de cada una de las razas les fueron entregadas todo tipo de poderosas y a su vez m&aacute;gicas armas: espadas de metales negros que cortaban la piedra, cotas de mallas inmunes a la magia de los humanos, armaduras cuya sola visi&oacute;n hac&iacute;a enloquecer de p&aacute;nico a sus enemigos, escudos que reflejaban la luz del Sol y que cegaban para siempre a quien los mirase... pero eso no era lo peor de todo. Ni siquiera era lo peor el hecho de que se crease un ser con la fuerza de todos los seres de la Primera Creaci&oacute;n, que llamaron LorGroud por su don de dar la vida a la roca negra, el de los cien mil hijos, el engendrador de los Centuriones Negros. </P>
<P ALIGN="JUSTIFY">Aun a pesar de &eacute;ste monstruo que no pod&iacute;a ser herido ni por el metal ni por la magia, lo peor era que esos nuevos seres ya no albergaban en sus inmundos corazones el temor a la Oscuridad. Lo que fue casi la perdici&oacute;n para los humanos. </P>
<P ALIGN="JUSTIFY">Pero ese poder que pose&iacute;an era demasiado fuerte. Y esos sentimientos que los pon&iacute;an en inferioridad, les vali&oacute; para salvarse. Salvarse y llevar al exterminio al resto de las razas enemigas. A todas menos a una. A todas menos a la que les salv&oacute; al final de la Primera Creaci&oacute;n, pero que en su decadencia, dejados de la mano de su Dios Creador, se sumieron en su propia desgracia. Al final no qued&oacute; ninguna otra raza que los amenazase, y con el paso de los siglos las ansias destructoras de los humanos fueron extingui&eacute;ndose, y la fuerza que hab&iacute;an adquirido la comenzaron a usar para crear, en lugar de destruir.</P>
<P ALIGN="JUSTIFY">Los Dioses no tuvieron m&aacute;s remedio que aceptar que los humanos eran los vencedores, pero continuaron viendo con malos ojos lo que estaban consiguiendo con su poder. Recelosos porque fueron prosperando en armon&iacute;a con lo que a&uacute;n exist&iacute;a. Envidiosos porque aprendieron a dominar su fuerza y a hacerla crecer. Y la idea de que esas criaturas tambi&eacute;n hubieran aprendido a crear, no Les gust&oacute; a ninguno. E hicieron jurar a Su hermano Dharmsqui que si usaban ese poder para oponerse a cualquiera de Sus deseos, se le arrebatar&iacute;a. Porque a partir de ese momento ya no eran s&oacute;lo las criaturas de un Dios, sino que Les pertenec&iacute;an a todos Ellos. </P>
<P ALIGN="JUSTIFY">Y por esta envidia, algunos de esos Dioses recelosos, empezaron una persecuci&oacute;n para lograr que los humanos se enfrentasen a Ellos y conseguir una afrenta lo suficientemente grave como para que Su hermano tuviera que cumplir su palabra. Entonces, durante varios siglos, los humanos fueron los juguetes de esos Dioses, castig&aacute;ndolos sin raz&oacute;n, oblig&aacute;ndolos a la insumisi&oacute;n hasta tal punto que consiguieron lo que buscaban. </P>
<P ALIGN="JUSTIFY">Tras una traici&oacute;n de un humano, traici&oacute;n: algo que esos Dioses les ense&ntilde;aron a todos; fue descubierta una conspiraci&oacute;n para escapar del dominio de sus creadores. Y el medio que utilizaron para tal intento fue el poder que algunos de los hombres consiguieron desarrollar. Un poder que creci&oacute; hasta tal punto que todos reunidos podr&iacute;an hacerle frente incluso a un Dios. </P>
<P ALIGN="JUSTIFY">Esto era intolerable, y Dharmsqui tuvo que cumplir Su juramento. Tuvo que ceder porque Ellos no pod&iacute;an dejarlos decidir su destino. No pod&iacute;an dejar sin castigo el que hubieran destruido la mayor&iacute;a de Sus caprichos y Su entretenimiento, y celosos por su felicidad, les arrebataron la fuente de su poder. </P>
<P ALIGN="JUSTIFY">Les negaron la Magia. </P>
<P ALIGN="JUSTIFY">Les arrebataron casi su propio ser, haci&eacute;ndoles sentir desnudos.</P>
<P ALIGN="JUSTIFY">Se sumieron en una oscuridad de la que tardaron muchas generaciones en salir. Sucumbieron porque tuvieron que aprender a hacer las cosas que antes hac&iacute;an por medio de la magia. Tuvieron que adaptarse a las inclemencias del tiempo, el cual ya no pod&iacute;a ser controlado para suavizar los inviernos y hacer que las cosechas fueran espl&eacute;ndidas durante todas las &eacute;pocas del a&ntilde;o. </P>
<P ALIGN="JUSTIFY">Tuvieron que dejar el aprendizaje de las artes de la magia, perdiendo el conocimiento que gracias a ella hab&iacute;an alcanzado, borr&aacute;ndoles su pasado y enturbi&aacute;ndoles su futuro. Un futuro que cre&iacute;an que ya nunca llegar&iacute;a, que siempre se mantendr&iacute;a en el presente con la desesperaci&oacute;n causada por la p&eacute;rdida de su poder.</P>
<P ALIGN="JUSTIFY">Ese fue el destino de esos seres, el destino que los Dioses les quisieron imponer; el que les oblig&oacute; a vivir bajo su dominio priv&aacute;ndoles de lo &uacute;nico que necesita un ser para vivir en paz: la Libertad. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">En ese mundo de otros muchos, vivieron unos humanos a cuyo destino se atrevieron a oponerse. En ese mundo existieron y sufrieron, aun sabiendo las consecuencias de lo que hac&iacute;an. Pero nunca se doblegaron ante ellos.</P>
<P ALIGN="JUSTIFY">Nunca consiguieron hacer con ellos lo que con el resto de Su humanidad,... que me ense&ntilde;aron la verdad y que me hicieron ver lo que no quer&iacute;a reconocer.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Todo sucedi&oacute; en un mismo lugar. Una regi&oacute;n donde se mantuvo el miedo a los Dioses m&aacute;s que en ning&uacute;n otro sitio. Un pueblo donde pocas cosas eran normales. Un lugar dominado por una impresionante monta&ntilde;a que hac&iacute;a que el Sol tardase m&aacute;s en llegarles durante el amanecer. Que sum&iacute;a a las gentes en un mundo de claroscuros y grises que s&oacute;lo era olvidado cuando el Sol consegu&iacute;a superarlas. As&iacute;, durante ese peque&ntilde;o tiempo, nadie se atrev&iacute;a a salir de sus casas, y si a alguien le alcanzaba ese momento fuera de su hogar, corr&iacute;a en busca de cobijo en cualquier sitio, corriendo casi sin raz&oacute;n. </P>
<P ALIGN="JUSTIFY">A pesar de esto, no era un mal lugar para vivir. Los inmensos campos cultivados que se extend&iacute;an hacia el Oeste, creaban la suficiente riqueza para que el peque&ntilde;o pueblo que anta&ntilde;o fuera, se convirtiera poco a poco en una peque&ntilde;a ciudad; para que los restos de la Ciudad destruida crecieran poco a poco desde la nada. </P>
<P ALIGN="JUSTIFY">Esos restos que sobrevivieron, pertenec&iacute;an a la antigua capital del Reino de Eslariot. Ciudad que a varios kil&oacute;metros de distancia, a&uacute;n reflejaba la luz que el Sol dirig&iacute;a hacia sus ruinas de m&aacute;rmol. Ciudad destruida para poner fin a las pretensiones de libertad de los humanos. </P>
<P ALIGN="JUSTIFY">Y lo &uacute;nico que hac&iacute;a que los viajeros que ten&iacute;an que pasar por esa zona se desviasen, si pod&iacute;an, para no atravesarla, eran sus gentes. </P>
<P ALIGN="JUSTIFY">En el resto del mundo habitado, las supersticiones sobre magias, hechiceros y brujas era parte de la cultura popular, parte del pasado que ya no se tomaba en serio, dej&aacute;ndolas de lado y ni siquiera plante&aacute;ndose si alguna vez existieron. Pero este lugar era muy diferente en cuanto a las creencias sobre lo sobrenatural e irracional para ellos. </P>
<P ALIGN="JUSTIFY">Quiz&aacute; la causa era el extra&ntilde;o suceso que ocurr&iacute;a todos los d&iacute;as antes del amanecer, que les recordaba continuamente que no todas las cosas eran normales, que les sum&iacute;a en una especie de letargo emocional en donde nadie m&aacute;s importaba aparte de uno mismo, haciendo despertar los temores de cada uno. O quiz&aacute; fuese el hecho de que all&iacute; en las cercanas monta&ntilde;as, y olvidado ya por todos, fue donde un d&iacute;a, o mejor dicho, una noche, la Luna fue bautizada con el nombre de Seriant. </P>
<P ALIGN="JUSTIFY">Lo ocurrido entonces marc&oacute; la existencia de todos los seres de aquel lugar y de sus descendientes. Pero fuera lo que fuese, hac&iacute;a que nadie se atreviera a burlarse de las supersticiones, aunque eso no evitaba que cuando hablasen entre ellos ninguno reconociese su temor. As&iacute;, se evitaban los comentarios sobre los Dioses y su poder, de la magia y del mundo de los esp&iacute;ritus, es decir, todo lo que sus costumbres cerradas en s&iacute; mismas por el paso del tiempo, les imped&iacute;an comprender. </P>
<P ALIGN="JUSTIFY">Por esto, todo aquel que se atreviera a pronunciar algo sobre este tema, era ignorado irracionalmente y hasta dejado de lado, sin atenerse a ninguna explicaci&oacute;n. Haciendo que la gente se encerrase en s&iacute; misma y en los m&aacute;s pr&oacute;ximos.</P>
<P ALIGN="JUSTIFY">Y en este lugar es donde comienza mi historia, aunque tambi&eacute;n ser&iacute;a correcto decir donde termina.</P>
<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







