<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 7. El pasado.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Cuando esa noche se qued&oacute; solo  en el sal&oacute;n, despu&eacute;s de que los otros dos ya se hubieran acostado, se sent&oacute; en su Butaca y medit&oacute; sobre las cosas que hab&iacute;a o&iacute;do. A Aradriel le dec&iacute;a que &eacute;l s&oacute;lo quer&iacute;a o&iacute;rlas para pasar el rato, pero en el fondo deseaba saber m&aacute;s y m&aacute;s. Y hasta se enfadaba consigo mismo al sorprenderse imagin&aacute;ndose c&oacute;mo ser&iacute;an esos tiempos con monstruos y espadas, magia y guerras, e intentaba convencerse a s&iacute; mismo de que eran cuentos.</P>
<P ALIGN="JUSTIFY">–<I> "¡Son cuentos!" </I>–se repet&iacute;a una y otra vez, pero sin conseguir convencerse, reconociendo siempre al final que aunque fuera un simple muchacho el que le contase esas cosas, era verdad. Incluso la historia del origen de la Monta&ntilde;a Maldita, incluso la leyenda del alma de una mujer encerrada en la invisibilidad. No quer&iacute;a aceptarlo, pero al final no tuvo m&aacute;s remedio que reconocer que estaba enga&ntilde;ado. </P>
<P ALIGN="JUSTIFY">Hab&iacute;a estado sin pasado durante mucho tiempo. Comprendi&oacute;, por las palabras de Aradriel, que sin pasado, no se puede aprender de los fallos cometidos.</P>
<P ALIGN="JUSTIFY">– <I>"Esa historia... esa mujer y ese muchacho..." </I>–pensaba mientras se mec&iacute;a una y otra vez, esperando a que la oscuridad de la Maldita desapareciera del amanecer. Pensando sin poder evitarlo en lo que la pasada noche cont&oacute; Aradriel. Y a la vez no deseando que llegase la hora de salir al pueblo y tener que dar explicaciones de qu&eacute; hac&iacute;a un extra&ntilde;o en su casa, puesto que los rumores sobre este hecho, ya se convirtieron en historias de brujos y de malos presagios, s&iacute;ntomas de su temor. Asque&aacute;ndose por la ignorancia de las gentes... y de la suya propia hasta hac&iacute;a poco.</P>
<P ALIGN="JUSTIFY">Esa historia era como las dem&aacute;s que hab&iacute;a o&iacute;do de los labios de Aradriel. Pero la forma de relatarla, la manera en que el lugar donde transcurr&iacute;a le despertaba recuerdos de cuando era joven, como si los conociera; los mal reprimidos atisbos de rabia y de pasi&oacute;n en la entonaci&oacute;n del muchacho, le desesperaban. Hab&iacute;a algo m&aacute;s. Lo present&iacute;a. Ten&iacute;a que haber algo m&aacute;s. </P>
<P ALIGN="JUSTIFY">Esa historia era la siguiente:</P>
<P ALIGN="JUSTIFY">«Un d&iacute;a cualquiera en la vida de un cazador, estaba &eacute;ste en su trabajo en las monta&ntilde;as, cuando encontr&oacute; el rastro de un ciervo.</P>
<P ALIGN="JUSTIFY">Era un humano llamado Eradil, nombre conformado por el del Dios Ara y el de su padre Ardil. Persegu&iacute;a el rastro del ciervo. </P>
<P ALIGN="JUSTIFY">Ensimismado en su b&uacute;squeda, traspas&oacute; la zona por donde sol&iacute;a cazar, y entre los ruidos del bosque, pudo distinguir como una voz de mujer, pero muy grave, que conforme se iba acercando al lugar de donde parec&iacute;a provenir, se iba tornando menos ronca y m&aacute;s clara de entender.</P>
<P ALIGN="JUSTIFY">Al fin vio una cueva y se qued&oacute; en la entrada. La voz de una mujer mayor reflejaba el relato de una historia acerca de una joven cuyo cuerpo y alma vagaban sin destino por entre esas monta&ntilde;as; la voz dec&iacute;a as&iacute;:</P>
<P ALIGN="JUSTIFY">– <I>Y &eacute;ste fue su castigo. Vagaba sin descanso desde hac&iacute;a cientos de a&ntilde;os, y la &uacute;nica forma en que se pod&iacute;a librar de su castigo, era que alguien se enamorase de ella. Ese castigo fue impuesto por los Dioses, que celosos de su felicidad, decidieron ser a&uacute;n m&aacute;s crueles, d&aacute;ndole una oportunidad de que se la perdonase. Pero a cambio, la hicieron invisible a los ojos de los humanos. Para que supiera que ten&iacute;a una salida que nunca podr&iacute;a alcanzar, puesto que la &uacute;nica forma en que pod&iacute;a demostrar su existencia a los mortales era mediante su voz, porque s&oacute;lo los animales la pod&iacute;an ver.</P>
</I><P ALIGN="JUSTIFY">Mientras Eradil o&iacute;a la historia, algo inexplicable sent&iacute;a en su interior. &Eacute;l comprend&iacute;a perfectamente la soledad que acompa&ntilde;aba las palabras de la voz, ya que &eacute;l, a pesar de tener tantos amigos, se sent&iacute;a s&oacute;lo; pensando que el mundo en que viv&iacute;a no era para &eacute;l, y esperando con incontenible deseo que un d&iacute;a llegara a conocer a la persona que lo comprendiera de verdad. </P>
<P ALIGN="JUSTIFY">De repente, sin darse cuenta, su arma que dej&oacute; apoyada contra la pared de la entrada, resbal&oacute; y cay&oacute; formando un gran ruido al dispararse por el golpe. Entonces, como si fuera una avalancha, comenzaron a salir decenas de animales de la cueva. Tal era el susto de &eacute;stos, que pasaron por el lado del cazador e incluso por encima, sintiendo en su est&oacute;mago un fuerte pisot&oacute;n.</P>
<P ALIGN="JUSTIFY">Cuando sali&oacute; el &uacute;ltimo animal, Eradil se percat&oacute; de que ning&uacute;n humano hab&iacute;a salido de la cueva. As&iacute;, decidi&oacute; entrar para conocer a la persona que contaba la historia, ya que alguien que era capaz de contar un cuento de esa clase, y de la forma en que lo hac&iacute;a, llegando al coraz&oacute;n de quien lo escuchaba, deb&iacute;a de ser un ser sensible y digno de conocer. Algo tan distinto a todo lo que conoc&iacute;a. </P>
<P ALIGN="JUSTIFY">Eradil entr&oacute; y lleg&oacute; hasta el final, encontr&aacute;ndose con que &eacute;sta no ten&iacute;a salida. Entonces se extra&ntilde;&oacute; mucho, ya que podr&iacute;a jurar por los Dioses que ning&uacute;n ser humano hab&iacute;a podido salir de la cueva sin que &eacute;l lo hubiera visto. Desconcertado por la situaci&oacute;n, se sent&oacute; en el suelo y estuvo un rato pensando sobre lo sucedido.</P>
<P ALIGN="JUSTIFY">Aunque no le parec&iacute;a demasiado posible, le rondaba por la mente la idea de que la persona que hab&iacute;a escuchado, pod&iacute;a ser la misma que la protagonista de la historia. Y como afuera estaba anocheciendo, se levant&oacute; y decidi&oacute; volver a su casa, no sin antes percatarse de que los sonidos que produc&iacute;a al andar mientras estuvo en la cueva, sonaban muy graves, hasta el punto de que se detuvo un momento y dijo:</P>
<P ALIGN="JUSTIFY">–<I> Hola</I> –sintiendo c&oacute;mo su voz parec&iacute;a la de un anciano, y pensando que tal vez, quien hablaba, podr&iacute;a ser tambi&eacute;n joven como &eacute;l. </P>
<P ALIGN="JUSTIFY">De regreso, continu&oacute; pensando en ello. Aunque no pod&iacute;a concebir la existencia de una persona encantada, invisible a la vista de los humanos, puesto que las costumbres hab&iacute;an olvidado lo que era la magia y lo extra&ntilde;o a lo normal, le gustaba pensar que era cierto. Le agradaba pensar que exist&iacute;a algo m&aacute;gico que le pod&iacute;a dar la oportunidad de conocer ese mundo distinto que tanto deseaba encontrar, que imaginaba en su interior durante horas y horas acostado en su cama antes de dormirse. Que necesitaba que existiera.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Al d&iacute;a siguiente, tuvo que volver al mismo sitio. Ten&iacute;a que hacerlo porque no pod&iacute;a desterrar de su pensamiento el recuerdo del d&iacute;a anterior. Estuvo toda la noche atormentado por un sue&ntilde;o, el cual volv&iacute;a tras provocar su despertar y volverse a dormir, en el que una mujer a la cual no pod&iacute;a verle el rostro, estaba arrodillada ante un animal de pelaje oscuro. Un animal que yac&iacute;a sin vida sobre una especie de mesa de madera. Con las manos estaba sujetando la cabeza del animal, llorando sobre el cuerpo sin vida.</P>
<P ALIGN="JUSTIFY">– <I>"Tengo que saber qu&eacute; era lo de ayer"</I> –pensaba, disculp&aacute;ndose a s&iacute; mismo por dejar de lado la caza que era su trabajo, con el cual ayudaba a su padre.</P>
<P ALIGN="JUSTIFY">Estaba escondido tras unos &aacute;rboles desde donde se ve&iacute;a la entrada de la cueva. Permaneci&oacute; durante bastante tiempo inm&oacute;vil, esperando, hasta que al atardecer comenzaron a aparecer animales de distintas especies que entraban lentamente en la cueva. A Eradil le parec&iacute;a incre&iacute;ble que todos esos animales pudieran estar juntos, olvidando sus instintos de depredadores y presas, pero m&aacute;s incre&iacute;ble a&uacute;n le pareci&oacute; cuando sinti&oacute; algo distinto a todo lo que hab&iacute;a sentido durante toda su vida. Algo que pasaba cerca de &eacute;l. Era como una leve brisa cargada de un olor indescriptible, que hac&iacute;a que los corazones se alegrasen, que se olvidasen todos los malos pensamientos, invocando el deseo de convivir en armon&iacute;a con todo lo existente. </P>
<P ALIGN="JUSTIFY">Parec&iacute;a como si hubiera estado en un sue&ntilde;o, aletargado, hasta que despert&oacute; y pudo escuchar de nuevo la voz que tanto se le hab&iacute;a repetido en el pensamiento. Se acerc&oacute; a la entrada de la cueva, pero esta vez, dejando su arma donde hab&iacute;a estado esperando. Entonces pudo escuchar una historia que le parec&iacute;a conocida, la misma que oy&oacute; el d&iacute;a anterior, de la cual s&oacute;lo escuch&oacute; la parte final, pero que sin saber c&oacute;mo, tambi&eacute;n conoc&iacute;a el principio. La voz dec&iacute;a as&iacute;:</P>
<P ALIGN="JUSTIFY">– <I>Ella era feliz, demasiado feliz para ser permitido. Ellos no pod&iacute;an dejarla libre. Esperaban la m&aacute;s m&iacute;nima oportunidad, el m&aacute;s leve intento de quebrantar sus normas, para castigarla. Y aunque ella lo sab&iacute;a, no pudo evitar el intentar salvar a su padre, el intentar impedir la muerte que le hab&iacute;a determinado el destino. </P>
<P ALIGN="JUSTIFY">Ella se llamaba Serind&euml;l, hija de Sild&euml;n y Sirendil. </P>
<P ALIGN="JUSTIFY">Su padre Sirendil tuvo que luchar junto a su se&ntilde;or en una de las innumerables guerras de la Segunda Creaci&oacute;n. Guerras en las cuales, las bestias del mal comandadas por los sardars, cumpliendo con el sentido de la existencia que les hab&iacute;an dado los Dioses, intentaban destruirlos. Serind&euml;l, al igual que su madre, ten&iacute;a unos poderes muy superiores a los de sus semejantes, y los utilizaba para que las cosechas crecieran en tiempos adversos, para ayudar a los m&eacute;dicos a curar a los enfermos, para que el invierno no fuera tan cruel con los necesitados. </P>
<P ALIGN="JUSTIFY">Pero en el momento en que vio a su padre tendido en el suelo junto a ella, sabiendo que ten&iacute;a que morir irremediablemente por la flecha envenenada que ten&iacute;a clavada en el coraz&oacute;n, supo que aunque le costar&iacute;a muy caro, usar&iacute;a la fuerza de su poder para salvarlo. Y en el momento en que tom&oacute; la decisi&oacute;n, con los ojos crispados por el dolor y la ira, y los pu&ntilde;os en alto apuntando al cielo grit&oacute;:</P>
</I><P ALIGN="JUSTIFY">– <I>S&eacute; que estabais esperando que esto sucediera para poder castigarme, y aunque me hag&aacute;is lo m&aacute;s cruel que vuestras p&eacute;rfidas mentes puedan crear, ¡nunca!, ¡nunca me arrepentir&eacute; de intentar salvarlo!. ¿Me o&iacute;s? ¡Nunca!</P>
<P ALIGN="JUSTIFY">Y tras decir estas palabras, sujet&oacute; la flecha con las dos manos, mientras pronunciaba varias frases para s&iacute; misma, mientras formaba en su mente el v&iacute;nculo entre su poder y la materia. Entonces, un halo de luz envolvi&oacute; al cuerpo de su padre, y lentamente fue extrayendo la flecha de su coraz&oacute;n. Al sacarla completamente, ech&oacute; la cabeza hacia atr&aacute;s y cay&oacute; exhausta junto a su padre. </P>
<P ALIGN="JUSTIFY">El cielo se quej&oacute;. Un abrumador trueno llen&oacute; el aire que se carg&oacute; de maldad, que se volvi&oacute; espeso, y mientras Serind&euml;l iba desapareciendo sorprendentemente a la vista de los que all&iacute; estaban, dijo sabiendo por gracia de los Dioses lo que le iba a pasar.</P>
<P ALIGN="JUSTIFY">– Adi&oacute;s, padre. Adi&oacute;s, madre. Vivid felices y nunca teng&aacute;is miedo de serlo, de enfrentarse a ellos. Tal vez alg&uacute;n d&iacute;a alguien les haga pagar su maldad. Tal vez alg&uacute;n d&iacute;a Dharmsqui se atreva a enfrentarse a ellos y los destruya.</P>
</I><P ALIGN="JUSTIFY">La voz continu&oacute; con la historia que hab&iacute;a escuchado Eradil el d&iacute;a anterior, pero como si fuera la primera vez, la escuchaba con total atenci&oacute;n. </P>
<P ALIGN="JUSTIFY">Al caer la noche, los cuentos en la cueva acabaron y comenzaron a salir los animales tan lentamente como entraron a ella. Eradil se volvi&oacute; a esconder, no sin antes asustar a varios conejos que lo vieron, y cuando sinti&oacute; de nuevo la presencia, sobreponi&eacute;ndose a la sensaci&oacute;n que lo embargaba, hizo acopio de toda su determinaci&oacute;n y se levant&oacute; r&aacute;pidamente.</P>
<P ALIGN="JUSTIFY">– <I>Hola</I> –dijo con voz temblorosa.</P>
<P ALIGN="JUSTIFY">Entonces sinti&oacute; c&oacute;mo esa brisa m&aacute;gica se deten&iacute;a durante un momento, para inmediatamente alejarse r&aacute;pidamente.</P>
<P ALIGN="JUSTIFY">– <I>¡Espera! Por favor.</P>
</I><P ALIGN="JUSTIFY">Dijo estas palabras con tanto dolor, que tras un breve momento not&oacute; c&oacute;mo la brisa se deten&iacute;a.</P>
<P ALIGN="JUSTIFY">– <I>¿Qui&eacute;n eres?</I> –pregunt&oacute; la voz. La voz de una joven. La voz de algo que ya no era humano, pero que un d&iacute;a lo fue. La voz de un alma.</P>
<P ALIGN="JUSTIFY">– <I>Me llamo Eradil</I> –respondi&oacute; sin saber qu&eacute; m&aacute;s decir.</P>
<P ALIGN="JUSTIFY">– <I>¿C&oacute;mo sab&iacute;as que estaba aqu&iacute;?</I> –volvi&oacute; a preguntar la voz, con un tinte de  temerosidad en su timbre.</P>
<P ALIGN="JUSTIFY">– <I>Te... te he sentido cuando pasabas.</P>
</I><P ALIGN="JUSTIFY">Se hizo un silencio profundo. Se detuvo todo alrededor: el viento, las hojas de los &aacute;rboles, el sonido del bosque... y despu&eacute;s:</P>
<P ALIGN="JUSTIFY">–<I> Y ¿c&oacute;mo te llamas t&uacute;?</I> –le pregunt&oacute; Eradil.</P>
<P ALIGN="JUSTIFY">– <I>Lo siento... no puedo dec&iacute;rtelo... no debo por tu bien.</P>
</I><P ALIGN="JUSTIFY">Y al no comprender Eradil la respuesta, atrevi&eacute;ndose un poco, a&ntilde;adi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Te llamas Serind&euml;l ¿verdad?</P>
</I><P ALIGN="JUSTIFY">–<I> ¿C&oacute;mo lo sabes? </I>–pregunt&oacute; alarmada la voz–. <I>D&eacute;jame, por favor, d&eacute;jame.</P>
</I><P ALIGN="JUSTIFY">Y la presencia se alej&oacute; r&aacute;pidamente por entre los &aacute;rboles. &Eacute;l la persigui&oacute; durante un trecho, pero le perdi&oacute; el rastro r&aacute;pidamente. Era imposible perseguir al viento. Y tuvo que regresar a su casa profundamente consternado por todo lo que hab&iacute;a pasado. Asombrado y a la vez desalentado por lo extra&ntilde;o e inusual de todo lo que hab&iacute;a vivido. Y durante el camino de vuelta, como si todo el silencio anterior se hubiera estado conteniendo y se hubiera desatado de golpe, sinti&oacute; como si todo el bosque lo estuviera observando.</P>
<P ALIGN="JUSTIFY">Al llegar a su casa, su padre le pregunt&oacute; que qu&eacute; le pasaba, porque su cara reflejaba tristeza y cansancio. Pero Eradil le respondi&oacute; con evasivas. Y se encerr&oacute; en su habitaci&oacute;n para pensar y aceptarlo todo. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Al d&iacute;a siguiente, en el D&iacute;a de los Dioses, Eradil estaba en la plaza del pueblo haciendo las compras necesarias para el d&iacute;a, cuando escuch&oacute; un griter&iacute;o a la entrada de la taberna. Se acerc&oacute; y pudo ver entre la multitud que se hab&iacute;a reunido en torno a ella, a la vieja bruja. Estaba en el suelo y ten&iacute;a todas sus cosas esparcidas en &eacute;l. Un instante despu&eacute;s vio c&oacute;mo el tabernero sal&iacute;a por la puerta y le gritaba a la vieja.</P>
<P ALIGN="JUSTIFY">– <I>¡Vete de aqu&iacute; si no quieres que te suelte a los perros!  Y no vuelvas nunca m&aacute;s a pedirme dinero ni a m&iacute; ni a mis clientes a cambio de tus malditos conjuros y mentiras de bruja. El tiempo de la magia ya pas&oacute; y nadie la posee desde hace muchos siglos, ¡mentirosa!.</P>
<P ALIGN="JUSTIFY">– ¡Mentirosa! </I>–se oy&oacute; decir a un emocionado espectador.</P>
<P ALIGN="JUSTIFY">– <I>¡Estafadora! </I>–dijo otra voz, cerca de Eradil.</P>
<P ALIGN="JUSTIFY">– <I>¡A la horca! </I>–se oy&oacute; a un tercero, que se perdi&oacute; entre el gent&iacute;o.</P>
<P ALIGN="JUSTIFY">Entonces la vieja, tras recoger sus cosas del suelo, se levant&oacute; y dijo con mucho convencimiento:</P>
<P ALIGN="JUSTIFY">– <I>Que esas palabras se vuelvan contra ti. Que al renegar de la magia te conviertas en un animal. He dicho.</P>
<P ALIGN="JUSTIFY">– ¿Qu&eacute;? ¿Que me vas a convertir en un animal? </I>–grit&oacute; &eacute;l.</P>
<P ALIGN="JUSTIFY">– <I>¡Si ya lo eres! </I>–grit&oacute; uno de entre el p&uacute;blico que se form&oacute;, y todos se echaron a re&iacute;r.</P>
<P ALIGN="JUSTIFY">Y la vieja sigui&oacute; sin hacer caso al gent&iacute;o.</P>
<P ALIGN="JUSTIFY">– <I>No te burles de la fuerza de la magia, pues fue la que nos salv&oacute; de la destrucci&oacute;n; y te advierto que no vuelvas a atreverte a maltratarme o te convertir&eacute; en un algo horroroso. He dicho.</P>
<P ALIGN="JUSTIFY">– ¿A&uacute;n m&aacute;s? </I>–dijo un cliente saliendo de la taberna con el cuerpo tambale&aacute;ndose, justo antes de que el tabernero lo hiciera entrar, de un amable pu&ntilde;etazo en la nariz. Y a&uacute;n desde dentro pudi&eacute;ndosele o&iacute;r: –pero si el tabernero es m&aacute;s feo que un sapo cabez&oacute;n con cola de le&oacute;n– perdiendo casi el aliento por la risa que le asalt&oacute;, al darse cuenta de que hab&iacute;a hecho un insulto–rima, algo que desde ese momento se cultiv&oacute; como una verdadera profesi&oacute;n.</P>
<P ALIGN="JUSTIFY">– <I>¿Y en qu&eacute; me convertir&iacute;as?</I> –le grit&oacute; con una suavidad de elefante, el fe&iacute;simo tabernero, a la anciana.</P>
<P ALIGN="JUSTIFY">– <I>Si prefieres, en cerdo, para que tal vez mejore tu aspecto un poco.</P>
</I><P ALIGN="JUSTIFY">Y entre las burlas de todos los presentes menos uno, desapareci&oacute; la vieja entre la multitud, mientras el afectado tabernero consum&iacute;a su ira golpeando a los incautos pueblerinos que se re&iacute;an demasiado cerca de &eacute;l. </P>
<P ALIGN="JUSTIFY">Tras esto, todas las personas fueron retomando sus caminos y quehaceres y se olvidaron pronto de lo sucedido. Todos menos uno. Eradil se qued&oacute; intrigado de si era verdad que la bruja pod&iacute;a convertir a un hombre en animal, pero aunque sab&iacute;a que todos la ten&iacute;an por loca, despu&eacute;s de lo que hab&iacute;a vivido en el bosque, ya nada le parec&iacute;a imposible. Y adem&aacute;s, podr&iacute;a estar en el mismo caso que la anciana, puesto que si se atreviera a contarlo a la gente, tambi&eacute;n lo tomar&iacute;an por loco.</P>
<P ALIGN="JUSTIFY">Regres&oacute; a su casa y ya no pudo callar m&aacute;s. Le cont&oacute; a su padre lo que hab&iacute;a pasado en el pueblo y lo que dijo la bruja, pero nada dijo sobre lo del bosque. Eso era s&oacute;lo para &eacute;l. Su padre, aunque era una persona inteligente, tambi&eacute;n ten&iacute;a el mismo concepto que el resto de la gente sobre la vieja bruja, y le dijo a su hijo que se olvidase de ella, que el tiempo de la magia ya hab&iacute;a quedado atr&aacute;s desde hac&iacute;a much&iacute;simos a&ntilde;os. Desde que los Dioses se la prohibieron a los humanos. </P>
<P ALIGN="JUSTIFY">La respuesta de Ardil, el padre de Eradil, no le gust&oacute; nada a su hijo, y tras el paso de los d&iacute;as, atormentado por lo que vivi&oacute; y la posibilidad de que la bruja pudiera convertirle en un animal s&oacute;lo para poder ver a Serind&euml;l, no pudo contenerse m&aacute;s y fue al bosque a buscarla. Sab&iacute;a que posiblemente era una tonter&iacute;a, que lo m&aacute;s seguro era que la gente tuviera raz&oacute;n, que estaba loca y para lo &uacute;nico que serv&iacute;a era para burlarse de ella. Pero algo, algo a lo que se le podr&iacute;a llamar intuici&oacute;n, le espoleaba d&eacute;bilmente en el &aacute;nimo para que se atreviera a intentarlo. De todas formas, si la bruja se burlaba de &eacute;l, ¿a qui&eacute;n se lo iba a decir?. Nadie la creer&iacute;a.</P>
<P ALIGN="JUSTIFY">Le cost&oacute; mucho encontrar la choza donde viv&iacute;a la vieja, ya que tuvo que dar un gran rodeo para no pasar cerca de la cueva a donde iba Serind&euml;l, donde no se hab&iacute;a atrevido a acercarse desde la ocasi&oacute;n en que habl&oacute; con ella y la perdi&oacute; cuando la persegu&iacute;a. Le asustaba y dol&iacute;a a la vez.</P>
<P ALIGN="JUSTIFY">Con mucha resignaci&oacute;n llam&oacute; a la puerta y una voz &aacute;spera pero profunda le contest&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Pasa, pasa. Entra y no tengas miedo. Un muchachote como t&uacute; que tenga miedo de una pobre ancianita. Y es que como dec&iacute;a mi amiga Carlindel del Monte de lo Alto, los j&oacute;venes tienen cada d&iacute;a menos verg&uuml;enza. No saben lo que quieren pero lo quieren todo; y no se te ocurra llevarles la contraria, o como dec&iacute;a mi amiga Pancrot&auml; de Playa Plana, te saltan con lo del conflicto generacional, y encima, si les dices algo de que respeten a los mayores, te dan el portazo y ni te escuchan, y es que... ¿pero todav&iacute;a est&aacute;s ah&iacute;?, entra hombre, entra. ¿Por d&oacute;nde iba? ¡Ah!, ya s&eacute;. Que no quiero comprarte nada, que no que no y que no, un momento,... me he equivocado, eso no era lo que te estaba diciendo, ¿qu&eacute; era?  ¡Ay!, qu&eacute; pena ser tan vieja y no acordarte de lo que dec&iacute;as ayer... ¿ayer? no, vieja, lo correcto es hace un momento– se corrigi&oacute; a s&iacute; misma mientras el asombrado joven no sab&iacute;a por d&oacute;nde escabullirse.–  Bueno, ¿qu&eacute; haces ah&iacute; de pie?. Si&eacute;ntate que hac&iacute;a tiempo, mucho tiempo que no ten&iacute;a una visita, y es que como dec&iacute;a mi amiga Letarda de Pinta Cantos Cuadrados, cada d&iacute;a cuesta m&aacute;s trabajo sacarle los ahorros a los tontos y as&iacute; no hay quien viva, pero no deber&iacute;a preocuparme porque bla bla bla...  y bla.</P>
</I><P ALIGN="JUSTIFY">Eradil la escuchaba asombrado porque no pod&iacute;a creer que existiera alguien tan alocado como la mujer que no paraba de hablar en tanta cantidad, y sin decir nada en absoluto; que no paraba de decir cosas sin sentido e incoherentes; hasta que tras media hora de verborrea monologa aplastante sin parar, alocado &eacute;l tambi&eacute;n por el zumbido de la voz de la vieja, grit&oacute;:</P>
<P ALIGN="JUSTIFY">–<I> ¡Basta!, ¡basta!, ¡pare ya, por favor! </P>
</I><P ALIGN="JUSTIFY">Entonces la mujer call&oacute; y con una sonrisa burlona, se dirigi&oacute; a Eradil:</P>
<P ALIGN="JUSTIFY">– <I>Bien, muchacho. Has resistido bastante y eso s&oacute;lo puede significar una cosa: que lo que te ha tra&iacute;do hasta aqu&iacute; es algo muy importante para ti. Pero dime, ¿qu&eacute; es lo que quieres que haga? </I>–y dedic&aacute;ndole una sonrisa p&iacute;cara con sus dientes mellados, a&ntilde;adi&oacute;–. <I>Ya sabes que dicen que estoy loca.</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;, eso es lo que dicen –</I>afirm&oacute; Eradil–<I> Pero yo no lo creo.</I> </P>
<P ALIGN="JUSTIFY">Durante unos segundos en los cuales la anciana se qued&oacute; en silencio, como si estuviera meditando, Eradil pudo mirar en derredor suyo.</P>
<P ALIGN="JUSTIFY">La d&eacute;bil iluminaci&oacute;n la creaba una chimenea que se manten&iacute;a encendida a duras penas, puesto que lo &uacute;nico que quedaban era un mont&oacute;n de rescoldos, que con sus ciclos de colores naranjas, rojos y amarillos, vomitaban una atm&oacute;sfera agobiante. La luz, parec&iacute;a que tuviese miedo de salir de la incandescencia, y se alejaba t&iacute;midamente de la chimenea, pero no se atrev&iacute;a a ir muy lejos puesto que en casi todos los rincones, una intensa oscuridad se agazapaba para devorarla. Por esto, Eradil no pod&iacute;a ver demasiados detalles, pero pudo advertir la presencia de m&uacute;ltiples estanter&iacute;as llenas de libros y montones de recipientes de cristal, reflejando los haces de luz m&aacute;s atrevidos, que osaban llegar hasta all&iacute;. Tambi&eacute;n crey&oacute; ver una especie de segunda habitaci&oacute;n, al fondo de la peque&ntilde;a estancia en la que se encontraban, pero que la oscuridad la hac&iacute;a parecer distante e inalcanzable. Y lo m&aacute;s extra&ntilde;o era que a&uacute;n a pesar de ese ambiente, no se notaba nada m&aacute;gico. No se sent&iacute;an las fuerzas de los elementos, a punto de caer sobre los desprevenidos, ni densas brumas que atravesaban las almas incautas. Nada de lo que se dec&iacute;a de la bruja era verdad. Aparte de la oscuridad, todo era casi normal, incluso el aspecto de la anciana.</P>
<P ALIGN="JUSTIFY">La mujer lo interrumpi&oacute; bruscamente.</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; has venido?</I> –le pregunt&oacute;.</P>
<P ALIGN="JUSTIFY">Eradil titube&oacute; un momento, y tras inhalar una r&aacute;pida bocanada de aire, que se le antoj&oacute; agrio, le respondi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Hace unos d&iacute;as te o&iacute; decirle al tabernero que lo podr&iacute;as convertir en un animal, si tu quisieras... y yo quiero convertirme en uno.</P>
<P ALIGN="JUSTIFY">– ¿En un animal? </I>–le pregunt&oacute; la vieja sobresaltada y divertida a la vez, y retomando de nuevo la compostura– <I>S&iacute;, eso dije, pero podr&iacute;a ser una mentira para asustarlo– a&ntilde;adi&oacute; con una expresi&oacute;n que no dejaba entrever si lo que dec&iacute;a era verdad o no. </P>
</I><P ALIGN="JUSTIFY">Y Eradil, cayendo en que no hab&iacute;a pensado en esa posibilidad, no pudo ocultar su desconcierto. Entonces, la vieja, d&aacute;ndose cuenta de que el joven no hab&iacute;a venido para burlarse de ella, de que el motivo era importante, le dijo:</P>
<P ALIGN="JUSTIFY">– <I>No te preocupes hijo. Aunque te parezca imposible, puedo hacerlo. Claro, pero s&oacute;lo si tu puedes creer en ello.</P>
<P ALIGN="JUSTIFY">– ¿De verdad? </I>–pregunt&oacute; Eradil nuevamente esperanzado. </P>
<P ALIGN="JUSTIFY">Entonces mir&oacute; a la mujer por primera vez. Y no vio a la desvariada que siempre iba ataviada con ropas tan antiqu&iacute;simas como destrozadas, sino que vio a una mujer mayor y cerca de la vejez, pero con un brillo en los ojos, que estaba desgastado, como si descansasen sobre ellos m&aacute;s a&ntilde;os que sobre el resto de su cuerpo. </P>
<P ALIGN="JUSTIFY">Tras un momento de duda, a&ntilde;adi&oacute; torn&aacute;ndose su voz en un suspicaz murmullo</P>
<P ALIGN="JUSTIFY">–  <I>D&iacute;game c&oacute;mo puedo pagarle.</P>
<P ALIGN="JUSTIFY">– No temas por eso </I>–le dijo la vieja con una sonrisa–. <I>Ya es suficiente con que creas en m&iacute;... aunque esto te parezca incre&iacute;ble. Desde hace muchos a&ntilde;os, todo el mundo me ha tratado como a una loca, todo porque yo segu&iacute;a defendiendo la existencia de la magia, tal y como me pidi&oacute; alguien que perd&iacute;, pero se equivocaban.</P>
<P ALIGN="JUSTIFY">– Pero la magia fue arrebatada en su totalidad por los Dioses </I>–dijo Eradil.</P>
<P ALIGN="JUSTIFY">–<I> No, eso no es correcto. El ser humano, la raza humana y todo lo que ello representa, fue creada a partir de la magia, o mejor dicho, del poder de los Dioses. Pero cuando se decidi&oacute; quitarnos ese poder, no pudieron hacerlo totalmente, ya que no pod&iacute;an erradicar algo que constitu&iacute;a una parte del propio ser. Si lo hubieran hecho, nosotros ya no existir&iacute;amos como tales, y eso no lo pod&iacute;an hacer, ya que &eacute;ramos los ganadores. Vencimos a todos los seres que enviaron en nuestra contra. Y como a partir de ese momento fuimos sus juguetes, Dharmsqui los convenci&oacute; para que esa negaci&oacute;n a nuestra magia fuera la mayor posible, pero nunca sin destruir a la propia persona. As&iacute;, algunos magos y personas que no hab&iacute;an desarrollado la magia pero que la pose&iacute;an muy profundamente en su ser, vieron sus poderes casi completamente apagados. Pero les qued&oacute; una chispa de magia. Una chispa que con el tiempo, y siempre ocult&aacute;ndoselo a Ellos, podr&iacute;a volver a encender el fuego, podr&iacute;a reavivar la llama de la magia que una vez todos pose&iacute;mos. </P>
</I><P ALIGN="JUSTIFY">Eradil estaba ensimismado por esta historia. Era algo distinta a la que conoc&iacute;a, y por primera vez se dio cuenta de que lo que conoc&iacute;a no era del todo cierto, hab&iacute;a ido desfigur&aacute;ndose con el paso del tiempo. Y como sin atreverse a pregunt&aacute;rselo, le dijo:</P>
<P ALIGN="JUSTIFY">–<I> Entonces... ¿t&uacute; todav&iacute;a posees esa magia?</P>
<P ALIGN="JUSTIFY">– As&iacute; es</I> –fue la r&aacute;pida respuesta de la mujer, como si la hubiera estado esperando.</P>
<P ALIGN="JUSTIFY">– <I>Pero... </I>–continu&oacute; Eradil–<I> no me dir&aacute;s que... que vives desde entonces.</P>
<P ALIGN="JUSTIFY">– Bueno... </I>–carraspe&oacute; la anciana como pill&aacute;ndose sorprendida–<I> eso es otra historia. Ser&aacute; mejor que volvamos a lo que te ha tra&iacute;do aqu&iacute;.</P>
<P ALIGN="JUSTIFY">– Cla... ¡claro! </I>–dijo Eradil, olvid&aacute;ndose por completo de las &uacute;ltimas palabras de la mujer, al recordar algo que tan importante era para &eacute;l–.<I> Yo te creo </I>–le dijo–. <I>Aunque te parezca raro, te creo.</P>
</I><P ALIGN="JUSTIFY">–<I> Veo la verdad en tus palabras, muchacho. Pero antes de convertirte en un animal me gustar&iacute;a que me dijeras por qu&eacute; quieres hacerlo. No me gustar&iacute;a que fuera por un simple capricho.</P>
</I><P ALIGN="JUSTIFY">– <I>Creo que es justo para ti cont&aacute;rtelo, pero no lo ser&iacute;a para otra persona. Podr&iacute;an hacerle da&ntilde;o si la gente conociese su existencia.</P>
</I><P ALIGN="JUSTIFY">–<I> Piensa que yo te voy a ayudar y que vas a confiar en m&iacute;, y ten en cuenta que no cuento nada a nadie cuando me depositan su confianza. Y adem&aacute;s, conociendo el problema podr&iacute;a hacer algo m&aacute;s. Y sobre todo, debes tener presente que esto est&aacute; prohibido por nuestros Dioses... y nos podr&iacute;an castigar a ambos si se descubriese </I>–y aumentando la gravedad de su voz y a&ntilde;adi&eacute;ndole algo de autoridad–. <I>Debo saberlo por el peligro que representa para los dos.</P>
</I><P ALIGN="JUSTIFY">Eradil se sinti&oacute; indefenso ante los argumentos y la sinceridad de la anciana, y no tuvo m&aacute;s remedio que contarle todo lo que le hab&iacute;a pasado en el bosque. Ella no se asombr&oacute; de lo que le confes&oacute; Eradil porque conoc&iacute;a esa historia. Pero s&iacute; parec&iacute;a como si le afectase el haberla recordado, puesto que en varios momentos tuvo que bajar la cabeza para ocultar su dolor a los ojos del joven.</P>
<P ALIGN="JUSTIFY">Permaneci&oacute; en silencio contenido mientras el joven continuaba, y al acabar su relato le dijo:</P>
<P ALIGN="JUSTIFY">– <I>No te preocupes. Har&eacute; todo lo que pueda por ti, pero tienes que saber que mi poder es muy limitado. S&oacute;lo podr&aacute;s ser un animal, el que t&uacute; elijas, durante un d&iacute;a solamente; desde que salga el Sol, hasta que habi&eacute;ndose ocultado, nazca de nuevo por entre las monta&ntilde;as. Podr&aacute;s comunicarte con todos los dem&aacute;s seres, menos con el hombre, ya que si lo haces, los Dioses se dar&aacute;n cuenta y te dejar&aacute;n convertido en animal para siempre. Eso como menor castigo, pero lo m&aacute;s seguro es que te maldijesen a ti y a tu familia mientras dure este mundo; tal y como sucedi&oacute; una vez por haber quebrantado las leyes de su Naturaleza... y... ¿qui&eacute;n sabe lo que me har&iacute;an a m&iacute;?</P>
</I><P ALIGN="JUSTIFY">– <I>No cre&iacute;a que fuese tan peligroso</I> –le dijo Eradil angustiado–; <I>y adem&aacute;s t&uacute; tambi&eacute;n corres peligro. Es mejor tener mucho cuidado de no equivocarme,  pero ¿podr&iacute;as decirme por qu&eacute; estar&iacute;as dispuesta a arriesgarte por m&iacute;? </I>–le pregunt&oacute; condescendiente con la situaci&oacute;n.</P>
<P ALIGN="JUSTIFY">– <I>Quiz&aacute;s alg&uacute;n d&iacute;a... si todo sale bien. Olv&iacute;date ahora de eso y dime en qu&eacute; animal quieres que te convierta </I>–le dijo la anciana mientras se levantaba para echar un gordo tronco de madera a la triste hoguera que ten&iacute;a en la chimenea.</P>
<P ALIGN="JUSTIFY">– <I>Debe de ser uno fuerte </I>–le respondi&oacute; Eradil mientras la ve&iacute;a levantar con esfuerzo el pesado tronco, pero sin atreverse a ayudarla por poder herir su autoestima–.<I> Debe ser fuerte y que pueda enfrentarse a cualquier peligro natural que se le afronte, pero no demasiado grande, para no asustarla</I>–. Y se sonri&oacute; dulcemente a s&iacute; mismo, al decir estas palabras–. <I>Podr&iacute;a ser un zorro o quiz&aacute;s un ciervo, no, mejor un lobo. S&iacute;, un lobo. </P>
</I><P ALIGN="JUSTIFY">– <I>Est&aacute; bien</I> –le dijo la anciana mientras volv&iacute;a su asiento de poca trabajada madera–. <I>As&iacute; lo has querido. Ma&ntilde;ana cuando salga el Sol, tendr&aacute;s que estar sobre el Monte del Bosque. All&iacute; te convertir&aacute;s en un lobo negro, pero recuerda, recuerda que debes estar en ese mismo sitio cuando vuelva a aparecer el Sol. Es imprescindible que est&eacute;s en ese mismo lugar. Esto debe ser as&iacute; para poder concentrar mi fuerza en ti. Y sobre todo, no te olvides de que no puedes hablar con ning&uacute;n humano mortal.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Y con ella?</I> –pregunt&oacute; ansioso Eradil.</P>
<P ALIGN="JUSTIFY">– <I>Con ella s&iacute; </I>–le sonri&oacute; la anciana–. <I>Ella no es mortal, ni si quiera tiene cuerpo. S&oacute;lo es el esp&iacute;ritu que sobrevivi&oacute; a su castigo. As&iacute; su vida es eterna...</P>
<P ALIGN="JUSTIFY">– Y su sufrimiento </I>–interrumpi&oacute; Eradil a la anciana.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;... y su sufrimiento, pero como iba diciendo, con nadie m&aacute;s podr&aacute;s hablar. He dicho.</P>
</I><P ALIGN="JUSTIFY">Eradil se despidi&oacute; de la anciana que parec&iacute;a querer librarse de &eacute;l por no poder contener algo, y volvi&oacute; a su casa para preparar lo que iba a ser el d&iacute;a m&aacute;s importante de su vida, pregunt&aacute;ndose si la vieja podr&iacute;a conseguirlo. Y cuando se iba alejando de la choza de la bruja, le pareci&oacute; como si escuchase los lamentos de una mujer que lloraba. Y pens&oacute; que ser&iacute;a el sonido del viento entre los &aacute;rboles. Pero no era as&iacute;. Era la anciana mujer la que lloraba por sus recuerdos.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Se levant&oacute; de la cama y sali&oacute; por la ventana. </P>
<P ALIGN="JUSTIFY">Seriant todav&iacute;a estaba bastante alta en el cielo. Con mucho cuidado de no hacer ruido, sali&oacute; del pueblo todav&iacute;a dormido y se encamin&oacute; al bosque. Cuando lleg&oacute; al monte m&aacute;s alto, desde el que se pod&iacute;a ver el pueblo y estaba repleto de sauces, faltaban pocos segundos para que el Sol saliera de su espera, en su escalada por la Maldita, y comenzase a iluminar la vida de todos los seres que habitaban esa regi&oacute;n. Tras unos instantes, los primeros rayos comenzaron a ba&ntilde;ar el cuerpo de Eradil y, en un momento, sin que se diera cuenta salvo por la altura a la que comenz&oacute; a ver las cosas, se transform&oacute; en el animal que hab&iacute;a elegido. Solamente conservaba una parte de su cuerpo de humano: sus ojos. </P>
<P ALIGN="JUSTIFY">As&iacute;, al amanecer, apareci&oacute; un nuevo animal sobre el Monte del Bosque, como lo llamaban los habitantes del pueblo. Un lobo de pelaje negro, un lobo negro de ojos humanos.</P>
<P ALIGN="JUSTIFY">Al salir el Sol por completo, Eradil mir&oacute; hacia el suelo y pudo ver asombrado que ten&iacute;a patas en lugar de brazos, y garras en vez de manos. Aunque se asust&oacute; bastante, ya que le parec&iacute;a incre&iacute;ble que la vieja bruja pudiera hacer lo que prometi&oacute;, en el fondo algo le dec&iacute;a que se iba a cumplir.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Se acerc&oacute; la hora que tanto hab&iacute;a estado esperando durante todo el d&iacute;a.  </P>
<P ALIGN="JUSTIFY">Un lobo negro estaba escondido tras unos matorrales en los que varios d&iacute;as atr&aacute;s un joven llamado Eradil tambi&eacute;n se ocult&oacute;. Los animales volvieron como era costumbre, a la cueva donde olvidaban sus instintos y compart&iacute;an la pena y la tristeza de Serind&euml;l, comprensivos y &uacute;nica compa&ntilde;&iacute;a de esa solitaria existencia. El lobo estaba impaciente, esperando. Y tras percibir una breve brisa, la misma que le llen&oacute; de ilusiones la otra vez, la vio. </P>
<P ALIGN="JUSTIFY">Nunca en ning&uacute;n momento de la historia de ese mundo, desde su creaci&oacute;n hasta su destrucci&oacute;n por los Dioses, un ser fue tan bello como la mujer que ten&iacute;a ante sus ojos. Nada pod&iacute;a compar&aacute;rsele; ni siquiera la raza m&aacute;s bella que un tiempo habit&oacute; otro mundo creado por otros Dioses, los Elfos, tuvieron entre sus semejantes la perfecci&oacute;n de la belleza convertida en un ser, en Serind&euml;l. Pero no era belleza f&iacute;sica. No era una atracci&oacute;n del cuerpo, de la carne, sino algo mucho m&aacute;s maravilloso. Era una belleza espiritual. Algo intangible pero con una evidencia de existencia imposibles de rebatir. </P>
<P ALIGN="JUSTIFY">Era la belleza de un alma.</P>
<P ALIGN="JUSTIFY">Caminaba lentamente esperando a que todos los animales estuviesen dentro. </P>
<P ALIGN="JUSTIFY">De vez en cuando se deten&iacute;a para escuchar a alg&uacute;n que otro animal que le contaba cosas, y luego ella les hablaba sin necesidad de lenguajes, s&oacute;lo con amor.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de una gran espera provocada por la indecisi&oacute;n, Eradil volvi&oacute; a armarse de valor, e intentando mantener fuera de sus pensamientos el hechizo que la belleza de Serind&euml;l hab&iacute;a provocado sobre &eacute;l, entr&oacute; muy despacio en la cueva, tan sigilosamente como el lobo que era. Otra vez Serind&euml;l estaba contando una historia, esta vez diferente a la suya propia, a todos los animales que all&iacute; se reunieron. Era una historia sobre la amistad de dos j&oacute;venes que tuvieron que luchar contra las bestias, en la cual uno de ellos desapareci&oacute;, y el otro, haciendo prevalecer la amistad ante la raz&oacute;n, fue a buscarlo sabiendo cu&aacute;l era su destino si lo hac&iacute;a. As&iacute; desaparecieron dos seres inocentes cuya &uacute;nica culpa fue la de tener una amistad que ni siquiera pod&iacute;an romper Ellos. Excepto con la muerte.</P>
<P ALIGN="JUSTIFY">Tras acabar su historia, todos los animales permanecieron en silencio. Y no se hab&iacute;an dado cuenta de que entre ellos se encontraba un nuevo compa&ntilde;ero. Un lobo negro. </P>
<P ALIGN="JUSTIFY">Serind&euml;l levant&oacute; la mirada desde un peque&ntilde;o ruise&ntilde;or que estaba posado cerca de ella, hasta los animales que estaban al fondo de la cueva, y se dio cuenta de la presencia del nuevo animal que eludi&oacute; su mirada. Tras verle sus extra&ntilde;os ojos para ser de un lobo, profiri&oacute; un grito de asombro, y a la vez de espanto. Entonces, como si el hechizo que los manten&iacute;a unidos se rompiera, todos los animales empezaron a huir despavoridos y la dejaron sola. Todos menos un lobo. </P>
<P ALIGN="JUSTIFY">Serind&euml;l no pod&iacute;a creer lo que sus ojos ve&iacute;an y su pensamiento interpretaba, y dijo con temor:</P>
<P ALIGN="JUSTIFY">– <I>¡Eres t&uacute;!</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;, soy yo </I>–respondi&oacute; Eradil asustado a su vez–. <I>Perd&oacute;name por asustarte.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Pero c&oacute;mo es posible que seas un lobo?, ¡yo te vi como un humano! </I>–le dijo Serind&euml;l sin poder contener su asombro.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, es verdad, yo soy un humano... pero una anciana me concedi&oacute; mi deseo de convertirme en animal... para...  para poder verte.</P>
</I><P ALIGN="JUSTIFY">La joven se qued&oacute; sin habla por la respuesta del lobo. Sin poder apartar su mirada de los extra&ntilde;os ojos del animal.</P>
<P ALIGN="JUSTIFY">Entonces, el joven le cont&oacute; a Serind&euml;l su historia con la bruja, y c&oacute;mo le hab&iacute;a invadido el deseo de conocer a un ser tan distinto, tan m&aacute;gico y… – <I>tan hermoso </I>–se ruboriz&oacute; al confesarlo. </P>
<P ALIGN="JUSTIFY">Tras una breve conversaci&oacute;n, Serind&euml;l se calm&oacute; y comenz&oacute; a hablar con Eradil como hac&iacute;a much&iacute;simos a&ntilde;os que no pod&iacute;a, con un ser humano. Venci&oacute; sus recelos para con aquel ser, y dej&oacute; que sus olvidados sentimientos la guiasen.</P>
<P ALIGN="JUSTIFY">Estuvieron muchas horas conversando y no parec&iacute;a que pasaba el tiempo para ellos. Fue como si el resto del mundo se hubiera detenido. Y en verdad as&iacute; fue, porque lo que para ellos fueron varias horas, para el resto del mundo fueron segundos; aunque para nosotros, este hecho ya casi no lo podemos ni concebir. Nosotros que vivimos en un mundo dominado por el tiempo, en el que no nos detenemos a pensar en lo que somos, sino que simplemente nos dejamos llevar y no disfrutamos de las cosas que realmente le dan el sentido a la existencia. Entonces se sol&iacute;a disfrutar de cosas que ya no significan lo que anta&ntilde;o; el concepto que tenemos del tiempo dejaba de tener sentido cuando se disfrutaban de esas cosas, sintiendo que exist&iacute;amos. Para ellos ten&iacute;a su l&oacute;gica explicaci&oacute;n: tal vez fue porque ambos estaban muy faltos de ese sentimiento, o porque se dieron cuenta de que se necesitaban mutuamente, pero fuera lo que fuese, algo nuevo que nunca hab&iacute;an sentido tan claramente, estaba naciendo entre ellos. Algo que suele pasar muy pocas veces cuando se encuentran por primera vez dos personas. Algunos lo recuerdan con una palabra sin sentido hoy, pero llena de significado entonces, algunos todav&iacute;a lo llaman amor.</P>
<P ALIGN="JUSTIFY">A pesar del hecho de que su tiempo no significaba mucho para el exterior, el amanecer se acercaba y los dos j&oacute;venes tuvieron que despedirse, haci&eacute;ndose incontables promesas acerca de volver a encontrarse, y de no abandonarse nunca. De disfrutar simplemente con su mutua compa&ntilde;&iacute;a.</P>
<P ALIGN="JUSTIFY">Eradil sali&oacute; corriendo de la cueva con la alegr&iacute;a de vivir por todo lo que hab&iacute;a pasado. Corr&iacute;a en direcci&oacute;n del Monte del Bosque, mientras miraba hacia Seriant sin saber porqu&eacute;. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Mientras tanto, Ardil, preocupado por la marcha de su hijo, el cual acostumbraba a despedirse de su padre antes de salir de su casa, estaba en el bosque junto a varios amigos. Buscaban al muchacho que deber&iacute;a de haber vuelto antes del anochecer del d&iacute;a anterior. Todos estaban agotados por la larga noche que hab&iacute;an permanecido en vela caminando por el bosque. </P>
<P ALIGN="JUSTIFY">Uno de los amigos de Ardil escuch&oacute; el ruido de un animal que se iba acercando hacia &eacute;l r&aacute;pidamente. De repente, vio una forma oscura.</P>
<P ALIGN="JUSTIFY">– <I>¡Cuidado!</I> –grit&oacute;, y levantando su arma en direcci&oacute;n al animal, dispar&oacute; en cuanto lo vio.</P>
<P ALIGN="JUSTIFY">EL animal cay&oacute; al suelo rodando sobre s&iacute; mismo sin saber lo que le hab&iacute;a pasado. S&oacute;lo sinti&oacute; un intenso calor en el pecho que le hizo olvidar todos sus pensamientos en los que estaba inmerso, y por los que no se dio cuenta de la presencia de los humanos. </P>
<P ALIGN="JUSTIFY">Cuando todos los hombres se acercaron al cuerpo que estaba echado boca abajo junto al tronco de un gran roble, el animal se estremec&iacute;a de dolor, con los ojos cerrados, y al escuchar voces humanas a su alrededor, los abri&oacute;. </P>
<P ALIGN="JUSTIFY">– <I>¡Dios m&iacute;o!</I>  –grit&oacute; el hombre.</P>
<P ALIGN="JUSTIFY">Era Ardil, que aunque ve&iacute;a un animal herido en el suelo, un lobo negro, sab&iacute;a que los ojos de ese animal no pod&iacute;an ser de ese lobo. Algo le dec&iacute;a que ese animal no era lo que su apariencia revelaba.</P>
<P ALIGN="JUSTIFY">– <I>"¡¿Eradil?!" </I>–grit&oacute; su mente–. <I>¡Es mi hijo! </I>–grit&oacute; desesperado.</P>
<P ALIGN="JUSTIFY">Sus palabras se adelantaron a su consciente, ya que aunque le parec&iacute;a imposible que fuese Eradil, sab&iacute;a que era su hijo. No s&eacute; c&oacute;mo fue, pero &eacute;l lo supo.</P>
<P ALIGN="JUSTIFY">Inmediatamente, se acord&oacute; de la pregunta tan irrelevante, que apenas le dio importancia en su momento, pero que ahora le resonaba en la cabeza con un acoso insoportable </P>
<P ALIGN="JUSTIFY">–<I> Es imposible que esa bruja lo haya convertido en un lobo, ¡es imposible! </I>–se repet&iacute;a una y otra vez.</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute; dices? ¿C&oacute;mo va a ser tu hijo? </I>–preguntaron algunos de sus amigos.</P>
<P ALIGN="JUSTIFY">– <I>¿No lo veis? </I>–les pregunt&oacute; casi fuera de s&iacute;–.<I> Mirad sus ojos.</P>
</I><P ALIGN="JUSTIFY">Varios de ellos se quedaron sin aliento del asombro, pero otros no le daban importancia, creyendo que la desesperaci&oacute;n por la desaparici&oacute;n de su hijo y el cansancio, le hac&iacute;an ver alucinaciones, intentando hacerle ver que era un simple lobo.</P>
<P ALIGN="JUSTIFY">Pero nada pod&iacute;a influir ya en su conclusi&oacute;n, sab&iacute;a que era &eacute;l. </P>
<P ALIGN="JUSTIFY">Se acerc&oacute; al cuerpo casi sin vida de su hijo y lo cogi&oacute; entre sus brazos. Eradil not&oacute; c&oacute;mo unos brazos lo levantaban y con un gran esfuerzo mir&oacute; al rostro del hombre que lo sosten&iacute;a. Al reconocer a su padre, nada pudo hacer para hablarle, ya que adem&aacute;s de su falta de vida, no pod&iacute;a hablar, porque se acord&oacute; de lo que le dijeron, porque condenar&iacute;a a la anciana que lo hab&iacute;a ayudado. </P>
<P ALIGN="JUSTIFY">Ardil despidi&oacute; a todos sus amigos y se fue con el cuerpo de su hijo entre sus brazos, en busca de la caba&ntilde;a donde viv&iacute;a la bruja. Y aunque ninguno de ellos lo quer&iacute;a dejar, lo encontraron tan inamovible en sus ideas, que no tuvieron m&aacute;s remedio que volver a sus casas y rogar por &eacute;l, deseando que apareciera su hijo y que no se hubiera vuelto loco. ¿Pero a qui&eacute;n le pod&iacute;an rogar? ¿A los Dioses?</P>
<P ALIGN="JUSTIFY">Mientras caminaba sosteniendo a su hijo, pensaba en todo lo que hab&iacute;a pasado. Desde hac&iacute;a mucho tiempo, la magia hab&iacute;a dejado de tenerse en cuenta para las personas normales. Y lo que antes eran hechos sin importancia, ahora parec&iacute;an milagros o maldiciones, seg&uacute;n la persona que los juzgase. Ardil conoc&iacute;a la historia de su pasado, pero no pod&iacute;a asimilar lo que le suced&iacute;a a su hijo. No pod&iacute;a darle ninguna explicaci&oacute;n l&oacute;gica al tener condicionada su mente desde su nacimiento, a que esas cosas eran supersticiones y enga&ntilde;os. Nunca hubiera imaginado que esa vieja, que era el hazmerre&iacute;r del pueblo, tuviera la raz&oacute;n de su parte. Pero lo que m&aacute;s le atormentaba, era el hecho de que su hijo estaba herido y de gravedad; y a&uacute;n mayor era ese dolor al saber que si le hubiera prestado atenci&oacute;n a las palabras de su hijo cuando &eacute;ste le cont&oacute; el suceso de la vieja, todo esto no habr&iacute;a pasado. Se sent&iacute;a culpable, como cuando cualquiera que est&eacute; sumido en una desgracia y se da cuenta de que exist&iacute;a la m&aacute;s m&iacute;nima posibilidad de que una acci&oacute;n suya en el pasado podr&iacute;a haberlo evitado, se echa a s&iacute; mismo la culpa de todo lo que pasa, aunque no tuviera ning&uacute;n sentido para una persona ajena al problema.</P>
<P ALIGN="JUSTIFY">Tras media hora de esforzado camino, mientras sent&iacute;a c&oacute;mo la vida de su hijo se escapaba, lleg&oacute; a la choza de la vieja.</P>
<P ALIGN="JUSTIFY">– <I>"¡Ella es la culpable!"</I> –se dec&iacute;a a s&iacute; mismo.</P>
<P ALIGN="JUSTIFY">De una patada abri&oacute; la puerta y entr&oacute; como un hurac&aacute;n hacia su interior, mas no la encontr&oacute; dentro. Y desesperado al no saber qu&eacute; mas hacer, tendi&oacute; el cuerpo del lobo sobre una gran mesa llena de recipientes y libros, que despej&oacute; de un manotazo descomunal. Se sent&oacute; en una tosca silla de madera junto a su hijo y le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Hijo m&iacute;o. Lo siento. Perd&oacute;name por no haberte escuchado, ¡perd&oacute;name! </I>–dijo entre sollozos.</P>
<P ALIGN="JUSTIFY">Y los ojos de Eradil se encontraron con los de su padre, que estaban saturados de l&aacute;grimas, pero aunque le dol&iacute;a el coraz&oacute;n por no hacerlo, no dijo nada, aun sabiendo que iba a morir y que no tendr&iacute;a nunca m&aacute;s la oportunidad de volver a hablar con su padre.</P>
<P ALIGN="JUSTIFY">–<I> No quiero que mueras </I>–dijo Ardil llorando–. <I>No puedes morir. Si te vas, vivir&eacute; el resto de mi vida con tu p&eacute;rdida en mi conciencia. ¡No puedes morir!</P>
</I><P ALIGN="JUSTIFY">Y repitiendo estas palabras hundi&oacute; su cabeza entre sus brazos sin poder dejar de llorar amargamente, mientras el lobo dejaba escapar la vida, sin fuerzas para hacer otra cosa, sin poder tener nada en su pensamiento que no fuera Serind&euml;l.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Bastante tiempo despu&eacute;s, apareci&oacute; la anciana por la puerta con un gran cesto lleno de hierbas y plantas. Al escucharla entrar, Ardil levant&oacute; la cabeza de entre sus brazos, y con los ojos todav&iacute;a h&uacute;medos, al reconocer a la vieja, corri&oacute; hacia ella y la sujet&oacute; firmemente por los hombros. Y sacudi&eacute;ndola bruscamente le gritaba:</P>
<P ALIGN="JUSTIFY">– <I>¡Maldita seas! ¿Qu&eacute; le has hecho a mi hijo? ¿D&oacute;nde te hab&iacute;as metido? ¡Ahora tienes que ayudarlo! ¿te enteras? </I>–y cediendo la fuerza en sus manos, cay&oacute; de rodillas ante la anciana que estaba muy asustada por la reacci&oacute;n del hombre. Y Ardil concluy&oacute; con dolor y s&uacute;plica en sus palabras:</P>
<P ALIGN="JUSTIFY">– <I>S&aacute;lvalo... ¡s&aacute;lvalo, por favor!</P>
</I><P ALIGN="JUSTIFY">La vieja sujet&oacute; entre sus manos la cabeza del hombre que estaba arrodillado ante ella, rog&aacute;ndole por la vida de su hijo, y compasivamente le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Tu hijo sab&iacute;a a lo que se expon&iacute;a, pero no le salieron las cosas como &eacute;l pensaba. Ahora ya es demasiado tarde para evitar el destino. Demasiado tarde hasta para m&iacute;</I> –y apartando la mirada de Ardil, agachando la cabeza, continu&oacute;–<I> Estoy segura de que pronto me llegar&aacute; el castigo a m&iacute; tambi&eacute;n.</P>
</I><P ALIGN="JUSTIFY">– <I>¿De qu&eacute; est&aacute;s hablando?</I> –dijo Ardil– <I>¿de qu&eacute; castigo hablas?</I> –a&ntilde;adi&oacute; sin saber por qu&eacute; estaba pasando todo esto. Deseando que estuviera viva su mujer, que volvieran los tiempos en que fueron felices.</P>
<P ALIGN="JUSTIFY">– <I>Por romper tu hijo la condici&oacute;n que ten&iacute;a que cumplir </I>–le dijo la vieja–, <I>los Dioses ya sabr&aacute;n todo lo que ha pasado, y no tardar&aacute;n en hac&eacute;rnoslo pagar a nosotros tambi&eacute;n.</P>
</I><P ALIGN="JUSTIFY">– <I>¡¿Qu&eacute; est&aacute;s diciendo?! </I>–le grit&oacute; el hombre. </P>
<P ALIGN="JUSTIFY">–<I> Al romper Eradil la condici&oacute;n, al hablar con un humano, se descubri&oacute; todo. Pero no importa, ya no importa nada.</P>
</I><P ALIGN="JUSTIFY">–<I> ¡Pero si mi hijo no ha hablado con nadie!. Yo lo encontr&eacute; cuando uno de mis amigos dispar&oacute; contra &eacute;l. Le dispar&oacute; cuando le vio acercarse. Y no ha dicho ni una sola palabra. </P>
</I><P ALIGN="JUSTIFY">Y la vieja con incredulidad, mir&oacute; a Ardil, pero no pod&iacute;a hacer otra cosa que creerle ya que en su estado era imposible que se atreviese a mentir sobre su hijo. </P>
<P ALIGN="JUSTIFY">– <I>Entonces, ¿c&oacute;mo sab&iacute;as que fui yo quien le hizo esto? </I>–le pregunt&oacute; como &uacute;ltima defensa para no aceptar lo que el hombre le estaba diciendo.</P>
<P ALIGN="JUSTIFY">– <I>¡&Eacute;l me dijo que t&uacute; amenazaste al due&ntilde;o de una de las posadas del pueblo, con convertirlo en un animal </I>–y volviendo a caer en el dolor–<I> Tuve que hacerle caso... yo tengo la culpa.</I> </P>
<P ALIGN="JUSTIFY">Y al darse cuenta de su error, de hasta d&oacute;nde hab&iacute;a llegado la lealtad de Eradil con su promesa, se sinti&oacute; aliviada y a la vez apenada, porque de todos modos, por su culpa pensaba ella, iba a morir el muchacho que comenz&oacute; a respetar de otra manera a partir de ese momento. Y con mucha tristeza dijo:</P>
<P ALIGN="JUSTIFY">– <I>Tanta fuerza que tuvo mi magia y que ya no pueda servir para salvar la vida de alguien que s&oacute;lo intent&oacute; realizar su sue&ntilde;o. Lo &uacute;nico que puedo hacer por &eacute;l es aliviar su dolor.</P>
</I><P ALIGN="JUSTIFY">Se acerc&oacute; al cuerpo que yac&iacute;a sobre la mesa y puso las manos sobre su pecho. De repente, todo el cuerpo del animal se relaj&oacute; y daba la impresi&oacute;n de que hubiera dejado de sufrir. Y aunque permanec&iacute;a con vida, lo poco que le quedaba podr&iacute;a sentirla sin el dolor de la muerte. </P>
<P ALIGN="JUSTIFY">Pasaron varios minutos y el final se acercaba. Pronto el coraz&oacute;n agotado por el intento de vivir, quedar&iacute;a sin fuerzas para seguir manteni&eacute;ndolo unido a este mundo. Y al cabo de unos segundos, con un estremecimiento acompa&ntilde;ado de un grito desgarrado de un hombre, un coraz&oacute;n dej&oacute; de latir.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">La anciana tambi&eacute;n llor&oacute;. Y Ardil cogi&oacute; entre sus brazos el cuerpo del lobo que hac&iacute;a unos segundos hab&iacute;a dejado de vivir.</P>
<P ALIGN="JUSTIFY">Entonces, de repente, sinti&oacute; como una suave brisa que entraba por la puerta abierta y, a pesar de su dolor, se sinti&oacute; m&aacute;s reconfortado. Al igual que la persona que sufre y ve c&oacute;mo un amigo se desvive por animarlo y ayudarle. </P>
<P ALIGN="JUSTIFY">Y tras esa brisa lleg&oacute; una voz con la que la anciana al o&iacute;rla se llev&oacute; las manos al rostro por el asombro. Y dijo Serind&euml;l:</P>
<P ALIGN="JUSTIFY">– <I>Todav&iacute;a no es demasiado tarde. No dejar&eacute; que consigan lo que quieren. ¡Esta vez no!</I>  –grit&oacute;, y como dirigi&eacute;ndose a la anciana continu&oacute;–<I> Voy a utilizar toda mi fuerza en esto, y aunque s&eacute; que mi alma va a morir, prefiero hacerlo antes de que &eacute;l deje de existir para siempre. Ellos mismos tendr&aacute;n que cumplir sus normas. ¡Tendr&aacute;n que hacerlo a la fuerza!</P>
<P ALIGN="JUSTIFY">– ¿Qu&eacute; piensas hacer? </I>–pregunt&oacute; la apenada anciana.</P>
<P ALIGN="JUSTIFY">–<I> Voy a cederle mi inmortalidad.</I> </P>
<P ALIGN="JUSTIFY">–<I> ¡No puedes hacerlo!</I> –le grit&oacute; horrorizada, la bruja.<I> ¡Ser&aacute; peor que ahora! ¡Deja las cosas como est&aacute;n y vive tu propia vida!</P>
</I><P ALIGN="JUSTIFY">– <I>¿Qu&eacute; vida? </I>–le grit&oacute; con odio, la voz de Serind&euml;l– <I>¡Y s&iacute; puedo hacerlo! Te equivocas de nuevo, te equivocas como lo hizo mi madre, Sild&euml;n de Eslariot– y dijo este nombre con tanto odio que la anciana se ech&oacute; a llorar sobre sus propias manos, mientras Ardil se manten&iacute;a como en un sue&ntilde;o, ensimismado sosteniendo la cabeza de su hijo muerto. Como en un mundo muy distante al que se encontraba.</P>
</I><P ALIGN="JUSTIFY">– <I>De esta forma </I>–continu&oacute; hablando agriamente Serind&euml;l–, <I>entrar&aacute;n sus normas en un conflicto. No puede existir un ser inmortal y que a la vez la vida le haya abandonado. Tendr&aacute;n que hacerlo volver. ¡Estar&aacute;n obligados!</I> –grit&oacute; perdi&eacute;ndose sus palabras en el aire.</P>
<P ALIGN="JUSTIFY">Y la vieja a&ntilde;adi&oacute;, saliendo de su estado:</P>
<P ALIGN="JUSTIFY">– <I>Pero entonces t&uacute; morir&aacute;s por esas mismas normas. Al estar viviendo desde hace muchas generaciones, ¡dejar&aacute;s de existir!</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;, lo s&eacute;</I> –contest&oacute; apenada la joven–. <I>Pero espero poder tener las energ&iacute;as suficientes para no morir en algo que desaparecer&aacute;, sino convertirme en un ser que permanecer&aacute; como un s&iacute;mbolo de que alguien se opuso a ellos. Para que se acuerden. ¡Y ahora dejadnos solos!</P>
</I><P ALIGN="JUSTIFY">Tras estas palabras, la anciana se llev&oacute; al aturdido Ardil, que no quer&iacute;a soltar el cuerpo de su hijo. </P>
<P ALIGN="JUSTIFY">Salieron de la habitaci&oacute;n, de la casa, y dejaron solos a los dos j&oacute;venes.</P>
<P ALIGN="JUSTIFY">– <I>No podr&iacute;a ser de otra forma</I> –dijo Serind&euml;l–. <I>No pod&iacute;an dejarnos vivir en paz y felices. Pero no podr&aacute;n conmigo esta vez. Y espero, amor m&iacute;o, que nunca te olvides de m&iacute;, que siempre lleves mi recuerdo en ti </I>–dijo quebr&aacute;ndosele la voz–.<I> As&iacute; podr&eacute; seguir existiendo en tu coraz&oacute;n.  Adi&oacute;s, mi vida.</P>
</I><P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">La puerta de la choza se abri&oacute; y sintieron la misma brisa. Pero que esta vez parec&iacute;a un lamento y un adi&oacute;s. Ardil y la anciana entraron y vieron con asombro que sobre la mesa ya no estaba el cuerpo de un lobo, sino el de un joven, ¡un joven que estaba vivo!</P>
<P ALIGN="JUSTIFY">– <I>¡Eradil! </I>–grit&oacute; Ardil– <I>¡Hijo m&iacute;o, est&aacute;s vivo!</P>
</I><P ALIGN="JUSTIFY">Y corri&oacute; hacia su hijo abraz&aacute;ndolo como nunca antes hab&iacute;a hecho. Nunca sinti&oacute; como en ese momento, hasta qu&eacute; punto lleg&oacute; a querer a su hijo. Pero Eradil no mostraba alegr&iacute;a en su rostro. Su padre no cab&iacute;a en s&iacute; de felicidad y no se pod&iacute;a dar cuenta del estado de su hijo que hab&iacute;a vuelto a la vida. La anciana se acerc&oacute; al joven y le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Lo sabes, ¿verdad?</P>
<P ALIGN="JUSTIFY">– S&iacute; </I>–respondi&oacute;– <I>Lo hizo ella. Me lo ha dicho. Ahora est&aacute; muerta...  no debi&oacute; hacerlo. Yo no lo merec&iacute;a.</P>
</I><P ALIGN="JUSTIFY">–<I> Lo hizo porque te lleg&oacute; a querer en tan poco tiempo. Y no te eches la culpa. Tambi&eacute;n lo hizo por ella misma. Lo lleg&oacute; a necesitar </I>–acab&oacute;, nubl&aacute;ndosele la vista como si se reflejasen en sus ojos pensamientos del pasado.</P>
<P ALIGN="JUSTIFY">–<I> ¡Eradil! ¿qu&eacute; ha pasado? </I>–pregunt&oacute; su padre sin contener su alegr&iacute;a.</P>
<P ALIGN="JUSTIFY">– <I>Tu hijo ha vuelto a la vida. Y debes dejar las cosas as&iacute; </I>–le dijo severamente la anciana.– <I>Volved a vuestras vidas y olvidaros de todo esto.</P>
</I><P ALIGN="JUSTIFY">Y dicho esto, pareci&oacute; como si Ardil olvidase todo y se despertara de un sue&ntilde;o. Y al darse cuenta de d&oacute;nde estaba, agarr&oacute; a su hijo enfadado y se lo llev&oacute; al pueblo, pero no sin antes o&iacute;r Eradil que la anciana le dec&iacute;a:</P>
<P ALIGN="JUSTIFY">– <I>Si miras ah&iacute; fuera, podr&aacute;s ver en un monte, un &aacute;rbol que acaba de nacer en su cima.</P>
</I><P ALIGN="JUSTIFY">Eradil, acompa&ntilde;ado de su padre que lo ayudaba a sostenerse, sali&oacute; fuera y all&iacute; lo vio. Sobre el monte se ve&iacute;a un peque&ntilde;o &aacute;rbol que desprend&iacute;a una suave luz blanca, que ba&ntilde;ado por el Sol acentuaba a&uacute;n m&aacute;s su belleza. </P>
<P ALIGN="JUSTIFY">All&iacute; sobre el Monte del Bosque se ergu&iacute;a un &aacute;rbol blanco que pronto crecer&iacute;a y se har&iacute;a fuerte, y desafiante y bello a la vez. All&iacute; sobre ese monte, intentar&iacute;a descansar Serind&euml;l para siempre.»</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







