<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 6. Recuerdos.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Varios d&iacute;as fueron pasando lentamente.</P>
<P ALIGN="JUSTIFY">Durante todo ese tiempo, todas las noches durante la cena y despu&eacute;s de &eacute;sta, Aradriel les contaba un relato tras otro, teniendo que responder pacientemente a todas y cada una de las preguntas que Lorien y Orein le hac&iacute;an. </P>
<P ALIGN="JUSTIFY">Aradriel comenz&oacute; a disfrutar y a apreciar esos ratos en que compart&iacute;a su conocimiento de la historia del pasado, con las dos personas que poco a poco fueron convirti&eacute;ndose en sus amigos. </P>
<P ALIGN="JUSTIFY">Al principio, se enfadaba un poco por la ignorancia que demostraban Orein y su hija, pero poco a poco fue aceptando este hecho. Comprendi&oacute; la situaci&oacute;n en que se encontraban, y trat&oacute; de ayudarles para que salieran de ese hermetismo que hab&iacute;an heredado de su entorno. </P>
<P ALIGN="JUSTIFY">Para Lorien era un aut&eacute;ntico placer escuchar historias de cosas lejanas y que pocos d&iacute;as antes consideraba como oscuras y tab&uacute;es. Pero comenz&oacute; a pensar en esas cosas que sucedieron, y en lo cegada que hab&iacute;a estado antes. </P>
<P ALIGN="JUSTIFY">Pero para Orein era distinto. A &eacute;l le costaba mucho m&aacute;s aceptar esas cosas. Durante toda su vida vivi&oacute; con sus creencias, y ahora un desconocido hab&iacute;a venido para pon&eacute;rselas en duda. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Era el atardecer. El Sol se estaba poniendo, cuando Lorien fue a buscar Aradriel. </P>
<P ALIGN="JUSTIFY">Hac&iacute;a poco tiempo que lo conoc&iacute;a, pero le encantaba estar con &eacute;l. Incluso utilizaba cualquier excusa para encontrarlo. </P>
<P ALIGN="JUSTIFY">Aradriel estaba en la parte posterior de la casa. Intentaba, sin &eacute;xito, arreglar a martillazos una inmensa viga de metal, que se resist&iacute;a a que la enderezasen, a pesar de ser extremadamente delgada.</P>
<P ALIGN="JUSTIFY">Lorien sali&oacute; afuera. Buscaba unos troncos de madera para la chimenea, y al o&iacute;r los retintineos del entrechocar de los metales, decidi&oacute; buscarlos tras la casa, a pesar de que sab&iacute;a que all&iacute; no la encontrar&iacute;a.</P>
<P ALIGN="JUSTIFY">Aradriel no pudo verla ni o&iacute;rla, pero cuando desisti&oacute; en su empe&ntilde;o de arreglar la curva del metal, sinti&oacute; que alguien estaba tras &eacute;l. Se gir&oacute;, no esperando encontrar nada, y la vio. Estaba sentada sobre uno de los arcones exteriores de la casa, en donde se guardaban las herramientas de metal. Y ante la extra&ntilde;a mirada que Aradriel le ofreci&oacute;, dijo ella, para evitar cualquier pregunta:</P>
<P ALIGN="JUSTIFY">– <I>¿No consigues arreglarla?</I> –y le sonri&oacute; como para dar a entender que quer&iacute;a re&iacute;rse un poco de &eacute;l, al ribetear sus palabras con un retintineo de burla.</P>
<P ALIGN="JUSTIFY">– <I>¿Lo har&iacute;a su excelencia mejor?</I> –le respondi&oacute; Aradriel, a&uacute;n m&aacute;s ir&oacute;nicamente.</P>
<P ALIGN="JUSTIFY">– <I>No. No quiero mancharme... ni dejarte en rid&iacute;culo ante una dama.</P>
</I><P ALIGN="JUSTIFY">– <I>¡Ja, ja, ja!</I> –se ri&oacute; estrepitosamente, Aradriel, al o&iacute;r sus palabras.</P>
<P ALIGN="JUSTIFY">Pero estas risas surtieron mal efecto, y Lorien se enfad&oacute;.</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; te r&iacute;es?</I> –le dijo muy enojada, a la vez que se levantaba de s&uacute;bito, del arc&oacute;n de madera en el que estaba sentada–. <I>Tu... ¡tu no eres capaz ni siquiera de enderezar un laminilla de metal! </P>
</I><P ALIGN="JUSTIFY">– <I>¿Quiere probar, su majestad? </I>–le pregunt&oacute; burlonamente, Aradriel, ofreci&eacute;ndole a la vez el martillo, en una extravagante reverencia.</P>
<P ALIGN="JUSTIFY">Lorien se enfad&oacute; de verdad. Y sin pensarlo, a grandes zancadas, lleg&oacute; a la altura del joven, cogi&oacute; el martillo, y se puso como una loca a darle mamporrazos al metal.</P>
<P ALIGN="JUSTIFY">Aradriel, que se lo estaba pasando bastante bien, dio la vuelta sobre la joven, y se puso frente a ella. Cruz&oacute; los brazos en actitud superior, y la mir&oacute; con una descarada sonrisa de disfrute, mientras la pobrecita muchacha golpeaba sin ning&uacute;n acierto, al lugar en que el metal se curvaba.</P>
<P ALIGN="JUSTIFY">– <I>"Ponte recta, ¡ponte recta, maldita viga!"</I> –gritaba Lorien, para s&iacute; misma. </P>
<P ALIGN="JUSTIFY">–<I> No parece que se enderece</I> –le dijo Aradriel muy seriamente, aunque sin poder contener la risa, risa que se le atragant&oacute; al ver el rostro enfurecido que Lorien le dedic&oacute;, al levantar la cabeza y mirarlo durante un segundo, para seguir con sus martillazos.</P>
<P ALIGN="JUSTIFY">–<I> ¡Maldita sea!</I> –grit&oacute; Lorien tras un minuto. Y tirando el martillo contra el suelo dijo–.<I> Este martillo est&aacute; mal. El peso est&aacute; descompensado y no se puede golpear bien</I> –Y mir&oacute; a Aradriel amenazadoramente, invit&aacute;ndolo a que osase a contradecirla.</P>
<P ALIGN="JUSTIFY">Aradriel no dijo nada. El car&aacute;cter de la mujercita era formidable, y s&oacute;lo atin&oacute; a decir:</P>
<P ALIGN="JUSTIFY">– <I>Bueno,... yo no digo nada. Esto..., ¿est&aacute; la comida preparada?</P>
</I><P ALIGN="JUSTIFY">– <I>No. Mi padre a&uacute;n no ha acabado de hacerla</I> –le dijo Lorien–. <I>Todav&iacute;a es muy temprano. </P>
</I><P ALIGN="JUSTIFY">Aradriel no tuvo m&aacute;s remedio que sonre&iacute;rle. Era una joven encantadora, y para sorpresa de &eacute;ste, ella tambi&eacute;n relaj&oacute; su rostro.</P>
<P ALIGN="JUSTIFY">El Sol continuaba su descenso, y faltaban pocos minutos para que se ocultase completamente tras el horizonte. Lorien se encontraba delante de Aradriel, con los rayos del Sol a su espalda, rayos que hab&iacute;an perdido la fuerza de la incandescencia. S&oacute;lo su luz inundaba el mundo. Y los &uacute;ltimos haces, perfilaban dorados destellos. </P>
<P ALIGN="JUSTIFY">Aradriel se sobrecogi&oacute;. Frente a &eacute;l, estaba ella con su pelo profundamente negro, e inundado por la luz. Mientras tanto, Lorien se perd&iacute;a en el reflejo de los ojos de su nuevo amigo. La luz hac&iacute;a m&aacute;s patente a&uacute;n el color de sus ojos, haciendo desaparecer del entendimiento todo lo que no fueran ellos. No pod&iacute;a dejar de mirarlos, de observar a ese muchacho. Pero Aradriel no la ve&iacute;a a ella. Se perdi&oacute; en su pensamiento. Durante un instante, vio a Lorien, pero despu&eacute;s, el contorno y el perfil de la muchacha desapareci&oacute;, para tornarse todo en una luz dorada, en algo sin forma ni existencia.</P>
<P ALIGN="JUSTIFY">– <I>"¿Ser&iacute;a as&iacute;, Ella?"</I> –se oy&oacute; preguntar a s&iacute; mismo.</P>
<P ALIGN="JUSTIFY">Todo esto dur&oacute; apenas unos segundos. Y Lorien se sonroj&oacute; porque cre&iacute;a que se hab&iacute;a puesto en evidencia, al mirar al muchacho de esa forma. As&iacute; que para intentar arreglarlo, aunque su coraz&oacute;n se impuso a la raz&oacute;n, le dijo a Aradriel, que sali&oacute; de su ensimismamiento al o&iacute;r sus palabras:</P>
<P ALIGN="JUSTIFY">–<I> No s&eacute; si estar&aacute;s acostumbrado a comer tan pronto. Perdona si no me he dado cuenta. Le dir&eacute; a mi padre que intente prepararlo todo un poco antes.</P>
</I><P ALIGN="JUSTIFY">– <I>Es igual</I> –le dijo Aradriel, desde la distancia en la que se encontraba su mente de la realidad–.<I> No te preocupes por eso.</P>
</I><P ALIGN="JUSTIFY">–<I> No. No tiene importancia.</P>
</I><P ALIGN="JUSTIFY">Y en un impulso, termin&oacute; de decirle con una ilusi&oacute;n apenas contenida:</P>
<P ALIGN="JUSTIFY">– <I>Ma&ntilde;ana har&eacute; yo la comida. Casi nunca la hago, puesto que mi padre ese d&iacute;a se queda sin comer. Siempre dice que me sale todo mal</I> –le confes&oacute; divertida–, <I>pero te preparar&eacute; m&aacute;s temprano la mejor cena que hayas probado.</P>
</I><P ALIGN="JUSTIFY">– <I>Vale... s&iacute;...</I> –le dijo Aradriel, que casi no la hab&iacute;a o&iacute;do, perdida a&uacute;n su mente, y de nuevo sumida en su autocompasi&oacute;n.</P>
<P ALIGN="JUSTIFY">–<I> ¡Bien!</I> –exclam&oacute; la muchacha. Y se alej&oacute; corriendo, con el rostro encendido.</P>
<P ALIGN="JUSTIFY">Aradriel volvi&oacute; a sentir en su ser la desesperaci&oacute;n que despertaron los recuerdos. Lorien los hizo resurgir de nuevo, haci&eacute;ndole sentir el mismo dolor de entonces. Dolor apagado por el tiempo, pero renacido con la misma fuerza del principio.</P>
<P ALIGN="JUSTIFY">Aradriel se sent&oacute; en el suelo, y se ech&oacute; a llorar.</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







