<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 2. Lorien.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">El Sol estaba ya alcanzando su cenit, cuando Lorien empez&oacute; a bajar las escaleras que comunicaban su habitaci&oacute;n con el piso inferior de la casa, donde viv&iacute;an ella y su padre. </P>
<P ALIGN="JUSTIFY">Era una casa bastante amplia para dos personas y estaba un poco abandonada, al representar sus cuidados una tarea excesiva para ellos dos.</P>
<P ALIGN="JUSTIFY">Estaba construida en casi su totalidad de madera, como todas las de su zona, y ten&iacute;a un amplio patio a la entrada, todo adoquinado con piedras del cercano r&iacute;o. Ten&iacute;a dos pisos, una gran cocina, cinco dormitorios repartidos por las mejores zonas de la casa y un gran porche donde el padre de Lorien gustaba sentarse en su Butaca, como &eacute;l la llamaba. </P>
<P ALIGN="JUSTIFY">Era un sue&ntilde;o de casa, pero como todos los sue&ntilde;os, est&aacute;n sujetos a desaparecer en cualquier instante, ya que aunque a&uacute;n les pertenec&iacute;a, era la &uacute;nica propiedad que todav&iacute;a no les hab&iacute;a arrebatado la adversidad. </P>
<P ALIGN="JUSTIFY">Antes, Lorien y su familia viv&iacute;an felizmente con unas grandes propiedades que dominaban todo lo que se pod&iacute;a divisar desde all&iacute;, pero como el destino siempre elige a los inocentes para ensa&ntilde;arse con ellos, les arrebat&oacute; casi todo lo que pose&iacute;an en un incendio. Todos los campos cultivados se perdieron por la acci&oacute;n devastadora del fuego que cre&oacute; un rayo al precipitarse contra el suelo, en un d&iacute;a de tormenta sin lluvia. Muchas casas adem&aacute;s de la suya propia tuvieron que ser abandonadas, perdi&eacute;ndose en la cat&aacute;strofe muchas vidas inocentes, entre ellas Lien, madre de Lorien, y su hermano. </P>
<P ALIGN="JUSTIFY">Tras esta tr&aacute;gica p&eacute;rdida tuvieron que retirarse a la casa de los sirvientes, &uacute;nica posesi&oacute;n que se pudo salvar; y as&iacute;, rebajados de pronto a una vida miserable comparada con la opulencia anterior, pronto se quedaron solos y sin "amigos", al abandonarlos todos por no tener m&aacute;s de donde sacar para sus intereses.</P>
<P ALIGN="JUSTIFY">Esas personas, supuestamente ligadas a ellos, pronto perdieron el inter&eacute;s, pues el lugar donde estaban siempre invitados y del que pod&iacute;an sacar beneficios aprovech&aacute;ndose de la falta de car&aacute;cter de Orein, desapareci&oacute; de repente. </P>
<P ALIGN="JUSTIFY">Durante muchos a&ntilde;os, Lorien y su padre Orein vivieron holgadamente aunque sin los lujos acostumbrados, con las escasas riquezas que les quedaron. </P>
<P ALIGN="JUSTIFY">Pero poco a poco este recurso fue agot&aacute;ndose y tuvieron que trabajar... para su desgracia, y no porque el trabajo les resultase ignominioso, sino porque aquellos que antes cre&iacute;an que eran sus amigos, se burlaban y aprovechaban de ellos, haciendo que con su poder, todos los habitantes del pueblo s&oacute;lo les ofrecieran los trabajos m&aacute;s rebajantes, los que nadie quer&iacute;a aceptar para no caer en el centro de las habladur&iacute;as, que consideraban una deshonra el trabajo en el que ten&iacute;an que emplearse duramente y volver a sus casas sucios por su labor.</P>
<P ALIGN="JUSTIFY">As&iacute; fue c&oacute;mo una familia feliz fue desgarrada y dejada de la suerte, para ser el objeto del odio y del desprecio de los hombres, pues la envidia durante la &eacute;poca de esplendor se volvi&oacute; en desprecio y pensamientos de superioridad tras la desgracia. </P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">– <I>Buenos d&iacute;as, hija</I> –dijo Orein cuando la vio bajar.</P>
<P ALIGN="JUSTIFY">– <I>Buenos d&iacute;as</I> –le respondi&oacute; Lorien, secamente.</P>
<P ALIGN="JUSTIFY">Orein estaba sentado en su Butaca, la cual sol&iacute;a estar casi siempre en el porche de la entrada, pero esa ma&ntilde;ana se le antoj&oacute; entrarla y mecerse hasta que su hija bajase. </P>
<P ALIGN="JUSTIFY">Al ritmo de sus mecidas, no apart&oacute; la vista de su hija hasta que lleg&oacute; a su altura y se dio cuenta de que su padre la miraba. </P>
<P ALIGN="JUSTIFY">– <I>Te veo cansada, Lorien, aunque has dormido bastante... ¿te encuentras bien?</I> –le pregunt&oacute; sin decisi&oacute;n en su voz.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, estoy bien</I> –le respondi&oacute;, y al ver que su padre frunc&iacute;a el entrecejo a&ntilde;adi&oacute;–.<I> Es que no he dormido muy bien esta noche. Bueno, d&eacute;monos prisa para ir al pueblo y presentarnos en la Casa de Oraciones.</P>
<P ALIGN="JUSTIFY"></I>Mientras dec&iacute;a estas palabras, cogi&oacute; su desayuno y se lo llev&oacute; fuera para comer al Sol de la ma&ntilde;ana. Esto extra&ntilde;&oacute; mucho a su padre porque sol&iacute;an comer juntos a no ser por un motivo especial, pero no le coment&oacute; nada sobre ello, a&uacute;n a sabiendas de que a su hija le pasaba algo.</P>
<P ALIGN="JUSTIFY">As&iacute; era Orein. Ten&iacute;a una sensibilidad especial para darse cuenta de lo que les suced&iacute;a a las personas, pero su virtud acababa ah&iacute;, ya que su car&aacute;cter pasivo y su timidez, le hac&iacute;an callarse lo que pensaba, aun deseando hacerlo. Esto le dol&iacute;a bastante, pero &eacute;l pensaba que no pod&iacute;a hacer otra cosa, y la comodidad de esta forma de pensar le hac&iacute;a parecer un desinteresado, aunque en el fondo fuera el m&aacute;s sensible de todos. </P>
<P ALIGN="JUSTIFY">Por esto, su hija que lo conoc&iacute;a bien, lo asum&iacute;a con calma. Y las veces en que necesitaba hablar con alguien, ten&iacute;a que resignarse a no cont&aacute;rselo a su padre, ya que &eacute;ste, aunque sab&iacute;a escuchar, luego no dec&iacute;a nada m&aacute;s que alg&uacute;n que otro r&aacute;pido consejo para salir al paso, y se callaba lo que de verdad quer&iacute;a decir pero que era comprometedor.</P>
<P ALIGN="JUSTIFY">Orein, por este car&aacute;cter, era algo especial. Por fuera era una persona normal para su edad, unos cincuenta a&ntilde;os, con un pelo que comenzaba a encanecerse y una incipiente barriga que dentro de poco le impedir&iacute;a verse sus propios pies. Su estatura era mediana, pero sus brazos a&uacute;n manten&iacute;an una robustez envidia del mejor joven de su tierra. Aunque lo que no se pod&iacute;a ver ni saber, era que ya estaba cansado de la vida. Simplemente se dejaba llevar por su discurrir, sin ninguna ilusi&oacute;n por alcanzar.</P>
<P ALIGN="JUSTIFY">Por el contrario, Lorien era mucho m&aacute;s despierta, debido sobre todo a sus diecisiete a&ntilde;os. Era igual de alta que su padre y ten&iacute;a el pelo largo e intensamente negro, al igual que sus ojos, que parec&iacute;an dos profundas lagunas, iluminadas en la noche desde el horizonte, por Seriant.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Tras desayunar, tomaron el camino de costumbre hacia el pueblo. La distancia era poca, pero el continuo sube y baja que transcurr&iacute;a desde su casa hasta el r&iacute;o que ten&iacute;an que atravesar para llegar al pueblo, lo hac&iacute;a penoso para el cuerpo, pero una alegr&iacute;a para el esp&iacute;ritu. </P>
<P ALIGN="JUSTIFY">La senda que atravesaban estaba bordeada de grandes setos de flores silvestres de todos los colores posibles, y un poco m&aacute;s alejados, se ve&iacute;an lo &uacute;ltimos vestigios del bosque que antes dominaba toda la regi&oacute;n. </P>
<P ALIGN="JUSTIFY">Se pod&iacute;an ver peque&ntilde;as concentraciones de &aacute;rboles en torno a grandes rocas o en suelos que no eran practicables para la agricultura, ya que el bosque fue desbrozado para el provecho de los humanos. Daba pena ver a los altivos Sauces en su eterna competici&oacute;n por ser los m&aacute;s altos, compitiendo por ser el primero en una carrera con un s&oacute;lo participante, pareciendo demasiado estramb&oacute;ticos y alargados cuando se les ve&iacute;a solitarios en medio de una parcela cultivada. Pero ese era el precio del progreso, y tan acostumbrados estaban a ver las cosas as&iacute;, que a&uacute;n les parec&iacute;an bellas, sin ni siquiera saber que esos &aacute;rboles pose&iacute;an tambi&eacute;n un alma, un alma que estaba herida en su orgullo, herida al verse relegados a la soledad y saber que siguen viviendo s&oacute;lo porque el terreno en el que hunden sus ra&iacute;ces no es v&aacute;lido para nadie. </P>
<P ALIGN="JUSTIFY">Tras dejar atr&aacute;s todo esto, alcanzaron el puente que atravesaba el ancho pero tranquilo r&iacute;o mientras bordeaba el pueblo, pero salvaje cuando lo dejaba atr&aacute;s. Al encontrarse sobre &eacute;l, Lorien observ&oacute; el r&iacute;o y mientras recorr&iacute;a las orillas con la mirada, vio a un muchacho sentado junto a la ribera. No pod&iacute;a reconocerlo, por lo que pens&oacute; que no ser&iacute;a del pueblo. </P>
<P ALIGN="JUSTIFY">Ten&iacute;a el pelo negro y aunque por la distancia no pudo distinguirlo, parec&iacute;a que su cara resplandec&iacute;a con un color extra&ntilde;o, como una mezcla entre el verde y el azul; pero asumi&oacute; que ser&iacute;a por el reflejo del Sol en las aguas del r&iacute;o. </P>
<P ALIGN="JUSTIFY">Igual que cuando por la noche la luz de la Luna se refleja en las aguas y &eacute;sta a su vez, en las piedras de los puentes que lo atraviesan, haciendo parecer como si se desplazasen sin moverse de su sitio, como si flotasen en el aire, tal y como Lorien hab&iacute;a contemplado maravillada muchas veces en sus antiguos paseos nocturnos.</P>
<P ALIGN="JUSTIFY">Dejaron atr&aacute;s al muchacho que despert&oacute; la curiosidad de Lorien, y siguieron en direcci&oacute;n al pueblo. Entonces no tuvieron m&aacute;s remedio que presenciar el miedo que emanaba de la Monta&ntilde;a y que se filtraba envolviendo las almas que la contemplaban. </P>
<P ALIGN="JUSTIFY">Su imponente mole, recuerdo sarc&aacute;stico de los antiguos tiempos en que el reino de Eslariot ten&iacute;a all&iacute; su capital y su indestructible fortaleza, era un recuerdo constante para que nadie pudiera olvidarse del poder de sus Dioses, que m&aacute;s temidos que queridos, consegu&iacute;an que las supersticiones y los temores estuviesen presentes continuamente. </P>
<P ALIGN="JUSTIFY">Al obligarse a bajar la mirada, embelesados con la maldita belleza de la Monta&ntilde;a tal y como ocurr&iacute;a todos los d&iacute;as, se encontraron con otra visi&oacute;n no menos detestada.</P>
<P ALIGN="JUSTIFY">Estaban llegando a la entrada, cuando les sali&oacute; al paso Morth y su s&eacute;quito de degenerados que se encontraban holgazaneando por casualidad, apoyados contra un muro que constitu&iacute;a parte de la primera casa del pueblo.</P>
<P ALIGN="JUSTIFY">Orein los vio y redujo el paso, haciendo que su hija tambi&eacute;n se percatase de ello. Intent&oacute; encontrar una forma de no tener que cruzarse con ellos, pero era demasiado tarde, ya los hab&iacute;an visto. Inmediatamente, Morth, al ver que los dos personajes que se acercaban y que hab&iacute;a visto acercarse eran sus dos m&aacute;s odiados enemigos, avis&oacute; a sus amigos y se&ntilde;al&aacute;ndoles con la cabeza dijo en un murmullo lleno de sarcasmo y rencor:</P>
<P ALIGN="JUSTIFY">– <I>¡Mirad qui&eacute;n viene por ah&iacute;!</P>
<P ALIGN="JUSTIFY"></I>Y los cuatro que lo acompa&ntilde;aban, al reconocerlos, se sonrieron socarronamente entre s&iacute;, sabiendo que iban a tener diversi&oacute;n.</P>
<P ALIGN="JUSTIFY">– <I>Buenos d&iacute;as, Se&ntilde;or Orein</I> –dijo en tono burl&oacute;n Morth cuando forzosamente Orein y Lorien pasaron a su altura; y todos sus acompa&ntilde;antes comenzaron a re&iacute;r. Al silenciarse las burlas, a&ntilde;adi&oacute;– <I>¿Cu&aacute;ndo vas a dejar que tu bella hija se venga con nosotros para divertirse unas horas? ¿Es que temes que nos pueda hacer da&ntilde;o?</P>
<P ALIGN="JUSTIFY"></I>Tras esas palabras todos sus amigos estallaron en risas m&aacute;s fuertes a&uacute;n que las anteriores.</P>
<P ALIGN="JUSTIFY">– <I>¡Dejadnos en paz! Nada os hemos hecho</I> –les grit&oacute; Orein cogiendo por el brazo a su hija y tirando de ella para salir de all&iacute;, pero se vieron rodeados de repente por los cinco personajes que se dedicaban continuamente a hacerles la vida m&aacute;s dif&iacute;cil a&uacute;n.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Morth era el hijo de Morthain, el administrador de la casa de Orein y que muri&oacute; en el incendio. &Eacute;l y su madre fueron recogidos por unos parientes en el pueblo, y desde entonces, vi&eacute;ndose relegado desde su posici&oacute;n tan pomposa hasta tener que vivir gracias a la caridad de sus familiares, torn&oacute; su ira hacia Orein, ira que encaminada hacia los Dioses en un principio, tuvo que abandonar por miedo y temor a que sus sentimientos lo culparan de hacerlo contrario a Sus Leyes. La ira poco a poco amain&oacute; dejando paso al odio, que creci&oacute; hasta el punto de tener que hacerle da&ntilde;o en cualquier oportunidad que tuviera.</P>
<P ALIGN="JUSTIFY">As&iacute; lleg&oacute; a odiar hasta la muerte al que pod&iacute;a culpar de la p&eacute;rdida de su padre.</P>
<P ALIGN="JUSTIFY">Cada vez que ten&iacute;a la oportunidad de da&ntilde;arlos lo hac&iacute;a, y nada pod&iacute;an hacer ni Orein ni su hija al ir siempre acompa&ntilde;ado Morth de las personas m&aacute;s bajas de todo el pueblo, sinti&eacute;ndose fuerte en el grupo. </P>
<P ALIGN="JUSTIFY">Morth codiciaba a Lorien, deseaba su cuerpo, quer&iacute;a poseerla, m&aacute;s para hacerles da&ntilde;o que por atracci&oacute;n f&iacute;sica, pero ella lo repudiaba. Incluso una vez que la encontr&oacute; sola paseando junto al r&iacute;o al anochecer, la abord&oacute; y le prometi&oacute; que ser&iacute;a suya. Pero logr&oacute; escaparse de &eacute;l, cuando en un acto reflejo provocado por el p&aacute;nico, le golpe&oacute; con todas sus fuerzas en el sitio m&aacute;s id&oacute;neo para dejarlo sin posibilidades de reaccionar. </P>
<P ALIGN="JUSTIFY">Lorien pas&oacute; mucho miedo pensando que si su padre se enteraba de que hab&iacute;a intentado aprovecharse de ella, buscar&iacute;a a Morth hasta encontrarlo e intentar&iacute;a matarlo, pero sab&iacute;a que nada podr&iacute;a hacer contra &eacute;l y sus amigos, un hombre mayor y ciego por la ira.</P>
<P ALIGN="JUSTIFY">&Eacute;sta era la situaci&oacute;n, y parec&iacute;a que ese d&iacute;a estaban m&aacute;s alborotados que nunca y pod&iacute;a pasar algo. </P>
<P ALIGN="JUSTIFY">Se hab&iacute;an puesto alrededor de los dos y no hab&iacute;a indicios de que fueran a dejarlos pasar sin conseguir nada. </P>
<P ALIGN="JUSTIFY">Orein intent&oacute; pasar apartando a uno de ellos, pero Morth lo par&oacute; bruscamente empuj&aacute;ndole con una mano en el pecho. Las caras que pod&iacute;a ver Lorien eran caras de desprecio, de superioridad y odio, y cuando Lorien intent&oacute;, tambi&eacute;n sin &eacute;xito, hacerse hueco y pasar, Morth, alentado por los gritos de sus amigos, le grit&oacute; a Orein con ira en la mirada:</P>
<P ALIGN="JUSTIFY">– <I>¡As&iacute; que crees que no me has hecho nada! ¿verdad?. </P>
<P ALIGN="JUSTIFY">– ¿Por qu&eacute; nos haces esto? ¡Yo siempre os trat&eacute; a ti y a tu familia como a la m&iacute;a propia! </I>–grit&oacute; Orein indignado–. <I>Yo no tuve la culpa de lo que pas&oacute;. No eres t&uacute; el &uacute;nico que perdi&oacute; a quienes quer&iacute;a. Yo tambi&eacute;n perd&iacute; a mi mujer y a mi hijo. ¿Crees que ser&iacute;a capaz de provocar algo as&iacute; sabiendo las consecuencias?</P>
<P ALIGN="JUSTIFY"></I>–<I> ¡Ese fue tu error! ¡Maldito seas!</I> –le contest&oacute; Morth mientras apretaba los pu&ntilde;os frente a Orein, amenaz&aacute;ndolo.</P>
<P ALIGN="JUSTIFY">– <I>¿Que error?, ¡no sabes de qu&eacute; est&aacute;s hablando!</I> –le replic&oacute; Orein, confuso y atormentado por la situaci&oacute;n y la incoherencia en las palabras de Morth, que no consegu&iacute;a comprender.</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute;?</I> –grit&oacute; Morth casi farfullando las palabras. Y dominado enteramente por la ira, con una rabia y una violencia contenidas durante muchos a&ntilde;os, empuj&oacute; a Orein, que cay&oacute; al suelo sin poder evitar el golpe. </P>
<P ALIGN="JUSTIFY">Inmediatamente despu&eacute;s, se dispon&iacute;an todos a golpear al hombre en el suelo, mientras uno de ellos sujetaba firmemente a Lorien, que intentaba en vano zafarse de su opresor, cuando, de repente, Morth cay&oacute; de rodillas al suelo con las manos en la cara. </P>
<P ALIGN="JUSTIFY">Todos los dem&aacute;s se quedaron perplejos.  Ante ellos se ergu&iacute;a un joven que no sab&iacute;an de d&oacute;nde hab&iacute;a salido. </P>
<P ALIGN="JUSTIFY">Al ver a su jefe en el suelo y creyendo que quien ten&iacute;an delante era un demonio de los Dioses, los miedos afloraron en todos ellos y salieron despavoridos dejando a Morth solo. </P>
<P ALIGN="JUSTIFY">Lorien pudo ayudar a su padre a levantarse del suelo. </P>
<P ALIGN="JUSTIFY">Morth, a&uacute;n de rodillas, manten&iacute;a las manos en la cara, y poco a poco, entre las uniones de los dedos comenzaron a correr hilillos de sangre, hasta que sus manos quedaron totalmente ensangrentadas. Delante de &eacute;l estaba un muchacho que en posici&oacute;n alerta manten&iacute;a su mirada fija en Morth. Ten&iacute;a el pelo negro y de su mano derecha pod&iacute;an verse caer unas gotas de sangre. </P>
<P ALIGN="JUSTIFY">Morth se apart&oacute; las manos de la cara y Lorien dio un grito de horror al verle el rostro que tanto hab&iacute;a llegado a odiar. Todav&iacute;a no se hab&iacute;a recuperado del golpe y estaba mirando al otro joven. En la cara ten&iacute;a una horrible herida, como si cuatro cuchillos afilados le hubieran atravesado la mejilla desde la oreja hasta la boca. Y cuando se dio cuenta de lo que hab&iacute;a pasado, saliendo del estupor en el que hab&iacute;a ca&iacute;do, fruto de la sorpresa y el dolor por la herida, se abalanz&oacute; hacia el joven que permanec&iacute;a de pie. Pero &eacute;ste ech&oacute; el brazo hacia atr&aacute;s como para asestar otro golpe y Morth se detuvo en seco. Los ojos se le desorbitaron por el dolor y el terror, y retrocediendo como si su vida dependiera de ello, se gir&oacute; y corri&oacute; como un poseso hacia el interior del pueblo. </P>
<P ALIGN="JUSTIFY">Lorien y Orein estaban abrazados, asustados por todo lo que hab&iacute;a ocurrido y contuvieron el aliento cuando vieron que se volv&iacute;a hacia ellos; pero cuando le vieron la cara, el miedo amain&oacute; bastante, ya que vieron el rostro de un joven normal, de cabello negro y cara estilizada, con rostro juvenil pero severo y, sobre todo, ojos verdes. </P>
<P ALIGN="JUSTIFY">– <I>¿&Eacute;l?</I> –pens&oacute; Lorien sorprendida.</P>
<P ALIGN="JUSTIFY">Era el muchacho que hab&iacute;a visto en el r&iacute;o, y ella lo reconoci&oacute; por los ojos y supo que el brillo que vio a lo lejos en su cara era producido por ellos. </P>
<P ALIGN="JUSTIFY">Y aunque estaba extra&ntilde;ada, no pod&iacute;a darle ninguna explicaci&oacute;n.</P>
<P ALIGN="JUSTIFY">– <I>¿Est&aacute;n bien?</I> –pregunt&oacute; con voz firme el joven.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;... s&iacute;, se&ntilde;or, gracias</I> –le respondi&oacute; Lorien.</P>
<P ALIGN="JUSTIFY">– <I>Gracias, hijo</I> –le dijo cansinamente Orein.</P>
<P ALIGN="JUSTIFY">Entonces, como si la persona que ten&iacute;an delante hubiera sido cambiada por otra con la misma presencia, vieron c&oacute;mo el rostro del joven cambiaba de un tono severo y sombr&iacute;o a otro sencillo e incluso t&iacute;mido. Y rompiendo el silencio dijo: </P>
<P ALIGN="JUSTIFY">– <I>Perd&oacute;nenme que me haya entrometido, pero no pod&iacute;a ver lo que estaban haciendo, sin hacer nada </I>–a&ntilde;adi&oacute; el joven.</P>
<P ALIGN="JUSTIFY">– <I>De nuevo te lo agradezco en mi nombre y en el de mi hija</I> –dijo Orein, y dirigi&eacute;ndose a Lorien continu&oacute;–. <I>Despu&eacute;s de este disgusto no me encuentro con fuerzas para ir a la Casa de Oraciones. Ve t&uacute; si quieres.</P>
<P ALIGN="JUSTIFY"></I>– <I>¡Pero Padre!</I> –dijo Lorien– <I>¡No puedes faltar!..., ¿y c&oacute;mo voy a ir sola?</P>
<P ALIGN="JUSTIFY"></I>Y Orein le respondi&oacute;, mirando de reojo al joven: </P>
<P ALIGN="JUSTIFY">– <I>No te preocupes, hija. Despu&eacute;s de lo que ha pasado aqu&iacute; no saldr&aacute;n de sus guaridas durante varios d&iacute;as, sobre todo ese Morth. Hasta que se le cure la herida de la cara y pueda disimularla, su orgullo le impedir&aacute; salir de su casa.</P>
<P ALIGN="JUSTIFY"></I>– <I>Tu padre tiene raz&oacute;n</I> –a&ntilde;adi&oacute; el joven temiendo entrometerse en la conversaci&oacute;n de los dos–. <I>No se preocupe usted por ella, yo la acompa&ntilde;ar&eacute; hasta que vuelva a su casa, si ella me lo permite. Iba hacia el pueblo y despu&eacute;s pensaba regresar al r&iacute;o donde tengo mi campamento.</P>
<P ALIGN="JUSTIFY"></I>Entonces, para horror mudo de Orein, se oy&oacute; hablar a s&iacute; mismo:</P>
<P ALIGN="JUSTIFY">– <I>Gracias de nuevo, despu&eacute;s de lo que ha pasado aqu&iacute; s&eacute; que volver&aacute; segura.</P>
<P ALIGN="JUSTIFY"></I>Pero aunque dijo esto, en realidad intentaba reaccionar por lo que sent&iacute;a, como si desde fuera lo estuvieran manejando como a una marioneta.</P>
<P ALIGN="JUSTIFY">– <I>Acepta su ofrecimiento, hija</I> –concluy&oacute; dejando sus pensamientos en su interior, mientras escuchaba sus palabras–, <I>que yo regresar&eacute; a casa. </P>
<P ALIGN="JUSTIFY"></I>– <I>Est&aacute; bien, padre</I> –dijo Lorien mirando de soslayo al joven que se ofreci&oacute; a acompa&ntilde;arla–. <I>Volver&eacute; tan pronto como acabe mis oraciones. Vuelve a casa y descansa el resto del d&iacute;a... de todas formas, hoy no hay mucho que hacer.</P>
<P ALIGN="JUSTIFY"></I>–<I> Muy bien, hija</I> –y d&aacute;ndose la vuelta no sin antes observar durante unos instantes al joven, a&ntilde;adi&oacute;–. <I>Y gracias de nuevo.</P>
<P ALIGN="JUSTIFY"></I>Y los dej&oacute; en la entrada del pueblo, desapareciendo lentamente por el sendero, olvidado ese momento en el que fue manejado, que nunca recordar&iacute;a y que siempre lo aceptar&iacute;a como si &eacute;l mismo lo hubiera hecho. Aunque no fue &eacute;l, que nunca hubiera dejado sola a su hija; aunque lo hicieran otros a trav&eacute;s suyo... porque esto ten&iacute;a que pasar.</P>
<P ALIGN="JUSTIFY">All&iacute; se quedaron solos los dos, viendo c&oacute;mo se alejaba el hombre, la marioneta en que se convirti&oacute; por obra de Dharmsqui, el intento ocultado al resto de sus hermanos para ayudar a sus hijos.</P>
<P ALIGN="JUSTIFY">Cuando ya no se distingu&iacute;a su silueta del paisaje, Lorien se dio cuenta de que la mano del joven estaba te&ntilde;ida de sangre y le pregunt&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>¿Est&aacute;s herido?</P>
<P ALIGN="JUSTIFY">– No...</I> –titube&oacute; el humano de ojos verdes, y ocultando la mano tras de s&iacute;–. <I>S&oacute;lo necesito un lugar donde limpiarme.</P>
<P ALIGN="JUSTIFY">– Ven entonces</I> –le dijo Lorien, y lo condujo a una fuente dos casas m&aacute;s all&aacute; de la que se encontraban.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de que el joven se limpiase la mano en la fuente, mientras Lorien lo observaba con extra&ntilde;o inter&eacute;s, mezcla de recato y recelo obligados por la cultura que la rodeaba, le pregunt&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Te llamas Lorien ¿verdad?.</P>
<P ALIGN="JUSTIFY">– S&iacute;, bueno, en realidad mi nombre completo es LinLorien...</I> –y tras unos segundos–<I>... pero ll&aacute;mame Lorien. Venga, si todav&iacute;a quieres acompa&ntilde;arme, v&aacute;monos</I> –a&ntilde;adi&oacute; bruscamente.</P>
<P ALIGN="JUSTIFY">Al pronunciar la joven su nombre completo, &eacute;l se dio cuenta, aunque era imperceptible para una persona normal, que lo dijo con una inmensa tristeza.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Entraron en el pueblo. Las calles estaban todas adoquinadas con piedras del r&iacute;o, el cual las hab&iacute;a erosionado convirti&eacute;ndolas en casi perfectas circunferencias, haciendo que las calles adquiriesen una peculiar forma. Las casas laterales al camino principal por el que iban, ten&iacute;an todas la misma estructura, como si la misma persona las hubiera dise&ntilde;ado. Eran todas blancas, de un blanco que las hac&iacute;a resplandecer a la luz del sol ya que estaban construidas, no de ladrillos ni de adobe, sino de puro m&aacute;rmol blanco. Era el &uacute;ltimo vestigio del Reino de Eslariot que quedaba renunciando a extinguirse, pero ya se ve&iacute;an edificios que en lugar del dif&iacute;cil m&aacute;rmol para trabajarlo, estaban construidos de ladrillo y encaladas para mantener la armon&iacute;a del conjunto.</P>
<P ALIGN="JUSTIFY">Hac&iacute;a muchos siglos que la ciudad, ahora en ruinas, hab&iacute;a sucumbido a la ira de los Dioses, llev&aacute;ndose consigo la fortaleza del Rey. Esa ciudad estaba enteramente construida en m&aacute;rmol blanco y tambi&eacute;n en negro. </P>
<P ALIGN="JUSTIFY">Para alguien que no conociera la situaci&oacute;n, le parecer&iacute;a que eso ser&iacute;a imposible, una ciudad entera de m&aacute;rmol, o siquiera una casa. Ser&iacute;a demasiado caro. Pero el motivo por el que el m&aacute;rmol constitu&iacute;a la principal fuente de materiales, era que la propia ciudad estaba construida sobre una gigantesca cantera, haciendo su compra relativamente barata. Y as&iacute;, la ciudad que estaba en su totalidad formada por el m&aacute;rmol trabajado y adecuado a las necesidades humanas, constitu&iacute;a el mayor monumento de todo el mundo. Desde lejos se pod&iacute;a ver su esplendor, que dur&oacute; varios siglos y crec&iacute;a conforme el tiempo pasaba, pero que al final sucumbi&oacute; bajo la venganza de los Dioses.</P>
<P ALIGN="JUSTIFY">Y as&iacute;, actualmente, de vez en cuando los mineros del pueblo se encaminan a las ruinas de esa antigua ciudad y traen consigo cargamentos enteros de m&aacute;rmol que los m&aacute;s pudientes compran para elevar su respeto hacia ellos, haciendo que el pueblo parezca una s&aacute;tira de la antigua ciudad, capital del Reino de Eslariot.</P>
<P ALIGN="JUSTIFY">Lorien y el joven recorrieron las calles empedradas, mientras la gente que los ve&iacute;a se pon&iacute;a a murmurar entre s&iacute;, y no les importaba que se dieran cuenta. Era su forma de rechazar a los extra&ntilde;os. A Lorien no le importaba ya nada de todo esto, y los ignoraba de forma clara, haciendo elevar el murmullo de los comentarios a&uacute;n m&aacute;s. </P>
<P ALIGN="JUSTIFY">Mientras tanto, el joven caminaba con la cabeza agachada y movi&eacute;ndola imperceptiblemente de un lado para otro, como avergonz&aacute;ndose internamente de a lo que se hab&iacute;a llegado.</P>
<P ALIGN="JUSTIFY">El joven la sigui&oacute; silencioso durante un tiempo hasta que se cans&oacute; de que lo observaran y le dijo a Lorien para olvidarse de ello:</P>
<P ALIGN="JUSTIFY">– <I>LinLorien... ¿sabes lo que significa tu nombre?.</P>
<P ALIGN="JUSTIFY"></I>A Lorien le sorprendi&oacute; esta pregunta, y aunque el recelo hacia el joven iba quedando atr&aacute;s, le pill&oacute; de improvisto.</P>
<P ALIGN="JUSTIFY">– <I>No estoy segura</I> –respondi&oacute; casi en un murmullo.</P>
<P ALIGN="JUSTIFY">Y el muchacho que se alegr&oacute; de haber encontrado algo en lo que conversar, le volvi&oacute; a preguntar para no dejar escapar la ocasi&oacute;n de hablar con alguien, cosa que no hac&iacute;a desde hac&iacute;a much&iacute;simo tiempo, al haber estado viajando durante muchos a&ntilde;os y casi nunca encontrar a alguien que se detuviera un poco para simplemente charlar.</P>
<P ALIGN="JUSTIFY">– <I>¿Quieres que te lo diga?</P>
<P ALIGN="JUSTIFY"></I>La muchacha se detuvo de repente mirando con ojos suplicantes al joven y le rog&oacute;: </P>
<P ALIGN="JUSTIFY">– <I>No quiero recordarlo, por favor.</P>
<P ALIGN="JUSTIFY"></I>Esto tom&oacute; al joven a&uacute;n m&aacute;s de improviso que su pregunta a Lorien, y enseguida relacion&oacute; la tristeza de ella al pronunciar su verdadero nombre con su reacci&oacute;n, e intentando saber por qu&eacute; y poder hacer algo, le volvi&oacute; a preguntar de nuevo.</P>
<P ALIGN="JUSTIFY">–<I> Perdona si te ha molestado, pero... ¿por qu&eacute;?. </P>
<P ALIGN="JUSTIFY"></I>Lorien se extra&ntilde;&oacute; de que el joven le preguntara de una forma tan insistente para alguien con quien no ten&iacute;a ninguna confianza y que ni siquiera conoc&iacute;a, pero que a ella le gustar&iacute;a responder si tuviera a alguien en la que s&iacute; tuviera esa confianza. Y aunque parezca extra&ntilde;o, la muchacha le respondi&oacute;, pero no era tan extra&ntilde;o sabiendo que ella necesitaba contarle sus cosas a alguien, ya que durante toda su vida, desde el incendio, por el que se negaba a reconocer que ten&iacute;a recuerdos de antes, estaba acostumbrada a callarse sus cosas, sin poder hablar con nadie, y menos con su padre. A un extra&ntilde;o, pensaba, pero el deseo tanto tiempo contenido, el hecho de que les hab&iacute;a ayudado, y la indiferencia a que el joven se riera de ella, <I>–"¿qu&eacute; pod&iacute;a hacer con lo que le contase?"</I>– pensaba; la hicieron confesar:</P>
<P ALIGN="JUSTIFY">– <I>Porque me recuerda a mi madre</I> –fueron sus palabras, pero dichas con tanta amargura, que el joven se qued&oacute; sin argumentos ni fuerza para seguir, y no insisti&oacute; m&aacute;s.</P>
<P ALIGN="JUSTIFY">Como &eacute;l sab&iacute;a, el nombre LinLorien proven&iacute;a de la mitolog&iacute;a de los dioses. Lin o Lien significaba flor de los dioses y Lorien p&eacute;talo de flor. En conjunto se interpretaba como flor nacida de los p&eacute;talos de Lien, una bella y antiqu&iacute;sima costumbre la de basar el nombre de un hijo en el de su padre o de su madre, perdida para siempre desde hac&iacute;a much&iacute;simo.</P>
<P ALIGN="JUSTIFY">Supuso que su madre se llamaba Lien y que algo tr&aacute;gico le deb&iacute;a de haber sucedido para no querer recordarlo. </P>
<P ALIGN="JUSTIFY">Al notar que el joven se qued&oacute; callado, Lorien, que ya se hab&iacute;a decidido a hablar, y al ver que lo hac&iacute;a porque se hab&iacute;a dado cuenta de su angustia, sinti&oacute; c&oacute;mo su decisi&oacute;n se reforzaba al reconocer su respeto, y comenz&oacute; ella de nuevo la conversaci&oacute;n sin detenerse siquiera a contemplar las caras de los habitantes del pueblo que la miraban con irracional desprecio y mezcla de odio por osar acompa&ntilde;ar a un extra&ntilde;o.</P>
<P ALIGN="JUSTIFY">–<I> Antes has preguntado si sab&iacute;a lo que significaba mi nombre... ¿t&uacute; lo sabes? </P>
<P ALIGN="JUSTIFY"></I>El muchacho se sinti&oacute; reconfortado al sentir que ella confiaba en &eacute;l, aunque dentro de unas horas la dejase para no volver a verla y seguir cada uno su camino. Echaba de menos ese placer en el que se compart&iacute;an pensamientos y se disfrutaba con el mero hecho de la presencia de alguien con quien se pod&iacute;a conversar. Se puede decir que se sinti&oacute; feliz al compartir eso.– <I>"Despu&eacute;s de tanto tiempo..." </I>–pens&oacute; con tristeza, y le cont&oacute; lo que sab&iacute;a del origen de su nombre y de la costumbre que hace muchos siglos se segu&iacute;a para nombrar a la descendencia mediante una alusi&oacute;n a los Dioses y una combinaci&oacute;n del nombre de los padres.</P>
<P ALIGN="JUSTIFY">Atravesaron la plaza del pueblo, donde se encontraba la Casa de Oraciones, lugar donde se rend&iacute;a obligado tributo y respeto, aunque mejor ser&iacute;a decir, temor a los Dioses.</P>
<P ALIGN="JUSTIFY">El bullicio que siempre predominaba en esa plaza estaba en contraste con el murmullo sordo en que se convirti&oacute;, al ver que un extra&ntilde;o estaba invadiendo sus dominios. Y los que a&uacute;n manten&iacute;an simpat&iacute;a por Lorien y su padre, aunque sin revelarlo abiertamente, lo que les hubiera supuesto el mismo desprecio del resto del pueblo, volvieron la espalda y se unieron a los murmullos y comentarios sobre los malos presagios que conllevar&iacute;a este suceso. </P>
<P ALIGN="JUSTIFY">El joven se daba perfectamente cuenta de ello. Este era el arma que usaban los habitantes para expulsar a cualquier viajante que se atreviera a recorrer esa regi&oacute;n. Pero &eacute;l sent&iacute;a una mezcla de pena y angustia, m&aacute;s que de temor y rabia.</P>
<P ALIGN="JUSTIFY">El ambiente le hizo enmudecer y la situaci&oacute;n hubiera sido embarazosa de prolongarse mucho m&aacute;s, pero al llegar a la puerta, Lorien, que cre&iacute;a que tambi&eacute;n &eacute;l iba a entrar, al ir a traspasar el umbral, se detuvo y se percat&oacute; de que se hab&iacute;a quedado al principio de las escaleras.</P>
<P ALIGN="JUSTIFY">– <I>¿No entras? –</I>le pregunt&oacute; extra&ntilde;ada.</P>
<P ALIGN="JUSTIFY">Y mostrando una sutil rabia, que ni siquiera hab&iacute;a conseguido despertar el comportamiento del pueblo, y que ahora afloraba con el simple hecho de ofrec&eacute;rsele el entrar en una Casa de Oraciones donde se rend&iacute;a el culto a los Dioses, respondi&oacute; el muchacho: </P>
<P ALIGN="JUSTIFY">– <I>¡No!. Yo reniego de ellos. Entra t&uacute;.</P>
<P ALIGN="JUSTIFY"></I>Estas fueron sus palabras, tan tajantes como claras y que reflejaban sus verdaderos pensamientos.</P>
<P ALIGN="JUSTIFY">– <I>"¡Dios m&iacute;o!"</I> –bram&oacute; la conciencia de Lorien al escuchar esas blasfemas palabras–. <I>Tan distinto...</I> –dijo su coraz&oacute;n. Pero aunque en ella las costumbres supersticiosas no estaban tan arraigadas, sinti&oacute; c&oacute;mo el peque&ntilde;o acercamiento que se hab&iacute;a iniciado se alej&oacute; un poco, al o&iacute;r c&oacute;mo el joven reconoc&iacute;a su aversi&oacute;n por los Dioses–.<I> "Tan distinto..."</I> –repiti&oacute; de nuevo, y levantando la voz hasta hacerse o&iacute;r, le contest&oacute; al joven.</P>
<P ALIGN="JUSTIFY">– <I>Bueno, como quieras. Me gustar&iacute;a que me esperaras </I>–dijo con un atisbo de ilusi&oacute;n–<I>. No tardar&eacute; mucho, s&oacute;lo unos minutos para rezar las oraciones. Pero antes me gustar&iacute;a que me dijeses cu&aacute;l es tu nombre. </P>
<P ALIGN="JUSTIFY"></I>&Eacute;l se sinti&oacute; como inquieto y tras un segundo le respondi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>...Aradriel... y s&iacute;, por supuesto. Te esperar&eacute;.</P>
<P ALIGN="JUSTIFY"></I>Y tras una sonrisa de la joven, se gir&oacute; r&aacute;pidamente haciendo que su larga melena girase junto a ella. Y entr&oacute; en la Casa.</P>
<P ALIGN="JUSTIFY">Aradriel, se sent&oacute; en las escaleras, pero pronto se tuvo que retirar de ah&iacute; porque estaba a la vista de todos que lo miraban con extra&ntilde;eza y recelo. La pena anterior comenz&oacute; a tornarse en molestia que iba creciendo, pues a la gente no le importaba que &eacute;l se diera cuenta de que era el centro de los comentarios, y se apart&oacute; a un costado de la Casa.</P>
<P ALIGN="JUSTIFY">Se recost&oacute; contra la pared, y aunque la gente que pasaba por all&iacute; demostraba el mismo comportamiento que el resto del pueblo, era menos la sensaci&oacute;n de opresi&oacute;n y repulsa que sent&iacute;a sobre &eacute;l. </P>
<P ALIGN="JUSTIFY">– <I>"C&oacute;mo ha cambiado todo"</I> –pens&oacute;–.<I> "Es incre&iacute;ble que la gente haya llegado hasta este extremo. Nunca antes en ning&uacute;n sitio hab&iacute;a sentido algo tan desagradable." ¡Que los humanos se rechacen a s&iacute; mismos!</I> –exclam&oacute; en voz alta haciendo que los dos hombres que pasaban a su altura, aunque a una distancia prudencial, lo mirasen de repente y aligerasen el paso para alejarse pronto de &eacute;l. Despu&eacute;s sonri&oacute; al darse cuenta de la expresi&oacute;n que hab&iacute;a utilizado– <I>"Los humanos"</I> –repiti&oacute; para s&iacute;–. <I>Hac&iacute;a mucho tiempo que no los llamaba de esa forma, desde... </I>– y sell&oacute; sus labios e hizo a su mente detenerse... para no recordar.</P>
<P ALIGN="JUSTIFY">Tras un tiempo, comenz&oacute; a salir gente de la Casa y sin que el joven se diera cuenta, Lorien apareci&oacute; por el otro lado y se le acerc&oacute; hasta llegar a su altura. Entonces le dijo sonriente: </P>
<P ALIGN="JUSTIFY">–<I> Gracias. Pensaba que ya no estar&iacute;as aqu&iacute;. </P>
<P ALIGN="JUSTIFY"></I>– <I>Te dije que as&iacute; lo har&iacute;a</I> –dijo Aradriel mientras se incorporaba y estiraba un poco las piernas, entumecidas por la postura fija que hab&iacute;an mantenido durante largo rato.</P>
<P ALIGN="JUSTIFY">Aradriel mir&oacute; a los ojos negros de la muchacha y le pareci&oacute; que la tristeza hab&iacute;a amainado un poco, y Lorien, que no pudo sostenerle la mirada, la apart&oacute;, y mirando alrededor le dijo con un suspiro: </P>
<P ALIGN="JUSTIFY">– <I>Espero que no te afecte el comportamiento de la gente. No s&eacute; si lo entender&aacute;s, pero es la forma en que aqu&iacute; se ha tratado a los extranjeros desde siempre, y como les ha funcionado, lo siguen haciendo. Aunque d&eacute; verg&uuml;enza...</P>
<P ALIGN="JUSTIFY"></I>– <I>No desde siempre</I> –la interrumpi&oacute; Aradriel–. <I>S&eacute; que hace mucho tiempo este pueblo no era as&iacute;. Pero dej&eacute;moslo, parece que sus iras tambi&eacute;n se est&aacute;n centrando en ti. No quiero que por mi culpa tengas problemas, m&aacute;s de los que he visto antes. </P>
<P ALIGN="JUSTIFY"></I>Lorien no sab&iacute;a si dar cr&eacute;dito a las palabras de Aradriel, pues ella siempre hab&iacute;a vivido en ese ambiente, y por lo que sab&iacute;a, la gente se comportaba as&iacute; desde mucho antes de que ella naciera, pero Aradriel lo dijo tan convencido y con tal deje de pena en su voz, que no pudo desechar su idea, y simplemente la acept&oacute; como posible en un pasado m&aacute;s remoto. </P>
<P ALIGN="JUSTIFY">– <I>Ojal&aacute; esto cambiase</I> –dijo ella–, <I>pero no creo que sea posible ni siquiera dentro de muchos a&ntilde;os.</P>
<P ALIGN="JUSTIFY"></I>– <I>Y mucho menos cuando les va tan bien de esta forma</I> –a&ntilde;adi&oacute; Aradriel a sus palabras–. <I>Puede que sea una forma vergonzosa de protegerse. Yo he viajado mucho por... bueno, he visto muchas ciudades y muchos pueblos, y cada uno de ellos tiene su forma de comportarse. Puede que no tengamos ni siquiera el derecho a juzgar a estas gentes que s&oacute;lo intentan protegerse a s&iacute; mismas. Este mundo est&aacute; sumido en la oscuridad desde que nos negaron nuestro privilegio hace much&iacute;simos siglos. Y parece que en este lugar se ha acrecentado </I>–y mirando hacia la gigantesca monta&ntilde;a que ten&iacute;a a su izquierda concluy&oacute;–<I> Y quiz&aacute;s la culpa la tenga esa maldita monta&ntilde;a.</P>
<P ALIGN="JUSTIFY"></I>Lorien lo escuchaba mientras miraba los rostros, que haciendo un semic&iacute;rculo para no pasar junto a ellos, les miraban sombr&iacute;amente. Las palabras de Aradriel bien podr&iacute;an ser de una persona con muchos a&ntilde;os a sus espaldas, pues reflejaban una inmensa madurez y conocimiento. Pero sin embargo &eacute;l era s&oacute;lo un joven, y por mucho que hubiese viajado, las dificultades y todo lo que hubiera podido aprender no ser&iacute;an suficientes para d&aacute;rsela en su corta vida, haci&eacute;ndole interesarse a&uacute;n m&aacute;s por ese joven tan extra&ntilde;o por su forma de comportarse y de hablar, y que parec&iacute;a sumido en una bruma de misterio.</P>
<P ALIGN="JUSTIFY">– <I>"Has le&iacute;do muchos libros"</I> –pens&oacute; sonriendo para s&iacute; misma–. <I>"Estas viendo lo que posiblemente sea algo normal y que t&uacute; no puedes saber al no haber salido nunca de aqu&iacute;"</I> –Y meneando la cabeza para alejar esos pensamientos se dio cuenta de que Aradriel la estaba mirando de nuevo, pero detect&oacute; en su mirada como algo que la hizo sentirse avergonzada, no sab&iacute;a por qu&eacute;, pero parec&iacute;a que le hab&iacute;a estado leyendo los pensamientos.</P>
<P ALIGN="JUSTIFY">– <I>¿Nos vamos?</I> –le pregunt&oacute; ella para cambiar la situaci&oacute;n, mientras miraba cada vez m&aacute;s furibundamente a la gente que la estaba empezando a molestar por su actitud.</P>
<P ALIGN="JUSTIFY">– <I>V&aacute;monos</I> –le contest&oacute; Aradriel mientras se percataba de que la muchacha quer&iacute;a dejar atr&aacute;s ese momento de perturbaci&oacute;n que revel&oacute; su rostro al observarla.</P>
<P ALIGN="JUSTIFY">Y ambos se dirigieron, sin tener siquiera que plante&aacute;rselo, en direcci&oacute;n opuesta a la plaza. Ninguno quer&iacute;a pasar por all&iacute; de nuevo, aunque tuvieran que dar un gran rodeo.</P>
<P ALIGN="JUSTIFY">Ella quer&iacute;a saber m&aacute;s de &eacute;l. No pod&iacute;a dejar pasar la oportunidad de conocer a alguien distinto, a alguien que no la tratase con desprecio como hac&iacute;a la mayor&iacute;a de los habitantes del pueblo. Le interesaba conocer a su enigm&aacute;tico compa&ntilde;ero. Enigm&aacute;tico s&oacute;lo porque se sal&iacute;a de la monoton&iacute;a de siempre. Por que sab&iacute;a hablar, y lo m&aacute;s importante, escuchar.</P>
<P ALIGN="JUSTIFY">– <I>Antes me explicaste lo que significaba mi nombre, ¿sabes si el tuyo tambi&eacute;n tiene significado? </I>–le pregunt&oacute; Lorien.</P>
<P ALIGN="JUSTIFY">El joven sonri&oacute; para inmediatamente tornar la sonrisa en tristeza, y al cabo de un momento le respondi&oacute;: </P>
<P ALIGN="JUSTIFY">– <I>S&iacute;. El m&iacute;o tambi&eacute;n tiene su interpretaci&oacute;n. Es un nombre, al igual que el tuyo, compuesto por la uni&oacute;n del de uno de mis padres y una invocaci&oacute;n a los Dioses. Mi padre se llamaba Radiel y junto con el nombre del Dios que cre&oacute; la tierra de nuestro mundo, Ara, conformaron el nombre de Aradriel. El hijo de la tierra cultivada por Radiel.</P>
<P ALIGN="JUSTIFY"></I>Lorien hizo un gesto de aprobaci&oacute;n, pues le interes&oacute; el hecho de que en el pasado se nombrasen a las personas de esa manera, e intentando saber por qu&eacute; Aradriel no quiso entrar en la Casa de Oraciones y se atreviese a renegar de ellos, actitud que le hizo recelar un momento de &eacute;l, le pidi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>As&iacute; que Aradriel... me gustar&iacute;a que me contaras c&oacute;mo aprendiste los or&iacute;genes de los nombres, y d&oacute;nde conociste esa perdida costumbre... y por qu&eacute; afirmas renegar de los Dioses. </P>
<P ALIGN="JUSTIFY"></I>Las &uacute;ltimas palabras las dijo tan bajas para que la poca gente que pasaba a su alrededor no la oyese, que a Aradriel le cost&oacute; bastante comprenderlas, y tras unos momentos...</P>
<P ALIGN="JUSTIFY">– <I>Prefiero no hablar de los Dioses </I>–dijo casi tan bajo que Lorien tuvo que acercarse para escucharlo– <I>No quiero que ning&uacute;n momento m&aacute;s de mi vida se centre en su atenci&oacute;n. Pero s&iacute; podr&iacute;a contarte d&oacute;nde aprend&iacute; el Nombramiento, como se sol&iacute;a llamar a este arte </I>–y al ver que Lorien cambiaba su expresi&oacute;n de desilusi&oacute;n, al o&iacute;rle decir que no le dir&iacute;a por qu&eacute; no quer&iacute;a saber nada de los Dioses, torn&aacute;ndose en inter&eacute;s, continu&oacute; mientras dejaban atr&aacute;s las &uacute;ltimas casas de la calle que daba hacia una de las salidas del pueblo–.<I> Antiguamente, los Dioses eran igual de temidos que ahora, pero la gente se lo tomaba de otra forma e intentaba agradarlos para que simplemente no se fijasen en ellos y los ignoraran. As&iacute; que algunos padres comenzaron a usar partes de los nombres de los Dioses, pues cre&iacute;an que se enfadar&iacute;an si llamasen a sus hijos con el mismo nombre que el de un Dios, junto con una forma que cada cual decid&iacute;a, de combinar su propio nombre. As&iacute;, si alguien quer&iacute;a llamar a una hija de esta forma, se usaba el nombre de la madre y una parte del nombre de un Dios, tal y como el tuyo fue compuesto </I>–en ese momento se acord&oacute; del dolor que vio en el rostro de Lorien al pronunciar el nombre de LinLorien y r&aacute;pidamente a&ntilde;adi&oacute; para hacer olvidar sus &uacute;ltimas palabras–. <I>Pronto a la gente le gust&oacute; esta original forma de llamar a sus seres queridos y esta aislada forma se convirti&oacute; en una costumbre que se fue extendiendo por todo el mundo, aunque ir&oacute;nicamente para el desagrado de los Dioses </I>–dijo socarronamente, y cambiando el tono de su voz hacia el rencor–, <I>haciendo que los que as&iacute; fueran llamados, sufrieran un destino peor a&uacute;n que el de sus cong&eacute;neres, pues nuestros Dioses </I>–dijo esta vez casi riendo mal&eacute;volamente– <I>crey
eron un sacrilegio posar sobre un simple e insignificante humano parte de su nombre, a&uacute;n a pesar de ser un intento de agradarlos. S&oacute;lo unos pocos permitieron que se usase su nombre, entre ellos nuestro creador Dharmsqui, la Diosa de la tierra Ara, el Dios del mar Amar, el Dios del aire Eria, el de los &aacute;rboles LeSarb, y la mayor&iacute;a de los Dioses que no crearon ninguna de las criaturas que vencimos en las dos Eras de su creaci&oacute;n.</P>
<P ALIGN="JUSTIFY"></I>– <I>¿Y d&oacute;nde has aprendido todo esto? </I>–le pregunt&oacute; Lorien mientras atravesaban el puente donde ella vio por primera vez a Aradriel.</P>
<P ALIGN="JUSTIFY">– <I>He estado recorriendo este mundo durante mucho tiempo y he aprendido muchas costumbres e historias de todos los lugares en donde he estado</I> –afirm&oacute; Aradriel sin ning&uacute;n sentimiento reflejado en su voz.– <I>Me han ense&ntilde;ado a ver las cosas de otra manera, a no juzgarlas por lo primero que veo de ellas, sino esperando antes a conocerlas un poco mejor, a ver c&oacute;mo son en realidad. E incluso a veces me he llevado muchas sorpresas positivas y desgraciadamente, la mayor&iacute;a, negativas.</P>
<P ALIGN="JUSTIFY"></I>Iban ya por el sendero bordeado de flores silvestres, cuando el Sol se oscureci&oacute; durante unos segundos, haci&eacute;ndoles mirar a ambos hacia el cielo, donde vieron una gran nube que presid&iacute;a y hac&iacute;a saber a los que la observaban que tras ella ven&iacute;a una inmensa mole semiopaca que oscurec&iacute;a los valles sobre los que planeaban, como si fuera un heraldo orgulloso anunciando a su ej&eacute;rcito que ven&iacute;a tras de s&iacute;.</P>
<P ALIGN="JUSTIFY">– <I>El invierno se acaba</I> –dijo Lorien–. <I>Parece que las lluvias se van a adelantar... de todas formas su llegada ya no le importa a mi familia... bueno, a lo que queda de ella. </P>
<P ALIGN="JUSTIFY"></I>Se hizo el silencio.</P>
<P ALIGN="JUSTIFY">Tras unos minutos en los que ninguno ten&iacute;a la suficiente fuerza de voluntad para romperlo, dejaron el camino y llegaron a la explanada empedrada que preced&iacute;a a la casa de Lorien. Orein los vio llegar. Estaba sentado en su butaca junto a la puerta de la entrada, donde le gustaba pasar largas horas mirando hacia las monta&ntilde;as que tanto le hab&iacute;a gustado explorar cuando era joven; esas monta&ntilde;as que bordeaban a la Maldita. </P>
<P ALIGN="JUSTIFY">Vio c&oacute;mo se acercaban lentamente, sin prisas, pero tambi&eacute;n vio que no hablaban, deseando llegar cuanto antes, pero sin acelerar el paso para no descubrirse.</P>
<P ALIGN="JUSTIFY">Cuando llegaron a su altura, Aradriel, que hab&iacute;a desviado su mirada intencionadamente para no encontrarse con la del hombre que sab&iacute;a que le observaba, le dijo: </P>
<P ALIGN="JUSTIFY">– <I>Buenas tardes, se&ntilde;or. He acompa&ntilde;ado a su hija tal y como le dije</I> –y dirigi&eacute;ndose a Lorien a&ntilde;adi&oacute;–, <I>y gracias por tu compa&ntilde;&iacute;a, hac&iacute;a mucho tiempo que no hablaba con alguien elocuente y sin prejuicios sobre los extra&ntilde;os.</P>
<P ALIGN="JUSTIFY"></I>Y Lorien, avergonz&aacute;ndose un poco por sus pensamientos sobre el desconocido, habiendo estado influenciada por esos mismos prejuicios, le contest&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>No hay nada que agradecer por tu parte sino por la m&iacute;a. Gracias por todo.</P>
<P ALIGN="JUSTIFY"></I>Y Aradriel, dirigi&eacute;ndose de nuevo a Orein:</P>
<P ALIGN="JUSTIFY">– <I>Aqu&iacute; le dejo a su hija como le dije</I> –Y r&aacute;pidamente se gir&oacute; y se fue en direcci&oacute;n hacia el r&iacute;o.</P>
<P ALIGN="JUSTIFY">Los dos se quedaron extra&ntilde;ados. Hasta que al fin dijo Orein, que ya no se acordaba de lo que le pas&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>Es una persona muy extra&ntilde;a ¿verdad hija?</P>
<P ALIGN="JUSTIFY"></I>– <I>S&iacute;, padre</I> –le contest&oacute; su hija–, <I>muy extra&ntilde;a </I>–a&ntilde;adi&oacute; mientras pensaba otras palabras– <I>"Pero no tanto."</P></I>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







