<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 4. Orein.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Los truenos segu&iacute;an retumbando en el &aacute;nimo de los mortales.</P>
<P ALIGN="JUSTIFY">Aradriel se incorpor&oacute; tras terminar de recordar los pasajes en su mente, en donde estaba escrita esa historia. Se acerc&oacute; hasta la orilla del r&iacute;o y se qued&oacute; mirando el reflejo de Seriant, que hab&iacute;a conseguido por un momento atravesar las nubes. </P>
<P ALIGN="JUSTIFY">Estuvo as&iacute;, con la mirada perdida, hasta que se volvi&oacute; a oscurecer el reflejo. No se movi&oacute; durante largo rato y despu&eacute;s, lentamente, levant&oacute; la mirada hacia el sauce llor&oacute;n y dijo con voz ahogada:</P>
<P ALIGN="JUSTIFY">– <I>T&uacute; tambi&eacute;n la perdiste. Igual que yo...; ya no la podremos ver. Ellos tambi&eacute;n te la quitaron.</I> </P>
<P ALIGN="JUSTIFY">Cuando pronunci&oacute; esas palabras, la luz de la Luna consigui&oacute; abrirse paso de nuevo durante un breve momento, como queriendo demostrarle al muchacho que estaba equivocado, e ilumin&oacute; las hojas del sauce llor&oacute;n. Entonces, todos los seres que all&iacute; viv&iacute;an, pudieron ver que los ojos del joven estaban llorando. </P>
<P ALIGN="JUSTIFY">Despu&eacute;s, las nubes se apretaron a&uacute;n m&aacute;s y consiguieron con un rugido vencer a los rayos de Seriant, y con la fuerza desatada, se liber&oacute; la tormenta. Rayos y truenos comenzaron a luchar entre s&iacute; para intentar imponerse sobre el otro y poder tener el privilegio de asustar a los mortales. </P>
<P ALIGN="JUSTIFY">Aradriel se refugi&oacute; bajo el sauce llor&oacute;n, pero &eacute;ste, con sus hojas apenas crecidas, no pod&iacute;a cobijarlo y pronto comenz&oacute; a empaparse. Pens&oacute; en ir a refugiarse bajo el puente que estaba cerca de all&iacute;, pero estaba como abstra&iacute;do por los recuerdos. Pensaba en Seriant, en ese &aacute;rbol bajo el que estaba..., en su pasado. </P>
<P ALIGN="JUSTIFY">La tormenta creci&oacute; en intensidad, pero aunque lo sab&iacute;a, parec&iacute;a no querer darse cuenta. Estaba sumido en sus pensamientos, hasta el punto en que la amargura que sent&iacute;a, lo reconfortaba de todo lo que pasaba fuera de &eacute;l. Se regocijaba irracionalmente en su pena, sin ganas de hacer otra cosa que quedarse donde estaba, sin moverse, y s&oacute;lo recordando, se sent&iacute;a mejor.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Los truenos despertaron a Lorien y se dio cuenta de que la tormenta era terrible. Medio dormida a&uacute;n, sinti&oacute; una ansiedad en el pecho, como si su conciencia le recordara algo, pero que la bruma del sue&ntilde;o no permit&iacute;a revelar. Tras un momento en que cedi&oacute; esa bruma, inmediatamente se acord&oacute; del joven que hab&iacute;a conocido por la ma&ntilde;ana. </P>
<P ALIGN="JUSTIFY">– <I>"¿D&oacute;nde estar&aacute;?"</I> –pens&oacute;–. <I>"Dijo que ten&iacute;a su campamento en el r&iacute;o... donde le vi esta ma&ntilde;ana."</P>
</I><P ALIGN="JUSTIFY">Y la idea de que estar&iacute;a desprotegido de la lluvia, del viento y del fr&iacute;o, le impidi&oacute; volver a conciliar el sue&ntilde;o. Se arrebuj&oacute; a&uacute;n m&aacute;s de lo que estaba en sus mantas, e intent&oacute; convencerse de que no era asunto suyo, de que aunque los hubiera ayudado el pasado d&iacute;a, &eacute;l mismo dijo que hab&iacute;a estado viajando durante mucho tiempo.</P>
<P ALIGN="JUSTIFY">– <I>"¡Ya estar&aacute; acostumbrado!"</I> –se oy&oacute; decir a s&iacute; misma, pero se dio cuenta de que no era su conciencia quien hablaba, sino sus costumbres y sus prejuicios aprendidos desde la ni&ntilde;ez.</P>
<P ALIGN="JUSTIFY">No paraban de tronar las nubes, cuando se levant&oacute; y se asom&oacute; a la ventana.</P>
<P ALIGN="JUSTIFY">–<I> "Puede haberse resguardado bajo alg&uacute;n &aacute;rbol, o bajo el puente" </I>–pens&oacute;, pero pronto le acuci&oacute; la idea de que aunque se hubiera protegido, el viento har&iacute;a imposible el evitar que se mojase. Y no sabiendo qu&eacute; hacer, se dirigi&oacute; hacia abajo.</P>
<P ALIGN="JUSTIFY">Sali&oacute; de su cuarto en silencio, para no despertar a su padre si es que no lo hab&iacute;an hecho ya los truenos, pero al bajar las escaleras, lo encontr&oacute; meci&eacute;ndose intranquilamente en su butaca. &Eacute;ste, que conoc&iacute;a muy bien a su hija, y sin esperar a que le explicase nada, le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Si es lo que deseas, ve a por &eacute;l y que pase aqu&iacute; la noche. Pero antes tienes que contestarme sinceramente a una pregunta... ¿podemos fiarnos de &eacute;l?</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;</I> –fue la r&aacute;pida respuesta de Lorien, sorprendida un poco por la actitud de su padre.</P>
<P ALIGN="JUSTIFY">–<I> Entonces ve </I>–le dijo Orein, que aunque ya nunca recordar&iacute;a el momento en el que lo manejaron, sinti&oacute; c&oacute;mo la desconfianza por los desconocidos, amain&oacute; un poco.</P>
<P ALIGN="JUSTIFY">–<I> Gracias, padre </I>–le agradeci&oacute; Lorien, con una sonrisa en sus labios.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">No tard&oacute; mucho en encontrarlo. Estaba en el mismo sitio en el que lo vio por primera vez. Estaba bajo un &aacute;rbol de ramas ca&iacute;das y con una manta echada por encima. Lorien iba bien abrigada, pero el incesante y alocado viento cambiaba continuamente el sentido, haci&eacute;ndose imposible el no empaparse completamente. </P>
<P ALIGN="JUSTIFY">Se acerc&oacute; lentamente a la figura oculta por la manta y la lluvia, y le dijo:                  </P>
<P ALIGN="JUSTIFY">– <I>Hola, Aradriel.</P>
</I><P ALIGN="JUSTIFY">&Eacute;l se sobresalt&oacute; y apart&oacute; la manta de su cara casi instant&aacute;neamente, sintiendo como si una colosal mano, lo sacase del fondo de su tristeza, devolvi&eacute;ndolo a la dolorosa realidad.</P>
<P ALIGN="JUSTIFY">– <I>¡...Lorien! Qu&eacute;... ¿qu&eacute; haces aqu&iacute;? </I>–consigui&oacute; balbucear en un segundo, cuando su vista consigui&oacute; vencer al viento y la lluvia, y distinguir la silueta de la persona que estaba frente a &eacute;l.</P>
<P ALIGN="JUSTIFY">Y Lorien, con la mirada perturbada durante un instante, le respondi&oacute;:</P>
<P ALIGN="JUSTIFY">– <I>No... no pod&iacute;a dormir. No pod&iacute;a dormir por culpa de los truenos... y pens&eacute; que podr&iacute;as necesitar ayuda</I> –Y ya con m&aacute;s confianza en su voz, pasado el primer mal trago de ocultarle sus pensamientos, a&ntilde;adi&oacute;–. <I>Si quieres, puedes venir a mi casa y resguardarte all&iacute; esta noche.</P>
<P ALIGN="JUSTIFY">– Gracias</I> – dijo Aradriel bastante complacido por el tono c&aacute;lido de su voz–, <I>pero no quiero ser una molestia. Ya he visto lo que vuestras costumbres son capaces hacer, de atenazaros en el aislamiento. Te lo agradezco, pero no puedo aceptarlo. No quiero perjudicaros ni a ti ni a tu padre. </P>
</I><P ALIGN="JUSTIFY">El rostro de Lorien qued&oacute; desilusionado. </P>
<P ALIGN="JUSTIFY">– <I>"¿Y ahora, qu&eacute; hago?" </I>–pens&oacute; desconcertada.</P>
<P ALIGN="JUSTIFY">Y ante la perspectiva de volver sola y presentarse ante su padre como si la hubieran derrotado, tras unos momentos de duda, le dijo mientras se sentaba junto a &eacute;l bajo el &aacute;rbol:</P>
<P ALIGN="JUSTIFY">– <I>Bueno, si te mojas t&uacute;, ¡yo tambi&eacute;n me mojar&eacute;!</P>
</I><P ALIGN="JUSTIFY">Aradriel se qued&oacute; sorprendido por el comportamiento de Lorien, y no tuvieron m&aacute;s remedio ambos, que sonre&iacute;r por el comportamiento de ella. Luego, la joven le pregunt&oacute; que porqu&eacute; hab&iacute;a elegido ese &aacute;rbol tan feo y poco agraciado para cobijarse, que por qu&eacute; no hab&iacute;a ido al menos al puente. </P>
<P ALIGN="JUSTIFY">Aradriel le respondi&oacute; que no hablase as&iacute; de &eacute;l, que no se merec&iacute;a ese desprecio, mientras intentaba con todas sus fuerzas dar una excusa que fuera aceptable, puesto que desde luego era una tonter&iacute;a el haberse quedado all&iacute;. Pero no sab&iacute;a qu&eacute; contestarle, ¿qu&eacute; le iba a decir, que le gustaba amargarse s&oacute;lo, prefiriendo estar en ese estado a ir en busca de cobijo?, ¿o que quer&iacute;a acompa&ntilde;ar a ese sauce llor&oacute;n, en su soledad?</P>
<P ALIGN="JUSTIFY">Menos mal que Lorien se extra&ntilde;&oacute; de que hablase as&iacute; de un &aacute;rbol, y para alivio de Aradriel:</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; dices eso de este &aacute;rbol? </I>–le pregunt&oacute; Lorien, puesto que sus costumbres le hab&iacute;an ense&ntilde;ado a ver s&oacute;lo lo funcional de las cosas, sin detenerse a disfrutar durante m&aacute;s de un momento, de la belleza de lo que la rodeaba.</P>
<P ALIGN="JUSTIFY">– <I>Para m&iacute;, &eacute;ste es el &aacute;rbol m&aacute;s hermoso de todos</I> –le respondi&oacute; Aradriel–, <I>y a la vez, el m&aacute;s desgraciado</I>. –Y le cont&oacute; que hab&iacute;a conocido la leyenda del nacimiento del Sauce que Llora, que sab&iacute;a cu&aacute;l era la historia del primer sauce llor&oacute;n que naci&oacute;. </P>
<P ALIGN="JUSTIFY">El instinto natural de la simple curiosidad por algo aparentemente sin importancia, algo que estaba olvidado, comenz&oacute; a florecer, y Lorien sinti&oacute; el deseo de escuchar esa historia, simplemente por conocerla. </P>
<P ALIGN="JUSTIFY">–<I> Bueno</I> –le dijo Lorien–, <I>si no quieres venir a mi casa, al menos vamos al puente... y cu&eacute;ntamela </I>–termin&oacute; con un atisbo de ilusi&oacute;n.</P>
<P ALIGN="JUSTIFY">Aradriel le sonri&oacute;, y le dijo que tal vez no le gustar&iacute;a, que era demasiado sentimental y triste. Pero ante los ojos de ruego que Lorien le dedic&oacute;, se qued&oacute; sin defensas, y finalmente accedi&oacute;. No estaba acostumbrado a enfrentarse a esas miradas que una mujer sabe hacer. </P>
<P ALIGN="JUSTIFY">Ambos se levantaron, y corrieron a resguardarse al puente, bajo el cual, s&oacute;lo hab&iacute;a un peque&ntilde;o espacio que no estaba ocupado por las aguas del r&iacute;o. Aunque al menos era mejor que la lacerante lluvia.</P>
<P ALIGN="JUSTIFY">– <I>Vente a mi casa... por favor</I> –le rog&oacute; dulcemente Lorien, cuando consiguieron ponerse bajo el arco de piedras.</P>
<P ALIGN="JUSTIFY">– <I>No..., no puedo, no os molestar&eacute;</I> –le contest&oacute; Aradriel en un susurro–.<I> Vuelve a tu casa, tu padre te estar&aacute; esperando.</P>
</I><P ALIGN="JUSTIFY">– <I>S&iacute;,...</I> –le contest&oacute; desilusionada– <I>pero me dijo que te trajera  </I>–volvi&oacute; a insistir, d&aacute;ndose cuenta de las dudas que asaltaban el rostro del joven, y que hac&iacute;an que sus ojos verdes se entornasen por una inexplicable angustia.</P>
<P ALIGN="JUSTIFY">Y como &uacute;ltimo recurso, le volvi&oacute; a decir:</P>
<P ALIGN="JUSTIFY">– <I>Ya que no quieres venir, cu&eacute;ntame esa historia.</P>
</I><P ALIGN="JUSTIFY">A Aradriel le dol&iacute;a esa situaci&oacute;n, y dedic&aacute;ndole una triste sonrisa a la encantadora mujercita que ten&iacute;a delante, le indic&oacute; con un gesto de la mano, que se sentase, y al hacer &eacute;l lo mismo, comenz&oacute;.</P>
<P ALIGN="JUSTIFY">Le cont&oacute; la historia del Sauce Llor&oacute;n y mientras se la iba relatando, alrededor de ellos fue como si la tormenta hubiera desaparecido. &Eacute;l se sent&iacute;a ilusionado al ver que Lorien escuchaba con gran inter&eacute;s su historia.</P>
<P ALIGN="JUSTIFY">– <I>"Hac&iacute;a tanto tiempo que no hablaba con alguien..."</I> –pero le dol&iacute;a tener que volver a recordarla, y m&aacute;s, pensando en el estado en que se sumi&oacute; despu&eacute;s.</P>
<P ALIGN="JUSTIFY">Ella se sent&iacute;a maravillada, contenta al descubrir el placer de un simple relato, de algo desconocido y distinto a todo lo que hab&iacute;a visto y escuchado hasta entonces. Contenta y a la vez algo asustada, al o&iacute;r a su compa&ntilde;ero hablar sin ning&uacute;n temor, y sin tapujos, de los Dioses, de la magia y de tantas otras cosas que nadie se atrever&iacute;a a hablar en el pueblo.</P>
<P ALIGN="JUSTIFY">No se atrevi&oacute; a interrumpirle. Le parec&iacute;a como si al hacerlo, pudiera romper esa extra&ntilde;a sensaci&oacute;n, mezcla de embrujo y melancol&iacute;a, en la que la envolv&iacute;an las palabras del joven. Su mente no consigui&oacute; crear ninguna pregunta, mas si lo hubiera hecho, no se la habr&iacute;a formulado. Sus negros ojos se clavaban en los de Aradriel, fascinada por las facciones del muchacho, encantada por las reacciones tan sutiles, pero que parec&iacute;a como si estuvieran reflejando la propia historia.</P>
<P ALIGN="JUSTIFY">Cuando concluy&oacute; el relato, Aradriel descubri&oacute; que Lorien estaba apartando las l&aacute;grimas de sus mejillas, intentando contenerlas.  </P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute; te pasa?</I> –le pregunt&oacute;.</P>
<P ALIGN="JUSTIFY">Y &eacute;sta le confes&oacute;, al verse sorprendida:</P>
<P ALIGN="JUSTIFY">– <I>Es la historia m&aacute;s bonita que he escuchado nunca </I>–y sonri&eacute;ndole, a&uacute;n con los ojos h&uacute;medos, le dijo– <I>aunque es la &uacute;nica que he o&iacute;do hasta ahora. </P>
</I><P ALIGN="JUSTIFY">– <I>¿Qu&eacute; pasa, hasta las historias est&aacute;n prohibidas aqu&iacute;?</I> –le pregunt&oacute; algo enfadado Aradriel.</P>
<P ALIGN="JUSTIFY">– <I>No</I> –respondi&oacute; Lorien intentando defender su forma de vida, pero d&aacute;ndose cuenta como nunca antes, de que no ten&iacute;a sentido defender algo de lo que no se sent&iacute;a orgullosa–. <I>Bueno... es que aqu&iacute; no se habla de los Dioses. Nadie habla de la magia, ni de cosas sobrenaturales– se oy&oacute; decirle a Aradriel, sorprendi&eacute;ndose de haber hablado as&iacute;.</P>
</I><P ALIGN="JUSTIFY">– <I>Perd&oacute;name</I> –se disculp&oacute; Aradriel, al darse cuenta de que la hab&iacute;a herido y le hablaba a la defensiva.</P>
<P ALIGN="JUSTIFY">– <I>No..., no importa </I>–le confes&oacute; Lorien–, <I>es que esto es nuevo para m&iacute;. De verdad, ha sido una historia preciosa, pero es... demasiado triste, ¿no? </I>–termin&oacute; de decir, temiendo contrariarlo.</P>
<P ALIGN="JUSTIFY">– <I>S&iacute;, lo es. Pero ha sido verdad</I> –y recordando lo que pas&oacute; el d&iacute;a anterior, le pregunt&oacute;– <I>¿Comprendes ahora por qu&eacute; no quise entrar en la Casa de los Dioses?... Me pareci&oacute; notar que te sorprendiste bastante... pero es que yo no sab&iacute;a que las cosas estaban aqu&iacute; de esta manera. Ahora ya sabes que para m&iacute;, tus Dioses no son como los imaginas.</P>
</I><P ALIGN="JUSTIFY">– <I>D&eacute;jalo</I> –le dijo Lorien–.<I> No ser&iacute;a verdad si te dijera que no me importa. Ni si quiera puedo llegar a creer que la historia del Sauce Llor&oacute;n pueda ser verdad. Pero... debes entender que es as&iacute; como me han educado, con lo que he vivido.</P>
</I><P ALIGN="JUSTIFY">– <I>Pero entonces... </I>–titube&oacute; Aradriel sin atreverse a preguntar.</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute;?</I> –le pregunt&oacute; a su vez Lorien.</P>
<P ALIGN="JUSTIFY">Y Aradriel, sin saber si se estaba acercando demasiado a lo personal, le pregunt&oacute; con inconsistencia en su voz, intentando no volver a herirla:</P>
<P ALIGN="JUSTIFY">– <I>¿Por qu&eacute; estabas llorando?</P>
</I><P ALIGN="JUSTIFY">Lorien se sinti&oacute; un poco afectada al o&iacute;r estas palabras. El deseo de compartir sus ilusiones, sus penas y sus pensamientos, con alguien, le acuciaba desesperadamente. Se enfrentaba al hermetismo que hab&iacute;a desarrollado al no tener nunca a nadie con quien hablar. Pero, como hizo ya una vez en el pueblo, volvi&oacute; a sincerarse con &eacute;l.</P>
<P ALIGN="JUSTIFY">–<I> No ha sido por la historia en s&iacute;</I> –le dijo sonri&eacute;ndole, como para relajar la situaci&oacute;n, y cambiando la expresi&oacute;n a severidad, a&ntilde;adi&oacute;– <I>No s&eacute; si lo podr&aacute;s entender, pero a m&iacute; s&oacute;lo con escuchar algo triste, se me saltan las l&aacute;grimas </I>–y por fin, casi con la voz quebrada, concluy&oacute;– <I>S&eacute; que es una debilidad m&iacute;a, pero es que... </I>– y las l&aacute;grimas volvieron a asolar su rostro.</P>
<P ALIGN="JUSTIFY">– <I>¿Qu&eacute;?</I> –pregunt&oacute; muy suavemente Aradriel.</P>
<P ALIGN="JUSTIFY">Y Lorien, entre sollozos, le respondi&oacute;: </P>
<P ALIGN="JUSTIFY">– <I>Es que siempre tengo presente el recuerdo de mi madre..., y de mi hermano... Con cualquier cosa que me entristezca, me vuelven los recuerdos una y otra vez.</P>
</I><P ALIGN="JUSTIFY">Aradriel se lament&oacute; de haberle hecho esa pregunta, y se sinti&oacute; culpable por la situaci&oacute;n. No sab&iacute;a qu&eacute; hacer. Pero la muchacha consigui&oacute; sobreponerse, y para sorpresa del joven, continu&oacute; abri&eacute;ndole su coraz&oacute;n, cont&aacute;ndole lo que sucedi&oacute; esa noche en que lo perdi&oacute; casi todo, en que los Dioses se ensa&ntilde;aron con ella y su padre. Y mientras Aradriel la escuchaba, notaba c&oacute;mo algo se encend&iacute;a en su coraz&oacute;n, algo que le hizo prometerse a s&iacute; mismo, m&aacute;s tarde, que har&iacute;a lo que fuese necesario para ayudarla, para hacer que cumpliera su sue&ntilde;o de volver a ver a su familia perdida. Aunque sab&iacute;a que era imposible, y que alguien que lo viese, pensar&iacute;a que por qu&eacute; se tomaba los problemas de Lorien como asunto suyo.</P>
<P ALIGN="JUSTIFY">Un poco despu&eacute;s, la lluvia segu&iacute;a cayendo, y cuando Lorien acab&oacute; de hablar, por fin Aradriel accedi&oacute; a ir a su casa, al volv&eacute;rselo a preguntar; m&aacute;s por no herirla tras haberla escuchado, que porque quisiera hacerlo de verdad.</P>
<P ALIGN="JUSTIFY">Aradriel corri&oacute; hacia el sauce llor&oacute;n, recogi&oacute; sus pocas pertenencias, y uni&eacute;ndose a Lorien que lo esperaba bajo el puente, volvieron corriendo. Cuando llegaron a la casa, Orein los estaba esperando, sentado en su butaca y vestido para salir a la tormenta.</P>
<P ALIGN="JUSTIFY">– <I>¡Vaya!, menos mal que hab&eacute;is vuelto. Ya estaba pensando en salir a buscarte, Lorien.</P>
<P ALIGN="JUSTIFY">– Lo siento padre, pero me cost&oacute; mucho trabajo convencerlo de que viniera.</P>
</I><P ALIGN="JUSTIFY">– <I>Vaya, vaya, as&iacute; que no quer&iacute;as venir ¿eh? </I>–dijo jovialmente Orein.– <I>Te ruego que pases aqu&iacute; la noche. Ah&iacute; fuera est&aacute; cayendo una tormenta bastante fuerte como para que est&eacute;s sin techo donde protegerte. Bueno, ahora a descansar. Pero antes quiero conocer tu nombre. El m&iacute;o es Orein.</P>
</I><P ALIGN="JUSTIFY">El joven mir&oacute; a Lorien, y tras unos instantes le dijo:</P>
<I><P ALIGN="JUSTIFY">– Me llamo Aradriel... y le agradezco su ofrecimiento. Y no se preocupe. Ma&ntilde;ana temprano me ir&eacute; y no les molestar&eacute; m&aacute;s.</P>
</I><P ALIGN="JUSTIFY">– <I>¿Pero qu&eacute; est&aacute;s diciendo? </I>–le pregunt&oacute; indignado Orein– <I>Ya veremos lo que nos depara el destino ma&ntilde;ana. Venga, a dormir que es muy tarde. Buenas noches</I> –y mientras sub&iacute;a las escaleras concluy&oacute;–<I> Puedes instalarte en el cuarto de abajo que prefieras, y hay ropa que te quedar&aacute; bien, en los armarios de la entrada.</P>
</I><P ALIGN="JUSTIFY">Y desapareci&oacute; por el pasillo superior tras subir las escaleras.</P>
<P ALIGN="JUSTIFY">– <I>Gracias, se&ntilde;or</I> –acert&oacute; a responder Aradriel, cuando Orein ya hab&iacute;a desaparecido. </P>
<P ALIGN="JUSTIFY">Aradriel mir&oacute; a Lorien, como para disculparse por no hab&eacute;rselo dicho antes, pero ella le dijo con una sonrisa:</P>
<P ALIGN="JUSTIFY">– <I>No te preocupes, te ha o&iacute;do.</P>
</I><P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Despu&eacute;s, Lorien condujo al joven a una habitaci&oacute;n, y a &eacute;ste le pareci&oacute; de lo m&aacute;s apropiada: hac&iacute;a mucho tiempo que no dorm&iacute;a bajo un techo. Le trajo ropa seca y se despidi&oacute; de &eacute;l.</P>
<I><P ALIGN="JUSTIFY">– Buenas noches, Aradriel.</P>
<P ALIGN="JUSTIFY">– Buenas noches, Lorien..., y gracias por todo.</P>
</I><P ALIGN="JUSTIFY">– <I>Gracias a ti por haberme contado esa historia</I> –a&ntilde;adi&oacute; Lorien–. <I>Pero, dime una cosa... ¿por qu&eacute; estabas bajo el sauce llor&oacute;n, en lugar de resguardarte en otro sitio?</P>
</I><P ALIGN="JUSTIFY">– <I>"¡Otra vez!"</I> –oy&oacute; Aradriel, a una voz quejarse en su interior. Y aflorando de nuevo esa angustia olvidada, mir&oacute; hacia otra direcci&oacute;n, con la frente surcada por l&iacute;neas, fruto del dolor. Pero decidi&oacute; no inventarse ninguna absurda excusa, y termin&oacute; dici&eacute;ndole–<I> No s&eacute; explicar por qu&eacute;, es absurdo, lo s&eacute;, pero... prefiero olvidarlo.</P>
</I><P ALIGN="JUSTIFY">Incluso a Lorien le afect&oacute; la respuesta, y como si intentara reconfortar a Aradriel, bajando la mirada, le dijo:</P>
<P ALIGN="JUSTIFY">– <I>Perdona. No sab&iacute;a que te ibas a sentir as&iacute;... de todas formas, gracias por escucharme. </P>
</I><P ALIGN="JUSTIFY">Pero antes de que Aradriel le respondiera, cerr&oacute; tras de s&iacute; la puerta, con una delicadeza, que no correspond&iacute;a a la velocidad con que lo hizo.</P>
<P ALIGN="JUSTIFY">– <I>"Buenas noches, Lorien"</I> –repiti&oacute; en su pensamiento, Aradriel.– <I>"Ojal&aacute; pueda hacer algo por ti" </I>–y dese&oacute; que alguien pensase lo mismo por &eacute;l.</P>
<P ALIGN="JUSTIFY">Lorien subi&oacute; a su cuarto, con una esperanza que nunca antes hab&iacute;a sentido, esperanza que anim&oacute; su coraz&oacute;n. Hab&iacute;a encontrado un amigo.</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







