<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>E</B></font><FONT color="#000000" size=7 face="arial"><B>l Rinc&oacute;n de las Historias</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=3 face="arial"><B>acedonia de Ocio</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>F</B></font><FONT color="#000000" size=2 face="arial"><B>antas&iacute;a &Eacute;pica</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>R</b></font><FONT color="#000000" size=2 face="arial"><b>elato escrito por<br>
<a href="mailto:aradriel@geocities.com">Jose Antonio Suárez "Aradriel"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<font face=arial>
<H3>
Serind&euml;l.<br>
Cap&iacute;tulo 3. El Sauce Llor&oacute;n.
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">
Durante el atardecer, las nubes que aparecieron entre las monta&ntilde;as, nubes grises que se desplazaban lentamente como si fuera un mal presagio convertido en bruma que oscurec&iacute;a la luz del Sol, fueron cubriendo todo el cielo. Cielo que parec&iacute;a como si se sintiese invadido, y su intenso azul se demacraba en un tambi&eacute;n gris, como si anunciara su duelo por el dolor.</P>
<P ALIGN="JUSTIFY">Cay&oacute; la noche y el cielo amenazaba tormenta. </P>
<P ALIGN="JUSTIFY">Ninguna estrella consegu&iacute;a atravesar con su resplandor el velo que cubr&iacute;a la creaci&oacute;n de Ara, mientras que la luz que la Luna Seriant consegu&iacute;a filtrar, hac&iacute;a crear unas sombras fantasmag&oacute;ricas a todo lo que se atreviera a existir, envolvi&eacute;ndolo en f&uacute;nebres presagios.</P>
<P ALIGN="JUSTIFY">All&aacute; a lo lejos se ve&iacute;a la Maldita, haciendo parecer que vomitaba esas nubes para dominar y acrecentar el p&aacute;nico de los mortales, para sumir a los humanos en el temor. Y sobre todo, para recordarles el motivo de su existencia: la fuerza de sus Dioses.</P>
<P ALIGN="CENTER">* * *</P>
<P ALIGN="JUSTIFY">Aradriel estaba apoyado sobre un &aacute;rbol, un Sauce Llor&oacute;n. Sus ramas curvadas hacia el r&iacute;o tocaban su superficie y sus peque&ntilde;as hojas desprend&iacute;an juventud por el nacimiento reciente. Durante unos momentos las nubes se abrieron, haciendo parecer que Seriant se abr&iacute;a hueco entre ellas con su poder para iluminarlo. Y se pudo ver que las gr&aacute;ciles e inocentes j&oacute;venes ramas que el Sauce Llor&oacute;n mec&iacute;a sobre el r&iacute;o, en ocasiones tocaban la superficie, para inmediatamente retirarse, como si no quisieran borrar el reflejo de Seriant del espejo que formaban las aguas.</P>
<P ALIGN="JUSTIFY">Aradriel sonri&oacute; con tristeza compartida al ver ese movimiento furtivo. </P>
<P ALIGN="JUSTIFY">Movimiento oculto a los Dioses, en el que el &aacute;rbol intentaba llegar a Seriant, pero que no se atrev&iacute;a a alcanzar por miedo hacerla desaparecer.</P>
<P ALIGN="JUSTIFY">&Eacute;l conoc&iacute;a muy bien su historia, el por qu&eacute; de esa extra&ntilde;a situaci&oacute;n en que Seriant luchaba por iluminar al Sauce Llor&oacute;n y &eacute;ste intentaba tocar su reflejo temiendo deshacerlo. Y record&oacute; el por qu&eacute;. Y record&oacute; la Leyenda del Sauce Llor&oacute;n. Cuyas palabras rememor&oacute; Aradriel en su mente y que comenzaba as&iacute;:</P>
<P ALIGN="JUSTIFY">«En una inmensa extensi&oacute;n de tierra, donde los hombres a&uacute;n no hab&iacute;an conseguido corromper su vida y su belleza, un bosque gigantesco se impon&iacute;a, rivalizando con su verdor contra el azul m&aacute;s intenso que el cielo pod&iacute;a crear. El bosque estaba formado por infinidad de especies, a cu&aacute;l m&aacute;s hermosa, y todas ellas crec&iacute;an intentando imponerse a las dem&aacute;s, pero sin destruirse mutuamente. Ese vergel de vida se extend&iacute;a desde el borde del mar hasta las monta&ntilde;as que formaban la espina dorsal del continente, a cientos de jornadas de cualquier sitio que no fuera el propio bosque.</P>
<P ALIGN="JUSTIFY">Los m&aacute;s numerosos eran los m&aacute;s antiguos, los Robles, y tambi&eacute;n en gran n&uacute;mero estaban las Secoyas con sus gigantescas ramas y sus extra&ntilde;as ra&iacute;ces, y los Pinos con su elegancia, junto a los Abetos y su dulzura, los Tilos y la belleza de sus hojas, los Abedules y la blancura de sus troncos, y los delgad&iacute;simos Eucaliptos, creaciones todos ellos del Dios de los &aacute;rboles, LeSarb, adem&aacute;s de much&iacute;simos otros, oscurecidos por sus esplendores. Pero por encima de todos ellos destacaban los Sauces. </P>
<P ALIGN="JUSTIFY">Eran altivos, esbeltos, los &uacute;nicos que pod&iacute;an rivalizar en altura con los Robles. Ten&iacute;an un tronco recio pero suave, y de sus ramas colgaban sus peque&ntilde;as pero bellas hojas, envidia de todos sus vecinos, pero envidia sin rencor, a diferencia de los humanos.</P>
<P ALIGN="JUSTIFY">Estaban situados en el lugar m&aacute;s privilegiado del bosque. En una colina que hac&iacute;a que sobresalieran de todos los dem&aacute;s, a&uacute;n m&aacute;s. Pero toda su altivez y arrogancia hac&iacute;a que los m&aacute;s peque&ntilde;os de su especie apenas tuvieran oportunidades de crecer y alcanzar a sus mayores, porque tal era la altura que alcanzaban los m&aacute;s viejos, que apenas llegaban hasta los peque&ntilde;os los rayos del Sol que necesitaban para crecer y vivir. Casi ninguno consegu&iacute;a llegar al techo de sus hermanos, pero el que lo consegu&iacute;a lo hac&iacute;a por ser el m&aacute;s fuerte de su generaci&oacute;n... aunque tambi&eacute;n el &uacute;nico que quiz&aacute;s hab&iacute;a sobrevivido.</P>
<P ALIGN="JUSTIFY">Ocurri&oacute; una vez que uno de &eacute;stos j&oacute;venes Sauces consigui&oacute; alcanzar una ma&ntilde;ana al resto de sus mayores, y cuando se asom&oacute; estir&aacute;ndose lo m&aacute;s posible que le permit&iacute;a su tronco, qued&oacute; perplejo ante el espect&aacute;culo que ten&iacute;a ante sus ojos: toda una gigantesca extensi&oacute;n de verdor se expon&iacute;a ante su vista. Todo era espesura de color verde intenso cuando su mirada se acercaba a las monta&ntilde;as y p&aacute;lida cuando se perd&iacute;a en el horizonte. Tambi&eacute;n pudo ver una formaci&oacute;n muy extra&ntilde;a de figuras geom&eacute;tricas y blancas, muy cercas las unas de las otras, de alguna de las cuales sal&iacute;a una especie de neblina negra. Pero ante la belleza que se extend&iacute;a, no le hizo el menor caso. Durante el resto del d&iacute;a no dej&oacute; de re&iacute;r y cantar, contento de poder recibir en sus hojas la luz y el calor del Sol, de no tener que pensar si al d&iacute;a siguiente tendr&iacute;a las suficientes fuerzas para crecer un poco m&aacute;s, y de si alcanzar&iacute;a el sue&ntilde;o de llegar hasta sus hermanos mayores. Todos sus sue&ntilde;os se hab&iacute;an cumplido y al no tener que pensar m&aacute;s en su propia existencia, creyendo que ya todas las dificultades hab&iacute;an acabado para &eacute;l, se sent&iacute;a feliz. Pero eso no era lo que hab&iacute;an decidido los Dioses para &eacute;l. Al llegar la tarde se qued&oacute; dormido por el cansancio producido por tantas impresiones y durmi&oacute; feliz y tranquilo. </P>
<P ALIGN="JUSTIFY">Poco a poco, la luz del Sol fue dejando paso a la oscuridad para que despu&eacute;s naciera la Noche con la salida de Luna. Un poco m&aacute;s tarde de la medianoche se despert&oacute;, y al abrir los ojos de su alma, no pudo creer lo que ve&iacute;a. Tanta belleza era imposible que pudiera existir reunida en un solo ser.</P>
<P ALIGN="JUSTIFY">Sent&iacute;a c&oacute;mo su luz ba&ntilde;aba todo su cuerpo y c&oacute;mo su tibia frialdad le llegaba hasta el coraz&oacute;n. ¿Pero qu&eacute; era lo que sent&iacute;a?, ninguno de sus hermanos le hab&iacute;a contado que existiese algo as&iacute;, nadie le advirti&oacute; que exist&iacute;a un ser cuya sola presencia se apoderaba del alma del que lo mirase.</P>
<P ALIGN="JUSTIFY">Estuvo durante mucho tiempo absorto en sus pensamientos, intentando comprender qu&eacute; hab&iacute;a pasado. Desde el momento en que sali&oacute; de su trance, supo que se hab&iacute;a enamorado, no sab&iacute;a por qu&eacute;, y algo comenz&oacute; a despertarse en su interior, algo que hab&iacute;a estado siempre dormido junto a &eacute;l, pero que no sinti&oacute; hasta entonces. Se dio cuenta de que era un &aacute;rbol, pero no pod&iacute;a comprender por qu&eacute; en ese momento se hab&iacute;a preguntado qu&eacute; es lo que era &eacute;l mismo. Hasta entonces simplemente era un Sauce, pero se dio cuenta horrorizado de que sab&iacute;a que no siempre hab&iacute;a sido as&iacute;, y a medida que pasaba el tiempo, comenz&oacute; a comprender porqu&eacute; cuando la vio se qued&oacute; asombrado, por qu&eacute; sinti&oacute; una punzada de dolor extra&ntilde;o que recorri&oacute; todo su cuerpo. Esto sab&iacute;a que iba en contra de la Naturaleza, un &aacute;rbol no pod&iacute;a enamorarse, pero as&iacute; fue, y m&aacute;s extra&ntilde;o a&uacute;n de quien lo hizo, de la Luna. Se qued&oacute; toda la noche despierto, maravillado, contempl&aacute;ndola extasiado, hasta que lleg&oacute; el d&iacute;a y se perdi&oacute; entre las monta&ntilde;as. </P>
<P ALIGN="JUSTIFY">La p&eacute;rdida de su visi&oacute;n, le debilit&oacute; tanto el &aacute;nimo, que unido a su cansancio, se qued&oacute; dormido hasta el siguiente anochecer. Cuando volvi&oacute; a aparecer estuvo toda la noche contempl&aacute;ndola, intentando comprender por qu&eacute; se sent&iacute;a tan feliz y a la vez tan profundamente triste cuando la miraba, y de nuevo se durmi&oacute; al desaparecer lo que se hab&iacute;a convertido en su &uacute;nica ilusi&oacute;n en la vida. Ya no le importaba todo el esfuerzo que le hab&iacute;a costado llegar hasta donde estaba, ya no le importaba nada, no se sent&iacute;a como un &aacute;rbol, se sent&iacute;a como...</P>
<P ALIGN="JUSTIFY">– <I>"¡No!, es imposible..."</I>– s&oacute;lo le importaba ella.</P>
<P ALIGN="JUSTIFY">As&iacute; pas&oacute; el tiempo, y cada d&iacute;a que transcurr&iacute;a se encontraba m&aacute;s angustiado. Sent&iacute;a el deseo de ir tras ella cuando la ve&iacute;a desplazarse por el cielo. Sus hermanos le dec&iacute;an que as&iacute; no pod&iacute;a vivir, que necesitaba la luz del Sol, que no pod&iacute;a dormir durante el d&iacute;a para pasar la noche despierto contemplando a la Luna. Pero sus hermanos no pod&iacute;an comprenderlo puesto que ninguno de ellos hab&iacute;a estado enamorado nunca ni sab&iacute;an lo que se sent&iacute;a. Ellos eran simples &aacute;rboles. &Eacute;l era algo m&aacute;s. Poco a poco el esbelto y alegre Sauce fue perdiendo su esplendor y una noche en la que hab&iacute;an aparecido unas largas y blancas nubes por el horizonte, no pudo contenerse m&aacute;s. Y por segunda vez sucedi&oacute; de nuevo algo incre&iacute;ble en el bosque. Impulsado por el deseo de su coraz&oacute;n de seguir a su amada, y de saber la verdad de lo que le pasaba, arranc&oacute; sus ra&iacute;ces... y consigui&oacute; moverse. </P>
<P ALIGN="JUSTIFY">Todos los dem&aacute;s &aacute;rboles se quedaron horrorizados ante lo que vieron y le gritaban en su idioma para que volviera a hundir sus ra&iacute;ces en el suelo, porque de no hacerlo, en poco tiempo morir&iacute;a. Pero &eacute;l no escuchaba a nadie; ya s&oacute;lo pensaba en ella. Entonces, ante un desaf&iacute;o tan grande a las leyes de la Naturaleza, LeSarb convoc&oacute; a sus hermanos los Dioses, que estaban esperando durante varios siglos que esto pasara, y contentos de su triunfo, al ver que el alt&iacute;simo Sauce lograba desplazarse como si de un humano se tratase, caminando sobre sus ra&iacute;ces a modo de piernas, cada vez que consegu&iacute;a con mucho esfuerzo dar un paso hacia adelante, la Luna se alejaba de &eacute;l. El Sauce volv&iacute;a a conseguir dar otro paso y Seriant se volv&iacute;a a alejar un poco m&aacute;s, as&iacute; su dolor aumentaba al darse cuenta de que no se acercaba a ella, y a cada paso que daba se alejaba m&aacute;s, y m&aacute;s. </P>
<P ALIGN="JUSTIFY">En esta situaci&oacute;n, una conciencia se termin&oacute; de despertar en el Sauce y empez&oacute; a asimilar lo que estaba ocurriendo, pero cada vez se encontraba m&aacute;s d&eacute;bil. Pero consigui&oacute; atravesar una parte del bosque en su locura, para llegar hasta un r&iacute;o. </P>
<P ALIGN="JUSTIFY">Entonces supo qui&eacute;n era, entonces comprendi&oacute; que la venganza de sus Dioses se cumpli&oacute; a&uacute;n despu&eacute;s de la muerte. Mir&oacute; hacia arriba y en vez de ver a la Luna, vio a su amada, vio a Seriant.</P>
<P ALIGN="JUSTIFY">La ve&iacute;a como ese d&iacute;a en que tuvo que renunciar a ella. El d&iacute;a en que despu&eacute;s perjur&oacute; contra su Dios de anta&ntilde;o y sus hermanos. Hermanos que despu&eacute;s aceptaron a los humanos como suyos. El final para el Sauce estaba cerca. Durante un momento debido a su debilidad, perdi&oacute; la visi&oacute;n y fue lo que aprovecharon los Dioses para ejecutar su maldad. Al volver a levantar el Sauce con un alma de humano atrapada en su corteza, su mirada, no la vio. Y en sus desvar&iacute;os no pudo entender c&oacute;mo hab&iacute;a desaparecido. En realidad segu&iacute;a en el mismo sitio, pero estaba oculta por las nubes para la vista mortecina del Sauce. Durante unos momentos no supo qu&eacute; hacer, hasta que sin darse cuenta, las nubes se apartaron y mientras &eacute;l miraba hacia el r&iacute;o, la vio all&iacute;. No pod&iacute;a caber en s&iacute; de alegr&iacute;a; pens&oacute; que hab&iacute;a llegado all&iacute; para &eacute;l, que su Seriant hab&iacute;a bajado por fin para reunirse con &eacute;l, que podr&iacute;a estar de nuevo cerca de ella, tocarla, sentirla por segunda vez.</P>
<P ALIGN="JUSTIFY">Entonces lo comprendi&oacute; todo. Aunque la idea de estar dentro del tronco de un &aacute;rbol no le permitir&iacute;a reconocerlo, ella podr&iacute;a comprender. Sab&iacute;a que su compa&ntilde;era estaba cerca de &eacute;l y que por fin estar&iacute;an juntos para siempre. Otra vez podr&iacute;a estar con ella y esta vez revelarle su amor. Se volvi&oacute; loco. El Sauce ya no ve&iacute;a a la Luna reflejada en el agua del r&iacute;o, ve&iacute;a a Seriant, la mujer que se sacrific&oacute; en su memoria. </P>
<P ALIGN="JUSTIFY">Con mucho esfuerzo se acerc&oacute; hasta la orilla y antes de que algo pudiera suceder, como si tuviera miedo de que el sue&ntilde;o se desvaneciese, hundi&oacute; sus ramas en el agua para llegar a ella, pero s&oacute;lo consigui&oacute; que el reflejo de Seriant desapareciese. En ese momento las nubes consiguieron ocultarla de nuevo pero el Sauce que continuaba mirando sus manos no pod&iacute;a concebir lo que pensaba que hab&iacute;a hecho, ¿d&oacute;nde estaba?, ¡la hab&iacute;a hecho desaparecer! ¡La hab&iacute;a perdido de nuevo!. Y el castigo de los Dioses se consum&oacute;. Pero Dharmsqui, ante la pasividad de su hermano LeSarb creador de los &aacute;rboles, se apiad&oacute; de &eacute;l por su anterior vida, e hizo que sus ra&iacute;ces se hundieran en la tierra. Y el Sauce fue perdiendo la movilidad de sus ramas, con lo que qued&oacute; con ellas hundidas en las aguas del r&iacute;o. </P>
<P ALIGN="JUSTIFY">El sauce no sab&iacute;a por qu&eacute; hab&iacute;a sucedido, s&oacute;lo sab&iacute;a que hab&iacute;a sido el culpable de su muerte por segunda vez.</P>
<P ALIGN="JUSTIFY">Ning&uacute;n ser en todos los mundos que se crearon, pudo sentir tanta tristeza en su coraz&oacute;n como sinti&oacute; ese alma de humano encerrada en un Sauce. Sus ojos se llenaron de l&aacute;grimas, los ojos de su alma, su dolor no ten&iacute;a l&iacute;mites, no pod&iacute;a hacer otra cosa que llorar por ella y odi&aacute;ndose a s&iacute; mismo por lo que hab&iacute;a hecho. Supo entonces que el castigo que le fue impuesto una vez, se hab&iacute;a consumado, y del que ni siquiera la muerte lo pudo librar.</P>
<P ALIGN="JUSTIFY">Estaba solo. No hab&iacute;a nadie cerca de &eacute;l. No estaban sus amigos de anta&ntilde;o, no estaban Arail, ni Alb&aacute;rian, ni AmhIori&oacute;n, ni Verniad, ni siquiera Treniam. Nadie.</P>
<P ALIGN="JUSTIFY">– <I>"No me queda nadie..." </P>
</I><P ALIGN="JUSTIFY">Sus antiguos hermanos estaban lejos y los &aacute;rboles que lo rodeaban lo ignoraban, temiendo por sus propias vidas, asustados de lo que hab&iacute;an visto. Y &eacute;l s&oacute;lo pod&iacute;a llorar, llorar con el alma. Tantas l&aacute;grimas derram&oacute; que sus ojos fueron perdiendo poco a poco su vida. Su alma fue perdiendo poco a poco su ilusi&oacute;n, la energ&iacute;a de la que se alimentaban todas las almas. Pero no le importaba. No quer&iacute;a seguir viviendo, no si no pod&iacute;a estar con ella, y sab&iacute;a que as&iacute; ser&iacute;a para siempre. Ellos se encargar&iacute;an de que as&iacute; fuese.</P>
<P ALIGN="JUSTIFY">Durante varios d&iacute;as sigui&oacute; hundi&eacute;ndose y llorando, pero no volvi&oacute; a verla porque los Dioses se la ocultaron para siempre. Finalmente, los ojos de su alma no pudieron resistir tanto castigo y perdi&oacute; la vista. Y su vida fue apag&aacute;ndose. S&oacute;lo resistiendo a la muerte y llevando a su consciencia un m&iacute;sero alivio perturbador, cuando por la noche sent&iacute;a de nuevo la caricia de la luz de Seriant ba&ntilde;ar sus hojas y su rostro, pensando que era un recuerdo que su locura le hac&iacute;a sentir de forma tan real. Y viviendo de ese recuerdo sobreviv&iacute;a. </P>
<P ALIGN="JUSTIFY">Sus ramas y su tronco poco a poco fueron curv&aacute;ndose presas del dolor y el sufrimiento, hasta que lo que antes era un esbelto Sauce se convirti&oacute; en un &aacute;rbol ca&iacute;do, con las ramas hacia abajo. Y as&iacute;, un &aacute;rbol que antes fue Sauce muri&oacute;, para que naciera el Sauce Llor&oacute;n. Un &aacute;rbol con el alma de una mujer en su pensamiento y con la de un hombre en sus entra&ntilde;as. Un hombre que un d&iacute;a se llam&oacute; Firiam.»</P>

<hr>
<ul>
<li><a href="rdhser00.htm">Introducci&oacute;n.</a></li>
<li><a href="rdhser01.htm">Cap&iacute;tulo 1. Seriant.</a></li>
<li><a href="rdhser02.htm">Cap&iacute;tulo 2. Lorien.</a></li>
<li><a href="rdhser03.htm">Cap&iacute;tulo 3. El Sauce Llor&oacute;n.</a></li>
<li><a href="rdhser04.htm">Cap&iacute;tulo 4. Orein.</a></li>
<li><a href="rdhser05.htm">Cap&iacute;tulo 5. Historias.</a></li>
<li><a href="rdhser06.htm">Cap&iacute;tulo 6. Recuerdos.</a></li>
<li><a href="rdhser07.htm">Cap&iacute;tulo 7. El pasado.</a></li>
<li><a href="rdhser08.htm">Cap&iacute;tulo 8. El final de la historia.</a></li>
<li><a href="rdhser09.htm">Cap&iacute;tulo 9. Un error.</a></li>
<li><a href="rdhser10.htm">Cap&iacute;tulo 10. Volver para recordar.</a></li>
<li><a href="rdhser11.htm">Cap&iacute;tulo 11. Venganza.</a></li>
<li><a href="rdhser12.htm">Cap&iacute;tulo 12. Despedida.</a></li>
<li><a href="rdhser13.htm">Cap&iacute;tulo 13. El lobo negro y el &aacute;rbol blanco.</a></li>
<li><a href="rdhser14.htm">Cap&iacute;tulo 14. Sild&euml;n de Eslariot.</a></li>
</ul>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rdhis.htm"><font FACE="ARIAL"><B>[El Rinc&oacute;n de las Historias]</B></font></a> <hR>
<A HREF="rdhisb.htm"><font FACE="ARIAL"><B>[Fantas&iacute;a &Eacute;pica]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">EL RINCON DE LAS HISTORIAS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







