<HTML>
<HTML>
<BODY BGCOLOR="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>ula Macedo<FONT COLOR="#CC0000">n</FONT>ia</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>rtículos Sobre Redes</B><HR>
<FONT COLOR="#009933" size=3 face="arial"><B>I</B></font><FONT color="#000000" size=2 face="arial"><B>ntroducción</B>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aalmansas.valeoclimati@nexo.es">Andrés Almansa</A>
</b></FONT>
<br><br>

</p>
<FONT color="#000000" face=arial><br><br><br>
<H3>Introducción a las redes (II).
</H3>
<P ALIGN=justify><FONT SIZE=2 face=arial>
Siguiendo el hilo  del art&iacute;culo anterior, continuaremos con el apasionante mundo de las redes estableciendo una serie de conceptos y t&eacute;rminos gen&eacute;ricos que se aplican a todo tipo de redes de comunicaciones, partiendo de una serie de premisas b&aacute;sicas de transmisi&oacute;n de datos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">B&aacute;sicamente habr&iacute;a en primer lugar que mencionar el <B>Canal de Comunicaci&oacute;n </B>que fundamentalmente establece un trayecto de comunicaci&oacute;n entre dos o m&aacute;s dispositivos. Si hablamos  de un ordenador personal podemos pensar en los canales de comunicaci&oacute;n existentes entre por ejemplo el procesador y alg&uacute;n otro dispositivo interno (memoria, Unidades de E/S, etc.)  pero en el &aacute;mbito de las telecomunicaciones utilizaremos otras formas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En transmisi&oacute;n de datos podemos hablar de <B>se&ntilde;ales digitales</B> y <B>se&ntilde;ales anal&oacute;gicas</B>, si hablamos de <B>se&ntilde;ales digitales, estas son transmitidas a trav&eacute;s de un medio utilizando la representaci&oacute;n de los d&iacute;gitos binarios, los cuales son enviados como pulsos el&eacute;ctricos. As&iacute; pues se establecen dos voltajes uno positivo (el 1 binario) y otro negativo (el 0 binario).</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">En las <B>se&ntilde;ales anal&oacute;gicas</B>, <B>podemos hablar de energ&iacute;a en movimiento, ondas sonoras que  hacen vibrar el aire por el cual se propagan, estas ondas son medidas por sus frecuencias en ciclos por segundo o hertzios (Hz).</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los datos transmitidos por el ordenador se <B>codificar&aacute;n </B>en el caso de conversi&oacute;n a se&ntilde;al digital o bien se utilizar&aacute;n <B>t&eacute;cnicas de modulaci&oacute;n</B> en el caso de conversi&oacute;n a se&ntilde;al anal&oacute;gica.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Existen dos importantes conceptos sobre transmisi&oacute;n, <B>transmisi&oacute;n en banda base y en banda ancha</B>.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La transmisi&oacute;n <B>en banda base</B> es utilizada en las redes como Ehternet y Token-Ring , donde los pulsos el&eacute;ctricos se aplican directamente al cable y se usa todo el espectro de se&ntilde;al del mismo, es decir que transmiten tan solo una se&ntilde;al a la vez, lo cual implica que cada vez que se establece una comunicaci&oacute;n entre dos dispositivos se utiliza todo el ancho de banda del cable, lo cual supone que todos los sistemas <B>transmiten por turnos, </B>solo un sistema transmite en un momento determinado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La transmisi&oacute;n <B>en banda ancha</B> por el contrario utiliza t&eacute;cnicas de modulaci&oacute;n, es decir las se&ntilde;ales se modulan con distintas frecuencias &quot;portadoras&quot; separadas dividi&eacute;ndose el ancho de banda en varios canales de comunicaci&oacute;n ocupando cada uno de ellos un grupo de frecuencias concreto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para poder compartir el medio f&iacute;sico por distintos canales l&oacute;gicos de comunicaci&oacute;n, se utilizan las llamadas t&eacute;cnicas de multiplexaci&oacute;n, y las m&aacute;s comunes son dos.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Multiplexaci&oacute;n por divisi&oacute;n de frecuencia (FDM), </B>en la cual cada se&ntilde;al de datos se modula en una portadora de se&ntilde;ales diferentes, cada canal usa un rango de frecuencias y estas se dividen para un canal en bandas estrechas, y estas a su vez transportan una se&ntilde;al de transmisi&oacute;n diferente. , en definitiva es como si para cada se&ntilde;al se utilizara un trocito de ancho de banda.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Multiplexaci&oacute;n por divisi&oacute;n en el tiempo (TDM), </B>se usa en banda base, y se identifican como un flujo de tramas con intervalos regulares de tiempo asignados, es decir que en un una unidad de tiempo determinada un canal tiene el medio a su disposici&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La <B>multiplexaci&oacute;n inversa</B> es otra de las t&eacute;cnicas utilizadas en algunas ocasiones, se basa b&aacute;sicamente en la divisi&oacute;n de grupos de datos de alta velocidad en m&uacute;ltiples flujos de datos de baja velocidad, m&aacute;s que nada con la finalidad de ahorro econ&oacute;mico en cuanto a alquiler de l&iacute;neas de alta velocidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero realmente la multiplexaci&oacute;n no optimiza el uso de las l&iacute;neas de transmisi&oacute;n y es por ello que existe otra t&eacute;cnica llamada <B>multiplexaci&oacute;n estad&iacute;stica por divisi&oacute;n en el tiempo (SDTM)</B>, la cual trata aquellos intervalos de tiempo desperdiciados por aquellas estaciones que no transmiten y que est&aacute;n previamente asignadas para utilizar dicho intervalo de tiempo, y es ah&iacute; donde los multiplexores estad&iacute;sticos eliminan esos tiempos muertos de no transmisi&oacute;n.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Cambiando un poco de tercio llegamos a los <B>sistemas de cableado</B>, uno de los temas importantes para los responsables y administradores de redes, cada vez m&aacute;s el equipamiento y la instalaci&oacute;n del cableado a de cumplir una serie de normas y requerimientos que deben ser estudiados y analizados antes de ser implementados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En todo el entramado del cableado deberemos de tener en cuenta cuestiones sobre la transmisi&oacute;n de datos, caracter&iacute;sticas el&eacute;ctricas y la topolog&iacute;a a utilizar, pero en primer lugar vamos a ver que tipos de cables nos podemos encontrar.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Hay que saber en primer lugar que los <B>medios de transmisi&oacute;n de datos pueden ser de dos maneras: guiados y  no guiados</B>. En el caso de los medios guiados estamos hablando de cables met&aacute;licos (cobre, aluminio, fibra &oacute;ptica, etc), se instalan normalmente en los edificios, por conductos protegidos o subterr&aacute;neos. Estos pueden presentar generalmente <B>dos tipos de estructuras, la coaxial o de par trenzado,</B> siendo el cobre el material m&aacute;s utilizado como el elemento central de transmisi&oacute;n, tambi&eacute;n tenemos<B> la fibra &oacute;ptica constituida principalmente por hebras de pl&aacute;stico o fibra de vidrio.</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Por otro lado nos encontramos con los <B>medios no guia</B>dos, donde estar&iacute;amos hablando de las t&eacute;cnicas de transmisi&oacute;n de las se&ntilde;ales a trav&eacute;s del aire y del espacio, evidentemente entre el transmisor y el receptor<B>, transmisiones por infrarrojos y microondas</B> se pueden poner como ejemplo. Existen por ejemplo tambi&eacute;n las <B>redes inal&aacute;mbricas, las comunicaciones m&oacute;viles y como no, las telecomunicaciones v&iacute;a sat&eacute;lite.</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Dentro de los distintos tipos de cables nos encontramos el <B>cable coaxial</B>, este es normalmente utilizado para la conexi&oacute;n en redes de topolog&iacute;a en bus, como lo eran <B>ARCNET y Ethernet</B> en sus inicios, tambi&eacute;n se utiliza en los entornos mainframe para la conexi&oacute;n de los terminales &quot;tontos&quot; a las controladoras de comunicaciones. Se pueden distinguir por su grosor como por ejemplo los <B>RG-8/RG-11 y por los finos RG-58/RG-62</B>, similares a los cables coaxiales que se utilizan  en la televisi&oacute;n. B&aacute;sicamente est&aacute;n formados por un n&uacute;cleo central de hilo de cobre recubierto con hilos de cobre trenzado u hojas met&aacute;licas, lo que protege la radiaci&oacute;n de las se&ntilde;ales internas de las externas, con estos cables podemos alcanzar velocidades de hasta 500 Mbps.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los <B>cables de par trenzado </B>son utilizados en una gran diversidad de redes de &aacute;rea local, y de hecho son los m&aacute;s utilizados actualmente, ya que est&aacute;n normalizados, tienen un relativo bajo coste, y permiten adaptarse a una gran variedad de tecnolog&iacute;as. Est&aacute;n constituidos por dos o m&aacute;s hilos de cobre aislados, entrelazados uno alrededor del otro por pares, formando cada uno de estos pares un circuito por el cual se transmiten datos. Podemos encontrarnos con cable de par trenzado <B>no apantallado y apantallado</B>, el <B>no apantallado</B> llamado <B>UTP (Unshielded Twisted Pair)</B> es el m&aacute;s utilizado, aunque no hace unos a&ntilde;os atr&aacute;s, puesto que entonces era el <B>apantallado STP (Shielded Twisted Pair)</B>, que hoy se sigue utilizando en algunas instalaciones, sobre todo porque proteje frente a la diafon&iacute;a, aunque es realmente el trenzado el que nos previene contra los problemas de interferencias. Los cables de par trenzado se diferencian seg&uacute;n las llamadas <B>categor&iacute;as</B>, siendo las m&aacute;s usuales:</P>
<P ALIGN="JUSTIFY"></P>

<UL>
<B><P ALIGN="JUSTIFY"><LI>Categor&iacute;a 1.  </B>No se utiliza para la transmisi&oacute;n de datos, es hilo trenzado que da una calidad suficiente para voz.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Categor&iacute;a 2. </B>Se utilizaban en las primeras LAN,s y podia alcanzar una velocidad de transmisi&oacute;n de 4 Mbits/seg.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Categor&iacute;a 3. </B>Alcanzan una velocidad de transmisi&oacute;n m&aacute;xima de 10 Mbits/seg, y eran generalmente usados para Ethernet 10Base-T.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Categor&iacute;a 4.  </B>Alcanzan los 16 Mbits/seg. Y son utilizados para Token-ring.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Categor&iacute;a 5. </B> Son los m&aacute;s utilizados en la actualidad, soportan de 100 Mbits/seg a 150 Mbits/seg, y son utilizados con la gran mayor&iacute;a de est&aacute;ndares de transmisi&oacute;n (Ethernet, Fast Ehternet, Token-Ring, 100Base VG, FDDI, etc).</LI></P></UL>

<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</B><P ALIGN="JUSTIFY">Actualmente ya podemos encontrarnos con nuevas normativas que hablan de las categor&iacute;as 6 y 7, pero que son temas a tratar aparte.</P>
<P ALIGN="JUSTIFY">Avanzando un poco m&aacute;s nos adentramos en las <B>topolog&iacute;as f&iacute;sicas</B>, estas nos dibujan la distribuci&oacute;n f&iacute;sica de las redes, de haberlas las hay, desde las topolog&iacute;as m&aacute;s simples a las muy complicadas, en las que estar&iacute;amos interconectando diferentes redes con distintas topolog&iacute;as.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">B&aacute;sicamente podemos considerar cinco dise&ntilde;os fundamentales.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Bus. </B>Su principal caracter&iacute;stica es que un &uacute;nico cable conecta a cada una de las estaciones, las se&ntilde;ales son transmitidas a cada una de las estaciones aunque finalmente solo las recibe la estaci&oacute;n a la que van dirigidas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><HR WIDTH="74%" SIZE=1></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/fredes1.gif"></center>
<P ALIGN="CENTER">Ejemplo de configuraci&oacute;n en bus.</P>
<P ALIGN="CENTER"></P>
<P ALIGN="JUSTIFY">Estrella. </B>Las estaciones se conectan a los concentradores, y estos son los encargados de distribuir las se&ntilde;ales, de hecho se realiza una conexi&oacute;n de estaci&oacute;n a concentrador y de este hacia otras estaciones.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/fredes2.gif"></center>
<P ALIGN="CENTER">Ejemplo de configuraci&oacute;n en estrella.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Anillo.</B> De hecho esta topolog&iacute;a se da en unas pocas configuraciones, debido a que el anillo f&iacute;sico real normalmente no existe, ya que estar&iacute;amos hablando de una especie de bus, pero cerrado por los dos extremos, no existen en este caso concentradores ni equipos de interconexi&oacute;n centralizados.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/fredes3.gif"></center>
<P ALIGN="CENTER">Ejemplo de configuraci&oacute;n en anillo.</P>
<P ALIGN="CENTER"></P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="JUSTIFY">Anillo configurado en estrella. </B> Esta topolog&iacute;a es algo m&aacute;s compleja y de hecho a nivel f&iacute;sico estamos hablando de estrella pero las se&ntilde;ales a un nivel l&oacute;gico pasan de una estaci&oacute;n a otra en c&iacute;rculo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/fredes4.gif"></center>
<P ALIGN="center">Ejemplo de configuraci&oacute;n de anillo en estrella.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Estrella / bus. </B>Existe un cable de bus lineal que lo &uacute;nico que hace genralmente es interconectar configuraciones en estrella, evidentemente utilizando concentradores.</P>
<B><P ALIGN="JUSTIFY"><HR ALIGN="LEFT" SIZE=1></B>&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;</P>
<P ALIGN="JUSTIFY"></P>
<center><img src="gif/fredes5.gif"></center>
<B><P ALIGN="CENTER">Ejemplo de configuraci&oacute;n estrella / bus.</P>
<P ALIGN="CENTER"></P>
<P ALIGN="CENTER">&nbsp;</P>
</B><P ALIGN="JUSTIFY">Bien creo que ya esta bien para este segundo cap&iacute;tulo, quedan para el pr&oacute;ximo los m&eacute;todos de acceso al canal, el modelo OSI en las redes locales y los important&iacute;simos est&aacute;ndares de transmisi&oacute;n.</P>

<br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index03.htm"><font FACE="ARIAL"><B>[Aula Macedonia]</B></font></a> <BR>
<HR>
<A HREF="aulal.htm"><font FACE="ARIAL"><B>[Artículos Sobre Redes]</B></font></a><br>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">AULA MACEDONIA</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

