<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>


<FONT color="#000000" face="arial">
<H3>Richard Garriot, el genio del calabozo.</h3>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>

Muchos de vosotros habr&eacute;is jugado a alguno de los juegos de Origin, ya sea
en forma de un Ultima o de un Wing Comander. Pues bien, aqu&iacute; os voy a tratar de
desvelar la figura del que es m&aacute;ximo responsable de
esta compa&ntilde;ia y, ya de paso, uno de los más geniales diseñadores de juegos
de rol del planeta.
PC.
<br>
<br>
Richard Garriot es el m&aacute;ximo responsable de la serie Ultima y del descubrimiento del que
m&aacute;s tarde se convertir&iacute;a en otro de los pilares de su compa&ntilde;&iacute;a, Chris Roberts. Sin embargo,
aqu&iacute; no voy a hablar de Chris Roberts sino de Origin desde el punto de vista de lo que
ha significado Richar Garriot dentro de su  compa&ntilde;ia y de cómo ha impulsado el concepto de
los juegos de rol con "fundamento". Comenzamos...
<BR>
<br>
<H3>Un dise&ntilde;ador llamado Richard Garriot.</h3>

<P ALIGN=justify>
Cualquier jugador &quot;serio&quot; del g&eacute;nero de los CRPG (Computer Role Play Games), le sonar&aacute;,
sin lugar a dudas, el nombre de Richard Garriot. Quizás los que únicamente se han "molestado" en jugar a sus juegos y no
en investigar al creador que hay detrás de ellos, se hallarán mejor si mencionamos el nombre
de Lord British. Mejor ahora ¿no?.
<br>
<br>
<img src="jpg/rich.jpg" align="left" border=0><p align="justify">
Richard Garriot pertenece a un muy reducido grupo de dise&ntilde;adores de juegos que son capaces de
manejar su creatividad y experiencia para convertir el desarrollo de juegos en una nueva
forma para expresar ARTE. Sí, y con mayúsculas. S&oacute;lo hace falta ver los 
t&iacute;tulos que tiene a sus espaldas este &quot;monstruo&quot; del
software de entretenimiento, para darse cuenta de que no s&oacute;lo dota a sus juegos de todos 
los detalles necesarios para convertirlos en &eacute;xitos de ventas, sino que les
proporciona algo a&uacute;n mucho m&aacute;s importante. Ese "algo mucho más importantes" es la historia, el argumento o la
filosofía que se pretende aportar al producto. No son sólo juegos; son auténticas novelas.
<br>
<br>
¿Que cu&aacute;l es su secreto?. Eso es algo muy simple y complejo a la vez. Garriot siempre
ha hecho lo que ha querido transmitir a los jugadores, es decir, se ha preocupado más de contar
historias que de ofrecer un juego alimentado por las exigencias comerciales imperantes en el mercado. El tiene 
que contar una historia. Esa historia pasa a ser el centro del juego y todo, 
absolutamente todo lo dem&aacute;s, es lo que gira alrededor de esta. Sin importar 
los retrasos de lanzamiento ni las tendencias actuales en el mundo del software. Esto es lo que siempre ha ocurrido
con todos sus juegos. Quizás, la octava parte de la saga pueda considerarse el gran y único error de Garriot.
<br>
<br>
La serie Ultima es, precisamente, la que lleva la bandera de su compa&ntilde;&iacute;a Origin 
(absorvida, por desgracia, por la multinacional Electronics Arts). Esta serie es 
la que principalmente sostiene su genial slogan &quot;We Create Worlds&quot;. Cuando
jugéis a un Ultima, no sólo busquéis divertiros. Intentad encontrar 
tambi&eacute;n la riqueza de su historia y sobre todo lo que nos quiere decir su creador en cada 
momento o situación en la misma. Sabed apreciar lo que apreciais en una buena 
novela épica, cuando jugéis a un juego de este hombre. Merece la pena ese "esfuerzo".
<br>
<br>
<H3>Historia de Origin desde el punto de vista Ultima.</h3>
<P ALIGN=justify>

<img src="gif/inlogo.gif" align="left" border=0><p align="justify">
Si tuviera que decir uno 
de los a&ntilde;os m&aacute;s importantes de la historia de los CRPG me quedaría, sin ninguna duda,
con 1983. Fue en ese a&ntilde;o cuando los hermanos Garriot (Robert y Richard), ayudados por su padre 
(que era astronauta de la NASA), fundaron, en el garaje de su casa de Texas, lo que serían los pilares
de una de las compa&ntilde;&iacute;as m&aacute;s emblem&aacute;ticas que se pueden encontrar dentro del software
de entretenimiento internacional; Origin (si bien no podremos hablar de Origin hasta
el lanzamiento del Ultima III, como veremos m&aacute;s adelante).<br>
<br>
Como todos los comienzos, el de los hermanos Garriot, no fue f&aacute;cil. Pese a 
contar con la ayuda econ&oacute;mica inicial (y vital) de su padre, los medios
existentes por entonces no permitían al creador o desarrollador poder esbozar todo
lo que su mente daba de sí. Esto para un creador de juegos de rol era ciertamente 
"dramático" pues le obligaba a crear juegos que se nutrían, casi al 100%, del factor
combate frente al factor historia. No se podían crear juegos excesivamente complejos. Pese
a todo estos dos hermanos salieron adelante con sus producciones. El papel de los
dos hermanos en la compa&ntilde;&iacute;a estaba perfectamente definido. Robert
Garriot se dedicaba a todo el tema econ&oacute;mico mientras que Richard se dedicaba de lleno 
al apartado de pogramaci&oacute;n y dise&ntilde;o de todos los sus productos.
 
<br>
<br>
El primer lanzamiento de los hermanos Garriot fue el Akalabeth (Una de las piezas
de incalculable valor en el "museo" de los CRPG). Este juego ha había sido 
realizado por Richard tiempo atr&aacute;s, en 1979 más concretamente. Como suele
ser normal, el juego siguió los cánones propios de las producciones de los años
ochenta, es decir, fue creado por pura afici&oacute;n. El Akalabeth, o preludio de
la serie Ultima, estaba totalmente hecho en BASIC y en él predominaba, cómo no, el combate. Curiosamente,
este factor sería el motor principal de los tres primeros títulos de la serie troncal de Ultima.
<br>
<br>
<img src="gif/u1pctitl.gif" align="right" border=0><p align="justify">
Despu&eacute;s del Akalabeth vino lo que fue el primer Ultima. Pese a que el combate era
pieza principal, ya empiezan a aparecer importantes detalles que sirven para ir
poniendo las primeras piezas del universo creado por este hombre. Este primer juego
ya utiliza la perspectiva subjetiva que recuerda, salvando las distancias pertinentes, 
al Wolfenstein 3D de
Id. 
<br>
<br>
Richard se empleará a fondo después del lanzamiento del primer Ultima 
y los Ultima II y III, utilizan programación más sofisticada al utilizarse el 
ensamblador como c&oacute;digo base. Esto mejorará notablemente la calidad técnica
de los mismos, tanto desde el punto de visa de velocidad como de calidad general. 
Los juegos pueden considerarse ya "profesionales&quot;". Otro
hecho a destacar es el de que hasta el Ultima III, Origin no es una 
compa&ntilde;&iacute;a &quot;propiamente
dicha&quot;, es decir, no tiene medios suficientes de distribuci&oacute;n. Esto produjo que
el Ultima II saliera bajo el sello de Sierra. Esta &uacute;ltima y legendaria 
compa&ntilde;&iacute;a le prometio a Richard una caja grande y el, ahora, tradicional 
mapa que acompa&ntilde;a a todos y cada uno de los t&iacute;tulos Ultima. 
Despu&eacute;s de la "ayuda" prestada
por la familia Williams, los hermanos Garriot ganan el suficiente dinero y
popularidad como para poder independizarse y lanzar el 
Ultima III bajo el sello de Origin. Ahora sí que había nacido Origin.
<br>
<br>
<img src="gif/pcexu.gif" border=0 align="left"><p align="justify">
Con el Ultima III se va a cerrar la primera trilog&iacute;a de la serie Ultima y
lo que es m&aacute;s importante, un modo de dise&ntilde;ar juegos. A partir de 
ahora todos los dem&aacute;s Ultima van a dar m&aacute;s importancia al argumento 
y a la historia frente al combate. El Ultima III se puede considerar como el 
asentamiento del universo Ultima. Con la conclusión de este episodio nos encontramos con 
los conceptos de Avatar, Britania y Lord British. Esto permitir&aacute; que el 
Ultima IV suponga un grand&iacute;simo salto adelante permitiendo la consagración de la 
serie Ultima como la m&aacute;s 
importane en el mundo de los juegos de Rol. Baste decir que para la 
creaci&oacute;n del argumento del Ultima IV Richard Garriot emple&oacute; nada
menos que ¡2 a&ntilde;os! (realmente el tiempo invertido no fué para realizar la base
de este juego sino para esbozar, en serio, el universo de Britania e ir ideando los
futuros títulos de la saga que el propio autor contabiliza como si de libros se
trataran). Ni que decir tiene que, en las "escasas" entrevistas concedidas por Garriot, 
siempre que le preguntan por su "Ultima" preferido su respuesta sea "El Ultima IV". 
<br>
<br>
A partir de este momento Richard Garriot &quot;muere&quot; como
programador. Al ganar suficiente dinero puede pagar a programadores
m&aacute;s preparados y comenzar a dirigir su propio equipo de programaci&oacute;n, es decir,
a ejercer de verdad de dise&ntilde;ador.
<br>
<br>
Seguimos avanzando y en el siguiente Ultima aparecen influencias del todopoderoso
Dungeon Master (otro juego de rol que es considerado como uno de los padres
del g&eacute;nero, creador de todas las secuelas del tipo Eye Of The Beholder, etc), 
haciendo que el Ultima V mantenga un gran parecido a esta otra joya de la casa FTL.
 Lógicamente este parecido será a nivel visual pues ambos juegos son muy distintos entre
s&iacute;. La filosofía que rige a ambos no tiene nada que ver. Mientras que en el Dungeon Master predominan los 
problemas de palancas, combate y exploraci&oacute;n, en el Ultima V lo que 
importa es la comunicaci&oacute;n y las acciones que tomes en relación al 
resto de los NPC (Non Player Caracter. O hablando en cristiano, los personajes controlados por el ordenador con los
que tú puedes entablar algún tipo de relación). <br>
<br>
En el Ultima VI se vuelve a cambiar la perspectiva. Con el Ultima VI el
juego alcanza ventas increibles y la serie empieza a crear legiones de
seguidores incondicionales por todo el mundo. Origin pasa de ser una compañía "del montón" 
a ser una de las que marquen la pauta a seguir en el futuro del desarrollo de software
de entretenimiento. Con el Ultima VI se da por concluida la segunda 
trilg&iacute;a, o libro, de la serie.
<br>
<br>
<H4>Wing Commander; hay otra estrella en Origin.</h4>
Pese a que el pilar central de la compa&ntilde;&iacute;as de Texas siempre ha 
sido la serie Ultima, le debe mucho a otro de los genios del desarrollo de juegos; Chris Roberts 
(ahora ya fuera de Origin). 
<br><br>
<img src="jpg/win2.jpg" border=0 align=right>
<p align="justify">Estamos en 1987 y el creador del mundo Wing Commander se une a la compa&ntilde;&iacute;a. Chris 
Roberts es, por aquellas fechas, uno de los mayores talentos del panorama
internacional, no s&oacute;lo por sus habilidades como programador, sino por su
capacidad de &quot;creador de mundos&quot;. De esta forma, en un viaje a Texas, 
Chris ense&ntilde;a un boceto de un juego que estaba dise&ntilde;ando (y que despu&eacute;s ser&iacute;a
Time Of Lore) a un grafista amigo que, casualidad, trabajaba en Origin. Este, a su 
vez, llevó el boceto al mismísimo Richard Garriot que, sin pens&aacute;rselo 
dos veces, contrat&oacute; a Chris Roberts. 
<br>
<br>
Chris Roberts tuvo que dirigir alg&uacute;n tiempo a varios equipos de programaci&oacute;n
dentro de Origin hasta la creaci&oacute;n de lo que supuso una de las obras de
arte de la historia de los juegos. Lógicamente esta obra de arte es Wing Commander. ¡Qué maravilla!. Desde
el punto de vista personal, pocas veces he &quot;vivido&quot; algo similar a lo que experiment&eacute; al jugar mi primera
partida al Wing Commander... La "influencia" del eslogan de 
Origin debió de tener buena parte de la culpa pues Christ creó, desde el primer momento, un universo capaz de plantar
cara a lo que Richard hizo con sus Ultimas. Sencillamente admirable.
<br>
<br>
Llegados a este punto, es muy probablemente que Origin hubiera llegado a 
aquirir el t&iacute;tulo de mejor compa&ntilde;&iacute;a de software del mundo ya que la 
sucesi&oacute;n de buenos y exitosos t&iacute;tulos como fueron las dos partes del
Ultima VII, los Underworld, las siguientes sagas de los Wing Commander, etc, son
tajantes a la hora de ofrecer diversión, originalidad, profundidad y calidad técnica. 
Fueron los juegos de Origin los primeros que comenzaron a desafiar al hardware
existente para los compatibles y, si me apuráis, los primeros que comenzaron ese
"mano a mano" entre las casas desarrolladoras por ofrecer los juegos "técnicamente"
más avanzados (y que dejaban por tierra equipos 286, 386... 486).
<br>
<br>
<img src="gif/u8intro1.gif" align="left" border=0><p align="justify">
Sin embargo en el años de las Olimpiadas, 1992, se produce un hecho que, si bien 
era un secreto a voces, resultó algo decepcionante; EA compra la mayor&iacute;a de 
las acciones de Origin y, aunque est&aacute; &uacute;ltima se va a convertir
en la filial de EA m&aacute;s importante, sus t&iacute;tulos futuros van a perder ese toque
personal de antes. Va a empezar a primar, descaradamente, el aspecto comercial.
Con esto no quiero decir que el talento del fundador se extinguiera. No, ni mucho 
menos, pero...
<br>
<br>
En resumidas cuentas, la historia de Origin hasta nuestros d&iacute;as ha estado 
plagada de &eacute;xitos que han contribuido a asentar las bases de muchos de los
g&eacute;neros que hay en nuestros d&iacute;as sin embargo, y esto es una opini&oacute;n personal,
Origin, en la actualidad, se encuentra demasiado &quot;saturada&quot; para gente de la
talla de Richard Garriot y hasta que Richard no decida cogerse a lo mejor
de su plantilla y marcharse sus t&iacute;tulos no volver&aacute;n a tener la magia de
los primeros.
<BR><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpga.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


