<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>esarrollo de Videojuegos</B></FONT>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>rupos de desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>




<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<FONT color="#000000" size=2 face="arial"><br><br><br>
<FONT color="#000000">        
<H3>Péndulo Studios</h3>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
<table align="left">
<td ><img height=200 WIDTH=200 src="jpg/logopen.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial>

<P align="justify">

El mundo de los videojuegos ha evolucionado much&iacute;simo. Es imposible trazar cualquier tipo de comparaci&oacute;n con el pasado. Si hacemos memoria, muy pocas casas, a lo largo de la historia del software l&uacute;dico, se han especializado en alg&uacute;n tipo de g&eacute;nero en concreto. El mundo de los videojuegos es como cualquier moda, si el g&eacute;nero que ahora &quot;vende&quot; se llama x, no quiere decir que para la pr&oacute;xima temporada se siga llamando as&iacute;. Es duro admitir que no hay nada con suficientes raices y temple para atravesar el paso de los a&ntilde;os y seguir teniendo la misma esencia y seguidores como el primer d&iacute;a (y sino que se lo digan a los aficionados a las conversacionales). Todo cambia. Quiz&aacute;, para cuando esto pueda darse, es decir, cuando el p&uacute;blico actual sepa valorar lo que ha existido antes y juegue sin ning&uacute;n atisbo de &quot;verg&uuml;enza&quot;, ya podremos hablar de arte sin que nadie pueda contradecirnos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El g&eacute;nero m&aacute;s antiguo que existe son (me niego a poner &quot;eran&quot;) la aventuras conversacionales. La primera de ellas fue Colossal Cave del d&uacute;o Crowther y Woods. Esta joya del soft se remonta a finales de los a&ntilde;os 60... ¡Los a&ntilde;os 60!, cuanto tiempo ha pasado ya, ¿eh?. Desde entonces el g&eacute;nero de la aventuras ha evolucionado (para el sector más purista de la aventura, esta evolución ha roto los enlaces con el verdadero concepto de aventura. Para otros esto no es así) hasta llegar a las actuales aventuras gr&aacute;ficas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En el presente, como dec&iacute;a al comienzo, hay muy pocas casas en el mundo del soft que se dediquen, en exclusiva, a un g&eacute;nero. Y, por supuesto, hay menos que lo hagan sobre g&eacute;neros que son, ciertamente, minoritarios como los juegos de rol o las aventuras gr&aacute;ficas. Es f&aacute;cil deducir, pues, que la gente que se dedica a realizar, en exclusiva, este tipo de juegos es gente que realmente se puede catalogar de artesanos del software. </P>
<P ALIGN="JUSTIFY"></P>
<table align="right">
<td ><img src="jpg/igoresp.jpg" ></td><tr>
<td><FONT color="#000000" size=1 face=arial><b><p align="right">Versión española de Igor Objetivo Uikokahonia. <br>Su primer juego y un clásico del soft patrio</b></p></td>
</table>
<B><P ALIGN="JUSTIFY">P&eacute;ndulo Studios</B> pertenece a ese gremio de artesanos. Fue la primera casa nacional en realizar una aventura gr&aacute;fica comercial y en iniciar una nueva forma de programar en Espa&ntilde;a destinada a &quot;destapar&quot;, de una vez por todas, la &quot;modorra&quot; creadora que se arrastraba desde la &eacute;poca de los 8 bits. Bien es cierto que antes de P&eacute;ndulo hubo creadores nacionales (¡y los sigue habiendo!) que realizaron aventuras tanto conversacionales como gr&aacute;ficas pero de una forma altruista. Quiz&aacute;, y muy probablemente, porque no dispusieron de medios o dinero para llevarlo a cabo pero, tambi&eacute;n os digo que, despu&eacute;s de conocer mejor a este fenomenal grupo, te das cuenta de que nadie les regal&oacute; tampoco nada a ellos, fue una apuesta &quot;al todo o nada&quot; y creo que, no reconocer el trabajo y las repercusiones que este grupo ha tenido para el &quot;encauzamiento&quot; del software nacional, ser&iacute;a un error estrepitoso. Existe demasiada gente que asocia la palabra comercial con facilidad de desarrollo, poco o nada de m&eacute;rito, en definitiva, menos esencia. Esta forma de pensar es algo que, bajo mi humilde punto de vista, me parece una suprema tonter&iacute;a. <br>Admiro mucho a cualquier chaval que es capaz de crear un buen gui&oacute;n y encima &quot;escribir&quot; el libro por ordenador, es decir, acabar el juego pero, admir&oacute; de una forma especial a la gente que, sin estar seguros de si van a tener &eacute;xito o sufrir un descalabro econ&oacute;mico, deciden arriesgar pr&aacute;cticamente todo para intentar vivir de lo que realmente les permite desarrollarse plenamente. Por eso, a P&eacute;ndulo, les guardo un recuerdo muy especial. 
<P ALIGN="JUSTIFY">
Cuando esta casa decidi&oacute; salir como desarrolladora comercial, no hab&iacute;a absolutamente nadie en el panorama espa&ntilde;ol que se atreviera a decir &quot;<I>bueno chicos, vamos a intentar abrir una casa de desarrollo de juegos a ver si somos capaces de vivir de esto</I
>&quot;. La valent&iacute;a de la decisi&oacute;n de P&eacute;ndulo se deber&iacute;a de recordar con mucho respeto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bien es cierto que despu&eacute;s de P&eacute;ndulo aparecieron casas como <B>Aca Soft</B> que tambi&eacute;n realiz&oacute; una aventura gr&aacute;fica comercial sin embargo y lamentablemente, la calidad dej&oacute; bastante que desear y pas&oacute; m&aacute;s que desapercibida. Tambi&eacute;n tenemos el caso del admirable grupo <B>Alcachofa Soft</B> que bajo ese nombre esconde un talento y capacidad que le pueden situar a la cabeza de los grupos independientes espa&ntilde;oles en un plazo de año y medio o dos años. Desde aqu&iacute; y pese a que este art&iacute;culo va dedicado a P&eacute;ndulo, quiero dar un saludo a la gente de Alcachofa pues también ellos se merecen ser citados en lo que ha sido la historia creadora de aventuras en nuestro país. Gracias a Dios hay m&aacute;s gente que quiere luchar por levantar un g&eacute;nero y adem&aacute;s hacerlo lo mejor que saben, es decir, con una calidad excelente.</P>
<h4>Una mirada a los inicios de P&eacute;ndulo</h4>
<P ALIGN="JUSTIFY">La historia de P&eacute;ndulo es breve, si nos ce&ntilde;imos al n&uacute;mero de productos que esta casa tiene en el mercado, pero muy intensa, si nos acercamos m&aacute;s a su nacimiento y posterior desarrollo o madurez. </P>
<P ALIGN="JUSTIFY">En el a&ntilde;o <B>1994</B>, este grupo sac&oacute; a la calle la primera aventura gr&aacute;fica comercial realizada en Espa&ntilde;a. El m&eacute;rito de crear una aventura gr&aacute;fica en Espa&ntilde;a no se lo llevaron ellos pues antes hubo gente que realiz&oacute; este tipo de productos en formato &quot;altruista&quot; (y a los que realmente nunca se les reconoce su fundamental importancia) pero, el caso de P&eacute;ndulo, es ciertamente especial pues fueron los primeros en &quot;agarrarse los machos&quot; y sacar a la venta un juego en condiciones de ser vendido al gran p&uacute;blico. ¡Cu&aacute;nto tiempo hab&iacute;amos esperado todos para ver en los cristales de nuestras habituales tiendas una caja grande que escond&iacute;a un juego espa&ntilde;ol!....</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pese a que es f&aacute;cil decir que todo el m&eacute;rito de P&eacute;ndulo fue el de sacar esa primera aventura gr&aacute;fica comercial, yo no lo voy a hacer. Creo sinceramente que el principal aporte de P&eacute;ndulo al panorama de entretenimiento espa&ntilde;ol fue el de despertar de la &quot;siesta&quot; a todos los que a&uacute;n cre&iacute;an que con los 8 bits tambi&eacute;n hab&iacute;a muerto la posibilidad de volver a ver a compa&ntilde;&iacute;as espa&ntilde;olas sacando juegos a la venta de forma seria y profesional. Hasta esa fecha, la mayor&iacute;a del legado espa&ntilde;ol, l&eacute;ase Topo, Opera, Dinamic o Zigurat (que hab&iacute;an sacado algo, principalmente durante el a&ntilde;o 91/92), no supo evolucionar y encontrarse &quot;as&iacute; mismo&quot; en las plataformas de 16 bits. Se segu&iacute;a programando como en los tiempos del Spectrum y eso era algo que se notaba. P&eacute;ndulo fue esa brisa de aire fresco que se lleva las antiguas formas pero sin hacer ruido, sin &quot;da&ntilde;arlas&quot;, dejando una nueva forma de crear acorde a los tiempos que corr&iacute;an.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">P&eacute;ndulo Studios nace en <B>Septiembre de 1993</B> y edita su primer juego en Junio/Julio de 1994. Fue casi un a&ntilde;o de desarroll&oacute; hasta que a todos nos cogiera por sorpresa su primer criatura: &quot;<B>Igor Objetivo Uikokahonia</B>&quot;. Fue, como todos sab&eacute;is, una Aventura Gr&aacute;fica. El programa, para ser sinceros, era m&aacute;s que notable en todos los aspectos. Retomaba el concepto introducido por la gran maestra (aunque quiz&aacute;s debiera decir, gran maestro Ron Gilbert) LucasFilm (ahora Lucas Arts) pero sin &quot;plagiarlo&quot;, es decir, se inspiraron s&iacute;, pero lo hicieron bien, supieron manejar el concepto que ten&iacute;an entre manos y eso fue fundamental para que la gente les reconociera su labor. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El grupo inicial de P&eacute;ndulo o, por as&iacute; decirlo, los pilares que &quot;sostuvieron&quot; a esta casa en sus inicios, estaba formado por <B>Ram&oacute;n Hern&aacute;ez</B>, <B>Felipe G&oacute;mez</B>, <B>Rafael Latiegui</B> y <B>Miguel Angel Ramos</B>. De ellos, Ram&oacute;n Hern&aacute;ez, Felipe G&oacute;mez y Miguel Angel Ramos se dedicaban a tareas de programaci&oacute;n mientras que Rafael Latiegui era el responsable de las animaciones. A este grupo b&aacute;sico se les unir&iacute;an colaboradores freelance (externos) como es el caso de <B>Carlos Veredas</B> y <B>Esteban Moreno</B>. El primero se encarg&oacute; de dibujar los fondos de la aventura mientras que el segundo puso &quot;en sinton&iacute;a&quot; al bueno de Igor. De todas formas, el grupo principal que llev&oacute; adelante al &quot;Igor&quot;, estaba formado por las cuatro personas primeramente citadas. Ellas fueron, adem&aacute;s, las que se encargaron de dise&ntilde;ar el argumento, gui&oacute;n y planteamiento de la aventura tarea, esta, fundamental.</P>
<center><table>
<td><center><img src="jpg/equipo.jpg" ></center></td><tr>
<td><FONT color="#000000" size=1 face=arial><b><center>
El cuarteto inicial, se ha visto mermado al irse Miguel Angel Ramos, pero<br> 
Ramón Hernáez(izquierda), Felipe Gómez(derecha) y Rafael Latiegui(sentado)<br> siguen formando los pilares
de la compañía.<br> Unos pilares más robustos que nunca.</b></center></td>
</table></center>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s del Igor y hasta estas pasadas navidades, no tuvimos la oportunidad de &quot;degustar&quot; ning&uacute;n producto suyo, es m&aacute;s, se temi&oacute; por la vida de la compa&ntilde;&iacute;a ya que todo el paseo de incertidumbre que se prolong&oacute; desde 1994 hasta casi 1998 estuvo plagado de rumores.</P>
<h4>¿Pero qu&eacute; pas&oacute; despu&eacute;s del Igor?</h4>
<TABLE align="right"><td>
<center><img src="jpg/igorinf.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="right"><b>Aquí tenéis una muestra de la versión<br> del Igor para Infogrames.
</b>
<b>
</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY">Despu&eacute;s del Igor las cosas deber&iacute;an de haber ido fenomenal pero fall&oacute; el factor suerte. P&eacute;ndulo logr&oacute; entrar en la &quot;fortaleza&quot; de la mism&iacute;sima <B>Infogrames</B> y &quot;apalabrar&quot; una versi&oacute;n de su juego m&aacute;s &quot;depurada&quot; para ser lanzada a nivel Europeo. Desde luego una noticia as&iacute; no puede ser mejor comienzo sin embargo, al final, Infogrames se ech&oacute; para atr&aacute;s y tuvieron que suspender el desarrollo de esta versi&oacute;n Europea del producto y creedme que fue una l&aacute;stima porque con s&oacute;lo observar las pantallas que este grupo ha regalado a Macedonia para publicar, uno se da cuenta que iban a realizar algo muy grande. Quiz&aacute;s deber&iacute;an de haberse movido un poco m&aacute;s y haber buscado alguna otra casa (aunque esto lo digo sin saber realmente si buscaron m&aacute;s editores a nivel Europeo).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De todas formas, esta fatalidad, que no fracaso pues de ellos no fue la culpa (por aquellos tiempos Infogrames tuvo alg&uacute;n que otro desastre econ&oacute;mico...) de la cancelaci&oacute;n de la versi&oacute;n Europea de Igor, se vio parcialmente suavizada con la publicaci&oacute;n del juego en el mercado Yankie. S&iacute;, amigos, s&iacute;. P&eacute;ndulo public&oacute; su juego en Estados Unidos y parece mentira lo inadvertido que pas&oacute; para las revistas nacionales ya que ni siquiera se hicieron eco de tal hecho, algo realmente importante. Sin embargo, como he dejado ver m&aacute;s arriba, este &eacute;xito de ver publicado su trabajo en un mercado tan complicado con en Norteamericano, se vio amenazado por la misma distribuidora que dej&oacute; al producto espa&ntilde;ol un tanto alejado de la mano de Dios, es decir, no cubrieron el producto como deb&iacute;an y el Igor pas&oacute; de puntillas &quot;al otro lado del charco&quot;. En estos momentos se deja de saber sobre P&eacute;ndulo. </P>
<P ALIGN="JUSTIFY"></P>
<TABLE align="left"><td>
<center><img src="jpg/igoryank.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="left"><b>Y aquí está una captura de<BR> la versión que salió en EEUU.</b>
<b>
</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY">Durante todo el tiempo que va desde que son contratados por Infogrames hasta un a&ntilde;o despu&eacute;s, hubo multitud de rumores. Se habl&oacute;, efectivamente, del tema de Infogrames pero no hab&iacute;a ninguna fuente realmente segura para afirmar tal hecho y la prensa espa&ntilde;ola no coment&oacute; absolutamente nada. Ni que decir tiene que tampoco se habl&oacute; de la edici&oacute;n Norteamericana del Igor ni de nada parecido...  </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En la entrevista realizada en el n&uacute;mero 4 de Macedonia a este grupo, se deja entrever que sufrieron un duro reciclado posterior, es decir, tuvieron que desechar todo sus recursos y replantearse la estrategia de mercado de arriba abajo, dise&ntilde;ar nuevas herramientas y, por si no fuera poco, sobreponerse al duro varapalo que sufrir&iacute;a el g&eacute;nero en el 95, a&ntilde;o en el que s&oacute;lo exist&iacute;a un g&eacute;nero, el creado por el DOOM, que &quot;devor&oacute;&quot; a otros como el del rol o la aventura convierti&eacute;ndoles en g&eacute;neros para una inmensa minor&iacute;a, pero minor&iacute;a a fin de cuentas. Realmente, no eran (ni son) tiempos f&aacute;ciles.</P>
<h4>Otra vez dan la campanada. <br>Llega el Hollywood Monsters.</h4>
<P ALIGN="JUSTIFY">S&iacute;, efectivamente, volvieron a sorprender a todo el mundo. En las navidades de 1997 sacaron a la venta su segundo programa, el <b>Hollywood Monsters</b>. Nadie nos lo esper&aacute;bamos. No hab&iacute;a habido ni una sola nota de prensa ni similares hasta que el producto no estuvo casi en la calle con lo que a todos nos volvi&oacute; a pillar de sorpresa pero, esta vez, la sorpresa fue a&uacute;n mayor pues la evoluci&oacute;n que sufri&oacute; el grupo desde 1994 a 1997, con tan s&oacute;lo 1 t&iacute;tulo, es impresionante. Yo jam&aacute;s he visto un salto tan grande en ninguna casa en cuanto a calidad y madurez general con tan s&oacute;lo un t&iacute;tulo por medio. En el mundo de los juegos, la experiencia de una casa de desarrollo no se cuenta por los a&ntilde;os que esta lleve en el mercado sino por los juegos que esta edite y, en el caso de P&eacute;ndulo, s&oacute;lo hab&iacute;a uno, con lo que realmente se hac&iacute;a dif&iacute;cil esperar algo como el Hollywood Monsters. </P>
<P ALIGN="JUSTIFY"></P>
<TABLE align="right"><td>
<center><img src="jpg/hollyre.jpg" border=1></center>
</td>
<tr>
<td>
<FONT color="#000000" size=1>
<p align="right"><b>El Hollywood Monsters. Juego que les ha<br> permitido recuperar
el prestigio <br>que alcanzaron con el Igor.
</b>
<b>
</b></p>
</td>
</table>
<p align = justify>
<P ALIGN="JUSTIFY">Los cambios o, mejor dicho, el salto fue realmente abismal. Si miramos &quot;dentro&quot; de la compa&ntilde;&iacute;a podemos notar tambi&eacute;n una serie de hechos realmente importantes. Para empezar, el cuarteto que era el que sosten&iacute;a el sello, en sus inicios, se ve mermado al marcharse Miguel Angel Ramos sin embargo, todo el aspecto freelance que rodea a la producci&oacute;n se ve multiplicado por 20 pues de los 2 colaboradores externos se pasa a m&aacute;s de 40 personas. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y la aventura en s&iacute;?. Bueno, cualquiera que haya estado un poco metido en el producto habr&aacute; observado que el juego no es nada f&aacute;cil, es m&aacute;s, se hace un reto para los veteranos en estas lides y, tambi&eacute;n hay que decirlo, un poco &quot;tab&uacute;&quot; para los n&oacute;veles. Pero, realmente, este es el esp&iacute;ritu de una buena aventura, ya sea gr&aacute;fica o conversacional, es decir, en estos juegos se trata de &quot;forzar&quot; al usuario a utilizar su imaginaci&oacute;n, inteligencia e ingenio, adem&aacute;s de mostrar, claro est&aacute;, una historia, un hilo argumental, etc. Creo, sinceramente, que el equipo de P&eacute;ndulo se esforz&oacute; mucho en esos puntos y de ah&iacute; que sacaran a la venta un juego bastante m&aacute;s desafiante que muchas otras aventuras de casas internacionales por todos conocidos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El &eacute;xito est&aacute; ah&iacute;. Estamos ya a varios meses del lanzamiento del producto y tan s&oacute;lo hay que ver la lista de ventas de juegos en Espa&ntilde;a. El Hollywood Monster sigue entre los m&aacute;s vendidos. ¿La f&oacute;rmula del &eacute;xito?. Trabajar a tope.</P>
<h4>Conclusiones finales</h4>
<P ALIGN="JUSTIFY">P&eacute;ndulo lleva camino de convertirse en una aut&eacute;ntica especialista en el g&eacute;nero de las Aventuras Gr&aacute;ficas. Ahora mismo, Espa&ntilde;a puede decir, con bastante orgullo, que posee dos estupendos baluartes en el panorama profesional de la producci&oacute;n de este g&eacute;nero. Por un lado est&aacute; P&eacute;ndulo y por otro Alcachofa. En toda Europa s&oacute;lo Revolution Software es capaz de realizar tal labor de especializaci&oacute;n. ¿Esto es bueno?. Esto es m&aacute;s que bueno. Yo creo, firmemente, en el desarrollo y la formaci&oacute;n de casas de software que se basan en la especializaci&oacute;n de sus t&iacute;tulos, en mi opini&oacute;n, s&oacute;lo as&iacute; se alcanza la posibilidad de producir los mejores juegos. Los desarrolladores especializados ponen un cuidado y tienen un &quot;sexto&quot; sentido que no pueden conseguir las grandes multinacionales o equipos de desarrollo del sector. ¿Qu&eacute; ha quedado ahora de la antigua Lucas Arts?. Dejad que os lo diga: NADA. Cuando esta casa hac&iacute;a las mejores aventuras del planeta era porque ten&iacute;a una divisi&oacute;n totalmente especializada en la producci&oacute;n de las mismas. Esta misma divisi&oacute;n constitu&iacute;a un 80%, o m&aacute;s, de su potencial y el resto se lo llevaban los simuladores de vuelo. Pod&iacute;amos hablar de una Lucas especializada en este g&eacute;nero. Ahora, sin embargo, pod&eacute;is observar que su forma de trabajo es bien distinta. S&oacute;lo hay que jugar a su &uacute;ltima aventura gr&aacute;fica y compararla proporcionalmente a lo que eran capaces de ofrecer a los jugadores all&aacute; por 1991.... Pero no s&oacute;lo es Lucas Arts, hay montones de ejemplos equivalentes, no s&oacute;lo en el campo de las aventuras sino en el cualquier otro. ¿Por qu&eacute; los grandes maestros se marchan de las casas que ellos mismos fundaron?. Es muy simple. El mercado crece tanto que se olvida de la esencia del mismo y, esa esencia, no se puede conseguir con el mejor 
equipo de programaci&oacute;n del mundo ni los mejores grafistas, ni el dise&ntilde;ador con las ideas m&aacute;s originales. Esa esencia de un buen juego, aventuras en este caso, o cualquier otro proyecto, s&oacute;lo se consigue cuando un equipo de desarrollo trabaja como una sola persona que reune todas las virtudes de un programador, un grafista, un m&uacute;sico, un dise&ntilde;ador...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De todas formas, el g&eacute;nero de la aventura es un g&eacute;nero ciertamente minoritario. Esto se debe, exclusivamente, al boom de los ordenadores que los ha convertido en un electrodom&eacute;stico m&aacute;s de los hogares. ¿Qu&eacute; es a fin de cuentas una aventura?. Una aventura no es m&aacute;s que una novela inform&aacute;tica, una novela que se lee jugado. Si esto lo extrapolamos a la vida normal ¿cu&aacute;nta gente tiene por &quot;vicio&quot; leer unos cuantos libros al a&ntilde;o?. Muy pocos ¿no?. S&iacute;, es triste, pero as&iacute; es. </P>
<P ALIGN="JUSTIFY">Antes, cuando los ordenadores s&oacute;lo estaban en manos de unos cuantos que se los pod&iacute;an costear, generalmente personas que rondaban los 16/17 a&ntilde;os para arriba, las aventuras eran el g&eacute;nero n&uacute;mero 1, eran los reyes indiscutibles. Ahora los ordenadores est&aacute;n al alcance de una inmensa mayor&iacute;a y esa inmensa mayor&iacute;a prefiere jugar a productos menos densos y m&aacute;s espectaculares t&eacute;cnicamente. ¿Tiene todo esto algo de bueno?. Posiblemente, a base de la merma de seguidores, las aventuras siguen teniendo ese encanto especial que s&oacute;lo pueden conseguir los g&eacute;neros no tan mayoritarios. ¿Os imagin&aacute;is que al cabo de un mes salieran tantas aventuras gr&aacute;ficas como juegos de estrategia en tiempo real o Arcades 3D, al mes?. Yo no, y tampoco querr&iacute;a que sucediera eso ya que entonces, la aventura habr&iacute;a muerto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Espa&ntilde;a es un pa&iacute;s que cuenta con una estupenda cantera de aficionados al mundo de la aventura y por eso, no es de extra&ntilde;ar, que las personas que se lanzan a realizar un t&iacute;tulos de este tipo acaben haciendo cosas muy buenas. En estos momentos, tenemos a una, profesionalísima, P&eacute;ndulo pendiente de consagraci&oacute;n con su tercer t&iacute;tulo (que est&aacute;, por supuesto, en camino), a un grupo, Alcachofa Soft, que va a lanzar al mercado otra aventura gr&aacute;fica en breve. Todo esto no son m&aacute;s que buenas noticias para esperar que, este a&ntilde;o, se pueda volver a hablar de t&iacute;tulos de juegos no empiecen o acaben en &quot;3D&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lo &uacute;nico que podemos pedir desde Macedonia a P&eacute;ndulo es que se vuelvan a &quot;arriesgar&quot; aumentando en n&uacute;mero la plantilla fija. Que no paren nunca de hacer aventuras o juegos de similar corte, que nos mantengan siempre avisados de sus proyectos, en definitiva, ¡os queremos P&eacute;ndulo! ;-)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si queréis saber más sobre este grupo español de programación de
juegos, sólo tenéis que pulsar <a href="pendulo.htm">aquí</a> y leer la más extensa entrevista que han
concendido.</P>

<br><br>
<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="pjuegos.htm"><font FACE="ARIAL"><B>[Desarrollo de Videojuegoso]</B></font></a> <hR>
<A HREF="dhispc.htm"><font FACE="ARIAL"><B>[Grupos de Desarrollo]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">DESARROLLO DE VIDEOJUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

