<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>ítulos de Coleccionista</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial"><br><br><br><br>

<H3>

Elvira Mistress of the Dark

</H3>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muchos de los que hoy en d&iacute;a se declaran seguidores fieles de los juegos de rol, se introdujeron al g&eacute;nero a trav&eacute;s de este cl&aacute;sico. &quot;Elvira Mistress of the Dark&quot; (a partir de ahora &quot;Elvira&quot;) fue el primer juego de rol de car&aacute;cter puramente comercial, es decir, el primero que se sirvi&oacute; de las plataformas m&aacute;s populares del momento, equipos de 16 bits, para mostrar los mejores gr&aacute;ficos vistos hasta entonces y una de las primeras bandas sonoras para juegos de calidad (se aprovechaba de las nacientes tarjetas de sonido para PC como Adlib y Sound Blaster). Es m&aacute;s, &quot;Elvira&quot; fue uno de los primeros juegos que obligaba al usuario de PC a disponer de un disco duro (por aquellas fechas, los juegos se ejecutaban directamente desde la disquetera). Por supuesto, el mayor de los alicientes se encontraba en la dificultad y la adici&oacute;n que pose&iacute;a.</P>
<P ALIGN="JUSTIFY"></P>
<CENTER><TABLE WIDTH="250">
<TD><IMG SRC="jpg/elv1_01.jpg"></TD>
<TR>
<TD><FONT SIZE=1 FACE=ARIAL><CENTER>Así comenzaba el "Elvira"</CENTER></FONT></TD>
</TABLE></CENTER>
<P ALIGN="JUSTIFY">Como os pod&eacute;is imaginar, la expectaci&oacute;n que se levant&oacute; entorno a este producto fue muy grande. Desde usuarios que lloraban porque no podr&iacute;an disfrutar de &eacute;l en sus, cada vez m&aacute;s, obsoletos XT sin velocidad y, en la mayor&iacute;a de los casos, disco duro, a otros que se jactaban de poder poner a prueba, al fin, sus modernos 286 con discos duros de 20 o 40 megas. En resumidas cuentas, la salida del &quot;Elvira&quot; fue todo un acontecimiento. Puso de moda los juegos de rol (desde luego, en Espa&ntilde;a, se encarg&oacute; de popularizarlos) acercando, as&iacute;, el g&eacute;nero al gran p&uacute;blico.</P>
<P ALIGN="JUSTIFY"> </P>
<B><P ALIGN="JUSTIFY">El argumento y caracter&iacute;sticas</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;Elvira&quot; era un juego que luc&iacute;a un estilo de rol totalmente distinto a lo que por aquellas fechas se hab&iacute;a visto. Para empezar, se basaba en la figura de una conocida presentadora de televisi&oacute;n de Norteam&eacute;rica (Elvira) que, haciendo gala de su buen ver, dio m&aacute;s &quot;morbo&quot;, si cabe, a la publicaci&oacute;n del juego. El argumento nos situaba en un castillo heredado por Elvira, que perteneci&oacute; a una lejana tatarabuela suya, una tal Emelda. Dicha Emelda, hab&iacute;a sido una despiadada bruja en vida (al parecer, se dedico a convertir en muertos vivientes a todos los habitantes de los alrededores del castillo). Pero como a todas las brujas (o a casi todas), a Emelda tambi&eacute;n le llego la muerte a causa de la vejez. Y ahora, en el momento en que Elvira se entera de que existe un testamento que la convierte en due&ntilde;a y se&ntilde;ora de esa mansi&oacute;n, Emelda &quot;tiene ganas&quot; de resucitar para sembrar el p&aacute;nico entre los mortales. La &uacute;nica forma de destruirla ser&aacute; encontrando un pergamino secreto con conjuros que se encuentra dentro de un cofre ubicado en alg&uacute;n lugar del castillo. Como os imaginar&eacute;is, nosotros tendremos que ayudar a la buena de Elvira (que aparecer&aacute; de vez en cuando para echarnos una mano y... dejarnos con la boca abierta). Lo malo (o lo bueno), es que hallar el cofre no ser&aacute;, ni mucho menos, f&aacute;cil (que yo sepa, el cofre que hay que encontrar en este juego, es el cofre m&aacute;s dif&iacute;cil de localizar de la historia de los videojuegos). Es m&aacute;s, el castillo estar&aacute; plagado de puzzles, criaturas monstruosas y cad&aacute;veres en descomposici&oacute;n... </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Decir que el desarrollo del juego era soberbio ser&iacute;a decir poco. Bajo mi opini&oacute;n, &quot;Elvira&quot; ha sido, y es, uno de los juegos de rol menos lineales que se han creado. La existencia de puzzles independientes (muy complicados), de enemigos individualizados (no aparec&iacute;an aleatoriamente), y de una adici&oacute;n y dificultad que se escapaba totalmente de la media de los juegos que hab&iacute;a por entonces, convirti&oacute; a este producto en un cl&aacute;sico por derecho propio. </P>
<P ALIGN="JUSTIFY"></P>
<CENTER><TABLE WIDTH="300">
<TD><IMG SRC="jpg/elv1_03.jpg"></TD>
<TR>
<TD><FONT SIZE=1 FACE=ARIAL><CENTER>Elvira, ¡eres la mejor! :o)</CENTER></FONT></TD>
</TABLE></CENTER>
<P ALIGN="JUSTIFY">El juego luc&iacute;a un mampeado muy amplio. Hab&iacute;a m&aacute;s de 800 habitaciones que visitar y m&aacute;s de 300 objetos que manipular. Con lo que las posibilidades de actuar y de desarrollar la aventura eran alt&iacute;simas. El hecho de permitir al jugador saltar de un puzzle a otro, de investigar habitaciones con montones de detalles, objetos o pistas, de premiarle continuamente con gr&aacute;ficos que pon&iacute;an a prueba las, por entonces, nuevas tarjetas VGA de 256 colores, era toda una experiencia nueva. Desde finales de los a&ntilde;os 80, los juegos que ten&iacute;an una complejidad de desarrollo realmente alta estaban vetados para el gran p&uacute;blico. Gr&aacute;ficos excesivamente pobres, interfaz muy poco intuitiva o, por qu&eacute; no decirlo, desarrollo pensado para jugadores &quot;veteranos&quot;, eran factores determinantes que imped&iacute;an la expansi&oacute;n de g&eacute;neros como el rol, la aventura, o el wargame. Elvira ten&iacute;a todos los adelantos tecnol&oacute;gicos de la &eacute;poca desmarc&aacute;ndose, as&iacute;, de ser soportado en equipos de gama baja (y, por tanto, favoreciendo a la nueva generaci&oacute;n de usuarios) y poniendo la primera piedra para la evoluci&oacute;n t&eacute;cnica en los juegos de por entonces.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Desarrollo</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;Elvira&quot; utilizaba la perspectiva en primera persona. Heredaba, de esta forma, uno de los aspectos caracter&iacute;sticos del cl&aacute;sico &quot;Dungeon Master&quot;. Muchas de las personas que jugaron &quot;Elvira&quot;, se negaron a encasillarlo bajo el g&eacute;nero del rol. La verdad es que, &quot;Elvira&quot;, no segu&iacute;a los c&aacute;nones que, por aquellas fechas, ten&iacute;a asociado el g&eacute;nero. Para empezar, no ten&iacute;amos a la t&iacute;pica cuadrilla de personajes bajo el mando del jugador, no hab&iacute;a complejas tablas estad&iacute;sticas y el combate era s&oacute;lo un aspecto m&aacute;s para avanzar en la aventura. Eso sin contar con que el juego combinaba espacios abiertos con los t&iacute;picos interiores de cualquier juego de Rol sobre mazmorras de por entonces. En lugar de todo lo anterior, el juego se hallaba en un perfecto importante entre el rol y la aventura. El hecho de que Elvira se dirigiera a ti de vez en cuando (&quot;cut scenes&quot; pobres, pero &quot;cut scenes&quot; al fin y al cabo), de poder manipular y usar objetos, de tener que resolver puzzles e investigar entre libros para hallar conjuros o, incluso, alguna que otra receta de cocina, daban una personalidad distintiva al producto. Es decir, no ten&iacute;a la etiqueta &quot;s&oacute;lo apto para roleros&quot;. Otro de los aspectos que se encontraban elevados a la en&eacute;sima potencia era el de la adici&oacute;n. Y es que, curiosamente, la alt&iacute;sima dificultad de este juego, no supon&iacute;a una renuncia o abandono para el jugador. Y lo digo por experiencia. Pocas veces me he encontrado con juegos tan complicados de resolver y tan adictivos. Por norma general, un juego que impone una dificultad elevada desde el primer momento, corre el riesgo de que el jugador no le d&eacute; ni la m&aacute;s m&iacute;nima oportunidad (hay excepciones como &quot;Baldur’s Gate&quot; en rol y &quot;Civilization&quot; en estrategia, por ejemplo). El hecho de ofrecer un mampeado grande y muc
has alternativas para avanzar, es decir, el ser un juego &quot;no lineal&quot;, permiti&oacute; que los usuarios lograran encontrarse con el producto.</P>
<P ALIGN="JUSTIFY"></P>
<TABLE WIDTH="300" ALIGN="RIGHT">
<TD><IMG SRC="jpg/elv1_02.jpg"></TD>
<TR>
<TD><FONT SIZE=1 FACE=ARIAL><CENTER>El jefe de los guardias, era de los enemigos más duros. Había que dejarlo para el final.</CENTER></FONT></TD>
</TABLE>
<P ALIGN="JUSTIFY">Los problemas que nos pod&iacute;amos encontrar iban desde tener que resolver una lucha con un enemigo especialmente poderoso, a tener que hallar la soluci&oacute;n a un problema o puzzle concreto, encontrar o fabricar alg&uacute;n objeto que nos permitiera avanzar o investigar entre pergaminos, textos, habitaciones, etc. Problemas cl&aacute;sicos del &quot;Elvira&quot; podr&iacute;an ser la fabricaci&oacute;n de una bala de plata para matar a un hombre lobo, el problema del pedestal de la Iglesia o el del dichoso laberinto del jard&iacute;n. Al igual que combates puntuales como el que ten&iacute;amos que mantener con la cocinera sanguinaria, el &aacute;guila que nos sacaba de forma insistente los ojos o el jefe de la guardia del castillo (para el que necesit&aacute;bamos una experiencia realmente alta).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los combates se llevaban a cabo en tiempo real, ahora bien, el mecanismo era un tanto peculiar, pues salt&aacute;bamos a una pantalla en la que se encontraba el enemigo contra el que luch&aacute;bamos d&aacute;ndonos mandobles a diestro y siniestro. Si logr&aacute;bamos parar alguno de los ataques, entonces nosotros ten&iacute;amos la oportunidad de iniciar la ofensiva. Desde luego, el sistema era original pero oscurec&iacute;a un poco el peso de la experiencia que pod&iacute;as llevar acumulada, resultando ser m&aacute;s un combate &quot;arcade&quot; que un combate &quot;rol&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Conclusiones</P>
</B></FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">El &quot;Elvira&quot; fue desarrollado por la compa&ntilde;&iacute;a Horror Soft. Por aquellas fechas, Horror Soft era una filial de Adventure Soft. Despu&eacute;s del lanzamiento de WaxWorks, Horror Soft deja de existir como tal y pasa a formar parte del equipo central de Adventure Soft para trabajar en la que ser&aacute;, dentro de poco, trilog&iacute;a de aventuras gr&aacute;ficas &quot;Simon the Sorcerer&quot;. Despu&eacute;s del &quot;Elvira&quot;, se desarroll&oacute; una segunda parte. ¿Su t&iacute;tulo?, &quot;Elvira II, The Jaws of Cerberus&quot;. Este t&iacute;tulo result&oacute; ser peor que la primera entrega, pese a tener unas caracter&iacute;sticas ciertamente m&aacute;s elevadas. Me explico, la segunda parte ten&iacute;a un mampeado a&uacute;n m&aacute;s grande, di&aacute;logos dirigidos, mejores gr&aacute;ficos, si cabe, m&aacute;s combate, m&aacute;s puzzles y... m&aacute;s dificultad. En efecto, el principal obst&aacute;culo de la segunda parte fue su mal ajustada dificultad (unida a una menor libertad de acci&oacute;n ) que terminaba por echar para atr&aacute;s al m&aacute;s ac&eacute;rrimo jugador del original &quot;Elvira&quot;. Ese fue el &quot;&uacute;nico&quot; fallo que impidi&oacute; que la continuaci&oacute;n alcanzara una popularidad, si quiera, parecida con respecto al t&iacute;tulo original. M&aacute;s tarde, Horror Soft, volver&iacute;a a la carga haciendo m&aacute;s de lo mismo pero sin Elvira de reclamo. &quot;WaxWorks&quot; super&oacute; con creces los elementos de gore de los anteriores &quot;Elvira&quot; pero ni se acerc&oacute; a la diversi&oacute;n que dispensaron los mismos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pese a que el &quot;Elvira&quot; no es un juego de rol en t&eacute;rminos estrictos, es m&aacute;s &quot;rol&quot; que otra cosa. Caus&oacute; una gran sensaci&oacute;n cuando fue lanzado al incorporar un desarrollo que dejaba abiertas varias posibilidades para el jugador gracias a su desarrollo poco lineal. Esto, unido a que pose&iacute;a una elevada calidad t&eacute;cnica, y una endiablada relaci&oacute;n entre dificultad y adici&oacute;n, provoc&oacute; que fueran muchos los jugadores que se introdujeran en su universo. La &uacute;nica gran pega que se puede echar a este t&iacute;tulo, es que no fue traducido al castellano en nuestro pa&iacute;s. Sin embargo, y dadas las fechas en las que este juego vio la luz, tan s&oacute;lo el tener la oportunidad de adquirirlo con manual en castellano, pod&iacute;a considerarse un milagro. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&quot;Elvira&quot; es un juego realmente imprescindible que marc&oacute;, de forma muy particular, un antes y un despu&eacute;s del rol por ordenador.</P></FONT>
<BR><BR>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>

<A HREF="rpgc.htm"><font FACE="ARIAL"><B>[Títulos de Coleccionista]</B></font></a> <br>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>











<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Artículo realizado por Fernando Rodríguez</TITLE>
</HEAD>
<BODY LINK="#0000ff">

