<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

</p> <br><br><br><br><h3>Manual del indeseable</h3>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Desde el comienzo de Ultima Online, la libertad de elegir el camino a tomar no solo nos leg&oacute; una cantidad innecesaria de panaderos, una sarta de fanfarrones guerreros y algunos molestos vendedores, sino que tambi&eacute;n nos dejo un lado oscuro del juego. El lado de los ladrones, malandrinas, asesinos, etc. Para los que hayan tomado el camino malvado de la vida, dedico mis siguientes l&iacute;neas, mi oficial "Manual para el uso y abuso de la ilegalidad", tambi&eacute;n llamado "Er Chorizo y sus ra&iacute;ces, y Ole".</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Ladr&oacute;n</P>
</B><P ALIGN="JUSTIFY">Esta profesi&oacute;n es la mas digna de ejercer en Ultima Online, si se desea ser un "indeseable". Existen muchas clases de ladrones, entre ellas las siguientes:</P>
<STRONG><P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">El nudista-banquero.</STRONG> Estos son personajes reci&eacute;n creados con habilidades de ladr&oacute;n al m&aacute;ximo. El lugar m&aacute;s com&uacute;n donde encontrar estos espec&iacute;menes es en las cercan&iacute;as de los bancos. Los personajes se desnudan para poder llevar el m&aacute;ximo de peso, y tambi&eacute;n para no perder nada valioso cuando mueran (lo m&aacute;s usual cuando son descubiertos). Son muy arriesgados y no toman precauciones porque no tienen nada que perder. Tambi&eacute;n usados por gente buena que quiere incursionar en las artes del delito.</LI></UL>

<STRONG><P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">El finisimo ladronzuelo.</STRONG> Personajes con mucho tiempo de juego y una habilidad asombrosa en las artes del delito premeditado. Suelen estar en casi cualquier parte, aunque es dif&iacute;cil saber cuando es uno de ellos, porque su habilidad es tan grande que cuando intentan robarte tu no te das cuenta nunca. Llegar a su nivel es realmente dif&iacute;cil, pero vale la pena, porque se pueden llevar botines realmente elevados de grandes se&ntilde;ores.</LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<STRONG><LI><p align="justify">El "comunacho".</STRONG> Son los prototipos de "finisimos ladronzuelos", pero en fase de entrenamiento. No se arriesgan mucho, y suelen intentar sus robos solo fuera de las ciudades. Son los m&aacute;s comunes, y son bastante d&eacute;biles, as&iacute; que si alguien los ve robando, corren a gran velocidad.</LI></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<STRONG><LI><p align="justify">Los Hiper-Arriesgados.</STRONG> Son gente que aun teniendo una habilidad media en el arte de robar, deciden arriesgarse con NPC´s o gente dif&iacute;cil, y en lugares p&uacute;blicos. Generalmente terminan muertos, pero si alguna vez tienen suerte, se podr&aacute;n retirar del negocio con los beneficios de un solo robo.</LI></UL>

<P ALIGN="JUSTIFY"></P><DIR>

<B><P ALIGN="JUSTIFY">Los Asesinos.</P>
</B><P ALIGN="JUSTIFY">Los mas odiados del juego. Son los llamados PK´s y son realmente asediados por los otros personajes del juego, especialmente los llamados Anti-PK´s, horribles servidores del bien que se dedican a matar a estos pobres tipos. A diferencia de los Ladrones, los Asesinos se dividen en tres grandes grupos:</P>
<STRONG><P ALIGN="JUSTIFY"></P></DIR>


<UL>
<LI><p align="justify">Los Asesino-Ladrones</STRONG>. Son personajes que indistintamente de su fuerza o habilidades de combate, se dedican a matar a otros para robarles sus cosas. Son salvajes y muy vengativos, sin reglas y realmente peligrosos (o al menos eso les hacen creer a los otros personajes del juego). Son los mas comunes de los asesinos, y tambi&eacute;n los peor considerados, est&aacute;n por todas partes, y hay una regla que si cumplen todos, sin distinci&oacute;n de guild o estrategia, usan nombres del tipo "Yourmomma", "Lord Suckmy&amp;%$#", "AIDS Patient", etc. Suelen usar una prenda roja como distintivo, aunque esto no es com&uacute;n a todos los asesinos, ni tampoco significa que todas las personas con algo rojo sean asesinos.</LI></UL>

<STRONG><P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Los Asesinos a sueldo.</STRONG> Como ya lo debes suponer, estos son los que se dedican a matar a alguien a cambio de dinero. Suelen ser malvados y con habilidades de combate y magia bastante elevadas. Son dif&iacute;ciles de encontrar, pero si uno necesita una venganza son los mas indicados. Pero tenemos que tener en cuenta que son asesinos, y por lo tanto no muy confiables todos, as&iacute; que es preferible acompa&ntilde;arlos para ver su trabajo, o exigirles pruebas de su asesinato, y NUNCA pagar por anticipado o en dos partes, siempre al final del trabajo.</LI></UL>

<STRONG><P ALIGN="JUSTIFY"></P>

<UL>
<LI><p align="justify">Los Asesinos por gusto.</STRONG> Son los menos, pero los mas respetados. Disfrutan la caza de otras personas, pero luego de matarlas las reviven sin robarles nada. Estos suelen ser el tipo de asesinos m&aacute;s poderosos, son pr&aacute;cticamente invencibles. Tambi&eacute;n trabajan como guerreros comunes y se dedican a cazar animales tambi&eacute;n. Suelen ser jugadores que llevan mucho tiempo jugando y ya se aburrieron del juego siempre mon&oacute;tono.</LI></UL>

<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Los Saqueadores.</P>
</B><P ALIGN="JUSTIFY">Estos son los que se dedican a saquear casas. Es la profesi&oacute;n m&aacute;s dif&iacute;cil, y requiere mucha experiencia mas que muchos puntos de skill, y a ser posible, una fuerza descomunal, pero tambi&eacute;n da beneficios al por mayor, muchas veces solucionando la vida del saqueador con un solo robo para siempre. En esta categor&iacute;a solo entran los que saquean casas mediante el uso de m&eacute;todos legales en el juego. Luego de robar una casa (y esta es la parte mala) suelen ser perseguidos d&iacute;a y noche por los due&ntilde;os de la casa para tomar venganza, y hasta por asesinos a suelo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Los "Hackers" .</P>
</B><P ALIGN="JUSTIFY">Son los que transcienden la ilegalidad fuera del juego. Aprovechan los bugs (errores) del juego para entrar en casas, aumentar sus puntos de skill, matar a otros personajes, destruir a sus enemigos (fuera de UO), ganar mas dinero, etc. Estos no solo son perseguidos por los personajes del juego, sino adem&aacute;s por todo el personal de Origin, que los considera rotundamente peligrosos. Y a pesar de todo esto no son pocos, como cabria suponer, sino bastante numerosos. Esta es la opci&oacute;n menos recomendada a tomar, a menos que desees correr riesgos innecesarios.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Toda la informaci&oacute;n contenida aqu&iacute; es pura y exclusivamente para entretenimiento, con este peque&ntilde;o informe no pretendo que todas las personas se vuelvan ladrones o asesinos dentro del juego sino todo lo contrario, pero soy de los que opinan que sin un lado oscuro, un caos, un chorizo en el pueblo, no la pasar&iacute;amos tan bien, y el juego no seria tan real.</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

