<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

</p> <br><br><br><br>
<h3>Cómo ganar dinero</h3>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Una de las preguntas m&aacute;s comunes que un novato (y aun alguien con experiencia) tiende a hacer es ¿C&oacute;mo puedo ganar mucho dinero?. Lo cierto es que no hay una respuesta segura ni garantizada, pero hay muchisimos m&eacute;todos para al menos no quedarnos sin un pedazo de pan. Como alguien con cierta experiencia en el juego, y que se ha hecho mas de una vez la maldita pregunta, creo que puedo hablar con propiedad sobre las maneras m&aacute;s efectivas de llenar nuestros bolsillos de oro. A continuaci&oacute;n intentare detallar los m&eacute;todos mas usados o m&aacute;s provechosos (o ambos) que he probado o me han sugerido.</P>
<STRONG><P ALIGN="JUSTIFY"><BR>
Los Comunes</P>
</STRONG><P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Mendigo</P>
</B><P ALIGN="JUSTIFY">As&iacute; es, como todos sabemos, la mendicidad se extiende por el mundo, y el UO no es una excepci&oacute;n. A pesar que es una manera muy f&aacute;cil de hacer dinero, no es muy efectiva, porque no siempre nos dar&aacute;n, y casi nunca cifras grandes, por lo tanto nos llevara muchisimo tiempo para juntar lo suficiente para comprar una m&iacute;sera espaducha. </P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = No recomendada</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Basurero</P>
</B><P ALIGN="JUSTIFY">La gente que lleva tiempo en el juego, o los personajes que no necesitan ciertas cosas suelen dejarlas tiradas por el suelo. Lo que tienes que saber es que pr&aacute;cticamente todo es comerciable en UO. Aun las cosas m&aacute;s inservibles e insignificantes; siempre podr&aacute;s encontrar a alguien dispuesto a comprarlas. Los mejores lugares para encontrar desperdicio son los bancos y los lugares donde hubo una reciente batalla, prefiriendo los primeros, al estar al amparo de los guardias de la ciudad. Tendr&aacute;s que tener en cuenta que suele haber mucha gente a la espera de que alguien tire algo, as&iacute; que debes ser r&aacute;pido y tener los ojos bien abiertos. Aun as&iacute;, no siempre conseguir&aacute;s cosas de mucho valor, y probablemente te cueste venderlas, pero puede valer la pena.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Si tienes perseverancia, no busca grandes beneficios y no tienes ning&uacute;n oficio, este es tu trabajo.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Guerrero</P>
</B><P ALIGN="JUSTIFY">Esto es algo parecido al Basurero, pero no tendr&aacute;s que esperar a que alguien tire algo para buscarlo, sino que ser&aacute;s tu quien se ocupe de tomar las cosas por la fuerza. Britannia esta llena de tesoros que podr&aacute;s tomar, y de objetos que podr&aacute;s vender a altos precios. La ventaja de este estilo es que si eres un luchador de los mejores, probablemente ganes mas dinero que en cualquier otro, pero si no lo eres, ser&aacute;s v&iacute;ctima de asesinos muy frecuentemente, las criaturas te mataran mas de lo normal, y no conseguir&aacute;s grandes beneficios.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Es dif&iacute;cil, pero puede llegar a dar mucha ganancia al final.</P>
<STRONG><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los "de Oficio"</P>
</STRONG><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; llamo a los m&eacute;todos que requieren alguna habilidad especial para ser aplicados.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Escudero</P>
</B><P ALIGN="JUSTIFY">Para este m&eacute;todo requerir&aacute;s las habilidades de Lumberjack y Carpentry. Es realmente muy f&aacute;cil y da beneficios desde el primer momento, pero llega a ser extremadamente aburrido. Lo que debes hacer es cortar una buena cantidad de madera, y con tu habilidad de carpintero, convertir los troncos en escudos. Cada escudo requiere 9 troncos, y te pagaran por el unas 30 monedas, dependiendo de donde lo vendas. Comparado con las otras cosas que se pueden hacer con la madera, es en proporci&oacute;n el que menos madera consume por mas dinero (adem&aacute;s de los arcos, pero ya hablaremos de eso). Este es uno de los m&eacute;todos m&aacute;s usados a trav&eacute;s de toda Britannia.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Bastante recomendable, y si no te molesta la rutina, mejor aun.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Arquero </P>
</B><P ALIGN="JUSTIFY">Muy parecido al Escudero, pero en lugar de la habilidad de Carpentry usaremos Bowcraft/Fletching. El resto del procedimiento es igual, con la diferencia de que fabricaremos arcos, los cuales tambi&eacute;n cuestan 9 de madera y se venden por 30 monedas mas o menos.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Es bueno el m&eacute;todo, pero prefiero la carpinter&iacute;a, porque aumenta la fuerza, mientras que esto aumenta la Dex.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Vendedor de Gorras</P>
</B><P ALIGN="JUSTIFY">Esta es definitivamente la estrategia de mercado m&aacute;s divulgada y usada de Ultima Online. Para poder usarla se debe tener una puntuaci&oacute;n aceptable en el skill de Tailoring. Lo que debes hacer es comprar un rollo de tela (o bien conseguirlo por cualquier otro medio) y hacer skull caps hasta acabar con la tela, pero siempre debes dejar 3 o 4 retazos de tela en el rollo. En proporci&oacute;n, el skull cap es la prenda que m&aacute;s cara se vende por esa cantidad de tela. Luego de haber hecho los gorritos, los vendes junto con el rollo de tela con 3 retazos, ya que se vende por un buen precio, a pesar de que casi no sirve para nada. El negocio da beneficios, pero poco a poco, y lo malo es que el comprador tenga tantos gorritos que se niegue a comprar m&aacute;s. Por eso este truco es bueno para habitantes de Britain, ya que esta ciudad tiene 2 negocios de ropa, y muchos m&aacute;s potenciales compradores. </P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Hace falta mucha paciencia, pero es el m&eacute;todo quiz&aacute;s m&aacute;s seguro que hay, ya que no hace falta exponerse a salir de la ciudad y el beneficio esta asegurado.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Costurero de Cuero</P>
</B><P ALIGN="JUSTIFY">Para esto hace falta un nivel bastante aceptable de Tailoring, y a ser posible, unos conocimientos de lucha. Aqu&iacute; lo que hay que hacer es conseguir hides y usarlas para hacer armaduras de cuero. Las armaduras de cuero se venden por un precio realmente bueno, pero el problema es conseguir las hides. Puedes intentar comprarlas a otros jugadores, lo cual no siempre es bueno, dado que puedes llegar a perder dinero, o puedes conseguirlas por ti mismo. Para esto debes matar un animal del tipo "peletero", y luego desollar el cad&aacute;ver (doble clic en un cuchillo y luego en el animal). Para esto los mejores animales son las goats, mountain goats, los ciervos peque&ntilde;os y las vacas.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Quiz&aacute;s al principio no sea de las mejores, pero con el tiempo te puede llegar a dar grandes beneficios.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Herrero</P>
</B><P ALIGN="JUSTIFY">La profesi&oacute;n de herrero es una de las m&aacute;s beneficiosas. De hecho, casi todas las cosas que puede hacer un herrero se venden bien. Por supuesto que siempre hay una estrategia m&aacute;s efectiva que la otra. La que yo recomiendo es esta: fabricar kite shields. Nuevamente son en proporci&oacute;n lo mejor a hacer. Lo dif&iacute;cil en este caso es conseguir los ingots necesarios para fabricar cosas. Se pueden comprar hechos, pero tambi&eacute;n se pueden conseguir mediante el skill de mining, y no es algo f&aacute;cil. </P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Es una de las mas recomendadas, pero hay que tener perseverancia porque no siempre salen las cosas bien.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">El Escolta</P>
</B><P ALIGN="JUSTIFY">Esto consiste en escoltar a personas de un lado a otro de Britannia, generalmente NPC´s (Non-Player´s Characthers). A pesar de que se supone que no hace falta ning&uacute;n oficio para hacer esto, muy pocas veces se pide una escolta para una ciudad cercana. Por lo tanto hay que ser siempre un buen guerrero o mejor aun, un buen mago, para teletransportarse al lugar destino. Los NPC´s que desean ser escoltados suelen estar caminando por el bosque o lugares abiertos. El escolta solo debe decirle la frase "I will take thee" y el contrato estar&aacute; cerrado. El cliente le indicara a donde lo debe llevar, y le dir&aacute; que le dar&aacute; el pago al llegar a destino.</P>
<I><P ALIGN="JUSTIFY">Puntuaci&oacute;n</I> = Paga bien y es un trabajo f&aacute;cil y r&aacute;pido si se tienen las habilidades. Muy bueno.</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

