<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">



</p> <br><br><br><br>

<h3><font face=Arial>El curandero</font></h3>
<p align="justify"><font face=arial size=2>

Esta no es exactamente una profesi&oacute;n, pero podr&iacute;a considerase mas bien como &quot;un modo de vida&quot;. Algunas recomendaciones de c&oacute;mo comenzar son.</P>
<P ALIGN="JUSTIFY"></P>
<B><FONT SIZE=4><P ALIGN="JUSTIFY">B&aacute;sicos</P>
</B></FONT><P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>Strenght: 30 (fuerza)</LI></P>
<P ALIGN="JUSTIFY"><LI>Dexterity: 10 (destreza)</LI></P>
<P ALIGN="JUSTIFY"><LI>Intelligence: 25 (inteligencia)</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<B><FONT SIZE=4><P ALIGN="JUSTIFY">Habilidades (Skills)</P>
</B></FONT><P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>Healing (Curaci&oacute;n): 50. Este ser&aacute; tu arte primario. Usa vendas (bandages) para curar a los dem&aacute;s. Las vendas puedes hacerlas usando una tijera en un poco de tela.</LI></P>
<P ALIGN="JUSTIFY"><LI>Anatomy (Anatom&iacute;a): 50. Una alta puntuaci&oacute;n en este skill aumentara tus habilidades a la hora de curar heridas. Tambi&eacute;n este skill te ayudara a la hora de resucitar personas.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<B><FONT SIZE=4><P ALIGN="JUSTIFY">Habilidades Secundarias </P>
</B></FONT><P ALIGN="JUSTIFY"></P>

<UL>
<P ALIGN="JUSTIFY"><LI>Inscription (Inscripci&oacute;n): Usa esta habilidad para crear pergaminos de curaci&oacute;n.</LI></P>
<P ALIGN="JUSTIFY"><LI>Magery (Magia): Esta habilidad es indispensable para crear pergaminos y tambi&eacute;n para usarlos.</LI></P>
<P ALIGN="JUSTIFY"><LI>Alchemy (Alquimia): Para hacer pociones curativas.</LI></P>
<P ALIGN="JUSTIFY"><LI>Spirit Speak (Hablar con los esp&iacute;ritus): Excelente habilidad para subir la inteligencia. Adem&aacute;s, te dejara hablar con el muerto antes de intentar resucitarlo, para decidir si lo vas a hacer o no.</LI></P>
<P ALIGN="JUSTIFY"><LI>Wrestling (Lucha): Esta es otra indispensable, pero por la defensa. No creer&aacute;s que por ser curandero te van a querer todos los animales y asesinos del mundo. Se elige esta skill de pelea, y no otra, porque deja las manos libres para lanzar hechizos.</LI></P>
<P ALIGN="JUSTIFY"><LI>Skill de comercio: Aqu&iacute; van incluidas Lumberjack (le&ntilde;ador), Bowcraft (arquero), etc., la &uacute;nica utilidad que tienen es que sirven para ganar dinero, que no es poco.</LI></P>
<P ALIGN="JUSTIFY"><LI>Tailoring (Sastrer&iacute;a): Esta es otra habilidad de comercio, pero te dar&aacute; la ventaja de poder hacer tela, lo que te permitir&aacute; fabricar tus propias vendas.</LI></P>
<P ALIGN="JUSTIFY"><LI>Hiding (Esconderse): Como ya hab&iacute;a dicho, no todos te respetaran como participante neutral. En el calor de la batalla, la gente puede no-querer que cures a sus enemigos, y te atacaran. Tambi&eacute;n &uacute;til para escapar de animales y bichos peligrosos cuando no estas armado.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>
<FONT SIZE=4><P ALIGN="JUSTIFY"> </I>La Filosof&iacute;a de un Curandero</P>
</FONT><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Como puedes estar imaginando, lo primero que debes saber es que un curandero no debe intentar luchar ni deber&aacute; nunca atacar a nadie. Nunca levantaras tus manos contra nadie, y por cierto, no intentaras matar a nadie. Deber&aacute;s ofrecer ayuda a aquellos que tengan alg&uacute;n tipo de sufrimiento, curaras a todo el que lo necesite, sin preguntar por su origen o por el origen de sus heridas. </P>
<P ALIGN="JUSTIFY">Al dedicarte a la curaci&oacute;n, no podr&aacute;s darte tantos lujos como en una actividad mas comercial, as&iacute; que no esperes mucho dinero. De las personas que cures solo debes esperar que te ayuden en alg&uacute;n enfrentamiento, o que te ofrezcan un poco de tela para tus vendas. No pidas dinero, porque aunque quiz&aacute;s te lo dieran, estar&iacute;as yendo contra todo lo que un curandero debe esperar. No lleves armas en las manos. Evita llevarlas tambi&eacute;n en la mochila, solo lleva tus instrumentos de curaci&oacute;n, un  cuchillo (que siempre es necesario) y quiz&aacute;s un par de tijeras y un hacha para la madera.</P>
<P ALIGN="JUSTIFY">Luego de un tiempo te dar&aacute;s cuenta que la mejor amiga de un curandero es la oveja. Te ofrece lana sin tener que matarla, y con eso podr&aacute;s ganar dinero, o bien hacer mas vendas (50 con la lana de una sola oveja!) Todo gratuitamente. </P>
<P ALIGN="JUSTIFY"></P>
<FONT SIZE=4><P ALIGN="JUSTIFY">Estrategia del Curandero</P>
</FONT><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Luego de entrenar y mejorar tus habilidades hasta un nivel en el que te sientas mas c&oacute;modo, busca un grupo de aventureros. Cuantos mas sean, y mejor armados est&eacute;n, ser&aacute;n una mejor escolta y tendr&aacute;s mas protecci&oacute;n, pero probablemente tambi&eacute;n tengan poca necesidad de ti. Si por el contrario, es un grupo chico y mas bien d&eacute;bil, agradecer&aacute;n muchisimo tu ayuda. Cuando haya batallas con otros humanos, aseg&uacute;rate de que todos sepan que tu eres neutral y no violento. Tampoco jures lealtad a nadie, eso te impedir&aacute; curar a gente que necesite de mucha ayuda.</P>
<P ALIGN="JUSTIFY"></P>
<FONT SIZE=4><P ALIGN="JUSTIFY">Reglas del Curandero</P>
</FONT><P ALIGN="JUSTIFY"></P>
<OL>

<P ALIGN="JUSTIFY"><LI>Cada curaci&oacute;n consume una venda.</LI></P>
<P ALIGN="JUSTIFY"><LI>Cada aplicaci&oacute;n de una venda consume alrededor de 20 segundos</LI></P>
<P ALIGN="JUSTIFY"><LI>Para intentar una segunda curaci&oacute;n en una misma persona, tendr&aacute;s que esperar 20 segundos desde tu ultimo intento.</LI></P>
<P ALIGN="JUSTIFY"><LI>Solo puedes curar a una persona a la vez. Si intentas aplicarle una venda a dos o mas, no te ser&aacute; permitido.</LI></P>
<P ALIGN="JUSTIFY"><LI>En un nivel de 50 en Healing y 50 en Anatomy, tu rango de curaci&oacute;n estar&aacute; entre los 23 y los 45 puntos. Te&oacute;ricamente, el m&aacute;ximo de puntos de curaci&oacute;n son 80.</LI></P>
<P ALIGN="JUSTIFY"><LI>Debes permanecer a poca distancia del paciente por los 20 segundos que dura la aplicaci&oacute;n.</LI></P>
<P ALIGN="JUSTIFY"><LI>Por mas que tu naturaleza te lo pida, no intentes curar a criminales y asesinos, porque esto te marcara como criminal a ti tambi&eacute;n, y no podr&aacute;s entrar en las ciudades, a riesgo de ser atrapado por los guardias.</LI></P>
<P ALIGN="JUSTIFY"><LI>Si mientras estas curando, alguien te ataca, tus dedos resbalaran de la venda y no podr&aacute;s continuar tu trabajo.</LI></P>
<P ALIGN="JUSTIFY"><LI>Puedes curarte a ti mismo, y hacer pr&aacute;cticamente cualquier cosa. Esto es bueno para cuando te atacan, te curas y corres.</LI></P>
<P ALIGN="JUSTIFY"><LI>No tienes que sacarte las armas de encima para curar, sin embargo, curar mientras se pelea es bastante inefectivo, debido a todos los ataques e interrupciones.</LI></P>
<P ALIGN="JUSTIFY"><LI>A los 60 puntos en Anatomy y Healing, puedes curar veneno.</LI></P>
<P ALIGN="JUSTIFY"><LI>A los 80 puntos, puedes resucitar fantasmas.</LI></P>
<P ALIGN="JUSTIFY"><LI>En general, lo descrito arriba tambi&eacute;n se aplica a la habilidad de Veterinaria, pero lo mas probable es que Animal Lore reemplace a Anatomy.</LI></P></OL>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>

<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



