<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:tear@ciudad.com.ar">Miguel Angel Cividanes "Beren"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

</p> <br><br><br><br>
<h3>Entrevista a Denny Yanuar Ramdhani. Jefe del proyecto UOX.</h3>

<FONT FACE="Arial" SIZE=2><P ALIGN=JUSTIFY><font size=2 face=arial>Esta es la entrevista que le realice a Denny Ramdhani, el iniciador del proyecto</FONT><FONT FACE="Courier New" SIZE=2> </FONT><FONT FACE="Arial" SIZE=2>UOX, para poder convertir a Ultima Online en un juego off-line. Esta entrevista fue realizada a trav&eacute;s de e-mail, ya que por la diferencia horaria (Danny vive en India) y su trabajo, me fue imposible acordar una cita con &eacute;l. A causa de esto notaran la poca interacci&oacute;n que hay durante la entrevista, pero aun as&iacute; creo que es algo interesante para leer. </P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>Macedonia Magazine.- </B></font><I> Qué es UOX?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>Denny Yanuar. R.- </b></font><font size=2> UOX es un emulador de servidor en Ultima Online, emula la funci&oacute;n de un servidor real. De esa manera, podemos hacer que Ultima Online funcione sin necesidad de conectarnos al servidor de OSI (Origin Systems Inc.)
<br>Con todas las funciones del servidor implementadas, podr&iacute;a ser &quot;real&quot;, pero no podemos esperar terminar con el proyecto en tan poco tiempo.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Cu&aacute;ndo comenz&oacute; el proyecto UOX?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Empez&oacute; unos meses despu&eacute;s del lanzamiento del Ultima Online Pre Alpha Test en 1996. Pero en ese momento no lo pude hacer funcionar porque no pod&iacute;a capturar la comunicaci&oacute;n entre el cliente y el servidor.
<br>As&iacute; que el proyecto se freno hasta el lanzamiento del Ultima Online Beta Test. Cuando el Beta Test comenz&oacute; y pude encontrar la comunicaci&oacute;n entre el cliente y el servidor... finalmente pude hacer funcionar a UOX</P>


<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I> Que convierte a UOX en algo que deba usar?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Bueno, algunas cosas son que no te debes conectar a Internet para jugar, por lo tanto no tienes el maldito problema del lag. Puedes jugar solo o jugar con amigos, ya que hemos implementado una opci&oacute;n que lo convierte en multijugador. Puedes crear tu propio servidor con tus propias reglas.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I>Cuales crees que podr&iacute;an ser las ventajas y desventajas de este nuevo sistema?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Voy a hacer una peque&ntilde;a lista:</P>

<ul><li><P ALIGN=JUSTIFY><font size=2 face=arial>Ventajas :
<li><P ALIGN=JUSTIFY><font size=2 face=arial>No hay Lag.
<li><P ALIGN=JUSTIFY><font size=2 face=arial>Tu propio servidor con tus propias reglas.
<li><P ALIGN=JUSTIFY><font size=2 face=arial>Crear tu propia historia
<li><P ALIGN=JUSTIFY><font size=2 face=arial>No tienes que preocuparte por los asesinos, si no te gustan.</P></ul>

<P ALIGN=JUSTIFY><font size=2 face=arial>Desventajas :</P>
<ul>
<li><P ALIGN=JUSTIFY><font size=2 face=arial>No es un servidor completo, muchisimas funciones aun no se han implementado.
<li><P ALIGN=JUSTIFY><font size=2 face=arial>El servidor de UOX aun depende del programa cliente de Ultima Online, as&iacute; que cada vez que Origin cambie el programa, UOX deber&aacute; adaptarse.</P></ul>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I> Estas trabajando en alg&uacute;n otro proyecto?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> No, solo hago trabajo de investigaci&oacute;n en cuestiones de multijugador.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I> Por qué creaste a UOX?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Al principio, solo quer&iacute;a caminar por Britannia sin tener que conectarme a Internet, porque tanto Internet y la cuenta telef&oacute;nica son cosas muy caras en mi pa&iacute;s. Pero entonces muchisimos jugadores de Ultima Online se interesaron en este proyecto, y a muchos de ellos no les gusta la idea del pago por mes :-). As&iacute; que pense, por qué no crear un emulador de servidores?</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I> Que piensas de Ultima Online?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Ultima Online es un concepto de juego excelente, con una muy buena interface y gr&aacute;ficos. Lejos, quiz&aacute;s el mejor juego de rol multijugador que haya existido. Pero de nuevo, quiz&aacute;s no.
 No hay historia en Ultima Online todav&iacute;a, solo algunas b&uacute;squedas, y unos pocos eventos. La comunicaci&oacute;n cliente/servidor no esta hecha demasiado bien, y eso lastima mucho al juego.
<br>Muchas veces se torna &quot;injugable&quot; por esa raz&oacute;n, o tambi&eacute;n por ese &quot;maldito lag&quot;, que es como lo llamamos. Y aqu&iacute; es todav&iacute;a es peor, porque no estoy jugando desde los Estados Unidos.
<br>Y lo peor quiz&aacute;s sea el tener que pagar 10 d&oacute;lares mensuales cuando el juego aun no esta es su mejor momento, y siguen habiendo fallas en &eacute;l. Pero (de nuevo) quiz&aacute;s alg&uacute;n d&iacute;a se convierta definitivamente en el rey de los juegos de rol multijugador, o por lo menos, eso espero. Y es que aun sigo jugando.</P>

<P ALIGN="JUSTIFY"><FONT color="#00aa00"><B>MM.- </B></font><I> Podr&iacute;as contarme algo sobre UOX3 y UOX4?</I></P>

<P ALIGN="JUSTIFY"><FONT color="#AF0CAA" size=2><b>D.Y.- </b></font><font size=2> Son los &uacute;ltimos progresos hechos en UOX, pero no puedo darte demasiada informaci&oacute;n, es que yo ya no pertenezco al equipo de programaci&oacute;n. </P>

<BR><BR>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR><hr>







<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

