<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>		  
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br>


<FONT color="#000000" face="arial">
<H3>Un breve repaso a la serie Ultima.</h3>
</FONT>
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>
A propósito de la inauguración de
la sección de CRPG's en Macedonia y de todos los temas relacionados con los mismos,
he decidido separar esta parte que iba incluida en el reportaje dedicado a Richard 
Garriot para mostrar un resumen, a grandes rasgos, de la historia de la saga de 
juegos de rol por ordenador más importante que existe. Realmente es escasa en contenido pero tampoco
se ha pretendido ir "más allá" de lo que había en el reportaje a Garriot. 
<br>
<br>
Lo que se ha decidido es poner los t&iacute;tulos de las
distintas sagas Ultima, que han aparecido hasta la fecha, junto a un comentario
explicativo de las mismas. Su historia, argumento, en fin, cualquier cosa relacionada
con las mismas. Del mismo modo, se ofrece una visión de los títulos de la misma
en trilogías. Como sabréis, la gran obra de Garriot se encuentra definida claramente
en tres trilogías o libros. He aquí cuáles son:
<br>
<br>

<h4>Saga Troncal</h4><P ALIGN=JUSTIFY>
<b>PRIMERA TRILOGIA</b><BR>
<UL>
<LI>Ultima I:             La Primera Edad De La Oscuridad.<BR>
<LI>Ultima II:            La Venganza De La Hechicera.<BR>
<LI>Ultima III:           Exodo.<BR><BR>
</UL>
<b>SEGUNDA TRILOGIA</b><BR>
<UL>
<LI>Ultima IV:            La B&uacute;squeda Del Avatar.<BR>
<LI>Ultima V:             Guerreros Del Destino.<BR>
<LI>Ultima VI:            El Falso Profeta.<BR><BR>
</UL>
<b>TERCERA TRILOGIA</b><BR>
<UL>
<LI>Ultima VII:           La Puerta Negra.<BR>
<LI>Ultima VII; Parte 2:  La Isla De la Serpiente.<BR>
<LI>Ultima VIII:          Pagan.<BR>
<LI>Ultima Ascension<BR><BR>
</UL>

<h4>Títulos no troncales</h4><P ALIGN=JUSTIFY>
<b>The Worlds Of Ultima</b><BR>
<UL>
<LI>The Savage Empire.<BR>
<LI>Martian Dreams.<BR><BR>
</UL>
<b>Saga UnderWorld</b><BR>
<UL>
<LI>Ultima UnderWorld I:  El Abismo Stigio.<BR>
<LI>Ultima UnderWorld II: El Laberinto De Mundos.<BR><BR>
</UL>
<h4>Otros</h4><P ALIGN=JUSTIFY>
<UL><LI>Ultima Online.</UL>
<P ALIGN=JUSTIFY>
Durante todos los juegos de la serie Ultima, nosotros nos encarnaremos en
un s&oacute;lo personaje. Seremos el Avatar.
<BR>
<BR>
<img src ="gif/u1boxlk.gif" BORDER=1 ALIGN=LEFT>
En la primera parte, <b>Ultima I</b>, aparece  <b>Mondain</b> como encarnaci&oacute;n del mal. Nos
encontramos con un juego bastante t&iacute;pico y el que hay total predominio del
combate. Para acabar con Mondain hab&iacute;a que destruir una gema que era la
que le daba la fuerza y el poder.
<BR><BR>
En el <b>Ultima II</b>, la lucha se centra en <b>Minax</b>, amante del destruido Mondain, pero
mucho m&aacute;s poderosa que este &uacute;ltimo. Aparecen por primera vez las puertas 
lunares que, en posteriores cap&iacute;tulos, tendr&aacute;n una valiosa importancia. 
<BR><BR>
<img src ="gif/u3boxlk.gif" BORDER=1 ALIGN=LEFT>
El <b>Ultima III</b> supone muchas cosas. Por un lado es el fin de la primera trilog&iacute;a y,
por otro lado, es el comienzo de lo que ser&aacute; el verdadero universo Ultima. En este 
episodio deb&iacute;amos de combatir, con el vengativo <b>Exodus</b>, hu&eacute;rfano de
Minax y Mondain (de nuevo, una originalidad no muy grande en lo que es el planteamiento. No ocurrirá
lo mismo en el desarrollo si lo comparamos con los dos títulos anteriores). Para ello deb&iacute;amos de penetrar en su fortaleza, situada
en mitad de los mares. Al derrotar a Exodus nace lo que
de verdad el mundo Ultima. Las tierras de la antigua <B>Sosaria</B> que es donde se
desarrollan las anteriores aventuras, se unen y forman el reino de Britania con Lord British como rey del mismo.
<BR><BR>
<img src ="gif/u4boxlk.gif" BORDER=1 ALIGN=LEFT>
En el <b>Ultima IV: La B&uacute;squeda del Avatar</b>, se procue un giro de 360 grados ya que Richard Garriot pone a prueba
su capacidad  creativa para crear unas bases (ampliamente utilizadas en
los posteriores t&iacute;tulos) dignas de figurar en la mejor de las novelas
de fantas&iacute;a. Se incluyen, por ejemplo, los conceptos de las <b>8 virtudes</b>  
 y la obtenci&oacute;n del <b>c&oacute;digo de la suprema sabidur&iacute;a</b> 
 (¿os suena el Codex of the Ultimate Wisdom?) del <b>Abismo Stigio</b>. 
 (lugar a donde nos arrojarán en el Ultima Underworld).
<BR><BR>
Para el <b>Ultima V: Los Guerreros del Destino</b> Garriot echa mano de los 
anteriores t&iacute;tulos y consagra a&uacute;n m&aacute;s el concepto de universo. 
Los tres fragmentos en los que fue destruida la gema de Mondain produce la 
aparici&oacute;n de tres <b>ShadowLords</b> que secuestran a <b>Lord British</b> 
y ponen en el trono al conoc&iacute;do traidor <b>BlackThorn</b>. El <b>Avatar</b> 
(nosotros) deber&aacute; explorar el desconocido Underworld y rescatar a su rey. Un juego realmente
explendido y con una trama muy interesante.
<BR><BR>
<img src ="gif/u6boxlk.gif" BORDER=1 ALIGN=LEFT>
De nuevo todo est&aacute; encadenado y en el <b>Ultima VI: El Falso Profeta</b> 
las acciones del Avatar en el Underworld provocar&aacute; que las <b>G&aacute;rgolas</b> (de gran
presencia e importancia a lo largo de la saga) se rebelen como consecuencia de ver su
territorio destrozado. Este t&iacute;tulo merece una menci&oacute;n especial ya 
que, si se sabe leer el transfondo del mismo, llegaremos a la conclusi&oacute;n 
de que Garriot aborda de forma magistral temas como el racismo, es m&aacute;s, 
este Ultima esta basado en su pr&aacute;ctica  totalidad en el dialogo que el 
Avatar tiene que llevar entre la raza humana y la de las G&aacute;rgolas para lograr una pacificaci&oacute;n. 
Con este Ultima, Garriot, cierra la segunda trilog&iacute;a de una forma soberbia.
<BR><BR>
<img src ="gif/u7boxlk.gif" BORDER=1 ALIGN=LEFT>
Ya nos encontramos en el <b>Ultima VII: La Puerta Negra</b>, que es considerado por
muchos como el mejor juego de rol de ordenador de la historia. El 
argumento principal consiste en la propagaci&oacute;n por el reino de Britania de 
una nueva corriente filos&oacute;fica que propugna unos nuevos valores. A medida 
que avancemos en el juego descubriremos misteriosos asesinatos, ritos, 
la aparici&oacute;n de droga, etc. Estos temas siempre van a estar girando 
alrededor de la llegada del nuevo enemigo del Avatar, <b>el Guardian</b> al reino de
Britania. Para que os hagáis una idea de la magnitud de esta obra de arte, 
se tuvo que dividir en dos partes la historia de la misma.
<BR><BR>
El <b>Ultima VIII: Pagan</b> es &uacute;ltimo t&iacute;tulo troncal de la saga que ha salido hasta la
fecha (aunque el noveno episodio está en camino) y en él se presenta el
combate del Avatar con el Guardian en su propio Mundo: Pagan. Este t&iacute;tulo,
puede considerarse muy flojo y realmente desastroso para los seguidores de la saga. 
<BR><BR>
<img src ="gif/uwboxlk.gif" BORDER=1 ALIGN=LEFT>
Como t&iacute;tulos no troncales de la saga se encuentran los pertenecientes 
a <b>Worlds Of Ultima</b>. Estos productos son una especie de homenaje a obras 
del calibre de "Viaje al Centro de la Tierra" de Verne. Por otro lado, 
tambi&eacute;n tenemos las dos partes de <b>Ultima Underworld</b> que vienen 
por un lado a mostrar (en aquellas fechas) la tecnolog&iacute;a punta que 
utilizaba Origin en sus engines 3-D y por otro lado a explotar nuevos lugares de 
desarrollo de las aventuras del Avatar como es el Abismo Stigo en la primera de los
Underworld (un juego excelente).
<BR><BR>
En la actualidad Richard Garriot ya ha concluido el <b>Ultima Online</b> que es
sin duda, el proyecto que m&aacute;s tiempo le ha ocupado (Os recomiendo que si
sois jugadores del mismo, leáis los excelentes artículos escritos por Miguel Angel Cvidanes
y José Manuel Hernández para Macedonia). El Ultima Online se trata de un Ultima 
multijugador v&iacute;a Internet en que varios cientos de personas pueden 
convivir en el universo ideado por Garriot. 
<BR><BR>
Por otro lado la espera se cierne sobre la que, probablemente, sea &uacute;ltima
parte y punto final de la serie Ultima, el <b>Ultima Ascension</b>. Este juego, que es posible
que no luzca la numeración novena, ha sido desarrallado utilizando la tecnología 3D y las
espectativas que está levantando son muy grandes. Lo único que esperamos todos los
aficionados es que el juego sea digno miembro de pertenecer a la saga y, sobre todo,
 corregir el tremendo error cometido con el Ultima VIII.
<BR><BR>


<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpga.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


