<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:srd@retemail.es">Samuel Rísquez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<BR><BR><BR><BR>

<h3>DOLPHIN; el nuevo juguete de Nintendo</h3>

<P align="justify">

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">


<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Era l&oacute;gico. Despu&eacute;s de
la salida a la venta de DreamCast (ya hace m&aacute;s de medio a&ntilde;o)
por parte de Sega en Jap&oacute;n, y el anuncio de la salida a corto plazo
de PlayStation 2, no se pod&iacute;a esperar menos de Nintendo.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>El hasta hace apenas unos meses poseedor
de la consola con mayor tecnolog&iacute;a en gr&aacute;ficos y procesamiento
(Nintendo 64), con unos resultados realmente buenos, aunque tal vez poco
para lo que se pod&iacute;a esperar, no pod&iacute;a quedarse de brazos
cruzados ante sus competidores.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>As&iacute; que atac&oacute; con la
misma moneda que Sega y Sony: una nueva consola totalmente revolucionaria.</FONT></FONT>

<FONT FACE="Arial"><H4>Características técnicas</FONT></H4>
<FONT FACE="Arial"><FONT SIZE=-2>(datos extra&iacute;dos del comunicado
de Nintendo Espa&ntilde;a)</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1 color="#CC0000"><B>CPU.</B></FONT></FONT>
<br><hr width="30%" align="left">
<FONT FACE="Arial"><FONT SIZE=-1>-Procesador IBM Gekko (una extensi&oacute;n
de la arquitectura del IBM Power PC)</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Velocidad de reloj de 400 Mhz</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Tecnolog&iacute;a Copper (cobre)
de 0,18 micras</FONT></FONT>
<br>
<BR><FONT FACE="Arial"><FONT SIZE=-1 color="#CC0000"><b>Gráficos.</b></FONT></FONT>
<br><hr width="30%" align="left">
<FONT FACE="Arial"><FONT SIZE=-1>-Chip personalizado dise&ntilde;ado
por ArtX</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Velocidad de reloj de 200 Mhz</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Tecnolog&iacute;a DRAM de 0,18 micras</FONT></FONT>
<br>
<BR><FONT FACE="Arial"><FONT SIZE=-1 color="#cc0000"><b>Memoria del sistema.</b></FONT></FONT>
<br><hr width="30%" align="left">
<FONT FACE="Arial"><FONT SIZE=-1>-Tecnolog&iacute;a DRAM de alta velocidad</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Anchura de banda de memoria de 3,2
GB/segundo</FONT></FONT>
<br>
<BR><FONT FACE="Arial"><FONT SIZE=-1 color="#cc0000"><b>Soporte de software.</b></FONT></FONT>
<br><hr width="30%" align="left">
<FONT FACE="Arial"><FONT SIZE=-1>-DVD con tecnolog&iacute;a Matsushita</FONT></FONT>
<BR><FONT FACE="Arial"><FONT SIZE=-1>-Protecci&oacute;n mejorada contra
la pirater&iacute;a</FONT></FONT>

<FONT FACE="Arial"><H4>Compañías asociadas</FONT></H4>
<FONT FACE="Arial"><FONT SIZE=-1>IBM: Es la creadora del procesador
central, el Gekko, que es una adaptaci&oacute;n para Nintendo del Power
PC. En IBM aseguran estar satisfechos de su uni&oacute;n con Nintendo pues
creen que es de las pocas compa&ntilde;&iacute;as preparadas para este
reto (aunque probablemente dir&iacute;an lo mismo de Sega o Sony –aunque
recordemos que Sony ya se tiene a s&iacute; misma- si fuese con ellos con
los que se hubiese aliado). IBM es la &uacute;nica compa&ntilde;&iacute;a
que crea procesadores con cobre, y parece que los resultados no son nada
malos.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>MATSUSHITA: Conocida por estor lares
del mundo por una de sus compa&ntilde;&iacute;as derivadas, Panasonic,
Matsushita es la competidora en hardware m&aacute;s directa de Sony en
Jap&oacute;n. &Eacute;sta ser&aacute; la compa&ntilde;&iacute;a encargada
de crear la unidad de DVD, que al parecer llevar&aacute; consigo un eficiente
sistema antipirater&iacute;a (veremos cuanto tardan en salt&aacute;rselo).
Hubo una gran expectaci&oacute;n en el E3 cuando se anunci&oacute; el uso
de &eacute;ste soporte en lugar del cartucho. Recordemos que, si Nintendo
utiliz&oacute; cartucho para N64, fue porque, aparte de que crey&oacute;
que el espacio ser&iacute;a m&aacute;s que suficiente (adem&aacute;s de
que ya ten&iacute;an el 64DD en mente y no esperaban que fuese a tardar
tanto), es que &eacute;ste sistema proporciona un r&aacute;pido acceso
a los datos, evitando cargas, adem&aacute;s de que con Super Mario 64 ya
pudimos comprobar el bien que pod&iacute;a hacer a la banda sonora (&iquest;alguien
recuerda en las pantallas de agua c&oacute;mo cambiaba la m&uacute;sica
de cuando flot&aacute;bamos a cuando buce&aacute;bamos, o a cuando toc&aacute;bamos
tierra?). Como dijo Miyamoto en una rueda de prensa, &eacute;ste sistema
tambi&eacute;n les ahorraba espacio, pues permit&iacute;a alternar entre
datos colocados en distintos lugares del soporte y no ten&iacute;an que
repetir los mismos archivos una y otra vez como ocurre en un CD, o cargar
la pantalla (lo que comportaba espera) para luego cargar la m&uacute;sica
directamente desde el soporte del software. Pero la r&aacute;pida velocidad
que el DVD traer&aacute; evitar&aacute; todos estos contratiempos del CD.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>ART-X: &Eacute;sta es la compa&ntilde;&iacute;a
encargada del procesador gr&aacute;fico de la consola. Est&aacute; compuesta
por extrabajadores de Silicon Graphics (ahora SGI). No se han dicho los
motivos de &eacute;sta separaci&oacute;n, tal vez una decisi&oacute;n de
Silicon que no gust&oacute; a los ahora componentes de Art-X, y tampoco
a Nintendo, pues al parecer ya estaba planeando su nueva consola con SGI
pero al final ha acabado siendo Art-X la encargada del revolucionario procesador.
Pero el caso es que se puede decir que esta compa&ntilde;&iacute;a es como
una selecci&oacute;n de lo mejor de lo mejor de SGI, y seg&uacute;n Nintendo,
su tecnolog&iacute;a para gr&aacute;ficos 3D es extraordinaria.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Y bueno, Nintendo est&aacute; content&iacute;sima
con todas estas alianzas. Al igual que Sega con DreamCast, &eacute;sta
consola no ser&aacute; tan suya como las anteriores, pero mientras siga
estando Nintendo detr&aacute;s, coordinandolo todo y aportando su siempre
genial software, son de esperar unos resultados &uacute;nicos.</FONT></FONT>

<FONT FACE="Arial"><H4>Hablemos un poco de software</FONT></H4>



<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>La consola saldr&aacute;, seg&uacute;n
previsiones de Nintendo, en el &uacute;ltimo trimestre del 2000 (posiblemente
s&oacute;lo en Jap&oacute;n). De ahora a entonces es solo un a&ntilde;o
y medio, poco para juegos de los buenos, as&iacute; que tenemos que suponer
que al menos Nintendo y Rare ya est&aacute;n trabajando en juegos desde
hace tiempo. Si Super Mario 64 fue revolucionario para Nintendo 64, y que
demostr&oacute; lo que val&iacute;a &eacute;sta consola, es de esperar
que haya otro juego con la misma misi&oacute;n, un juego que no pueden
hacer en poco tiempo.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>A&uacute;n no hay nada confirmado sobre
cu&aacute;l ser&aacute; &eacute;se juego, pero las apuestas est&aacute;n
en marcha: &iquest;Mario, Link o los Pocket Monsters? &iquest;O... o todo
a la vez?</FONT></FONT>

<FONT FACE="Arial"><H4>Y.. ¿Qué va a ser de mi consola?</FONT></H4>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Sobre la durabilidad de la N64, podemos
estar tranquilos, hay en preparaci&oacute;n un nuevo Kirby, m&aacute;s
sobre los Pocket Monster, un segundo Smash Brothers, la conexi&oacute;n
con la Game Boy, y un largo etc de juegos en preparaci&oacute;n. Tambi&eacute;n
hay una continuaci&oacute;n de Zelda ya empezada (llamada Ura Zelda), que
al parecer saldr&aacute; a finales de a&ntilde;o y para el 64DD, que seg&uacute;n
Nintendo S&Iacute; saldr&aacute;, aunque de momento s&oacute;lo en Jap&oacute;n.
Puede que &eacute;ste juego nos llegue en cartucho, o seg&uacute;n &uacute;ltimos
rumores, en 64DD seg&uacute;n como funcione en Jap&oacute;n...</FONT></FONT>

<FONT FACE="Arial"><H4>Otros</FONT></H4>


<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Sobre la tecnolog&iacute;a de cobre
de IBM, este es, extra&iacute;do de la nota de prensa de Nintendo Espa&ntilde;a,
el avance de esta revolucionaria tecnolog&iacute;a en sus dos a&ntilde;os
de exist&eacute;ncia:.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Septiembre de 1997: IBM anuncia un
avance hist&oacute;rico, una tecnolog&iacute;a del proceso de fabricaci&oacute;n
que incorpora el cobre. Esta tecnolog&iacute;a permite que los fabricantes
de chips utilicen cables de cobre en lugar de las tradicionales conexiones
de aluminio, para enlazar los transistores de los chips. Esta ventaja da
a IBM el liderazgo en la creaci&oacute;n de la futura generaci&oacute;n
de semiconductores.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Octubre de 1997: IBM introduce su primera
oferta de chip personalizado (ASIC) basado en cobre.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Septiembre de 1998: Los procesadores
basados en cobre son fabricados y enviados desde la f&aacute;brica de IBM
en Burlington, Vermont, incluidos los procesadores del Power PC , destinados
a los ordenadores Apple. IBM es el primer fabricante de chips que aprovecha
los procesos avanzados del cobre.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>Diciembre de 1998: Popular Science
Magazine cita a la tecnolog&iacute;a del cobre de IBM como "Lo Mejor de
lo Nuevo", en sus "100 a&ntilde;os de grandes logros cient&iacute;ficos
y tecnol&oacute;gicos". Entre las ventajas citadas est&aacute;n su enorme
aumento en la velocidad de proceso, as&iacute; como sus bajos requisitos
de potencia.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>3 de Mayo de 1999: IBM toma el liderazgo
tecnol&oacute;gico con la introducci&oacute;n del primer servidor que utiliza
cobre - el S/390 G6 Parallel Enterprise Server. Los dise&ntilde;adores
de chips de IBM fueron capaces de aumentar el rendimiento del sistema,
su velocidad y fiabilidad hasta en un 50 por ciento sobre sus predecesores.</FONT></FONT>

<p align="justify"><FONT FACE="Arial"><FONT SIZE=-1>12 de Mayo de 1999: IBM y Nintendo
anuncian el primer sistema de videojuegos que incorporar&aacute; la innovadora
tecnolog&iacute;a del chip de cobre. Un procesador central basado en el
Power PC de 400 Mhz y personalizado, ser&aacute; utilizado en la siguiente
generaci&oacute;n de consolas de videojuegos que esperamos poner a la venta
en el cuarto trimestre del a&ntilde;o 2000. IBM sigue siendo la &uacute;nica
compa&ntilde;&iacute;a en fabricar productos utilizando la probada tecnolog&iacute;a
semiconductora del cobre.</FONT></FONT>


<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="rtfnin.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







