<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>rtículos / Reportajes</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:srd@retemail.es">Samuel Rísquez</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">

<BR><BR><BR><BR>

<h3>Reportaje sobre la DreamCast</h3>

<P ALIGN="JUSTIFY"><font face=Arial size=2>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"><font face=Arial size=2>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Es una maravilla. Es una gran proeza t&eacute;cnica. Es... DreamCast. Ya ha salido en Jap&oacute;n y dicen que aqu&iacute; llegar&aacute; en septiembre. Y esparamos que as&iacute; sea.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Os hago un peque&ntilde;o avance de lo que esta m&aacute;quina es. Os doy sus caracter&iacute;sticas, os hablo de sus principales juegos y os nombro y describo todos sus perif&eacute;ricos. Que este peque&ntilde;o reportaje sirva de ayuda para que SEGA se reponga.</P></FONT></BODY>

<center><img src="jpg/dc_front.jpg"></center>

<br><br><br><br>

<FONT SIZE=5 FACE=ARIAL><b>Periféricos</b></FONT>

<hr>

<center><img src="jpg/varios.jpg"></center>



<br><br><br>

<img src="jpg/dcklein.jpg" align="left"><h4>Visual Memory System</h4>

</U><P ALIGN="JUSTIFY"><font face=Arial size=2>Es una tarjeta de memoria con funciones especiales. A parte de grabar las partidas tanto de la consola como de las recreativas que se creen a partir de ahora por parte de SEGA, podremos cargar juegos desde la Dream Cast para jugar en su pantalla como si fuera una port&aacute;til, e incluso tendr&aacute; algunas funciones de agenda.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Caracter&iacute;sticas t&eacute;cnicas;</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>CPU; 8 bits</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Memoria; 128 Kb</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Pantalla; LCD 48 x 32 puntos cuadrados monocromo</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Alimentaci&oacute;n; 2 pilas de bot&oacute;n</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Sonido; 1 canal</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Tama&ntilde;o; 80 x 47 x 16 mm</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Controles; un bot&oacute;n direccional, dos botones de disparo (A y B), un bot&oacute;n de selecci&oacute;n de modo (Mode) y un tal Dormir (Sleep) para ¿apagar el aparato?</P>

<img src="jpg/vtras.jpg" align="left"><h4>Pad</h4><P ALIGN="JUSTIFY"><font face=Arial size=2>Despu&eacute;s de pensar un buen rato, se llega a la conclusi&oacute;n de que las consolas requieren un pad para seguir siendo llamadas as&iacute;. Un pad es lo que da esa sencillez de manejo a los juegos, tan envidiada por los ordenadores personales.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>En esta ocasi&oacute;n, el pad de SEGA para su Dream Cast dispone de un stick que acepta cualquier direcci&oacute;n, otro stick pero como los de las consolas de 8 bits, con s&oacute;lo 4 direcciones, y ya los botones t&iacute;picos de la consola: A, B, C, X, Y, Z, m&aacute;s el R y L para girar en los juegos de carreras, colocados estos dos &uacute;ltimos en la parte de abajo a modo de gatillo.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Como se puede ver en una de las im&aacute;genes, el pad tiene dos entradas para el VMS, y una de ellas podr&iacute;a ser usada, m&aacute;s adelante, para usar con el Puru Puru Pack, del que os hablamos m&aacute;s abajo...</P>

<img src="jpg/teclado.jpg" align="left"><h4>Teclado</h4><P ALIGN="JUSTIFY"><font face=Arial size=2>Para conectar a la red... Los que han tenido que hacerlo desde la Dream Cast sin este perif&eacute;rico, es decir, "a palo" con el mando, pueden justificar muy bien esto...</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Puesto que ha sido dise&ntilde;ado junto a Microsoft, precisamente porque se ha ideado para el sistema operativo que lleva, una adaptaci&oacute;n del Windows CE, tiene las teclas de m&eacute;todo abreviado tan caracter&iacute;sticas de los teclados creados para Windows.</P>

<h4>Módem</h4>

<BR>

No os podemos decir demasiado sobre este perif&eacute;rico. Tan s&oacute;lo que va a 33.600 bos y que, c&oacute;mo no, har&aacute; de intermedio entre la consola y la red telef&oacute;nica...</P>

<img src="jpg/astick.jpg" align="left"><h4>Arcade Stick</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Para jugar a los arcades de lucha, como al Virtua Fighter 3 tb, que para ello se mataron tanto los de SEGA en versionarlo...</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Tiene entrada para el VMS, los 6 botones caracter&iacute;sticos de la consola y, por supuesto, un stick, hecho de manera especial (como la "palanca" del pad de la Nintendo 64) para que admita cualquier posici&oacute;n. Y es que la tecnolog&iacute;a hace milagros, y es de agradecer para jugar a grandes juegos, como es el caso de VF3tb...</P>

<h4>Puru puru pack</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Es ni mas ni menos que un aparato vibratorio para hacernos sentir MUCHO mejor las sensaciones que los juegos proporcionan. Vibra, suponemos que con distintos grados de fuerza, cada vez que en el juego pase algo que pueda provocarlo: un golpe o un pu&ntilde;etazo en un juego de lucha, un accidente en un juego de carreras... Saldr&aacute; pr&oacute;ximamente en Jap&oacute;n.</P>

<img src="gif/volante.gif" align="left"><h4>Racing Wheel</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>El Racing Wheel es, ni m&aacute;s ni menos, un volante para aprovechar al m&aacute;ximo la &uacute;ltima maravilla automovil&iacute;stica: Sega Rally 2. Por supuesto, a parte de la "rueda", dispone de los botones para las funciones "normales" de la consola, como son los 6 botones del pad (A,B,C,X,Y,Z) y los ya t&iacute;picos R y L, aunque sinceramente, no sabemos que uso tendr&aacute;n estos dos &uacute;ltimos, pues para girar tenemos la "rueda" (volante). Suponemos que le habr&aacute;n dado al menos una entrada para el VMS u otros, como el Puru Puru Pack...</P>

<font size=2 face=arial>

<br><br>

<FONT SIZE=5 FACE=ARIAL><b>Previews</b></FONT>

<hr>

<br><br><br>



<img src="gif/sadc02.gif" align="left"><h4>Sonic Adventures</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>El puercoesp&iacute;n vuelve a la carga... Velocidad, velocidad y m&aacute;s velocidad acompa&ntilde;ar&aacute; a las nuevas aventuras de la graciosa mascota de SEGA.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>El &quot;pesao&quot; de Robotnick sigue con su ambici&oacute;n de conseguir las Esmeraldas del Caos, y Sonic sigue con su ambici&oacute;n de detenerle (l&oacute;gico, ¿no?</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Le acompa&ntilde;ar&aacute;n Tails, Knucles, Ami, y dos personajes nuevos, E-102 y Big, de los que os hablaremos en cuanto sepamos m&aacute;s.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Cada uno de los m&aacute;s de 5 enormes niveles ha sido retocado y adaptado a las habilidades que cada personaje pueda tener. De &eacute;sta forma, si ya era una diversi&oacute;n recorrerse cada nivel, imaginad tener que jugar una y otra vez con cada uno de los personajes, m&aacute;s los que cuentas por all&iacute; que estar&aacute;n secretos...</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Y el juego rebosa calidad por los cuatro costados. Esperamos poder jugar pronto para poder contaros m&aacute;s sobre un juego que promete ser un bombazo...</P>

<h4>Sega Rally 2</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>M&aacute;s de 10 coches, 10 circuitos m&aacute;s los secretos, muchas marcas de prestigio... Dicen que la versi&oacute;n casera superar&aacute; a la original. Porque, seg&uacute;n SEGA, su DreamCast puede mover m&aacute;s pol&iacute;gonos que la Model 3 (su &uacute;ltima placa para arcades), as&iacute; que la sensaci&oacute;n de velocidad est&aacute; asegurada. Tiene m&aacute;s coches y m&aacute;s circuitos que su versi&oacute;n original, as&iacute; que, ¿que m&aacute;s deciros para convenceros?</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Tendremos coches de Peugeot, de Toyota, de Ford, ... Seg&uacute;n si es de d&iacute;a o de noche, todos los escenarios cambiar&aacute;n, tendr&aacute; su modo &quot;normal&quot; (competici&oacute;n), supones que ya el t&iacute;pico de pr&aacute;ctica, y todo lo dem&aacute;s ya son habladurias y nada oficial. Soportar&aacute; partidas en la red (¡el primer juego en hacerlo!), as&iacute; que imaginad poder jugar con vuestro primo de la otra punta del pa&iacute;s o, qui&eacute;n sabe, con alguien que hay&aacute;is conocido en un foto, o en un chat.... </P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Adem&aacute;s, para los que sig&aacute;is prefiriendo el arcade, SEGA instalar&aacute; en sus m&aacute;quinas una salida para VMS, con lo que podr&aacute;s grabar la partida en tu casa e irte a jugar al sal&oacute;n de la esquina, o viceversa...</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Al igual que con el resto de juegos, os contaremos m&aacute;s en cuanto hayamos jugado. Sed buenos...</P>

<h4>Virtua Fighter 3 tb</h4>

<P ALIGN="JUSTIFY"><font face=Arial size=2>&Eacute;ste juego es otro de los que m&aacute;s tiempo se llevaba esperando. Virtua Fighter 3 es considerado, hasta ahora, el mejor arcade de lucha disponible en los salones de lucha. Y en su conversi&oacute;n casera no pod&iacute;a ser menos.</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>No ver&eacute;is ni un solo pol&iacute;gono dando sospechosas vueltas. No perder&eacute;is ninguno de vista. Virtua Fighter 3 es el arcade de lucha de mejor calidad t&eacute;cnica disponible (en Jap&oacute;n) de forma casera. Es r&aacute;pido. Tiene unos 20 escenarios, much&iacute;simos personajes (cada uno con sus cualidades y defectos, claro).</P>

<P ALIGN="JUSTIFY"><font face=Arial size=2>Adem&aacute;s, al Arcade Stick os har&aacute; olvidar los oscuros salones recreativos. ¡Viva el jugar en casa!</P></B></FONT>

<FONT FACE="Arial" SIZE=2>

<br><br>

<FONT SIZE=5 FACE=ARIAL><b>Características técnicas</b></FONT>

<hr>

<br><br><br>



<FONT FACE="Arial" SIZE=2>

*CPU; Hitachi SH4 RISC 128 bits<br>

*Velocidad; 200 MHz a 360 millones de instrucciones por segundo<br>

*Engine Grafico 3D; Power VR2<br>

*Poligonos maximos en procesamiento; 3.000.000<br>

*Sonido; Procesador Yamaha 32 bits RISC (64 canales de sonido)<br>

*RAM; 16 Mb<br>

*RAM de video; 10 Mb<br>

*RAM de sonido; 2 Mb<br>

*Modem; incluido uno a 33.6 kbpds, canjeable por el usuario.<br>

*Sistema operativo; Windows CE<br>

*Paleta; 16’7 millones de colores (¿se llegaran a utilizar todos?)<br>

*Recursos de imagen; Bump mapping, niebla, Alpha Blending, Mip *Mapping, filtro Trilineal, Anti Aliasing, ...<br>

*Tama&ntilde;o; 190 x 195 x 78 mm<br>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="rtfsega.htm"><font FACE="ARIAL"><B>[Artículos / Reportajes]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







