<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>T</B></font><FONT color="#000000" size=7 face="arial"><B>eclados Fuera</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>



</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:kyle_jx2@yahoo.com">Javier M.</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<h3>PlayStation 2</h3>
<P ALIGN="JUSTIFY"><IMG SRC="jpg/ps2-1.jpg" HEIGHT=226 WIDTH=178 ALIGN=LEFT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La
batalla ha comenzado. Despu&eacute;s de varios meses esperando la respuesta
de Sony al desaf&iacute;o de la Dreamcast, la compa&ntilde;&iacute;a nipona
ha decidido devolverle la jugada a Sega, y lo ha hecho anunciando la “Playstation
de la pr&oacute;xima generaci&oacute;n”, “Playstation 2” o lo que quieras
llamarle, a falta de una denominaci&oacute;n definitiva. Y lo ha hecho
por la puerta grande, sorprendi&eacute;ndonos con una especificaciones
t&eacute;cnicas que superan, incluso, a los PCs de &uacute;ltima generaci&oacute;n.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<FONT FACE="Arial,Helvetica">
<H4>La consola</H3>
<FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La Playstation 2 contar&aacute;
con un procesador central de 128 bits, cuya velocidad alcanzar&aacute;
los 300 Mhz (comp&aacute;ralos con los 200 Mhz de la Dreamcast, o los 33
Mhz de la actual Playstation). Ese procesador, denominado “Emotion Engine”
(algo as&iacute; como “Motor Emotivo”), estar&aacute; potenciado por un
Sintetizador de Gr&aacute;ficos capaz de producir 75 millones de pol&iacute;gonos
(!) por segundo sin texturas (20 millones con texturas y efectos). El soporte
ser&aacute; DVD-Rom, aunque tambi&eacute;n podr&aacute; leer CD-Roms normales,
algo indispensable para un sistema que ser&aacute; 100% compatible con
la actual Playstation. S&iacute;, lo has o&iacute;do bien: todos los juegos
y perif&eacute;ricos disponibles para Playstation funcionar&aacute;n en
la Playstation 2, una medida que parece bastante sensata si Sony no quiere
alienar a los millones de propietarios de la actual Playstation.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>Emotion Engine</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Sony ha afirmado que la Playstation
2 podr&aacute; procesar 75 millones de pol&iacute;gonos por segundo, cifra
que habr&aacute; producido, con toda seguridad, desmayos a m&aacute;s de
uno. Pero hemos de tener en cuenta que esta cifra se refiere a pol&iacute;gonos
b&aacute;sicos, sin ning&uacute;n tipo de efectos. Si tomamos en consideraci&oacute;n
efectos como el mapeado de texturas (im&aacute;genes aplicadas sobre la
superficie del pol&iacute;gono), el filtrado (para que las texturas parezcan
limpias, naturales, sin pixelaci&oacute;n) y la iluminaci&oacute;n (sombras
y efectos de luces), el n&uacute;mero de pol&iacute;gonos por segundo se
reduce a 20 millones. Y si a esto a&ntilde;adimos que el procesador central
debe atender a otros factores, como los efectos de sonido, la m&uacute;sica,
la inteligencia artificial de los personajes, etc., podr&iacute;amos arrojar
una cifra (conservadora) de 8 a 10 millones de pol&iacute;gonos por segundo
para la primera generaci&oacute;n de juegos.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>
<br><br>
<center><IMG SRC="jpg/ps2-2.jpg" HEIGHT=174 WIDTH=253></center>
<br><br>
<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Hablando
de efectos gr&aacute;ficos, aparte de los ya conocidos como el mip-mapping,
el filtrado bi-lineal, el anti-aliasing, la correcci&oacute;n de texturas
y el z-buffering, cabe mencionar el procesado de curvas Bezier, una t&eacute;cnica
que no s&oacute;lo permite seleccionar al sistema cu&aacute;ntos pol&iacute;gonos
ser&aacute;n necesarios para que un objeto presente una superficie m&aacute;s
suavizada, sino que tambi&eacute;n ofrece la posibilidad de que el procesador
utilice, en un determinado momento, el n&uacute;mero de pol&iacute;gonos
estrictamente necesarios para evitar la sobrecarga del sistema.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Todo esto es posible debido
al “Emotion Engine”, el nombre con el que Sony ha denominado a la unidad
central de proceso de la Playstation 2. En palabras de la compa&ntilde;&iacute;a
nipona: “la ‘Emotion Synthesis (tm)’ no s&oacute;lo comunica al sistema
cu&aacute;l ser&aacute; el aspecto de las im&aacute;genes, sino tambi&eacute;n
c&oacute;mo piensan, act&uacute;an y se comportan los personajes y objetos
de un juego. Este concepto requiere un sistema con una capacidad masiva
de c&aacute;lculo matem&aacute;tico de coma flotante que va mucho m&aacute;s
all&aacute; de la de las estaciones de trabajo m&aacute;s potentes existentes
actualmente, y se acerca a la actuaci&oacute;n de s&uacute;per ordenadores
a gran escala utilizados para simulaciones cient&iacute;ficas”. Uno de
los ejemplos de la potencia del sistema es que permitir&iacute;a recrear
cada uno de los cabellos de un personaje determinado. Da la impresi&oacute;n
de que gr&aacute;ficos que s&oacute;lo pueden ser creados por grandes estaciones
de trabajo en la actualidad estar&aacute;n al alcance de todos con la Playstation
2.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>DVD</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La Playstation 2 tendr&aacute;
una unidad DVD que permitir&aacute; la lectura tanto de CDs normales (650
megas de capacidad) como DVDs (4.7 gigas de capacidad). Sony ha afirmado,
al respecto, que los juegos, en un principio, vendr&aacute;n en formato
CD, y s&oacute;lo utilizar&aacute;n el formato DVD aquellos que requieran
su gran capacidad de almacenamiento.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La velocidad de la unidad
DVD a&uacute;n no se ha decidido (actualmente, las unidades de DVD m&aacute;s
r&aacute;pidas permiten una transferencia de 6 Mb por segundo). Tampoco
est&aacute; claro si la consola permitir&aacute; reproducir pel&iacute;culas
en formato DVD, aunque no se descarta el lanzamiento posterior de un adaptador
que lo permita. Eso s&iacute;: la inclusi&oacute;n de tecnolog&iacute;a
de compresi&oacute;n de v&iacute;deo MPEG-2 permitir&aacute; la reproducci&oacute;n
de escenas de v&iacute;deo de alta calidad.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>Conectividad</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Uno de los aspectos m&aacute;s
interesantes de la nueva Playstation es su capacidad de ampliaci&oacute;n.
Sony ha licenciado la tecnolog&iacute;a FireWire, creada por Apple, consistente
en un bus externo digital que permite la transferencia de datos a 400 Mbs
(400 millones de bits por segundo), con el que se pueden conectar hasta
63 aparatos en cadena. Adem&aacute;s, el sistema tambi&eacute;n incluye
la tecnolog&iacute;a USB y PCMCIA (que permite la utilizaci&oacute;n de
PC-Cards), lo cual permitir&aacute; la conexi&oacute;n de todo tipo de
perif&eacute;ricos al sistema. Todo apunta a que la Playstation 2 tendr&aacute;
alg&uacute;n tipo de m&oacute;dem, aunque Sony no ha confirmado nada al
respecto, ya que, seg&uacute;n la propia compa&ntilde;&iacute;a, cualquier
cosa que anuncie estar&aacute; obsoleta en el momento de salir al mercado.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>Software</h4>

<P ALIGN="JUSTIFY">
<IMG SRC="jpg/ps2-3.jpg" HEIGHT=218 WIDTH=236 ALIGN=right>
<FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Desde que Sony desvelara
las especificaciones de la Playstation 2, varias compa&ntilde;&iacute;as
han anunciado ya su deseo de programar para la m&aacute;quina. Nueve compa&ntilde;&iacute;as
japonesas han expresado su compromiso de desarrollar para la m&aacute;quina:
Konami, Square, Namco, Capcom, Atlus, Enix, Gasto, Koei y From Software.
Otras compa&ntilde;&iacute;as que a&uacute;n no se han decidido, pero que
est&aacute;n investigando la posibilidad de desarrollar para la Playstation
2, son: Takara, Data East, ASCII, SNK, Epoch Co., Game Arts, Jaleco, Taito,
Tecmo, Hudson, Bandai, Victor Interactive Software, Human, Artdink, Imagineer
y NEC International.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Acclaim es la &uacute;nica
compa&ntilde;&iacute;a occidental que ha anunciado oficialmente su intenci&oacute;n
de desarrollar juegos para la Playstation 2. Es l&oacute;gico pensar que
compa&ntilde;&iacute;as como Naughty Dog y Electronic Arts (que no han
hecho a&uacute;n ning&uacute;n anuncio oficial) desarrollar&aacute;n para
la m&aacute;quina. Y se espera que gigantes como Eidos, Midway, Activision
e Infogrames hagan lo propio pr&oacute;ximamente.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La cuesti&oacute;n m&aacute;s
importante, no obstante, es qui&eacute;n ser&aacute; capaz realmente de
aprovechar las inmensas posibilidades que, sobre el papel, al menos, posee
la Playstation de la Pr&oacute;xima Generaci&oacute;n. Esto es lo que se
cuestiona el presidente de Square, T. Takechi: “no m&aacute;s de 5 compa&ntilde;&iacute;as
pueden desarrollar juegos que aprovechen totalmente la capacidad de la
Playstation 2” (entre ellas, es l&oacute;gico suponer, se encuentran Sony,
Namco y Square).</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>&iquest;Cu&aacute;ndo?</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>La intenci&oacute;n de Sony
es lanzar la Playstation 2 “dentro del a&ntilde;o fiscal que termina en
marzo del 2000” en Jap&oacute;n y en “oto&ntilde;o del 2000” en EE.UU y
Europa. El precio estar&aacute; por debajo de los 400$ (unas 60.000 ptas.),
e incluso nos atrever&iacute;amos a decir que ser&aacute; inferior a 300$
(unas 45.000 ptas.). Seg&uacute;n declaraciones hechas a Next Generation
Online por una persona perteneciente a la industria, Sony tiene la intenci&oacute;n
de vender 15 millones de Playstations 2 en 18 meses, para la cual es l&oacute;gico
suponer que intentar&aacute; ponerla a la venta a un precio atractivo (quiz&aacute;s
incluso a 200$, unas 30.000 ptas.) La experiencia nos dice que es posible
que la m&aacute;quina salga a la venta con un precio algo elevado, el cual
se ir&aacute; reduciendo a medida que pasen los meses, algo necesario si
Sony pretende que la Playstation 2 alcance la cuota de mercado de su predecesora.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>
<br><br>
<center><IMG SRC="jpg/ps2-4.jpg" HEIGHT=219 WIDTH=239></center>
<br><br>

<h4>Conclusiones</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Sobre
el papel, la Playstation 2 presenta unas especificaciones t&eacute;cnicas
absolutamente incre&iacute;bles. Parece que, por fin, podremos ver gr&aacute;ficos
de calidad similar a la de las intros de los juegos actuales de Playstation.
Eso s&iacute;: hemos de tener en cuenta que, por incre&iacute;bles que
parezcan ahora esas especificaciones, es posible que, cuando la consola
salga a la venta, sea superada por los PCs de &uacute;ltima generaci&oacute;n
(aunque la diferencia de precio siempre inclinar&aacute; la balanza a favor
de la Playstation 2). Y no olvidemos la competencia, que se anuncia muy
dura: no me estoy refiriendo s&oacute;lo a Sega, cuya Dreamcast se est&aacute;
vendiendo relativamente bien en Jap&oacute;n (es normal ver juegos para
Dreamcast, a pocos meses del&nbsp; lanzamiento de la consola, entre los
10 m&aacute;s vendidos), sino tambi&eacute;n a Nintendo, la cual ha anunciado
ya la Nintendo 2000. Sea cual sea el resultado del enfrentamiento entre
estas compa&ntilde;&iacute;as, ya sabemos qui&eacute;n va a resultar ganador:
el usuario, es decir, gente como t&uacute; y como yo, que disfrutaremos
de aut&eacute;nticas maravillas en nuestro televisor.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<h4>Especificaciones t&eacute;cnicas
de la Playstation 2</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•CPU: "Emotion Engine" (128
bits).</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Frecuencia del reloj: 300
MHz.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Memoria principal: 32MB.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Ancho de banda del bus
de la memoria: 3.2GB por segundo.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Co-procesador: FPU (Unidad
de Punto Flotante).</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Capacidad: 6.2 GFLOPS.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•66 millones de pol&iacute;gonos
por segundo.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Codificador de compresi&oacute;n
de im&aacute;genes: MPEG-2.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Gr&aacute;ficos: Procesador
"Graphics Synthesizer"</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Frecuencia del reloj: 150MHz</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Ancho de banda del bus
DRAM: 48GB por segundo.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Capacidad m&aacute;xima
de pol&iacute;gonos: 75 millones de pol&iacute;gonos por segundo.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Sonido: "SPU2+CPU".</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•N&uacute;mero de voces
ADPCM: 48 canales en SPU2 m&aacute;s capacidad para programaci&oacute;n
de voces por software.</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Frecuencia de muestreo:
44.1 KHz or 48 KHz.</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Interfaces: IEEE1394 (Firewire),
Universal Serial Bus (USB)</FONT></FONT>
<BR><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Communicaci&oacute;n v&iacute;a
PC-Cards (PCMCIA)</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>•Almacenamiento: CD-ROM and
DVD-ROM</FONT></FONT><FONT FACE="Arial,Helvetica"><FONT SIZE=-1></FONT></FONT>





<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="tf.htm"><font FACE="ARIAL"><B>[Teclados Fuera]</B></font></a> <hR>

<A HREF="rtfsony.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







