<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> StarCraft.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Blizzard.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Ubi Soft.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Estrategia en tiempo real.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Castellano.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95. </b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 92%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<FONT color="#000000">
<P ALIGN=justify>

<P ALIGN="JUSTIFY">
<table align="left">
<td><img src="jpg/pscraft.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">

El nuevo chico bonito del g&eacute;nero de la estrategia
de tiempo real (RTS) ha llegado. A pesar de que StarCraft estaba anunciado
para una fecha tan jugosa como navidades, Blizzard no sac&oacute; StarCraft
hasta que no estuvieron seguros de que estaba como ellos lo quer&iacute;an,
con la ayuda de 1000 betatesters de todo el mundo, que se estuvieron dando
de porrazos hasta que se lleg&oacute; a un equilibrio en el juego. &iquest;Cu&aacute;l
es el resultado?.
<P ALIGN=JUSTIFY><B>Argumento</B>: El argumento de StarCraft es digno de una pel&iacute;cula.
En un resumen r&aacute;pido, la t&iacute;pica raza superior cre&oacute;
a los Protoss, la raza sabia e introvertida de turno. Despu&eacute;s crearon
a los Zerg, y &eacute;stos se les fueron de las manos y les destruyeron.
Los Zerg empiezan a atacar colonias terrestres, y los Protoss los destruyen
para defender a los Terrestres, pero se llevan alguno por delante, y &eacute;stos
creen que son atacados por los Protoss y responden. En fin, el argumento
de SC es algo que tiene que verse, c&oacute;mo cada misi&oacute;n, cada
v&iacute;deo, va avanzando un poco el argumento y nos lleva a conocer un
poco m&aacute;s a los personajes, y como llega al bombazo final, quiz&aacute;
un poco previsible, pero en absoluto por ello malo.
<P ALIGN=JUSTIFY> Por daros una primera impresi&oacute;n, los Terrestres
son la raza en principio defensiva. Pueden hacer volar la mayor&iacute;a
de los edificios y reparar las unidades da&ntilde;adas. Los Zergs est&aacute;n
bastante basados en el t&iacute;pico alien de Giger. Construyen unidades
mucho m&aacute;s r&aacute;pido y se regeneran poco a poco cuando est&aacute;n
da&ntilde;ados. Sus edificios no se construyen, sino que se mutan a partir
de vuestros trabajadores, algo digno de ver. Los Protoss son la raza poderosa.
Sus unidades son realmente potentes, pero muy caras. Su ventaja es que
tienen escudos que se regeneran tras cada combate.
<P ALIGN=JUSTIFY><table align="right"><td><img src="jpg/star1.jpg"></td></table><P ALIGN=JUSTIFY><P ALIGN=JUSTIFY><B>Gr&aacute;ficos</B>: SC ha levantado alguna mala cr&iacute;tica por
sus gr&aacute;ficos 2D y por funcionar en una &uacute;nica resoluci&oacute;n:
640x480. Sin embargo, si nos olvidamos de eso, lo cierto es que los gr&aacute;ficos
acompa&ntilde;an muy bien al juego. Cada raza tiene sus propios rasgos,
los distintos tipos de planetas (volc&aacute;nico, bosque...) tienen gran
cantidad de detalles (&aacute;rboles, cuevas submarinas, r&iacute;os de
lava...), y los v&iacute;deos son realmente excelentes. Buena nota para
Blizzard. Como dir&iacute;an por ah&iacute;, no son los gr&aacute;ficos
lo importante, sino la jugabilidad, pero si son bonitos, &iquest;por qu&eacute;
quejarse?.
<P ALIGN=JUSTIFY><B>Sonidos y M&uacute;sica</B>: Los sonidos son muy buenos. Cada una
de las armas y sonidos es todo lo cre&iacute;ble que puede ser algo de
ciencia ficci&oacute;n. Los doblajes son muy buenos (&iexcl;ojo!, hablo
de una versi&oacute;n importada, no pondr&iacute;a la mano en el fuego
por la versi&oacute;n espa&ntilde;ola), y nada parece fuera de lugar.
<P ALIGN=JUSTIFY> En cuanto a la m&uacute;sica, es sencillamente sensacional.
Cada raza tiene su tipo de m&uacute;sica particular, y todas, desde la
m&uacute;sica de introducci&oacute;n a la misi&oacute;n como la que escuchamos
mientras nos debatimos a vida o muerte, son fant&aacute;sticas. Al igual
que ocurr&iacute;a con la de Warcraft 2, deber&iacute;an sacar un CD con
la banda sonora original ;). Adem&aacute;s, no choca con los sonidos del
juego, con lo que podremos dejarla puesta sin miedo de que nos tape sonidos
importantes del tipo "estamos bajo ataque".
<P ALIGN=JUSTIFY><B>Extensionabilidad</B>: Pocos juegos del g&eacute;nero RTS me hacen
rellenar esta secci&oacute;n. StarCraft es una excepci&oacute;n, pues viene
equipado con un editor de campa&ntilde;as que nos permite realizar nuevos
mapas. Adem&aacute;s, pueden cambiarse los gr&aacute;ficos, los sonidos,
y hay un lenguaje script que permite programar distintos tipos de juegos.
As&iacute;, ya se han visto escenarios que nos permiten jugar al f&uacute;tbol,
o echar carreras a lo largo de un circuito. Ver para creer.
<P ALIGN=JUSTIFY><table align="left"><td><img src="jpg/star2.jpg"></td></table><P ALIGN=JUSTIFY><P ALIGN=JUSTIFY><B>Jugabilidad</B>: &Eacute;ste es el punto fuerte de StarCraft. Las
campa&ntilde;as Single Player est&aacute;n muy bien planteadas, aunque
la estrategia para ganarlas es en general la misma que en War2: defenderse
como se pueda hasta tener unidades suficientes como para arrasar al enemigo.
<P ALIGN=JUSTIFY> Para lo que est&aacute; pensado SC es para las partidas
multijugador. A pesar de lo que puedan decir algunos, las tres razas est&aacute;n
muy bien equilibradas, sin ser copias exactas una de las otras como ocurr&iacute;a
en War2. La gran variedad de estrategias que pueden usarse entre oponentes
humanos en los distintos mapas, los distintos tipos de juego, las posibles
combinaciones de razas, hacen que sea muy dif&iacute;cil aburrirse de este
juego. Eso s&iacute;, hay que tratar de luchar contra gente que sea m&aacute;s
o menos de nuestro nivel, pues jugar contra alguien mejor que nosotros
nos frustrar&aacute; cuando nuestras unidades se enfrenten a unidades mucho
m&aacute;s fuertes y ciertamente superiores en n&uacute;mero, y nos aburriremos
cuando sin hacer mucho eliminemos a un pobre <I>newbie</I> que s&oacute;lo
ha jugado un par de veces en MultiPlayer. Sin embargo, jugando con la misma
gente y llegando todos a un nivel parecido, SC dar&aacute; muchas horas
de diversi&oacute;n.
<P ALIGN=JUSTIFY> SC trae la posibilidad de jugar en el servidor de
Blizzard, Battle.Net. Lo cierto es que los problemas de conexi&oacute;n
gracias a nuestra querida compa&ntilde;&iacute;a de tel&eacute;fonos hace
que no se juegue demasiado bien, adem&aacute;s de la cantidad de cheaters
que hay sueltos. Blizzard ha prometido para pronto un nuevo parche que
arregle esto. La otra opci&oacute;n de jugar en Internet es mediante <A HREF="www.kali.net">Kali</A>,
un programa que nos permite jugar a juegos IPX por Internet. Mucho m&aacute;s
estable que B.Net y con muchas m&aacute;s posibilidades, su &uacute;nica
desventaje es que hay que registrarse (3000 para toda la vida), pero os
aseguro que merece la pena.
<P ALIGN=JUSTIFY><B>Puntos Negros</B>: Muy poco que hayamos podido encontrar. Si jug&aacute;is
un escenario contra el ordenador para pulir vuestras aptitudes en multiplayer
elegid un s&oacute;lo oponente, pues si eleg&iacute;s m&aacute;s se aliar&aacute;n
contra vosotros, y no podr&eacute;is hacer demasiado.
<P ALIGN=JUSTIFY><B>En resumen</B>: Un juego imprescindible si os va la estrategia. Adem&aacute;s,
est&aacute;n en camino dos packs de ampliaci&oacute;n, Brood Wars e Insurrection.
Cada uno de ellos traer&aacute; nuevas misiones y nuevas unidades dise&ntilde;adas
con mucho cuidado para que no alteren el equilibrio de StarCraft. &iquest;Y
ahora qu&eacute;, Warcraft 3?.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestrab.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

