<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>L</B></font><FONT color="#000000" size=7 face="arial"><B>a Casa del Estratega</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez.</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<H3>Sid Meier, el creador de la nueva estrategia.</h3>

<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">
La estrategia, tal y como la conocemos hoy, no hubiera nunca llegado a ser igual de
divertida y accesible a todo tipo de público si Sid Meier no hubera entrado en escena
y hubiera roto moldes tal y como hizo con el, histórico, Civilization. Hablar de Sid Meier es hablar
de una forma de hacer juegos que une todo el concepto serio y profundo que tiene que
tener un juego de estrategia con el concepto de diversión y accesibilidad que, también, debe
de existir en un juego de ordenador.
<br>
<br>
Gracias a sus títulos, los juegos de estrategia han ido entrando en los ordenadores de
más y más usuarios de todo el mundo. La estrategia ha dejado de ser un género de
uno pocos, para dar paso a ser uno de los géneros que más dinero mueven en
la industria del entretenimiento. Pese a que sus títulos más famosos (salvo
el Gettisburg), han sido por turnos, todas y digo TODAS las compañías que existen
en la actualidad desarrollando juegos de estrategia, ya sean en tiempo real o 
por turnos, han tenido que tomar, los títulos de este
genio como punto de referencia en alguna ocasión.
<br>
<br>
Uno de los aspectos más notables de la personalidad de Sid Meier es el hecho de su
"timidez" o como he puesto en la cabecera, "labor callada". Sí este diseñador se
diferencia, además de por sus juegos magníficos, por su capacidad de permanecer totalmente
a parte de entrevistas, marketing, rumores y demás historias. Sólo se centra en lo
que le gusta, que es hacer buenos juegos. Es por ello que las entrevistas
con este señor se cuenten con los dedos de una mano.
<br>
<br>
Si quieres conocer un poco más de uno de los personajes más influyentes en el mundo 
del software de entretenimiento mundial, sólo tienes que consultar el artículo "De Microprose a Firaxis".

<H3>De MicroProse a Firaxis.</h3>
<FONT color="#000000" size=2 face="arial">
<img src="jpg/meier.jpg" align="left" border=1>
<FONT color="#000000" size=2 face="arial"><P ALIGN=justify>
La carrera de Sid Meier como programador y dise&ntilde;ador se centra en su etapa dentro
de MicroProse que, por cierto, fundó con otro amigo, el actual presidente de MicroProse, un ex-piloto
de aviones (de ah&iacute;, que la mayor&iacute;a de los t&iacute;tulos de la etapa de oro de MicroProse sean
simuladores de aviones de combate). 
<br>
<br>
Sid Meier se estrena como programador y dise&ntilde;ador con el fant&aacute;stico F-15, que batio
records de ventas y puso el list&oacute;n muy alto en el mundo de los simuladores de vuelo.
En ese t&iacute;tulo, ya se empiezan a dar visos del talento de Sid Meier como programador,
dejando claro, adem&aacute;s, por donde ir&iacute;an encaminadas las producciones de Microprose en
el futuro. Recordemos tambi&eacute;n que de este t&iacute;tulo se han sacado varias continuaciones, 
si bien y como suele ser habitual en los juegos de Sid (y casi, casi la
&uacute;nica excepci&oacute;n sea el CivII), &eacute;ste ya no participar&iacute;a en las continuaciones de sus
t&iacute;tulos originales.
<br>
<br>

Despu&eacute;s del F-15, debemos de hacer una parada en otro de los grandes simuladores de
MicroProse en los que Sid participa directamente como dise&ntilde;ador y programador. Estoy
hablando del simulador de submarinos Red Storm Rising, el cual, si mal no recuerdo, obtuvo
el galard&oacute;n de la ECTS a mejor simulador del a&ntilde;o. Con este t&iacute;tulo se acaban de forma
definitiva el mundo de los simuladores &quot;reales&quot; que Sid Meier dise&ntilde;a y programa. A partir
de ahora se meter&aacute; de lleno en la estrategia.
<br>
<br>
<center><IMG SRC="jpg/logomp.jpg"></center>
<br>
<br>
<P ALIGN=justify>
Despu&eacute;s del t&iacute;tulo anterior, Sid decide dejar el dise&ntilde;o y la programaci&oacute;n de simuladores
de combate, para pasar a lo que realmente va a dominar, la estrategia. El primer resultado
en el campo de la estrategia lo tenemos en el fant&aacute;stico Pirates!, que derrochaba
originalidad, calidad t&eacute;cnica y sobre todo diversi&oacute;n. Hoy en d&iacute;a es considerada como
obra de culto por los incondicionales del &quot;t&iacute;mido&quot; Sid y ha sido, hace 2 o 3 a&ntilde;os,
reprogramado para mostrar todo su poder&iacute;o en SVGA. 
<br>
<br>
El Pirates! signific&oacute; una primera se&ntilde;al del potencial de Sid, de eso no cabe la 
menor duda, pero lo que realmente supondr&aacute; el aviso a lo que posteriormente ser&aacute;
la gran bomba y har&aacute; que su nombre empiece a sonar en los c&iacute;rculos de los juegoadictos,
como una de las promesas del mundo del software de entretenimiento, ser&aacute; el fabuloso
Rail Road Tycoon. Esta maravilla de juego hizo que muchos, entre los que me incluyo,
empezaran a disfrutar de la estrategia de verdad, pero de un modo sencillo y divertido. El Rail Road Tycoon fue
el punto de partida de los juegos de estrategia &quot;Made in Sid Meier&quot;. Con el Rail Road Tycoon, 
se empezará a asociar el nombre de Meier a juegos de indudable calidad. 
Al igual que ocurr&iacute;a
con el Pirates!, &eacute;ste t&iacute;tulo tambi&eacute;n ser&aacute; pasado a la
SVGA 3 a&ntilde;os despu&eacute;s de su lanzamiento. Ni que decir tiene, que el Rail Road Tycoon crear&iacute;a
nuevos caminos a estudiar dentro del mundo de los juegos de estrategia.
<br>
<br>
Ahora viene la aut&eacute;ntica bomba de Sid Meier. Tomando como base toda la experiencia
adquirida con los t&iacute;tulos anteriores va a conseguir mezclar todo lo aprendido en sus 
títulos anteriores y sus justas proporciones para producir el que, para muchos, es el mejor juego de la historia de los
compatibles. S&iacute; has acertado, estoy hablando del Civilization. Jam&aacute;s y repito jam&aacute;s se
ha creado un juego de estrategia capaz de absorver de tal forma al jugador de como
lo hac&iacute;a el Civilization. Han corrido r&iacute;os de tinta en todas las revistas del mundo
hablando de las enormes virtudes de este juego por lo que yo poco os puedo contar que
no sepáis. Simplemente deciros que, en mi opini&oacute;n, si nunca hubiera existido el 
Civilization, la estrategia basada en turnos jam&aacute;s
hubiera llegado a lo que es hoy en d&iacute;a, un g&eacute;nero que ocupa una de las tres plazas
en el mundo del PC. Comentaros que le&iacute;, hace bastante tiempo, en una entrevista que
Sid Meier concendi&oacute; a la revista PC Review, que hasta &eacute;l mismo se hab&iacute;a sentido 
desbordado con el &eacute;xito que signific&oacute; el Civilization...
<br>
No me querría dejar este párrofo sin mostrar mi queja a las distribuidoras de nuestro
país que no supieron y quizás ni quisieron, traer esta joya del soft a nuestro país. Parece
mentira que, mientras todo el planeta informático disfrutaba de este título, nuestras
casas de distribuición no se ponían deacuerdo y nos seguían tratando como inmaduros. Lógicamente el juego
tuvo que llegar, por desgracia, por otros canales de distribuición...
<br><br>
<h4>Y llegó la bomba</h4>
<P ALIGN=justify>
<table align="left">
<td><img src="jpg/civ1por.jpg" ></td>
<tr>
<td><FONT color="#000000" size=1><b>La falsa promesa del<br> Civilization en España.</b></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>

El &uacute;nico anuncio que supuso un "amago" de lanzamiento
del producto en nuestro pa&iacute;s lo ten&eacute;is a la izquierda. Está sacado de la revista PC Review, edici&oacute;n traducida, n&uacute;mero 1.
Posteriormente, para subsanar el ERROR cometido se lanzar&iacute;a el producto de nuevo. Sin embargo,
a esas alturas todos ya lo hab&iacute;amos jugado y requetejugado y para c&oacute;lmo coincid&iacute;a
con el lanzamiento del Civilization II y la caja era en edición barata y...
<br>
<br>
Después del Civilization, la verdad sea dicha, se ha utilizado bastante el nombre
de Sid Meier para vender "por el morro". Esto ocurri&oacute; con el Colonizat&iacute;on. T&iacute;tulo con un aspecto
muy parecidp al de Civilization y que cont&oacute; con una m&iacute;nima participaci&oacute;n de Sid Meier. 
Lo mismo ocurrir&aacute; con el Civilization II, un juego que
supone, sobre todo, un lavado de cara al Civilization para adaptarlo a los tiempo en
los que vivimos, pero que no incorpora excesivas novedades como para hablar de un
juego igual de revolucionario que el original Civilization. 
Tambi&eacute;n en esta ocasi&oacute;n,
pese a aparecer el nombre de Sid Meier, su participación ha sido más bien m&iacute;nima. En definitiva,
que lo inmejorable no se puede mejorar y punto. Jam&aacute;s habr&aacute; un juego de estrategia tan bueno como
el Civilization original y eso es algo que hay que asumir. Vale muchas mejoras gr&aacute;ficas,
vale mucho mejor sonido, vale opciones extra, vale todo eso pero el coraz&oacute;n sigue
siendo del viejo, querido y original Civilization de Meier.
<br>
<br>
<center><img src="gif/civ2logo.gif"></center>
<br>
<br>
<P ALIGN=justify>
Despu&eacute;s del Civilization II Sid va a abandonar Microprose, la compa&ntilde;&iacute;a que cofundara
en 1984/1985, llev&aacute;ndose a la gente más cercana a él del equipo y va a crear una nueva compa&ntilde;&iacute;a llamada Firaxis en Junio del 96.
Actualmente ya se ha estrenado con el Sid Meier´s Gettysburg. Os voy a confesar que no he jugado a&uacute;n con
&eacute;l, pero sí que he leido y he tenido la caja entre mis manos y me atrevo a decir que
es muy posible que Sid haya vuelto a redefinir los g&eacute;neros. Al parecer el
juego mezcla la estrategia en tiempo real con los WarGames cl&aacute;sicos de un modo magistral.

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="cestra.htm"><font FACE="ARIAL"><B>[La Casa del Estratega]</B></font></a> <hR>
<A HREF="cestraa.htm"><font FACE="ARIAL"><B>[Reportajes]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

