<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>eneral</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:a.monte@jet.es">Antonio Montesinos.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Sí, pero...
</FONT>
</H3>


<P align="justify">
<FONT color="#000000" size =2 face="arial" >        
<P ALIGN=JUSTIFY>
Me llueve sobre mojado. Los que escriben art&iacute;culos de opini&oacute;n, novelas, ensayos o cualquier otra cosa siempre lo hacen sobre lo mismo, pero envuelto en caperuzas diferentes. Siempre se escribe sobre la propia experiencia o conocimientos, independientemente de la forma en que se haga. Esto viene a cuento de un art&iacute;culo anterior en el que ya habl&eacute; de la cara oculta de las cosas, aquella que, sin ser evidente, se supone. Pues vuelvo con lo mismo, los m&uacute;ltiples puntos de vista desde que pueden ser encarados los asuntos (en este caso asuntos inform&aacute;ticos) y cuya validez no siempre ha de estar del lado m&aacute;s conocido. Seg&uacute;n esto, para todas las caras hay una cruz (o varias), para todos los claros un obscuro (o varios) y para todos los S&Iacute;ES un PERO... (o varios)</P>
<P ALIGN="JUSTIFY"></P>
<UL>
<LI><P ALIGN="JUSTIFY">La pirater&iacute;a es un delito, PERO tambi&eacute;n es el mayor soporte publicitario del software.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Internet es la mayor red de ordenadores del mundo, PERO existen much&iacute;simas redes m&aacute;s veloces propiedad de los estados y empresas privadas por donde la informaci&oacute;n se mueve con mucha m&aacute;s velocidad que por Internet.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">La red Internet es lenta, PERO ya est&aacute;n desarrolladas las tecnolog&iacute;as para, con las infraestructuras actuales, aumentar la velocidad de la red de redes.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">La revoluci&oacute;n de las comunicaciones es una de las m&aacute;s importantes de la historia de la humanidad, PERO si empresas como Telef&oacute;nica siguen subiendo sus precios esta revoluci&oacute;n estar&aacute; s&oacute;lo al alcance de las clases m&aacute;s pudientes, siendo, de todas todas, una revoluci&oacute;n injusta.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">El concepto de colaboraci&oacute;n es la base de la filosof&iacute;a de trabajo en Internet, PERO si la mayor&iacute;a de usuarios se dedica a pedir, solicitar, querer y obtener y no a participar, aportar, trabajar y colaborar, este invento acabar&aacute; como otros en la historia del hombre.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Internet es una red internacional, global, multirracial, multilingual y sin fronteras, PERO como no sepas ingl&eacute;s te pierdes la mayor parte de sus contenidos.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Los internautas tienen fama de introvertidos, aislados, obsesivos, aburridos y antisociales, y todo ello por pasar horas delante del ordenador, PERO nadie dice nada de los que, siendo much&iacute;simos m&aacute;s, se  pasan esas horas delante del televisor, gritando en un campo de f&uacute;tbol o trag&aacute;ndose las p&aacute;ginas de la prensa m&aacute;s coloreada.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Windows 95 y su papa&iacute;to, Bill Gates, son objeto de las m&aacute;s airadas protestas y odios, tanto por parte de particulares como de grandes empresas y medios de comunicaci&oacute;n, PERO la mayor&iacute;a de los que protestan tienen instalado en sus m&aacute;quinas el mencionado sistema operativo (seguramente pirata) y lo que realmente les molesta es que un se&ntilde;or con tanto dinero haya llegado hasta donde est&aacute; simplemente por el hecho de haber tenido la suerte de haber estado en el sitio adecuado en el momento adecuado.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Bill Gates es uno de los hombres m&aacute;s ricos del mundo gracias a la inform&aacute;tica, PERO que no descuide a la legi&oacute;n de programadores aficionados que contribuyen de forma altruista a hacer crecer proyectos como LINUX, que le pueden dar en un futuro muchos dolores de cabeza.</LI></P></UL>

<P ALIGN="JUSTIFY"></P>

<UL>
<LI><P ALIGN="JUSTIFY">Intelectuales, famosos y cada vez m&aacute;s pol&iacute;ticos de este pa&iacute;s hablan de las bondades de la red Internet, PERO el Estado sigue comprando para sus ministerios partidas de ordenadores a los que les falta la "&Ntilde;", en plena era de los entornos gr&aacute;ficos todav&iacute;a hay montones de dependencias de la administraci&oacute;n en las que se trabaja con WordPerfect 5.1 en modo texto y el problema del 2000 puede causar estragos en los sistemas inform&aacute;ticos oficiales.</LI></P></UL>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opiniona.htm"><font FACE="ARIAL"><B>[Opinión General]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
