<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 15. El Templo de Xian</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Me encontraba en el pasillo de entrada al templo, decorado con una hermosas antorchas doradas con forma de cabeza de drag&oacute;n. Avanc&eacute; con cautela y enseguida vislumbr&eacute; en la penumbra la tan ansiada daga, reposando en un pedestal rojo. S&oacute;lo era cuesti&oacute;n de tomarla y escapar de all&iacute; pero no iba a ser tan f&aacute;cil. Al acercarme, el suelo se abri&oacute; bajo mis pies y me encontr&eacute; cayendo hacia un destino desconocido. Me deslizaba por una pronunciada pendiente y tuve que esquivar una afilada hoja que amenazaba con cortarme en dos. Mi accidentado viaje termin&oacute; con una espectacular zambullida en un lago con fuertes corrientes que me acabaron llevando hasta lo que parec&iacute;a la puerta principal del templo. Un tigre me atac&oacute; por sorpresa sin apenas darme tiempo a reaccionar. En el lateral izquierdo del templo descubr&iacute; una de esas &quot;catapultas&quot; que me lanz&oacute; hasta el tejadillo. All&iacute; encontr&eacute; una palanca con la que abr&iacute; una trampilla en lo alto de una escala en otro lugar. Un &aacute;guila me atac&oacute; y cuando descend&iacute; de nuevo otro tigre me estaba esperando.</P>

<center><table>

<td><img src="jpg/tr2tx01.jpg"><br>

<b><font size=1 face=arial><center>La puerta principal del Templo de Xian</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">No hab&iacute;a m&aacute;s que yo pudiera hacer all&iacute; por el momento, as&iacute; que me zambull&iacute; otra vez y encontr&eacute; un pasaje submarino hasta otro lugar, justo donde acababa de abrir la trampilla. Ascend&iacute; por la escala en la pared y entr&eacute; en una estancia con un lago de un peligroso l&iacute;quido rojo en el fondo. Me descolgu&eacute; por una escala en la pared y aprovechando varias fisuras en la pared de roca me hice con otra estatuilla drag&oacute;n de piedra. Desandando parte del camino utilic&eacute; otra escala para ascender hasta un oscuro pasillo que pasaba por encima de una corriente de agua. Al final del mismo me dej&eacute; caer en una estancia con unas afiladas p&uacute;as de acero en el suelo. Por el lado libre ascend&iacute; la escala de la pared y, al llegar a una fisura, me desplac&eacute; hacia la derecha para evitar otros pinchos de la zona superior. Salt&eacute; hacia atr&aacute;s hasta un tejadillo y de nuevo hacia delante para aterrizar sana y salva. Ante m&iacute; hab&iacute;a una plataforma bastante fr&aacute;gil por la que camin&eacute; hasta el final; cuando se desplom&oacute; aterric&eacute; sobre el &uacute;nico punto de tierra firme en la piscina de ese corrosivo l&iacute;quido rojo. Tomando carrera salt&eacute; hasta una rampa y de nuevo otro salto para evitar unas p&uacute;as. Un &uacute;ltimo salto girando a la derecha en el aire me dej&oacute; sana y salva en el suelo. Ascend&iacute;, accion&eacute; una palanca m&aacute;s —la cual abri&oacute; las puertas del templo—, y salt&eacute; al agua junto a la cascada, volviendo al templo y penetrando en su interior.</P>

<P ALIGN="JUSTIFY">El hall principal estaba lleno de estatuas de guerreros, algunas de las cuales estaban armadas con grandes espadones que me recordaron los de el escondite de Bartoli, por lo que no me acerqu&eacute; mucho a ellas. Continu&eacute; el camino por el pasadizo del fondo del hall hasta una cueva llena del l&iacute;quido rojo. Con cuatro saltos por empinadas rampas acab&eacute; en el otro extremo de la cueva, iz&aacute;ndome hasta suelo llano. Un salto m&aacute;s y estaba ante una oscura entrada con una palanca al final. Cuando me acerqu&eacute; para accionarla el suelo cedi&oacute; bajo mis pies y baj&eacute; resbalando hasta una habitaci&oacute;n en la que las paredes, llenas de p&uacute;as, se acercaban a toda velocidad hacia m&iacute;. Sin perder un instante, accion&eacute; una palanca frente a m&iacute; y di la vuelta para escapar por los pelos por una peque&ntilde;a puerta. Ahora las trampas consist&iacute;an en varias bolas rodantes que tambi&eacute;n tuve que esquivar para ascender finalmente por una escala. Llegu&eacute; de esta forma a una habitaci&oacute;n totalmente a oscuras en la que localic&eacute; una palanca. Tras accionarla, un tigre me atac&oacute; por la espalda y lo tuve que despachar r&aacute;pidamente. La palanca abri&oacute; una salida en la que peligrosas hojas afiladas dificultaban la bajada. Finalmente consegu&iacute; llegar al final sin graves da&ntilde;os, descolg&aacute;ndome por el lado derecho de la escala. En la habitaci&oacute;n del fondo otras enormes hojas rodantes me fueron m&aacute;s sencillas de evitar para acabar en una pasarela elevada sobre el hall principal del templo, donde dos &aacute;guilas pasaron a mejor vida.</P>

<P ALIGN="JUSTIFY">En la pared de la izquierda encontr&eacute; un interruptor que, al pulsarlo, abr&iacute;a una puerta temporizada en el extremo opuesto del hall. El tiempo era muy limitado as&iacute; que fue preciso volar, m&aacute;s que correr, atravesando las pasarelas que cruzaban el hall para colarme por la puerta en el &uacute;ltimo instante. Ahora ten&iacute;a ante m&iacute; unas bolas de pinchos oscilando a un lado y otro de una pasarela sobre la lava que evit&eacute; sorte&aacute;ndolas de una en una con cautela. Al otro extremo me esperaban dos interruptores a ambos lados de un nuevo corredor. El de la izquierda abr&iacute;a una puerta al fondo y el de la derecha sub&iacute;a una trampilla que daba continuidad al suelo del corredor pero ambas actuaban por un corto espacio de tiempo. Puls&eacute; ambos en el orden correcto y atraves&eacute; rauda el pasillo, cuyo suelo se desplomaba a mi paso. Al cruzar la puerta, una enorme bola rodante vino en pos de m&iacute; y el camino se interrump&iacute;a delante de mis narices acabando en un lago de ese l&iacute;quido (¿ser&iacute;a sangre de drag&oacute;n?). Cuando el camino terminaba salt&eacute; y me agarr&eacute; al borde de una plataforma sobre la que reposaba el Sello del Drag&oacute;n que se parec&iacute;a mucho a la cerradura de la puerta situada en el hall principal.</P>

<P ALIGN="JUSTIFY">Tom&eacute; el sello y salt&eacute; hacia el lateral derecho de la enorme estatua. En una oscura habitaci&oacute;n tras la estatua accion&eacute; una palanca que hizo aparecer varios pilares y plataformas en la sala anterior. Regres&eacute; all&iacute; por el lado en que las plataformas estaban m&aacute;s bajas y mediante una serie de saltos acab&eacute; en una plataforma baja en el lado contrario. Ante m&iacute; ten&iacute;a otra plataforma con un dibujo semejante al de la &quot;catapulta&quot; situada junto a las puertas del templo, as&iacute; que me prepar&eacute; para esta contingencia. Salt&eacute; hacia adelante y al accionarse la catapulta me lanz&oacute; a lo alto del pilar situado enfrente. Esto activ&oacute; una enorme bola rodante que esquiv&eacute; descolg&aacute;ndome por el borde del pilar. Salt&eacute; hasta la siguiente plataforma a mi derecha, donde esquiv&eacute; otra bola. Poco a poco, de plataforma en plataforma, fui ascendiendo hasta lo m&aacute;s alto, aunque por el camino me detuve y, aprovechando otra catapulta al final de una de las rampas, me hice con una estatuilla de jade que reposaba en lo alto de la estancia en una plataforma pr&oacute;xima a una de las vigas de madera. En lo alto de la estructura hab&iacute;a una peque&ntilde;a habitaci&oacute;n una de cuyas paredes era un bloque de piedra que pude apartar de mi camino. Al otro lado, en una oscura estancia, una palanca accionaba una trampilla que me llev&oacute; a otra zona en rampa. La recorr&iacute; perseguida por otra de esas enormes bolas y acab&eacute; mi carrera en la zona alta del hall principal del templo. Abajo me esperaban varios tigres a los que despach&eacute; protegida desde lo alto.</P>

<P ALIGN="JUSTIFY">Con el sello abr&iacute; la puerta situada abajo en el hall y baje la pendiente. Esquivando la hoja rodante, gracias a los huecos laterales del pasillo, alcanc&eacute; otra rampa que me llev&oacute; a una sala con varios cad&aacute;veres y algo de agua. En la pared hab&iacute;a tres palancas diseminadas y medio camufladas por la decoraci&oacute;n. Las accion&eacute; todas y esto abri&oacute; una compuerta que me salv&oacute; del techo lleno de p&uacute;as que poco a poco bajaba a mi encuentro. Estaba ahora ante una cascada y, con la ayuda de los dos pilares, ascend&iacute; hasta una pasarela que la cruzaba. Mat&eacute; al pececillo que habitaba la piscina para evitar ser molestada y me zambull&iacute;. El t&uacute;nel bajo el agua ten&iacute;a una corriente demasiado fuerte para entrar en &eacute;l as&iacute; que accion&eacute; una palanca que localic&eacute; en una esquina y esto cerr&oacute; una compuerta al final de dicho t&uacute;nel permiti&eacute;ndome acceder a &eacute;l, aunque tuvo como consecuencia una subida del nivel del agua. En dicho t&uacute;nel la primera de las palancas volv&iacute;a a abrir la compuerta as&iacute; que tuve que repetir la operaci&oacute;n otra vez. Esta vez gir&eacute; a la derecha por un estrechamiento del pasadizo para accionar otra palanca, la cual abri&oacute; otro acceso cercano en cuyo interior hab&iacute;a una nueva palanca. Antes de entretenerme en accionarla deshice el camina para tomar aire ya que, de lo contrario, tem&iacute;a no poder volver a tiempo. Al accionar esta palanca se abri&oacute; una reja en la piscina que descubri&oacute; tras de s&iacute; otra palanca, la cual abr&iacute;a una puerta en la parte superior. El cerebro que hab&iacute;a dise&ntilde;ado este templo deb&iacute;a estar, sin ning&uacute;n g&eacute;nero de duda, terriblemente perturbado.</P>

<P ALIGN="JUSTIFY">Me aup&eacute; hasta la mencionada puerta y acab&eacute; con otro de esos molestos peces antes de entrar. La siguiente habitaci&oacute;n ten&iacute;a una pared llena de p&uacute;as as&iacute; que pronto imagin&eacute; lo que me esperaba si no actuaba con rapidez. Accion&eacute; la palanca y me lanc&eacute; por la trampilla que se abri&oacute; al fondo para acabar en un canal de fuerte corriente que me arrastraba sin remedio. Cuando la corriente afloj&oacute; su fuerza encontr&eacute; una llave dorada ante m&iacute;, la cual tom&eacute; y segu&iacute; nadando hasta encontrar la salida, que result&oacute; ser la cascada ante las puertas del templo. Con la llave reci&eacute;n obtenida abr&iacute; la compuerta situada al lado de aquella trampilla que, al principio, hab&iacute;a abierto mediante la palanca del tejado del templo. Tras una primera exploraci&oacute;n del t&uacute;nel subacu&aacute;tico encontr&eacute; una entrada a la derecha, la cual se cerr&oacute; tras de m&iacute; dej&aacute;ndome a solas con un pescadito bastante agresivo y poco aire en los pulmones para tratar de salir. Tras deshacerme del pez encontr&eacute; una palanca en una de las columnas y sal&iacute; de all&iacute; por la nueva trampilla que se abri&oacute; en el t&uacute;nel principal, terminando en una cueva en la que no hab&iacute;a estado a&uacute;n. Me ic&eacute; fuera del agua y acab&eacute; con otro molesto pez.</P>

<P ALIGN="JUSTIFY">La cueva estaba en una oscuridad casi total y yo quer&iacute;a ahorrar mis bengalas. De repente not&eacute; una mordedura en mi pie y ¡arrrrrgggghh! ¡La cueva estaba llena de ara&ntilde;as! ¿No os he dicho ya cuanto asco me dan las ara&ntilde;as? Luchando contra la repulsi&oacute;n a estos bichos segu&iacute; avanzando hasta que ¡Oh, Dios M&iacute;o! ¡Esa ara&ntilde;a era m&aacute;s grande que yo! Realmente era enorme y, para mi desgracia no fue la &uacute;ltima de las que tendr&iacute;a que enfrentar. La cueva terminaba en un &aacute;rea con varios pilares de roca en su centro y en la que hab&iacute;a un mont&oacute;n de enormes ara&ntilde;as m&aacute;s. Tras liquidarlas y estudiar la configuraci&oacute;n de las rocas averig&uuml;&eacute; la forma de salir de all&iacute;. Trep&eacute; al &uacute;nico pilar que alcanzaba desde el suelo —que estaba pegado a la pared— y de &eacute;ste a otro situado a su lado. De aqu&iacute; me ic&eacute; hasta una estrecha cornisa que sal&iacute;a de la pared muy cerca de m&iacute;. Despu&eacute;s fui saltando de cornisa en cornisa hasta que otra enorme ara&ntilde;a me sali&oacute; al paso. Desde esta &uacute;ltima cornisa pude acceder a la columna en el centro de la sala y, de &eacute;sta, a otra pr&oacute;xima a la salida. Cruc&eacute; la cueva a la carrera y, de un gran salto, acab&eacute; en lo alto de las rocas en medio del agua, donde encontr&eacute; otra llave, plateada esta vez. Me zambull&iacute; en direcci&oacute;n a las puertas del templo. A la derecha del mismo ya hab&iacute;a visto con anterioridad una cerradura plateada que ahora estaba en condiciones de abrir.</P>

<center><table>

<td><img src="jpg/tr2tx02.jpg"><br>

<b><font size=1 face=arial><center>La llave plateada que me abrir&iacute;a las <br>puertas a la derecha del templo</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Entr&eacute; a un peque&ntilde;o recinto con una rampa y varias plataformas. Aprovechando las plataformas fui ascendiendo, esquivando dos de esas enormes bolas por el camino. Segu&iacute; adelante por una pasarela que cruzaba de lado a lado la cueva en que estaban las puertas del templo y quit&aacute;ndome de en medio a un &aacute;guila y un par de tigres. En la siguiente sala sub&iacute; hasta el pilar saltando hacia atr&aacute;s desde el plano inclinado junto a &eacute;l. A mi derecha hab&iacute;a una largu&iacute;sima rampa que ascend&iacute;a hasta perderse la vista con lo que parec&iacute;an varias &quot;catapultas&quot; para ascender. De momento consider&eacute; m&aacute;s oportuno explorar el otro camino que se abr&iacute;a ante m&iacute; as&iacute; que salt&eacute; hacia delante y me dirig&iacute; al lugar donde me esperaba una afilada hoja rodante. Observ&eacute; la escala que hab&iacute;a en una de las paredes y tom&eacute; buena nota de su posici&oacute;n. Evit&eacute; la hoja rodante con dos limpios saltos y me dej&eacute; caer de espaldas por la rampa para agarrarme a la escala mencionada. Abajo solamente encontr&eacute; algo de munici&oacute;n y un orificio por el que saltar al agua y volver a la entrada del templo. Ahora ten&iacute;a que volver a subir otra vez todo el camino pero quiz&aacute;s la munici&oacute;n extra me viniese bien. Volv&iacute; a superar la hoja rodante y esta vez entr&eacute; en la sala a mi derecha donde otra igual a la anterior descansaba por el momento. Cruc&eacute; la pasarela y puls&eacute; el bot&oacute;n que hab&iacute;a al otro lado lo que, como m&aacute;s tarde comprobar&iacute;a, abri&oacute; una puerta en lo alto de la rampa de las catapultas. Elimin&eacute; un molesto p&aacute;jaro y no pude evitar fijarme en una estatua drag&oacute;n de oro que reposaba al lado de la catarata por la que yo hab&iacute;a ca&iacute;do al intentar tomar la daga. Quiz&aacute;s podr&iacute;a haberla a&ntilde;adido a mi colecci&oacute;n si me hubiera fijado mejor. Regr

es&eacute; por la pasarela evitando el encuentro con la hoja rodante y me dirig&iacute;, puesto que no ten&iacute;a otro camino, hacia la mencionada rampa.</P>

<P ALIGN="JUSTIFY">Tom&eacute; carrera hasta la primera de las catapultas y despu&eacute;s todas fueron en serie hasta agarrarme al borde de un saliente. Elimin&eacute; dos &aacute;guilas m&aacute;s y, de un salto, me dirig&iacute; a las puertas doradas. Salt&eacute; a una peque&ntilde;a plataforma y, de &eacute;sta, a la cavidad que ten&iacute;a delante. La pared de pinchos se me ech&oacute; encima y tuve que saltar a una plataforma y subir la escala en la pared a toda prisa para no verme ensartada. Arriba otra habitaci&oacute;n con trampa de pinchos, de la que me libr&eacute; saltando hasta otra escala y subiendo. Me encontraba en un pasillo oscuro, lleno de enrejados a trav&eacute;s de los cuales se ve&iacute;a una enorme estatua drag&oacute;n y una llave. Al final encontr&eacute; una palanca que abri&oacute; uno de los enrejados. Despu&eacute;s de varios saltos por las repisas adyacentes me hice con la llave y me deslic&eacute; hasta abajo por la cola del drag&oacute;n. Volv&iacute; hasta la entrada principal y us&eacute; la llave en la cerradura situada frente a la peque&ntilde;a plataforma. Esto tuvo una serie de efectos, el m&aacute;s notable de los cuales fue habilitar una peque&ntilde;a plataforma hasta la que pude saltar. De all&iacute; hasta una escala en la pared y luego otra que me llevaron hasta el mismo pasillo oscuro de antes donde hab&iacute;a otro enrejado abierto, dando a otra estatua drag&oacute;n similar a la primera. Con varios saltos, el &uacute;ltimo de ellos sobre un plano inclinado, llegu&eacute; hasta el cuello del drag&oacute;n donde encontr&eacute; otra escala.</P>

<P ALIGN="JUSTIFY">Ascend&iacute; por esta escala pero pronto me encontr&eacute; con una hoja m&oacute;vil que me habr&iacute;a partido en dos. Baj&eacute; por un instante hasta la plataforma lateral y estudi&eacute; la situaci&oacute;n. Me cost&oacute; encontrar la forma de superarlo pero as&iacute; es como lo hice: sub&iacute; de nuevo hasta la hoja y salt&eacute; hacia atr&aacute;s hasta un plano inclinado. De &eacute;ste a una nueva escala y, antes de llegar a otra hoja m&oacute;vil, salt&eacute; de nuevo hacia atr&aacute;s, girando en el aire, para agarrarme a otra escala situada a mi espalda. ¿No lo cre&eacute;is? ¡Peor para vosotros! Sub&iacute; toda la escala hacia la derecha y me asom&eacute; al interior del pasillo donde ya sab&iacute;a que me esperaba la daga de Xian, ¡por fin iba a ser m&iacute;a! Pero me equivocaba. Se me hab&iacute;an adelantado, all&iacute; estaba Bartoli con varios de sus ac&oacute;litos y, delante de mis propias narices, se clav&oacute; la daga en el coraz&oacute;n. Sus secuaces se llevaron el cuerpo inerte de Bartoli mientras yo los persegu&iacute;a sin saber muy bien a d&oacute;nde.</P>

<center><table>

<td><img src="jpg/tr2tx03.jpg"><br>

<b><font size=1 face=arial><center>Bartoli se me hab&iacute;a adelantado y ahora<br> ten&iacute;a la daga en su poder</center></font></b></td>

</table></center>

</FONT>





<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





