<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 10. En Cubierta.</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Y poco fue el descanso que tuve ya que enseguida fui calurosamente recibida por un hombre y su lanzallamas y, sin tiempo para recuperarme, otro con una llave inglesa. Los liquid&eacute; a los dos con un par de fintas y algo de plomo. Despu&eacute;s de explorar a fondo la zona de cubierta se hizo patente que la &uacute;nica forma en que podr&iacute;a salir de all&iacute; ilesa era realizando una impresionante zambullida desde la zona a la izquierda del lugar por donde hab&iacute;a entrado. As&iacute; lo hice y, tras librarme de unos molestos pescaditos, escal&eacute; por la pared de roca hasta encontrar una llave. Con ella en mi poder me sumerg&iacute; de nuevo y localic&eacute; una abertura en la roca por la que continu&eacute; hasta la zona inferior de cubierta. All&iacute; me encargu&eacute; de otros dos tipos m&aacute;s y, ya con m&aacute;s libertad, explor&eacute; la zona. Esta vez parec&iacute;a no haber salida alguna, ya que la &uacute;nica puerta estaba cerrada con llave —que no era la que yo pose&iacute;a— y la otra posible salida estaba bloqueada por una enorme h&eacute;lice. Tambi&eacute;n hab&iacute;a una trampilla que llevaba hasta una palanca, la cual no pude accionar por resultarme inaccesible. Lo &uacute;nico sospechoso que observ&eacute; fueron unas cajas apiladas as&iacute; que, no teniendo mejor cosa que hacer, me dediqu&eacute; a manipularlas hasta que consegu&iacute; apartar la que estaba en el centro, descubriendo una puerta oculta que, esta vez, s&iacute; se abri&oacute; con la llave que ten&iacute;a en mi poder.</P>

<center><table>

<td><img src="jpg/tr2td01.jpg"><br>

<b><font size=1 face=arial><center>Esta palanca abri&oacute; una trampilla<br> que me bloqueaba el paso</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Tuve que bucear de nuevo para localizar y accionar una palanca que tuvo el efecto de abrir la trampilla que anteriormente me bloqueaba el paso. Regres&eacute; hasta all&iacute; y accion&eacute; la otra palanca. De esta forma se dren&oacute; la cavidad donde estaba la primera. All&iacute; volv&iacute; y, apartando una caja, acced&iacute; a la zona posterior a la gran h&eacute;lice que hab&iacute;a visto desde el otro lado con anterioridad. Hab&iacute;a all&iacute; un gran lago y, en medio, un bote hinchable —al que no pod&iacute;a acceder— con unas cajas dentro y en el que cre&iacute; distinguir un objeto peque&ntilde;o y brillante. Me lanc&eacute; al agua y nad&eacute; hacia el lado izquierdo, donde hab&iacute;a una especie de plataforma natural. All&iacute; me hice cargo de otro tipejo y, de paso, de los dos hombres rana que me ven&iacute;an persiguiendo por el lago. Segu&iacute; por la cornisa de roca hasta ver, en el fondo, un drag&oacute;n de piedra. Me lanc&eacute; a por &eacute;l y, buceando por una peque&ntilde;a abertura en la roca, emerg&iacute; de nuevo ante un estrecho t&uacute;nel. Por &eacute;l avanc&eacute; hasta liarme a tiros con otro individuo m&aacute;s. M&aacute;s o menos a esa altura, el t&uacute;nel se bifurcaba a la izquierda. Tom&eacute; esa direcci&oacute;n y, tras mucho escalar, llegu&eacute; hasta la cubierta superior del barco, a la que al principio no hab&iacute;a podido acceder. Despu&eacute;s de liquidar a algunos hombres descend&iacute; hasta una peque&ntilde;a piscina. En las cercan&iacute;as me esperaban m&aacute;s hombres armados, incluso con lanzallamas. Tras desembarazarme de ellos y del hombre rana que, oculto tras un panel en la piscina, guardaba un drag&oacute;n de oro, me dirig&iacute; a la derecha y, desde all&iacute;, con tres enormes saltos acab&eacute; encima de la enorme estructura met&aacute;lica, de color naranja debido al &oacute;xido acumulado.</P>

<center><table>

<td><img src="jpg/tr2td02.jpg"><br>

<b><font size=1 face=arial><center>Este bote hinchable escond&iacute;a la llave<br> que tanto me cost&oacute; obtener</center></font></b></td>

</table></center>



<P ALIGN="JUSTIFY">En el lado contrario de esta estructura hab&iacute;a una peque&ntilde;a hendidura por la que me descolgu&eacute; hasta que la altura de la misma me permiti&oacute; izarme de nuevo y coger la suficiente carrera para saltar hasta una cavidad elevada enfrente de m&iacute;. Continu&eacute; por el t&uacute;nel y ascend&iacute; por la pared de roca gracias a las peque&ntilde;as plataformas naturales. Arriba me esperaban dos tipos bastante duros con ganas de pelea. M&aacute;s t&uacute;nel a&uacute;n y, finalmente, acced&iacute; a la zona superior de la cubierta. De un salto me plant&eacute; en el techo y, despu&eacute;s de otro peque&ntilde;o salto, me col&eacute; por una trampilla. Otro individuo m&aacute;s me esperaba all&iacute; adentro. Cuando acab&eacute; con &eacute;l, sal&iacute; por la puerta, que se abri&oacute; sola, y liquid&eacute; a otro m&aacute;s que estaba afuera. Apart&eacute; la caja que hab&iacute;a junto a la puerta para descubrir un interruptor que, al accionarlo, abri&oacute; otra puerta cercana. Entre en la sala reci&eacute;n abierta para descubrir que otra puerta me esperaba adentro y que la llave no obraba en mi poder. Sin saber muy bien donde podr&iacute;a hallarla recorr&iacute; otra vez todo el camino hasta la zona donde aqu&eacute;l t&uacute;nel se bifurcaba a la izquierda y, esta vez, segu&iacute; de frente. As&iacute; llegu&eacute; hasta una abertura en el suelo de roca que daba directamente encima del bote hinchable. Descend&iacute; hasta &eacute;l, aunque fue una ca&iacute;da muy dura, para comprobar que mi vista no me hab&iacute;a enga&ntilde;ado, una llave descansaba sobre la superficie del bote.</P>

<P ALIGN="JUSTIFY">De repente el agua estaba infestada de tiburones. Pude liquidar a alguno desde el bote, y al resto los esquiv&eacute; como pude, nadando de nuevo hasta el t&uacute;nel, para tomar de nuevo la bifurcaci&oacute;n de la izquierda y repitiendo mis pasos hasta la puerta en la que anteriormente me tuve que dar la vuelta. Abr&iacute; la puerta con la llave y atraves&eacute; el suelo r&aacute;pidamente, ya que se desplomaba a mi paso hacia una muerte segura. Al otro lado de la sala puls&eacute; un interruptor y volv&iacute; a salir tal y como hab&iacute;a entrado. De camino a la puerta que ahora se acababa de abrir tuve tiempo de eliminar a un nuevo individuo que vino a por m&iacute;. Tras esta nueva puerta hab&iacute;a unas escaleras que me llevaron a otra cueva. No sin cierta dificultad al final, ascend&iacute; hasta una abertura que daba a la parte m&aacute;s alta del barco donde, casualmente, alguien se hab&iacute;a dejado olvidada una llave que tom&eacute; prestada. Record&eacute; entonces que, en la zona de la h&eacute;lice, hab&iacute;a una puerta que anteriormente no logr&eacute; abrir, as&iacute; que descend&iacute; por la cubierta hasta realizar de nuevo aquella serie de saltos que me llev&oacute; hasta la gran estructura met&aacute;lica oxidada, que se elevaba cerca de dicha puerta. Desde la plataforma anterior pude vislumbrar un drag&oacute;n de jade que hubiera podido recuperar pero no quise correr riesgos, ya que el salto era muy peligroso.</P>

<center><table>

<td><img src="jpg/tr2td03.jpg"><br>

<b><font size=1 face=arial><center>Finalmente, tras tantos esfuerzos, el <br>&quot;seraf&quot; era m&iacute;o</center></font></b></td>

</table></center>





<P ALIGN="JUSTIFY">Descend&iacute;, pues, hasta la zona donde estaba aquella puerta, descubriendo que dos hombres con lanzallamas me esperaban parapetados tras las cajas que anteriormente yo hab&iacute;a estado manipulando. Los elimin&eacute; y, sin m&aacute;s dilaci&oacute;n, me acerqu&eacute; hasta la puerta. La llave la abri&oacute; con facilidad. Dentro me esperaba, nada m&aacute;s y nada menos que el &quot;seraf&quot;, objeto del que me hab&iacute;a hablado aquel monje tiempo atr&aacute;s. Cuando lo tuve en mi poder volv&iacute; a la superficie agarrada a una boya. Por casualidad termin&eacute; en el hangar del complejo situado mar adentro, donde el avi&oacute;n en que hab&iacute;a llegado hasta all&iacute; estaba abandonado. Lo tom&eacute; prestado —s&iacute;, tambi&eacute;n s&eacute; pilotar aviones— y me dirig&iacute; hacia el T&iacute;bet, donde tuve un aterrizaje m&aacute;s bien problem&aacute;tico. En el &uacute;ltimo momento salt&eacute; del avi&oacute;n con mi paraca&iacute;das y llegu&eacute; al suelo sin un rasgu&ntilde;o.</P>











<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





