<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 7. 40 Brazas.</h3>

</FONT>



<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">All&iacute; estaba yo, en medio de ninguna parte y con tiburones a mi alrededor, los cuales empezaban a pensar en m&iacute; como en un sabroso tentempi&eacute;. A mi espalda cre&iacute; vislumbrar algo, as&iacute; que all&iacute; me dirig&iacute; pensando en mi muerte inminente. Llegu&eacute; hasta los restos de un barco hundido y en la parte izquierda me pude colar por el hueco de salida del ancla hasta el interior donde —¡gracias al cielo!— encontr&eacute; una bolsa de aire que me salv&oacute; la vida. Un tibur&oacute;n ven&iacute;a a por m&iacute;, as&iacute; que tom&eacute; aire y me col&eacute; por una perforaci&oacute;n en el caso y tras un par de giros y accionar una palanca, abr&iacute; una compuerta por la que pude entrar hasta otra sala con cajas flotando. No hab&iacute;a mucho que pudiera hacer para izarme hasta el casco de la nave pero, entre las cajas pude encontrar un pasillo que me llev&oacute; hasta una palanca que dren&oacute; la sala.</P>



<center><table>

<td><img src="jpg/tr24f01.jpg"><br>

<b><font size=1><center>Pude entrar hasta otra sala con <br>cajas flotando</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Ahora ya me fue posible subirme hasta la caja m&aacute;s alta y, de all&iacute;, hasta la siguiente estancia. En ella me esperaba un individuo apostado a la derecha y una trampilla que se activaba al pasar por encima. Como lo hice de un salto tuve suerte de no caer. Tambi&eacute;n hab&iacute;a una estatua drag&oacute;n, la cual recog&iacute;. Por el hueco de la trampilla liquid&eacute; a los dos que me esperaban abajo antes de descender. Una vez en la nueva sala me ic&eacute; hasta otra caja elevada y, de &eacute;sta, hasta una abertura que me permiti&oacute; salir de all&iacute;. Desde luego aquel naufragio parec&iacute;a ser el lugar al que se dirig&iacute;a el submarino. ¿Qu&eacute; sentido ten&iacute;a si no el hecho de encontrarme hombres armados paseando por el interior de un barco que hab&iacute;a naufragado hac&iacute;a varias decenas de a&ntilde;os?</P>



<center><table>

<td><img src="jpg/tr24f02.jpg"><br>

<b><font size=1><center>Los quemadores que me imped&iacute;an el<br> paso, una vez superados</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Llegu&eacute; a una zona de pasillos en uno de los cuales hab&iacute;a unos quemadores impidi&eacute;ndome el paso. Nada m&aacute;s entrar en la zona, a mano izquierda, hab&iacute;a una palanca que abr&iacute;a una compuerta dando paso a una zona sumergida donde podr&iacute;a haber obtenido un drag&oacute;n de jade, pero estaba lleno de pececillos con malas intenciones y no quise jugarme el tipo. En el corredor m&aacute;s oscuro hab&iacute;a una abertura a media altura hasta la que me ic&eacute;, encontrando una palanca que abri&oacute; una puerta en otro de los pasillos. All&iacute; hab&iacute;a otra sala con una palanca que apagaba la primera mitad de los quemadores por un tiempo limitado. Tuve que volar, m&aacute;s que correr, para llegar a tiempo hasta dichos quemadores y accionar otra palanca que abr&iacute;a otra nueva puerta. ¿Quien era el chiflado que hab&iacute;a dise&ntilde;ado aquel barco? En aquella nueva sala encontr&eacute; otra palanca que apagaba la segunda mitad de los quemadores. Otra carrera hasta la sala donde se apagaban los primeros quemadores y, de nuevo, corriendo para poder cruzar aquel maldito pasillo sin chamuscarme. Como os pod&eacute;is imaginar, ya que estoy contando esta historia, lo consegu&iacute; por escasos segundos.</P>

<P ALIGN="JUSTIFY">Descans&eacute; unos instantes de tanto correr y accion&eacute; la palanca que abr&iacute;a la puerta al final del &quot;caluroso&quot; pasillo. Tras la puerta me esperaba una zona inundada por la que tuve que nadar a toda la velocidad de que fui capaz atravesando unas estrechas aberturas. Accionando dos palancas, una en cada extremo del recorrido, se abri&oacute; una compuerta por la que finalmente pude escapar a una muerte segura por asfixia. En el lugar donde se encontraba la segunda de las palancas tambi&eacute;n hab&iacute;a una estatuilla drag&oacute;n dorada, la cual recog&iacute;. Sal&iacute; a un corto pasillo que desembocaba en una habitaci&oacute;n llena de rocas. Descend&iacute; hasta ella y de &eacute;sta a otra m&aacute;s grande y tambi&eacute;n parcialmente cubierta de rocas. Hab&iacute;a varias salidas, pero ninguna de ellas estaba a mi alcance. En una esquina encontr&eacute; entonces una caja que pude desplazar hasta debajo de una de las aberturas y as&iacute; colarme por ella. All&iacute; encontr&eacute; una palanca que produjo un derrumbe de las rocas del nivel superior a trav&eacute;s de una compuerta y que me permiti&oacute; acceder a las dos escaleras pegadas a la pared izquierda. Sub&iacute; por ambas y, trepando por las rocas, acced&iacute; hasta una abertura con una palanca en cada caso. Una de ellas abri&oacute; una puerta en medio de una profunda sala y la otra inund&oacute; de agua dicha sala.</P>

<P ALIGN="JUSTIFY">Descend&iacute; de nuevo hasta la sala grande y, por la pared opuesta a la caja que utilic&eacute; en primer lugar, ascend&iacute; hasta otro pasillo por el que se llegaba a la sala reci&eacute;n inundada. Me sumerg&iacute; y entr&eacute; por la puerta reci&eacute;n abierta. Me encontr&eacute; a un hombre rara por el camino, al que no tuve m&aacute;s remedio que eliminar con mi arp&oacute;n. Siguiendo por un corto pasillo llegu&eacute; hasta una nueva sala, donde otros dos hombres armados quisieron aprovechar su oportunidad mientras yo sal&iacute;a del agua. En cuanto consegu&iacute; izarme a terreno seco, desenfund&eacute; un par de autom&aacute;ticas y di buena cuenta de ellos. En esta sala hab&iacute;a una palanca que abr&iacute;a la puerta adyacente y se comunicaba con otra zona del barco hundido.</P></FONT></BODY>

<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





