<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 12. El Monasterio Barkhang</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Descend&iacute; por la pendiente y enseguida comenc&eacute; a o&iacute;r una m&uacute;sica religiosa; aparentemente estaba en un monasterio. Hacia la derecha estaba la impresionante entrada y desde all&iacute; contempl&eacute;, sin intervenir, como los monjes daban buena cuenta de unos cuantos tipejos, probablemente mercenarios como los que llevaba yo largo tiempo despachando. Entr&eacute; con precauci&oacute;n, prepar&aacute;ndome para una dura batalla con los monjes, pero estos no me atacaron, as&iacute; que les dej&eacute; tranquilos con gran alivio por mi parte.</P>

<center><table>

<td><img src="jpg/tr2bm01.jpg"><br>

<b><font size=1 face=arial><center>El monasterio era una edificaci&oacute;n<br> realmente impresionante</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">La puerta principal del monasterio estaba cerrada, as&iacute; que deb&iacute;a hallar otra forma de colarme en su interior. En uno de los impresionantes muros hab&iacute;a una escala por la que trep&eacute;. Una vez arriba, tras ocuparme de unos molestos pajaritos, y con un par de saltos acabe en una cornisa de piedra. Desde aqu&iacute;, con otro par de saltos, me descolgu&eacute; hasta una ranura en las rocas por la que me acerqu&eacute; hasta una de las ventanas. Tuve que romper los cristales para poder entrar a lo que parec&iacute;a la biblioteca del lugar. Hice una exploraci&oacute;n preliminar de las estancias, dejando en todo momento que fueran los monjes los que se ocuparan de los tipejos que por all&iacute; abundaban, aunque ayud&aacute;ndoles cuando la ocasi&oacute;n as&iacute; lo requer&iacute;a.</P>

<P ALIGN="JUSTIFY">En una de las habitaciones, frente a otra con unas cuchillas rodantes, encontr&eacute; una escala por la que ascend&iacute; hasta la parte superior de lo que parec&iacute;a la enorme sala principal del monasterio. All&iacute; obtuve una llave, colocada en un pedestal, y segu&iacute; por la pasarela hasta el extremo opuesto a mi entrada. Dos enormes rocas rodantes estuvieron a punto de aplastarme aunque las evit&eacute; en el &uacute;ltimo instante. Ascend&iacute; por donde hab&iacute;a ca&iacute;do la &uacute;ltima hasta llegar a una especie de piscina. Salt&eacute; al agua para comprobar que la corriente me arrastraba hacia el fondo. Tuve que luchar con todas mis fuerzas para no morir ahogada y finalmente escap&eacute; por un t&uacute;nel lateral. Continuando por el pasadizo, &eacute;ste se torn&oacute; m&aacute;s oscuro para terminar en un impresionante salto de fe al vac&iacute;o, al final del cual se vislumbraba la presencia de agua pero sin garant&iacute;as sobre su profundidad. Me lanc&eacute; y, despu&eacute;s de la tremenda ca&iacute;da, me encontr&eacute; con todos los huesos enteros, cosa que ya de por s&iacute; fue casi un milagro. El pasadizo continuaba siendo oscuro as&iacute; que encend&iacute; una bengala. Una serie de puertas met&aacute;licas, que se abr&iacute;an y cerraban de forma intermitente, me esperaban a continuaci&oacute;n. Midiendo bien mi carrera no tuve problema en evitarlas. Ascend&iacute; por otra escala y acced&iacute; de esta manera a una habitaci&oacute;n donde otro monje hac&iacute;a guardia. Pronto aparecieron dos tipos armados y, en colaboraci&oacute;n con el monje, no dejamos m&aacute;s que sus despojos. De all&iacute; obtuve una especie de rueda de oraci&oacute;n aunque, como castigo por mi osad&iacute;a, unos quemadores se encendieron y tuve que medir bien las distancias para no morir abrasada. Solo me restaba mover un par de cajas para salir a una zona que cre&iacute; nueva pero pronto descubr&iacute; que llevaba de nuevo hasta las rampas donde estaban ub

icadas las rocas rodantes.</P>

<P ALIGN="JUSTIFY">Regres&eacute; hasta las habitaciones primeras y descubr&iacute; que la llave que ten&iacute;a en mi poder ajustaba perfectamente en la cerradura ubicada en el pasillo y me daba acceso al nivel inferior de la enorme sala principal en la que ya hab&iacute;a estado. Pronto se produjo otra refriega con unos individuos en la que los monjes fueron de nuevo una ayuda inestimable. Explor&eacute; todas las posibles v&iacute;as de salida y tambi&eacute;n encontr&eacute;, a la izquierda de la gran imagen sagrada, una sala donde faltaban cinco de esas ruedas de oraci&oacute;n. Coloqu&eacute; la que ten&iacute;a en mi poder sabiendo ya que deb&iacute;a encontrar otras cuatro m&aacute;s. Todos los pasillos me llevaban hasta un punto muerto hasta que tom&eacute; el primero a la derecha de la puerta de la sala principal. Tras una peque&ntilde;a estancia decorada en rojo segu&iacute;a un pasillo que, al acercarme, descubri&oacute; un mecanismo de hojas m&oacute;viles terriblemente afiladas. Esquiv&aacute;ndolas acced&iacute; a otra sala donde adquir&iacute; una nueva llave. Por su color y forma razon&eacute; que la cerradura deb&iacute;a ser una que ya hab&iacute;a observado en mi recorrido por el monasterio. As&iacute; que regres&eacute; por la puerta de la sala principal y hacia la izquierda encontr&eacute; la puerta que buscaba. Dentro solo hall&eacute; otra llave peque&ntilde;a de la que tambi&eacute;n cre&iacute;a conocer la pareja ya que en la cercana sala protegida por dos ruedas cortantes hab&iacute;a observado una diminuta cerradura que parec&iacute;a la adecuada.</P>

<P ALIGN="JUSTIFY">Salvando las cuchillas con habilidad abr&iacute; dicha cerradura. Tras unas escaleras llegu&eacute; a un lugar a cielo abierto donde un pasillo lleno de quemadores parec&iacute;a el camino a seguir. Un par de estatuas doradas con forma bovina escond&iacute;an la palanca que apagaba temporalmente dichos quemadores. Sin pausa salv&eacute; los obst&aacute;culos hasta llegar al final del pasillo. A la izquierda hab&iacute;a un patio con varias trampillas y una palanca. Cuando me dirig&iacute;a hacia ella se volvi&oacute; a montar otro jaleo entre monjes y mercenarios en el que no quise involucrarme. Accion&eacute; la palanca y se abrieron dos trampillas. Abajo me esperaban un par de gemas que acabaron en mi mochila. Otra palanca me permiti&oacute; salir de all&iacute;, de nuevo hacia el patio. Gir&eacute; a la izquierda para toparme con una enorme puerta en forma de estrella. Entre otras dos estatuas doradas encontr&eacute; un lugar donde colocar una de las gemas lo que provoc&oacute; la apertura de la puerta. Dentro, apart&eacute; una caja para obtener otra rueda de oraci&oacute;n. Ahora que tenia a&uacute;n una gema en mi poder se me ocurri&oacute; donde pod&iacute;a utilizarla; en mis exploraciones previas por la sala principal hab&iacute;a descubierto una cavidad similar que entonces no me sugiri&oacute; nada. Me encamin&eacute; hasta la segunda desviaci&oacute;n a la derecha de la sala grande y tras una escalada y un gran salto acab&eacute; reposando en la mano de la enorme estatua. Desde all&iacute; salt&eacute; de hasta la cabeza, la mano del otro lado y finalmente acced&iacute; a un peque&ntilde;o hueco en la pared donde, con la segunda gema, abr&iacute; una trampilla situada en la base de la estatua.</P>

<center><table>

<td><img src="jpg/tr2bm02.jpg"><br>

<b><font size=1 face=arial><center>En la sala principal una enorme imagen<br> sagrada lo dominaba todo</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Me col&eacute; por dicha trampilla, ascend&iacute; la oscura rampa y acab&eacute; en una diminuta sala tras una reja por la que se ve&iacute;a una gran sala inundada. Accion&eacute; una palanca que me abri&oacute; una puerta d&aacute;ndome acceso a una caja con la que podr&iacute;a bloquear el flujo de agua y drenar la sala pero antes quise explorar concienzudamente la sala y, buceando, encontr&eacute; un drag&oacute;n de piedra. De regreso a la sala principal hubo una refriega m&aacute;s en la que ayud&eacute; a los monjes a triunfar y tambi&eacute;n repar&eacute; en una peque&ntilde;a rampa tras la enorme estatua que, tras detallada inspecci&oacute;n, me revel&oacute; un recept&aacute;culo elevado donde encontr&eacute; un drag&oacute;n dorado. Recorr&iacute; de nuevo todo el camino y esta vez dren&eacute; la sala con lo que qued&oacute; accesible una caja que pude mover. Tras ella se escond&iacute;a otra rueda de oraci&oacute;n. Ascend&iacute; por la escala y me dirig&iacute; a la izquierda a una sala al final del pasillo de la que ya me hab&iacute;a vuelto atr&aacute;s con anterioridad por presentar seria amenaza para mi integridad f&iacute;sica. Ahora, en vista de que pr&aacute;cticamente no hab&iacute;a otra salida, tuve que afrontarlo. El quemador se apag&oacute; al acercarme, pero las bolas cubiertas de pinchos oscilaban de forma peligrosa. Haciendo una cabriola en el aire pude evitarlas y aterrizar en el pasaje inferior. Tuve que repetir la operaci&oacute;n, salvando adem&aacute;s una cuchilla rodante por en medio. El premio fue una nueva llave en mi poder. Para salir segu&iacute; la rampa ascendente y me dej&eacute; caer de espaldas para agarrarme al borde y amortiguar la ca&iacute;da de nuevo a la sala recientemente drenada. Ten&iacute;a tambi&eacute;n idea de cual era la cerradura correcta por ser de similar color a la llave, as&iacute; que me dirig&iacute; hasta la sala principal y abr&iacute; la trampilla que hab&iacute;a a la izquierda con la llave. Por la trampilla acced&iacute; 

al exterior del monasterio y tambi&eacute;n a una palanca que abri&oacute; las puertas que a&uacute;n permanec&iacute;an cerradas en la sala principal.</P>

<P ALIGN="JUSTIFY">Tras otros pocos disparos decid&iacute; explorar la zona exterior donde, tras unas rocas, descubr&iacute; una escalera. Trep&eacute; y segu&iacute; por la cornisa hasta encontrarme con un puente colgante y un hombre armado. Lo despach&eacute; y continu&eacute; hasta un peque&ntilde;o edificio que estaba cerrado. Con mis dotes circenses me col&eacute; por un lateral, trepando a unos salientes en la roca. Dentro hall&eacute; otra rueda de oraci&oacute;n y una palanca para abrir la puerta de salida. Regres&eacute; hasta la sala principal, eliminando m&aacute;s mercenarios por el camino pero cuando llegu&eacute; all&iacute; contempl&eacute; los resultados de una fuerte lucha en la que varios monjes hab&iacute;an ca&iacute;do. En una de las salas llena de cajas y barriles descubr&iacute; un pasaje que antes se me hab&iacute;a pasado por alto. Cuando pasaba por encima de una trampilla, &eacute;sta se abri&oacute; y en el &uacute;ltimo momento me agarr&eacute; a una escala en el interior del orificio por el que ca&iacute;a. Segu&iacute; adelante hasta unas escaleras que daban a una ventana. De inmediato sonaron disparos tras de m&iacute; y la ventana se rompi&oacute; en mil pedazos. Estaba totalmente cercada por hombres fuertemente armados as&iacute; que, de espaldas, me descolgu&eacute; por la ventana hasta un patio interior. All&iacute; accion&eacute; una palanca que abri&oacute; una puerta contigua. Por ella se precipitaron varios monjes en pos de los mercenarios as&iacute; que fui con ellos y les ayude en lo que pude hasta terminar con todos.</P>

<center><table>

<td><img src="jpg/tr2bm03.jpg"><br>

<b><font size=1 face=arial><center>Introduje el Seraf en su lugar para <br>poder continuar</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">De vuelta al patio ascend&iacute; por una serie de escalas hasta encontrar la &uacute;ltima rueda de oraci&oacute;n que me faltaba as&iacute; que descend&iacute; y recorr&iacute; el camino hasta aquella sala, colocando las ruedas restantes en su lugar. Como esperaba, las puertas se abrieron d&aacute;ndome paso a una sala en la que ard&iacute;an varios pebeteros. Una pared estaba totalmente cubierta por un enorme medall&oacute;n de oro en cuyo centro destacaba un orifico con la forma del Seraf. Lo introduje y se abri&oacute; una puerta lateral que conduc&iacute;a a…</P>

</FONT>









<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





