<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 5. El Complejo Mar Adentro.</h3>

</FONT>



<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Cuando recuper&eacute; la consciencia me encontraba encerrada en una celda y me hab&iacute;an despojado de todas mis armas, por lo que la situaci&oacute;n no pod&iacute;a ser mas complicada. Un dolor lacerante palpitaba en la parte posterior de mi cabeza, impidi&eacute;ndome pensar con claridad. Necesitaba hacer un poco de ejercicio para reactivar todo mi cuerpo as&iacute; que comenc&eacute; a mover sin prop&oacute;sito fijo las cajas que hab&iacute;a en mi celda. Detr&aacute;s de una de ellas encontr&eacute; un pulsador que abr&iacute;a la puerta de la celda durante unos segundos, pero no era suficiente como para llegar hasta ella, as&iacute; que tuve que reorganizar las cajas para despejar una v&iacute;a de escape. En cuanto sal&iacute; una alarma empez&oacute; a sonar y un par de tipos vinieron en mi busca. ¡Si tan s&oacute;lo hubiera tenido con qu&eacute; defenderme! Tuve que huir pasillo adelante pero enseguida mi carrera se vio frenada. ¡Estaba atrapada! Por suerte uno de los matones fall&oacute; el tiro y rompi&oacute; uno de los cristales, d&aacute;ndome sin querer una posibilidad de escape que aprovech&eacute; enseguida. Me dirig&iacute; hacia la derecha y, tras caer una peque&ntilde;a altura, observ&eacute; otro pulsador en la pared. Lo activ&eacute; y se abrieron las compuertas de la panza del avi&oacute;n.</P>

<P ALIGN="JUSTIFY">No lo dud&eacute; un instante y entr&eacute; en el avi&oacute;n buceando. All&iacute; estaban, tras una rejas, mis pistolas mas no las pude alcanzar. Sin embargo active otro pulsador que par&oacute; los motores del avi&oacute;n. Volv&iacute; al lugar del primer pulsador y tomando carrera salt&eacute; hasta el avi&oacute;n, col&aacute;ndome por una trampilla situada en la parte superior y recuperando, ¡por fin! mis pistolas. ¡Ahora sabr&iacute;an esos dos lo que era bueno! Les di su merecido y, como recompensa, uno de ellos me dej&oacute; en herencia una tarjeta de seguridad amarilla que seguro me ser&iacute;a de gran utilidad. Efectivamente, en la sala de los cristales rotos estaba la cerradura de nivel amarillo. Entr&eacute; y un nuevo pulsador me permiti&oacute; callar el molesto sonido de la alarma. Hab&iacute;a dos escaleras y decid&iacute; tomar la de la izquierda, carg&aacute;ndome a mi paso a los que encontr&eacute; por delante. Tras esquivar unos bidones rodantes llegu&eacute; a una cerradura de nivel rojo y tuve que dar la vuelta por donde hab&iacute;a venido.</P>

<P ALIGN="JUSTIFY">Tom&eacute; esta vez la escalera de la derecha y abr&iacute; una puerta de manivela. Detr&aacute;s hab&iacute;a un par de tipos que tambi&eacute;n quer&iacute;an juerga y una puerta al final de una rampa que se cerr&oacute; sola al acercarme, as&iacute; que descend&iacute; y abr&iacute; otra puerta de manivela, liquid&eacute; a otro hombre y me dirig&iacute; a los camarotes, donde encontr&eacute; un arp&oacute;n, mis autom&aacute;ticas y munici&oacute;n variada. En una de las literas encontr&eacute; otro pulsador que abri&oacute; una trampilla por la que trep&eacute; a continuaci&oacute;n. Segu&iacute; por el pasillo hasta una rampa pero, al no ver el suelo, decid&iacute; deslizarme de espaldas para poderme agarrar al borde y hacer menor la ca&iacute;da. Fue una suerte ya que la altura era enorme y de esta manera pude descender por la escala que hab&iacute;a en la pared. Una vez abajo coloqu&eacute; estrat&eacute;gicamente una de las cajas para poder saltar por encima de los quemadores hasta la otra escala por la que sub&iacute;. Arriba encontr&eacute; a otro candidato a difunto que ten&iacute;a en su poder la tarjeta de nivel rojo que yo necesitaba. Una escala lateral me llev&oacute; hasta una estatuilla drag&oacute;n de piedra y despu&eacute;s, por la escalera principal llegu&eacute; hasta una fosa a la que salt&eacute;. Buceando descubr&iacute; una palanca y prosiguiendo mi camino bajo el agua llegu&eacute; hasta una estatuilla de jade, aunque para volver estuvo a punto de faltarme el aire.</P>



<center><table>

<td><img src="jpg/tr2or02.jpg"><br>

<b><font size=1><center>Coloqu&eacute; una de las cajas para <br>saltar por encima de los quemadores</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Sal&iacute; de all&iacute; y me encamin&eacute; a la puerta de nivel rojo, para la que ya ten&iacute;a la llave. Otra alarma comenz&oacute; a sonar y tres tipos intentaron acorralarme. Ahora todos ellos descansan para siempre v&iacute;ctimas de su error al enfrentarse conmigo. La sala en que me encontraba ten&iacute;a una abertura a la que no parec&iacute;a f&aacute;cil llegar hasta que me ayude de una caja. Me col&eacute; por all&iacute; llegando hasta una cerradura de nivel verde y un interruptor que puls&eacute;. Esto llen&oacute; de agua un tanque adyacente a la primera sala de forma que pude cruzar a nado y seguir mi camino. Al otro lado del tanque, tras unas tuber&iacute;as, encontr&eacute; un pulsador que abri&oacute; una trampilla en la sala de la puerta de nivel verde. All&iacute; me dirig&iacute; y me lanc&eacute; por la trampilla y despu&eacute;s al agua, donde un par de hombres rana me dieron mucha lata. En uno de los pilares encontr&eacute; un drag&oacute;n dorado pero, al apropi&aacute;rmelo, llam&eacute; la atenci&oacute;n de varios individuos que tuve que eliminar. Otro de los pilares estaba pr&oacute;ximo a una escala a la cual trep&eacute; y, desde all&iacute;, hasta una pasarela adyacente mediante un gran salto. All&iacute; me esperaba el cad&aacute;ver de otro elemento que ten&iacute;a mi escopeta ya que me hab&iacute;a encargado de &eacute;l desde uno de los pilares.</P>



<center><table>

<td><img src="jpg/tr2or04.jpg"><br>

<b><font size=1><center>Entramado de pasarelas, con la<br> tarjeta verde al fondo</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Segu&iacute; por las pasarelas hasta llegar a otro individuo que guardaba celosamente la tarjeta de nivel verde. Yo le convenc&iacute; de que me la prestase unos instantes. Desandando mis pasos en parte, llegu&eacute; hasta una pasarela sobre la que hab&iacute;a un orificio elevado que me permiti&oacute; salir de all&iacute; por una serie de rampas y una escalera. Volv&iacute; hasta la puerta de nivel verde —eliminando a uno m&aacute;s por el camino— y la abr&iacute;. Tambi&eacute;n puls&eacute; de nuevo el interruptor de llenado de los tanques de forma que ahora era el segundo tanque el que estaba inundado. Esto me permiti&oacute; bucear por todo el pasadizo hasta una compuerta con una palanca y finalmente pude salir de nuevo a la superficie.</P></FONT></BODY>

<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





