<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">

<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 2. Venecia.</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Siguiendo la pista de Bartoli llegu&eacute; a la ciudad de Venecia, donde mi intenci&oacute;n no era precisamente ofrecerle mi lealtad a semejante individuo sino, quiz&aacute;s, un poco de plomo para ayudar a sus seguidores a recordar algunas cosas que necesitaba averiguar sobre la daga. No sab&iacute;a muy bien por donde empezar mi investigaci&oacute;n. Curioseando por la ciudad acab&eacute; en un estrecho callej&oacute;n donde identifiqu&eacute; pintarrajeado en la pared el s&iacute;mbolo del drag&oacute;n. Por fin parec&iacute;a estar en el camino correcto de nuevo.</P>

<P ALIGN="JUSTIFY">Lo primero que me encontr&eacute; al salir del callej&oacute;n fue el ataque furibundo de un enorme doberman y, tras acabar con el perro, un tipo nada amistoso empez&oacute; a dispararme desde un balc&oacute;n. Esto me reafirm&oacute; que estaba siguiendo la pista correcta. Poco m&aacute;s adelante me salieron al paso otro perro y su due&ntilde;o, un t&iacute;o bastante feo y muy fuerte con un bate de b&eacute;isbol al que decid&iacute; que le sentar&iacute;an bien un par de cartuchos de escopeta en el plexo solar. Tras tomar prestadas sus pertenencias me acerqu&eacute; hasta el canal y me di un remoj&oacute;n para atravesar buceando por debajo de un gran port&oacute;n de madera. Tras &eacute;l encontr&eacute; una lancha fuera borda y un interruptor que no dej&eacute; de pulsar —soy una curiosa compulsiva—. La puerta ten&iacute;a cerradura y, puesto que no ten&iacute;a la llave en mi poder, lo dej&eacute; para mejor ocasi&oacute;n y sal&iacute; buceando de nuevo hasta el garito del tipo al que me acababa de cargar. All&iacute; escal&eacute; por un par de trampillas —ambas accionadas por interruptores— hasta el techo, desde donde se pod&iacute;a contemplar una hermosa vista de la ciudad, pero no hab&iacute;a venido a hacer turismo as&iacute; que, de un disparo, abr&iacute; la ventana que ten&iacute;a m&aacute;s a mano y entr&eacute; en la casa. Cruzando por la otra ventana acced&iacute; de un par de saltos al balc&oacute;n donde descansaba el primer miembro del comit&eacute; de bienvenida, el cual ten&iacute;a una llave que m&aacute;s tarde us&eacute; para abrir la puerta del embarcadero donde estaba la lancha.</P>



<center><table>

<td><img src="jpg/tr2ve02.jpg"><br>

<b><font size=1><center>Balc&oacute;n donde descansaba el<br> primer miembro del comit&eacute;<br> de bienvenida</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Volviendo al interior de la casa me encontr&eacute; otro simp&aacute;tico perrito al que no tuve m&aacute;s remedio que dar un poco de jarabe de plomo. Al final de una hermosa galer&iacute;a, que cruzaba el canal de lado a lado, puls&eacute; otro interruptor y, para llegar a la puerta que se abri&oacute;, solo tuve que salir de nuevo por la &uacute;nica ventana que quedaba entera y poner en pr&aacute;ctica mis dotes circenses saltando de toldo en toldo. Una cosa que descubr&iacute; en mi viaje es que ¡Venecia est&aacute; lleno de interruptores! Otro interruptor m&aacute;s en la zona reci&eacute;n alcanzada y por fin se abre la puerta que da acceso al canal. Con la llave que hab&iacute;a obtenido antes abr&iacute; la puerta de la lancha pero cuando me dispon&iacute;a a subir en ella otro esbirro de Bartoli, armado hasta los dientes, decidi&oacute; eliminarme por lo que tuve que ense&ntilde;arle buenos modales, lecci&oacute;n que me agradeci&oacute; regal&aacute;ndome un par de pistolas autom&aacute;ticas que resultaron bastante &uacute;tiles de aqu&iacute; en adelante a la hora de dialogar con gente de su cala&ntilde;a.</P>



<center><table>

<td><img src="jpg/tr2ve03.jpg"><br>

<b><font size=1><center>Volv&iacute; al bote y me dirig&iacute;<br> hacia la oscuridad del canal<br> reci&eacute;n abierto</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Volv&iacute; al bote y me dirig&iacute; hacia la oscuridad del canal reci&eacute;n abierto donde, aparte de un mont&oacute;n de ratas ins&oacute;litamente agresivas y otro par de estatuillas drag&oacute;n, no encontr&eacute; gran cosa. La primera de las estatuillas —de piedra— estaba situada en un oscuro pasillo en el lateral derecho, al principio del canal. La otra, que era de oro, la encontr&eacute; en el fondo del canal, buceando en la zona tras la cascada. Finalmente, en una gran estancia con columnas, acced&iacute; a un peque&ntilde;o embarcadero de madera junto a un edificio en el que me col&eacute; mediante mi recientemente adquirida pasi&oacute;n por romper ventanas a tiros, cosa que no le hizo gracia al tipo que esperaba dentro, ¡descanse en paz el pobre infeliz! Un interruptor en el interior accionaba la esclusa que elev&oacute; mi lancha de nuevo hasta la salida y una nueva palanca, que hall&eacute; sumergida en la mencionada esclusa, me abr&iacute;a la puerta hasta otra zona de canales.</P>

<P ALIGN="JUSTIFY">Gire al lado izquierdo y me encontr&eacute; con unas g&oacute;ndolas que me bloqueaban el paso, as&iacute; que sal&iacute; de la lancha y me ic&eacute; desde el embarcadero hasta un toldo rojo. Desde ah&iacute; salt&eacute; hasta un paso elevado donde tuve que enfrentarme a algunos enemigos m&aacute;s, uno de los cuales portaba una llave que funcion&oacute; a la perfecci&oacute;n en la &uacute;nica puerta que hab&iacute;a en el patio adyacente. Dentro solo hall&eacute; un interruptor, el cual puls&eacute;, y al salir despach&eacute; a otro tipo que me vino siguiendo. Volv&iacute; a bajar hasta el canal aunque antes elimin&eacute;, desde la seguridad que me daba la distancia, a otro individuo que proteg&iacute;a una segunda lancha m&aacute;s adelante. Sub&iacute; a la m&iacute;a y atraves&eacute; las g&oacute;ndolas, que se destrozaron a mi paso. Segu&iacute;a navegando a buena velocidad, pasada la segunda lancha, en l&iacute;nea recta por el canal cuando, por el rabillo del ojo, apreci&eacute; unas sombras negras bajo el agua. Tuve el tiempo justo de saltar mientras la lancha volaba en pedazos al impactar con la primera de las minas. ¡Esta vez cre&iacute; que no lo contaba!</P>

<P ALIGN="JUSTIFY">Cerca de donde se encontraba la segunda lancha hab&iacute;a una puerta para la que no ten&iacute;a la llave y, al no encontrar otra salida, sub&iacute; a la lancha y volv&iacute; por donde hab&iacute;a venido. Por el camino liquid&eacute; a otro tipo que me esperaba oculto tras una esquina a mano izquierda. M&aacute;s adelante destroc&eacute; otro par de g&oacute;ndolas. Al saltar al embarcadero que hab&iacute;a a continuaci&oacute;n se abri&oacute; una puerta y otro aficionado al b&eacute;isbol sali&oacute; a recibirme. Su &uacute;nica compa&ntilde;&iacute;a eran las ratas y un interruptor que habr&iacute;a una puerta en otro lugar. Hacia all&iacute; me dirig&iacute; y la puerta se cerr&oacute; sola detr&aacute;s de m&iacute;. En un peque&ntilde;o charco encontr&eacute; una llave y despu&eacute;s ascend&iacute; por la escalera y liquid&eacute; a perro y amo que me esperaban arriba. Un interruptor abri&oacute; la salida por la que me lanc&eacute; al agua acabando con otro m&aacute;s que me esperaba abajo. Con la llave abr&iacute; la puerta situada en el lugar en que obtuve la segunda lancha, donde se escond&iacute;a un nuevo interruptor y un sujeto con cara de pocos amigos que tambi&eacute;n mat&eacute; en defensa propia. Empezaba a estar un poco perdida y no sab&iacute;a adonde dirigirme pero, tras dar varias vueltas por los canales, llegu&eacute; finalmente a un lugar con una rampa y otro hombre armado hasta los dientes. Puls&eacute; el interruptor que all&iacute; hab&iacute;a y salt&eacute; a la lancha de nuevo.</P>



<center><table>

<td><img src="jpg/tr2ve05.jpg"><br>

<b><font size=1><center>Saltando la enorme rampa, camino<br> del escondite de Bartoli</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Un reloj empez&oacute; a sonar y yo, alarmada, puse la directa saltando la rampa para seguir por una segunda rampa a&uacute;n mayor, atravesar los cristales de una galer&iacute;a —al hacerlo vi a mi derecha un drag&oacute;n de jade que no tuve tiempo de recoger— y finalmente consegu&iacute; pilotar la lancha por un estrecho callej&oacute;n hasta girar a la derecha y enfilar la entrada del escondite de Bartoli, donde previamente —y pr&aacute;cticamente sin querer— hab&iacute;a hecho volar con la otra lancha las minas que la proteg&iacute;an. La secuencia de apertura deb&iacute;a estar temporizada ya que, a los pocos segundos de entrar, la puerta se cerr&oacute; sola de nuevo, dej&aacute;ndome sin posibilidad de retroceder. De haber podido, habr&iacute;a recogido ese drag&oacute;n de jade, al que seguro ten&iacute;a acceso desde el embarcadero que hab&iacute;a al otro lado de la rampa —donde la puerta se hab&iacute;a abierto sola al llegar yo—. Fue una pena no darme cuenta en aquel momento pero no siempre se puede acertar en lo que uno hace. A&uacute;n as&iacute; estaba contenta porque, al menos, segu&iacute;a viva. Lo que no sab&iacute;a era por cuanto tiempo, ya que todo se estaba complicando mucho m&aacute;s de lo previsto.</P></FONT></BODY>

<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





