<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 8. Naufragio del María Doria.</h3>

</FONT>





<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">La puerta se cerr&oacute; tras de m&iacute;, con lo que el camino a tomar estaba claro: hacia adelante. Un corto pasillo me enfrent&oacute; a la necesidad de una nueva zambullida hacia lo desconocido. Lo primero que me encuentro es a un hombre rana con ganas de jaleo, lo que no hac&iacute;a muy esperanzador el resto de la excursi&oacute;n. Por si eso fuera poco, en cuanto salgo del agua veo que mi &uacute;nica salida es lanzarme cuesta abajo hasta una supuesta plataforma que, nada m&aacute;s caer en ella, se desplom&oacute;. La ca&iacute;da fue terrible y casi pierdo la vida en ella. Sin tiempo para curarme las heridas, dos hombres armados se lanzaron a por m&iacute; desde una sala contigua. A duras penas pude recuperarme lo suficiente para acabar con ellos. En la sala de la que vinieron los dos hombres no parec&iacute;a haber salida as&iacute; que, una vez los desplum&eacute; de sus pertenencias, volv&iacute; al lugar de mi ca&iacute;da donde hab&iacute;a visto una peque&ntilde;a abertura en el suelo y me dispuse a nadar de nuevo. Un largo pasadizo ascendente con una palanca en medio que abr&iacute;a la trampilla superior era lo que me esperaba. Y al ascender por la trampilla un mont&oacute;n de hombres armados por si no hab&iacute;a tenido bastante con los anteriores.</P>

<P ALIGN="JUSTIFY">La sala en la que me encontraba era enorme y la &uacute;nica salida parec&iacute;a ser una abertura elevada a la que no pod&iacute;a acceder. Unos quemadores me imped&iacute;an mover la caja que me hubiera izado hasta ella. Como no hab&iacute;a forma de apagarlos volv&iacute; al lugar donde los dos primeros hombres me recibieron tras mi estrepitosa ca&iacute;da. Recorr&iacute; la sala con m&aacute;s atenci&oacute;n y, adem&aacute;s de un mont&oacute;n de trastos viejos, descubr&iacute; unas cajas que pod&iacute;a apartar de mi camino, abriendo camino a trav&eacute;s de dos nuevos pasillos. Tom&eacute; el de la derecha, entrando a una gran sala con dos niveles y llena de tipos con malas intenciones a los que elimin&eacute; no sin cierto apuro. Cercano a una zona con el techo semiderrumbado descubr&iacute; un orificio en el suelo rodeado de cristales. Desde el &uacute;nico lateral que no ten&iacute;a cristales pude saltar al interior donde hab&iacute;a un peque&ntilde;o pasadizo en el que encontr&eacute; una llave. Sal&iacute; de all&iacute; y me encamin&eacute; al segundo de los pasillos que hab&iacute;a descubierto tras las cajas, el de la izquierda. El aspecto era, como en la sala anterior, desolador. Por todas partes hab&iacute;a restos de mobiliario destrozado por el naufragio. Tras una silla encontr&eacute; una cerradura que parec&iacute;a apropiada para la llave reci&eacute;n encontrada. Se abri&oacute; una puerta adyacente que descubri&oacute; un bot&oacute;n. Al pulsarlo se abrieron unas puertas dobles frente a m&iacute; y por ellas vino un individuo con intenci&oacute;n de golpear primero y preguntar despu&eacute;s.</P>

<P ALIGN="JUSTIFY">Tras liquidarlo me dirig&iacute; a la zona de la que &eacute;l hab&iacute;a venido. All&iacute; puls&eacute; otro bot&oacute;n que abri&oacute; una puerta en el segundo nivel de la sala m&aacute;s grande. A trav&eacute;s de los cristales tambi&eacute;n observ&eacute; otro pulsador y un objeto que seguro me servir&iacute;a de algo pero que no pod&iacute;a coger… a&uacute;n. As&iacute; pues, me dirig&iacute; de nuevo a la sala grande. All&iacute;, una de las elevaciones del suelo me permiti&oacute; elevarme hasta el segundo piso y, descolg&aacute;ndome por el borde pude acceder a la zona a mi izquierda, donde se hab&iacute;a abierto la puerta, y m&aacute;s a la izquierda a&uacute;n. All&iacute; estaba el cad&aacute;ver de uno de mis enemigos y tras un largo salto tuve en mi poder el primer cortacircuitos de los que iba a necesitar m&aacute;s tarde. Volv&iacute; a la puerta reci&eacute;n abierta y entr&eacute; por un largo pasillo con varias puertas. No ten&iacute;a la llave para la primera de ellas, as&iacute; que prob&eacute; con la siguiente, que me llev&oacute; a una sala totalmente vac&iacute;a. Abr&iacute; pues la otra puerta de manivela y me descolgu&eacute; hasta el suelo. Manejando un par de cajas y accionando un interruptor consegu&iacute; encaramarme hasta una puerta elevada. Segu&iacute; por el pasillo, pasando otra habitaci&oacute;n vac&iacute;a de largo, y por una peque&ntilde;a rampa hasta otra habitaci&oacute;n donde me esperaba otro individuo poco amistoso.</P>

<P ALIGN="JUSTIFY">Hab&iacute;a en esta sala una palanca elevada, a la que llegu&eacute; moviendo otra caja que, adem&aacute;s, revel&oacute; una llave oculta bajo ella. La palanca abri&oacute; la puerta y me encontr&eacute; de nuevo en el pasillo lleno de puertas. Prob&eacute; la llave en la primera puerta —la que antes no hab&iacute;a podido abrir— y funcion&oacute; perfectamente. Me descolgu&eacute; de nuevo al suelo y de nuevo tuve que mover unas cuantas cajas aqu&iacute; y all&aacute; para abrir un pasaje. Tras un corto pasillo llegu&eacute; a una habitaci&oacute;n con una parte de suelo inestable. Adem&aacute;s al cruzar por el unos barriles bajaron una rampa en pos de m&iacute;. Los evit&eacute; con un salto y, antes de subir, despach&eacute; al hombre que me esperaba m&aacute;s arriba. Del lugar donde vinieron los barriles obtuve un drag&oacute;n de jade, aunque tuve que sortear un &uacute;ltimo barril para conseguirlo. Sub&iacute; hasta donde hab&iacute;a matado al &uacute;ltimo; una habitaci&oacute;n con suelo de reja y un bote de madera debajo. Encontr&eacute; una palanca sumergida que abr&iacute;a una puerta en esa misma sala. Tuve que darme prisa para izarme hasta ella antes de que volviera a cerrarse.</P>

<P ALIGN="JUSTIFY">Ya dentro, otra palanca la mantuvo abierta de forma permanente. Segu&iacute; por la puerta de la derecha hasta una zona con bordes inclinados. Resbal&eacute; por el primero y entonces se abri&oacute; una trampilla mortal. Permanec&iacute; saltando adelante y atr&aacute;s hasta que se volvi&oacute; a cerrar. Entonces me pude izar hasta una abertura donde otra palanca abri&oacute; un pasaje en otro lugar. Retroced&iacute; hasta la sala del bote y de aqu&iacute;, por la abertura opuesta al lugar por el que hab&iacute;a entrado, hasta la zona reci&eacute;n descubierta. Elimin&eacute; a los tipos que rondaban la zona tanto en el primer nivel como en el inferior y puls&eacute; un bot&oacute;n que abri&oacute; una trampilla al otro lado de la abertura central. Corriendo pude llegar a tiempo de descolgarme hasta el nivel inferior, donde encontr&eacute; otro cortacircuitos y un bot&oacute;n que drenaba la sala del bote de madera. Otra trampilla temporizada me permiti&oacute; regresar al nivel superior. Fui hasta la sala del bote, donde en mi primera inmersi&oacute;n ya hab&iacute;a descubierto una puerta sumergida que, gracias a la ausencia de agua, me fue posible abrir ahora. Ascend&iacute; por un pasillo hasta la sala de las cristaleras pero mi camino estaba bloqueado por las puertas que yo hab&iacute;a dejado abiertas, impidi&eacute;ndome el acceso a otro cortacircuitos. Pulse el interruptor —que abri&oacute; una trampilla— y regres&eacute; por un pasillo, girando dos veces a la derecha y cayendo por dicha trampilla, hasta la citada sala.</P>



<center><table>

<td><img src="jpg/tr2wm03.jpg"><br>

<b><font size=1><center>Coloqu&eacute; la caja debajo de la abertura,<br> gracias a los cortacircuitos</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Puls&eacute; el bot&oacute;n que cerraba las puertas que me molestaban y volv&iacute; a subir por la trampilla y recorrer el camino para, por fin, poder hacerme con el tercer cortacircuitos. Esta vez solo gir&eacute; una vez a la derecha en el pasillo de regreso y segu&iacute; hasta el fondo, iz&aacute;ndome un par de veces hasta acabar cayendo al piso superior de la otra sala m&aacute;s grande ya visitada. Ahora ya ten&iacute;a los tres elementos que empezaba a vislumbrar me servir&iacute;an para apagar aquellos tres quemadores en la sala tras la inmersi&oacute;n por el pasillo ascendente. Me dirig&iacute; all&iacute;, eliminando a otros dos hombres por el camino y utilic&eacute; los cortacircuitos tal y como hab&iacute;a previsto. Coloqu&eacute; la caja debajo de la abertura y ascend&iacute; hasta ella, matando a otro que me esperaba escondido. Accion&eacute; una nueva palanca y cruc&eacute; la sala a saltos por encima de los enormes conductos. Al final tuve que dar un salto de fe, ya que la altura era enorme, hasta una zona de agua. Un poco de buceo y aparec&iacute; en otra zona inundada y con alg&uacute;n &quot;pececillo&quot; bastante agresivo. A la izquierda hab&iacute;a un pasillo bastante oscuro donde me encontr&eacute; por sorpresa con otro individuo. Tras acabar con &eacute;l acced&iacute; a la sala de la que proven&iacute;a. Por los ventanales observ&eacute; una llave situada en las rocas del fondo marino que, de momento, no sab&iacute;a como obtener. Explorando el puente de mando descubr&iacute; una puerta de manivela. Al abrirla acced&iacute; a una sala donde un interruptor daba acceso temporalmente a una nueva estancia en el lado opuesto. Corr&iacute; hacia ella y, empujando una caja descubr&iacute; otro interruptor. Puls&aacute;ndolo se abri&oacute; una trampilla que me permit&iacute;a el acceso a la llave.</P>



<center><table>

<td><img src="jpg/tr2wm04.jpg"><br>

<b><font size=1><center>Instante en que me apodero de la<br> llave sumergida</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Fue mucho m&aacute;s f&aacute;cil decirlo que hacerlo, ya que el fondo marino estaba infestado de tiburones y otros agresivos animales acu&aacute;ticos. Me persiguieron sin descanso mas no consiguieron alcanzarme y volv&iacute; a la trampilla con la llave y a salvo, aunque mis pulmones empezaban a pedir descanso. Otra inmersi&oacute;n, esta vez todo recto, me llev&oacute; hasta una cueva submarina donde encontr&eacute; un drag&oacute;n dorado y un lanzagranadas. Descans&eacute; un rato y volv&iacute; al barco sin m&aacute;s problemas. Con la llave reci&eacute;n obtenida abr&iacute; la cabina del puente de mando, cuya puerta se encontraba en el pasillo oscuro donde hab&iacute;a matado al &uacute;ltimo hombre. Dentro accion&eacute; otro interruptor que abri&oacute; una trampilla. De esta forma pude empujar una caja y ganar acceso a otro interruptor m&aacute;s, el cual abri&oacute; una nueva trampilla en el techo de la cabina.</P>

<P ALIGN="JUSTIFY">Sub&iacute; por la trampilla y llegu&eacute; hasta una sala con el fondo acristalado. Estaba parcialmente roto, d&aacute;ndome acceso al agua de nuevo. Acab&eacute; desde arriba con un par de tipos armados y un hombre rana para despu&eacute;s descender por una abertura a mi derecha hasta el segundo nivel. Desde aqu&iacute; me lanc&eacute; al agua sin peligro de cortarme con los cristales y, tras acabar con otro hombre rana, prosegu&iacute; buceando por un pasadizo en las rocas. Perseguida por varios animales acu&aacute;ticos nada amistosos llegu&eacute; a una nueva zona del barco.</P>



<center><table>

<td><img src="jpg/tr2wm05.jpg"><br>

<b><font size=1><center>Perseguida por animales acu&aacute;ticos<br> llegu&eacute; a una nueva zona del barco</center></font></b></td>

</table></center>





<font face=arial size=2><hr>



<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





