<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 4. La Casa de la Ópera.</h3>

</FONT>





<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Fue un descenso r&aacute;pido y breve al final del cual apenas pude frenar a tiempo de evitar golpearme contra una caja que oscilaba colgada de una cuerda. ¡La ca&iacute;da habr&iacute;a sido fatal! Salte a la derecha y desde all&iacute; liquid&eacute; f&aacute;cilmente a un tipo que me esperaba m&aacute;s abajo. Salt&eacute; al agua y recorr&iacute; el canal a nado. En la parte de la izquierda hab&iacute;a una larga escalera. Sub&iacute; hasta encontrar un interruptor y m&aacute;s arriba hasta una peque&ntilde;a plataforma desde la cual pude volver, de dos impresionantes saltos, hasta la plataforma con la caja oscilante. Desde aqu&iacute; cruc&eacute; de nuevo el canal de un salto hacia el frente y fui a colarme por una trampilla que hab&iacute;a abierto aquel interruptor. All&iacute; me esperaba un tipo grandote con muy malas pulgas que desde entonces duerme el sue&ntilde;o eterno, como dir&iacute;a Raymond Chandler. Tambi&eacute;n hab&iacute;a una llave que no dud&eacute; en apropiarme, ya que donde hay una llave suele haber cerca una cerradura a su medida —por lo que me dicta la experiencia—. Sal&iacute; por las escaleras tras liquidar a otro m&aacute;s que me sali&oacute; al paso y volv&iacute; por la ruta ya conocida al lugar del inicio.</P>



<center><table>

<td><img src="jpg/tr2ho01.jpg"><br>

<b><font size=1><center>Me descolgu&eacute; hasta la ventana<br> y entr&eacute; por ella</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">En ese momento me llam&oacute; la atenci&oacute;n un edificio acristalado a mi derecha, as&iacute; que tras dos saltos acab&eacute; en una peque&ntilde;a plataforma a la derecha del mismo. Desde all&iacute; me descolgu&eacute; mediante una arriesgada maniobra hasta la ventana y entr&eacute; por ella, como ya ven&iacute;a siendo costumbre en m&iacute;. Teniendo cuidado al caminar por los cristales me dispuse a escalar de nuevo. Finalmente llegu&eacute; hasta una puerta que abr&iacute; con la llave reci&eacute;n adquirida. Para poder continuar tuve que cruzar saltando a gran altura por varias plataformas en bastante mal estado, que se fueron destrozando a medida que las pisaba. ¡Suerte tuve de llegar con vida al otro lado! Segu&iacute; hacia la derecha por un pasillo hasta la c&uacute;pula de la Casa de la Opera, guardada por varios hombres y algunos perros, a los que liquid&eacute; no sin algunos problemas, debido a su elevado n&uacute;mero. Posteriormente salt&eacute; hasta el extremo opuesto de la c&uacute;pula, al lugar donde otra caja oscilaba colgada de una cuerda y all&iacute; descubr&iacute;, oculto en la penumbra, otro interruptor, que abri&oacute; la c&uacute;pula y dio paso a dos gorilas enfurecidos. Tras acabar con ellos, acced&iacute; al interior de la Casa de la Opera por la reci&eacute;n abierta trampilla. El estado en que se encontraba todo el edificio era francamente lamentable.</P>

<P ALIGN="JUSTIFY">Uno de los interruptores que encontr&eacute; abri&oacute; una reja lateral por la que acced&iacute; a un corredor con bastante pendiente, donde tuve que esquivar la primera de las muchas rocas rodantes que me esperaban a partir de entonces. Puls&eacute; otro interruptor y sub&iacute; por la escala hasta una abertura junto a la reja ahora cerrada. Por all&iacute; descend&iacute; a los palcos superiores donde liquid&eacute; a varios hombres m&aacute;s y sus mascotas mientras llegaba poco a poco hasta el piso inferior del teatro. Cruzando por el agua llegu&eacute; al escenario, donde me recibieron algunos tipejos m&aacute;s. Al lado izquierdo del escenario puls&eacute; un interruptor que abri&oacute; una reja en el lado derecho pero, cuando me acerqu&eacute;, otros dos cachas me quisieron sacudir, aunque yo no les permit&iacute; que pegaran a una dama. Sub&iacute; hacia la reja reci&eacute;n abierta y, con cuidado nuevamente por los cristales, llegu&eacute; hasta donde pude y con un gran salto a la izquierda me qued&eacute; colgada de un saliente en la pared por el que me deslic&eacute; hasta izarme hacia otro interruptor, que baj&oacute; el puente de madera que antes me impidi&oacute; el paso. Volv&iacute;, pues, hasta all&iacute; y fui subiendo por las plataformas de madera y esquivando un par de sacos que oscilaban a un lado y a otro hasta llegar a un nuevo interruptor el cual lanz&oacute; otro saco al suelo haciendo un agujero en mitad del escenario.</P>



<center><table>

<td><img src="jpg/tr2ho03.jpg"><br>

<b><font size=1><center>Esquivando un par de sacos que <br>oscilaban a un lado y a otro</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Segu&iacute; avanzando y descend&iacute; con cautela por la rampa para acabar cayendo por el reci&eacute;n abierto orificio y me fui a hacer una excursi&oacute;n por la zona que &eacute;ste revelaba. Necesit&eacute; alguna bengala, ya que estaba bastante oscuro y descubr&iacute; un interruptor que a&ntilde;ad&iacute; a mi colecci&oacute;n de interruptores pulsados, una estatuilla drag&oacute;n y una especie de rel&eacute; que cog&iacute; por si acaso, aunque parec&iacute;a un trasto viejo y sin utilidad aparente. Ascend&iacute; por la escalera y volv&iacute; a la parte alta del teatro. En un pasillo que antes hab&iacute;a pasado por alto encontr&eacute; un par de perritos que no dude en despachar. El ascensor no funcionaba as&iacute; que prob&eacute; el rel&eacute; que hab&iacute;a encontrado y ¡voil&aacute;! ¡No sab&iacute;a que mis dotes como t&eacute;cnico de ascensores llegaran a tanto! Descend&iacute; en el ascensor y al llegar abajo tuve que matar a otros dos individuos que no ten&iacute;an ganas de charla precisamente, armados con autom&aacute;ticas. Cuando les obligu&eacute; a dejarme en paz puls&eacute; el bot&oacute;n del ascensor de nuevo para hacerlo subir y me lanc&eacute; al agua que descubr&iacute; en el foso del mismo. Explorando la zona encontr&eacute; una placa de circuito impreso y un interruptor que me abri&oacute; una nueva salida hacia arriba. Ascend&iacute; un par de veces hasta un pasillo y aqu&iacute; mat&eacute; a otro hombre y su perro para despu&eacute;s colarme en los camerinos… efectivamente, por la ventana ¿como si no?</P>

<P ALIGN="JUSTIFY">La salida de los camerinos era muy extra&ntilde;a, ya que consist&iacute;a en una rampa, al final de la cual hab&iacute;a un peligroso ventilador. ¿A qui&eacute;n se le ocurre poner los conductos de ventilaci&oacute;n en el suelo? El caso es que con un salto a tiempo me libr&eacute; del corte mortal de las palas y tome una llave prestada de nuevo. Con una complicada combinaci&oacute;n de escalada y salto llegu&eacute; a un conducto que terminaba con m&aacute;s ventiladores. Tuve que medir muy bien mis saltos para evitarlos, pero finalmente llegu&eacute; hasta un drag&oacute;n de jade y m&aacute;s arriba hasta un peque&ntilde;o espacio con una caja de madera. No parec&iacute;a haber salida y no pod&iacute;a volver atr&aacute;s as&iacute; que mov&iacute; la caja y descubr&iacute; un pulsador oculto tras ella que me devolvi&oacute; a los camerinos. Ten&iacute;a que volver a subir pero ¿como? Tuve que poner dos cajas una encima de la otra para conseguirlo. La segunda la encontr&eacute; en un peque&ntilde;o y oscuro habit&aacute;culo tras los ventanales.</P>

<P ALIGN="JUSTIFY">Elimin&eacute; al hombre que me esperaba impaciente y segu&iacute; subiendo hasta una cerradura que abr&iacute; con la llave, volviendo al corredor inclinado del principio. Puls&eacute; el interruptor y volv&iacute; a entrar en la sala de control del teatro. All&iacute; nuevamente hice uso de mis dotes de mec&aacute;nico y, con el circuito impreso, arregl&eacute; el mecanismo de la derecha. Ahora el pulsador levant&oacute; los decorados del escenario, lo que levant&oacute; mucho revuelo ¿Pero es que no van a dejar nunca de aparecer tipos malos? Tuve que bajar a presentarles mis respetos, form&aacute;ndose una gran ensalada de tiros de la que yo sal&iacute; vencedora. La parte posterior del escenario estaba llena de cajas amontonadas, una de las cuales pude desplazar y tras ella encontr&eacute; un nuevo interruptor que me dio acceso a una plataforma sobre el escenario. Desde all&iacute; me cargu&eacute; a otro tipo que apareci&oacute; abajo y me col&eacute; por una abertura bien escondida hacia la parte derecha. Puls&eacute; otro bot&oacute;n m&aacute;s y se abri&oacute; una compuerta delante de m&iacute;, pero primero tuve que eludir con un salto lateral el saco oscilante que amenazaba con golpearme.</P>

<P ALIGN="JUSTIFY">Ante m&iacute; oscilaba otra caja de madera, as&iacute; que me descolgu&eacute; hasta el suelo y all&iacute; me esperaba Bartoli sin darme tiempo ni a presentarme, por lo que tuve que eliminarlo a &eacute;l y sus perros. ¡Tengo que decir en su honor que era un tipo bastante duro de roer! Otro de sus esbirros tambi&eacute;n dijo su &uacute;ltima palabra. Desde el fondo de la sala escal&eacute; encima de las cajas y, con unos cuantos saltos bien medidos, volv&iacute; hasta la zona por la que hab&iacute;a entrado, donde… s&iacute;, lo hab&eacute;is adivinado ¡encontr&eacute; otro interruptor! Que abr&iacute;a un pasaje hacia un avi&oacute;n que esperaba con los motores en marcha. Aunque para llegar a &eacute;l tuve que pasarle por encima a otro de los secuaces de Bartoli. Mont&eacute; en el avi&oacute;n y pude escuchar parte de la conversaci&oacute;n entre el piloto y otro t&iacute;o vestido de negro, pero de repente alguien debi&oacute; golpearme porque sent&iacute; un dolor muy fuerte en la parte posterior de la cabeza y no recuerdo nada m&aacute;s…</P>



<center><table>

<td><img src="jpg/tr2ho05.jpg"><br>

<b><font size=1><center>Sent&iacute; un dolor en la parte posterior<br> de la cabeza y no recuerdo nada m&aacute;s</center></font></b></td>

</table></center>







<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





