<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">

<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 3. El Escondite de Bartoli.</h3>

</FONT>



<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">All&iacute; me encontraba, sola en la oscuridad del canal, cuando sin acci&oacute;n alguna por mi parte la reja que me bloqueaba el paso se abre, como invit&aacute;ndome a entrar. Parec&iacute;a bastante sospechoso, seguramente era una treta del tal Bartoli pero, ¿que otra cosa pod&iacute;a hacer m&aacute;s que seguirle el juego a mi anfitri&oacute;n? As&iacute; que dej&eacute; mi lancha en el embarcadero y sal&iacute; dispuesta a enfrentarme a cualquier cosa que hubieran preparado para m&iacute;.</P>

<P ALIGN="JUSTIFY">La puerta estaba cerrada, as&iacute; que sub&iacute; por unas escaleras laterales y encontr&eacute; el interruptor que la abre —bastante bien protegido, como era de esperar, por uno de los esbirros de Bartoli, m&aacute;s otro que lleg&oacute; despu&eacute;s—. Dentro, el recibimiento tambi&eacute;n fue a base de plomo, pero seguro que no contaban con mi buena punter&iacute;a, cada vez mejor gracias a la pr&aacute;ctica. Baste decir que nunca supieron de donde les llegaban los disparos, de tan r&aacute;pido como me mov&iacute;. Al otro lado de las ventanas hab&iacute;a un par de perros que dieron tambi&eacute;n sus &uacute;ltimos ladridos. Tras recorrer la estancia, llamaron mi atenci&oacute;n unas estatuas armadas con enormes espadas que guardaban un pasillo. En cuanto me acerqu&eacute;, las espadas empezaron a moverse amenazadoras arriba y abajo pero, midiendo mi carrera con cuidado, pude evitarlas sin demasiada dificultad. Al fondo, en una habitaci&oacute;n muy oscura —tuve que usar una bengala para poder ver algo— encontr&eacute; un interruptor que, como siempre hago, puls&eacute; de inmediato. Para entonces las estatuas hab&iacute;an detenido su mortal danza por lo que, afortunadamente, salir fue mucho m&aacute;s sencillo que entrar.</P>



<center><table>

<td><img src="jpg/tr2bh01.jpg"><br>

<b><font size=1><center>En cuanto me acerqu&eacute;, las espadas<br> empezaron a moverse</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">De vuelta en la sala principal sent&iacute; curiosidad por una rampa de madera a la que muy pronto encontr&eacute; utilidad para izarme —con un salto de espaldas— hasta el nivel superior donde, tras mover un enorme bloque de piedra, me hice sitio para saltar hasta el otro lado por encima de la barandilla y de all&iacute;, trepando por la pared, hasta un balc&oacute;n exterior desde el que liquid&eacute; a un tipo apostado a mi derecha en otro balc&oacute;n. Despu&eacute;s vino lo m&aacute;s dif&iacute;cil, ¡no lo creer&eacute;is cuando os lo diga! Desde el balc&oacute;n salt&eacute; a un toldo, pero el maldito era muy resbaladizo, as&iacute; que me desplac&eacute; colgada del borde hasta la parte izquierda, donde me ic&eacute; y, mientras resbalaba, di un salto de espaldas y sin mirar hasta otro balc&oacute;n que hab&iacute;a enfrente ¡guau!.</P>

<P ALIGN="JUSTIFY">Otro par de saltos m&aacute;s y acab&eacute; en otro toldo desde donde me lanc&eacute; —con cuidado de no chocar con la pared— hacia una puerta que hab&iacute;a abierto antes mediante uno de los pulsadores. Acab&eacute; con el comit&eacute; de bienvenida perruno —cosa que no divirti&oacute; al due&ntilde;o de los chuchos— y sub&iacute; hasta una sala con una ventana que ¡l&aacute;stima! romp&iacute; en pedazos. Al tipo que estaba en el balc&oacute;n no le hizo gracia as&iacute; que, bueno, le present&eacute; mis disculpas y &eacute;l no tuvo m&aacute;s remedio que aceptarlas de buen grado. Antes de salir al balc&oacute;n observ&eacute;, pr&oacute;xima a la puerta, una palanca bastante bien escondida que abri&oacute; una puerta al final de la escalera que acababa de subir. Dentro me esperaba el cad&aacute;ver de un tipo que hab&iacute;a liquidado previamente y otro drag&oacute;n de piedra. ¡Ya empezaba a coleccionarlos!</P>

<P ALIGN="JUSTIFY">Ahora s&iacute;, sal&iacute; al balc&oacute;n y entre por la siguiente ventana, donde un par de tipos y su perro me lo pusieron bastante dif&iacute;cil, persigui&eacute;ndome por toda la habitaci&oacute;n. Durante unos minutos me pareci&oacute; que no hab&iacute;a m&aacute;s salida pero, finalmente, apreci&eacute; que el fondo de la chimenea ten&iacute;a un aspecto sospechoso as&iacute; que me acerqu&eacute; y, empuj&aacute;ndolo hacia adentro, me abr&iacute; paso. Tras liquidar a algunas ratas me toc&oacute; saltar por encima de unas enormes cuchillas m&oacute;viles y de una serie de hogueras —esto &uacute;ltimo muy r&aacute;pido y midiendo bien cada salto para no caerme—. Al llegar al final una puerta se abri&oacute; autom&aacute;ticamente y entr&eacute; a una sala con tres l&aacute;mparas situadas a diferentes alturas y un tipo que, desde el principio, se ve&iacute;a que era carne de ca&ntilde;&oacute;n al igual que sus perros. Aqu&iacute; estuve un buen rato entretenida, saltando de l&aacute;mpara en l&aacute;mpara, sin olvidarme de pulsar dos interruptores situados en sendas plataformas laterales. Tras subir hasta la viga principal del edificio y saltar al otro lado un tipo me estaba esperando y, sin dudarlo, le di su merecido. Volv&iacute; a subir a la viga por el lado contrario y encontr&eacute; otro interruptor que cambi&oacute; la altura de las l&aacute;mparas, permiti&eacute;ndome bajar hasta una cavidad en el interior de un cuadro que se hab&iacute;a abierto mediante uno de los pulsadores anteriores y donde encontr&eacute; una llave. Es la casa m&aacute;s raramente construida que he tenido la suerte o la desgracia de recorrer en toda mi vida.</P>

<P ALIGN="JUSTIFY">Nuevamente sub&iacute; por las l&aacute;mparas hasta una de las plataformas adyacente a la pared izquierda y sal&iacute; por la ventana, recorriendo la cornisa hasta llegar al hueco de la chimenea, lanz&aacute;ndome por &eacute;l al agua. Un interruptor sumergido me abri&oacute; camino hasta un drag&oacute;n dorado y algo de munici&oacute;n, aunque a punto estuve de ahogarme en el intento por lo complejo del recorrido subacu&aacute;tico. Volv&iacute; al punto de partida y abr&iacute; la puerta de la biblioteca con la llave que encontr&eacute; en el cuadro. Tras liquidar al primer individuo que se me acerc&oacute; me dirig&iacute; hacia el fondo y escalando por las estanter&iacute;as llenas de libros alcanc&eacute; un interruptor que abr&iacute;a otra de las puertas.</P>

<P ALIGN="JUSTIFY">All&iacute; me dirig&iacute;, liquidando a otro por el camino y, una vez dentro, escal&eacute; de nuevo las estanter&iacute;as, salt&eacute; y volv&iacute; a escalar hasta una ventana que romp&iacute;. Cruc&eacute; por ella, dej&aacute;ndome caer por la rampa y tras varios saltos bien medidos, primero al balc&oacute;n y de all&iacute; hasta un tejadillo, acab&eacute; en una pared de ladrillo y desde el final de &eacute;sta hasta el tejado de la caba&ntilde;a de madera del otro lado del canal —un salto reservado para unos pocos elegidos—. Siempre por el techo me dirig&iacute; al extremo opuesto de la caba&ntilde;a y despu&eacute;s de otro salto m&aacute;s hasta una abertura en la pared me lanc&eacute; a un peque&ntilde;o charco donde tom&eacute; prestadas unas armas autom&aacute;ticas. Baj&eacute; hasta el interior de la caba&ntilde;a y elimine al guardi&aacute;n de una extra&ntilde;a llave que, por supuesto, tom&eacute; prestada. No sab&iacute;a que utilidad pod&iacute;a darle pero estar&iacute;a m&aacute;s segura en mi poder.</P>

<P ALIGN="JUSTIFY">Cruce el estrecho canal a nado y entr&eacute; por la peque&ntilde;a puerta, que me reservaba otra sorpresita en forma de hombre armado. De regreso en la sala principal de la biblioteca pulse un interruptor que antes hab&iacute;a pasado por alto en el calor de la refriega y entr&eacute; por la puerta adyacente al mismo —muy bien guardada, por cierto, por otro par de gorilas con armas autom&aacute;ticas—. Tras salir nadando de nuevo llegu&eacute; a una especie de detonador. Fue divertido activarlo con la llave que obtuve en la caba&ntilde;a y ver como buena parte de la guarida de Bartoli volaba por los aires, aunque otro hombre armado no opinaba lo mismo que yo y tuvimos de zanjar nuestras diferencias a tiros.</P>

<P ALIGN="JUSTIFY">Nunca supe cual era el verdadero prop&oacute;sito de semejante carga explosiva pero no fue esta la primera ni la &uacute;ltima cosa inexplicable que me sucedi&oacute; a lo largo de mi aventura. Escal&eacute; con cuidado y paciencia el edificio pr&aacute;cticamente derruido y acab&eacute; cayendo sin propon&eacute;rmelo por una oscura rampa que no sab&iacute;a donde me llevar&iacute;a. Mientras me deslizaba por ella no pod&iacute;a dejar de pensar en que esta aventura empezaba a convertirse en una especie de pesadilla. ¡Inocente de m&iacute;! ¡No ten&iacute;a ni idea de lo que me esperaba a&uacute;n!</P>

<center><table>

<td><img src="jpg/tr2bh05.jpg"><br>

<b><font size=1><center>Acab&eacute; en una oscura rampa que no<br> sab&iacute;a dónde me llevar&iacute;a</center></font></b></td>

</table></center>







<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





