<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 9. Los Camarotes.</h3>

</FONT>





<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Me encontraba de nuevo buceando, con los pulmones al l&iacute;mite y sin v&iacute;a de escape posible. Tratando de no perder la calma, finalmente descubr&iacute; a mi izquierda una palanca que abri&oacute; una compuerta de carga ante m&iacute;. Por ella entr&eacute; a una bodega donde respir&eacute; m&aacute;s relajada. Por poco tiempo, ya que un trabajador vino a liquidarme, resultando &eacute;l liquidado. Evitando los enormes nervios del costado del barco llegu&eacute; hasta el otro extremo de la bodega por donde acced&iacute; a una gigantesca sala de m&aacute;quinas dividida por la mitad por una serie de enormes pistones. Cruc&eacute; al otro lado —no sin antes observar una palanca en un saliente elevado— y continu&eacute; por un pasillo bastante revirado hasta un hueco en el suelo. Salt&eacute; y cuando me dispon&iacute;a a seguir camino tranquilamente o&iacute; unos sospechosos pasos. Eso fue lo que me salv&oacute; puesto que inmediatamente apareci&oacute; un trabajador, armado con la llave inglesa m&aacute;s grande que he visto nunca, dispuesto a usarla conmigo. Cuando cre&iacute; que estaba a salvo, un segundo hombre, este con arma de fuego, vino en su ayuda. Saliendo al pasillo, unos bidones se me vinieron encima, adem&aacute;s de un tercer hombre. Termin&eacute; en una habitaci&oacute;n con una rampa y unos quemadores, que pude evitar saltando hasta un saliente en la pared y cruzando colgada por encima de ellos hasta llegar a una palanca que los apag&oacute;. Me ic&eacute; hasta otro pasadizo y accion&eacute;, al final del mismo, otra palanca que movi&oacute; los pistones de la sala de m&aacute;quinas, donde regres&eacute; de inmediato, por el orificio en el suelo junto al interruptor.</P>



<center><table>

<td><img src="jpg/tr2lq01.jpg"><br>

<b><font size=1 face=arial><center>Variando la altura de los pistones pude<br> alcanzar esta palanca</center></font></b></td>

</table></center>



<P ALIGN="JUSTIFY">El desplazamiento provocado en los pistones me permiti&oacute; izarme hasta ellos y llegar hasta un saliente en el otro extremo de la sala donde me esperaba un caluroso recibimiento —a tiros, como casi siempre—. Antes de proseguir salt&eacute; hasta un saliente a mi derecha, donde descubr&iacute; un drag&oacute;n de piedra, y regres&eacute; otra vez por los pistones. Continu&eacute; por el pasillo hasta legar a una caja que empuj&eacute; hasta llegar a otra con la que hice lo mismo. Esto me permiti&oacute; volver a la palanca que mov&iacute;a los pistones y dejarlos como estaban en un principio. Volv&iacute; a ascender hasta la sala de m&aacute;quinas por donde hab&iacute;a venido y cruc&eacute; de nuevo por encima de los pistones, cuya nueva posici&oacute;n me permiti&oacute; llegar hasta aquella palanca que hab&iacute;a observado anteriormente y que estaba fuera de mi alcance. Al accionarla se inund&oacute; la sala de la rampa y los quemadores a donde me dirig&iacute; de inmediato. Accion&eacute; all&iacute; una palanca que abri&oacute; la puerta al fondo y hacia all&iacute; nad&eacute; despu&eacute;s de coger aire. Despu&eacute;s de desembarazarme de un hombre rana sal&iacute; hasta el exterior del barco de nuevo. Tom&eacute; aire en una peque&ntilde;a cavidad natural cercana y me dirig&iacute; hacia la boca de una cueva mayor donde encontr&eacute; una nueva palanca vigilada por una enorme criatura marina que no me devor&oacute; por pura suerte. Al accionar la palanca se abri&oacute; una compuerta que me permiti&oacute; acceder a una nueva zona del barco.</P>



<center><table>

<td><img src="jpg/tr2lq02.jpg"><br>

<b><font size=1 face=arial><center>La compuerta se abri&oacute; y acced&iacute; a<br> otra zona del barco</center></font></b></td>

</table></center>





<P ALIGN="JUSTIFY">Era una gran sala con una pasarela central. Tras eliminar al hombre que se ocultaba arriba y accionar la correspondiente palanca se abri&oacute; una puerta al otro extremo de la pasarela. En la nueva ubicaci&oacute;n hab&iacute;a dos palancas que accionaban sendas plataformas temporizadas. Accion&eacute; ambas palancas en r&aacute;pida sucesi&oacute;n, salt&eacute; hasta agarrarme al borde y, colgando, me desplac&eacute; hasta una nueva palanca que tuvo efectos en la sala principal. Volv&iacute;, pues, all&iacute; para observar que una trampilla hab&iacute;a bajado dejando el hueco justo para, con una h&aacute;bil sucesi&oacute;n de saltos, izarme hasta arriba, donde me esperaba el cad&aacute;ver de aquel hombre. Camin&eacute; por el estrecho conducto y apart&eacute; como pude una caja para seguir camino descolg&aacute;ndome de nuevo. Salt&eacute; hasta un pasillo central y de nuevo por el otro conducto hasta el extremo opuesto de la gran sala. Un nuevo salto me llev&oacute; a una zona donde un trabajador con malas pulgas intent&oacute; en vano detenerme. No era de extra&ntilde;ar ya que custodiaba una estatuilla dorada, aunque tuve que afinar mucho mi salto para no caer encima de unos cristales bastante peligrosos. Segu&iacute; por el pasillo hasta unos ventanales a trav&eacute;s de los cuales contempl&eacute; un nuevo drag&oacute;n, este de jade. Unos pececillos no fueron obst&aacute;culo para obtenerlo. Hacia el fondo de la extravagante sala de inclinado suelo consegu&iacute; izarme hasta la parte alta de la misma, no sin antes sortear de h&aacute;bil salto las columnas que me imped&iacute;an el paso.</P>





<center><table>

<td><img src="jpg/tr2lq03.jpg"><br>

<b><font size=1 face=arial><center>Tuve que sortear estas plataformas <br>temporizadas para continuar</center></font></b></td>

</table></center>



<P ALIGN="JUSTIFY">En la parte superior descubr&iacute; una abertura, por la que descend&iacute; hasta una sala donde liquid&eacute; a otro individuo. Ascend&iacute; por la rampa y mat&eacute; a otro m&aacute;s que estaba al otro lado del balc&oacute;n y salt&eacute; hasta all&iacute;. La sala con columnas era amplia y me esperaban algunos tipos armados m&aacute;s. Al fondo, en una zona de suelo m&aacute;s bajo, apart&eacute; una caja para descubrir una llave bajo ella. Volv&iacute; sobre mis pasos hasta unas escaleras alfombradas, pero una caja me imped&iacute;a el paso. Salt&eacute; de nuevo hasta la zona superior, a trav&eacute;s del balc&oacute;n, y descubr&iacute; que ten&iacute;a acceso a esa caja desde el otro lado, por lo que la apart&eacute; y volv&iacute; a las escaleras, ahora con el paso libre. Pronto me encontr&eacute; con un nuevo aspirante a mandarme al otro barrio, del que tuve que encargarme antes de abrir la cerradura con mi nueva llave. De esta forma entr&eacute; en lo que parec&iacute;a un teatro dentro del propio barco, con dos escalinatas laterales y, por supuesto, algunos tipos con armas de fuego dispuestos a usarlas contra m&iacute;. Despu&eacute;s de despacharlos a todos, entr&eacute; al palco lateral y accion&eacute; un interruptor, lo que provoc&oacute; que se abriera el escenario dando paso a un tipo que fue blanco f&aacute;cil. Tras el escenario me ic&eacute; gracias a una caja y llegu&eacute; hasta una oscura zona que ocultaba un pulsador guardado por una trampa de cristales. El pulsador inund&oacute; una zona donde ya hab&iacute;a estado y a la que volv&iacute; enseguida, liquidando a un hombre fuertemente armado que vino a imped&iacute;rmelo. Cruc&eacute; a nado hasta la salida y segu&iacute; mi aventura.</P>



<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





