<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">

<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 1. La Gran Muralla.</h3>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Mi misi&oacute;n comenzaba, como es l&oacute;gico, en China, al pie de la Gran Muralla. Seg&uacute;n la leyenda, all&iacute; fue donde los monjes la guardaron para que nunca fuera descubierta de nuevo ni usado su poder m&aacute;gico para alg&uacute;n fin perverso. La &uacute;ltima parte del viaje fue en helic&oacute;ptero y, dado que no era posible aterrizar en aquella escarpada orograf&iacute;a tuve que descolgarme mediante una cuerda hasta tierra firme. Entr&eacute; por una cavidad en las rocas y, casi sin querer, me fui deslizando cuesta abajo por la tremenda pendiente hasta un valle al pie de la Gran Muralla. Para llegar hasta ella ten&iacute;a ante m&iacute; unos peligrosos riscos que deber&iacute;a salvar. La escalada promet&iacute;a ser bastante dif&iacute;cil por lo que el tigre al que me tuve que enfrentar nada m&aacute;s empezar no hac&iacute;a sino complicarme las cosas. Tuve suerte de poder escalar una roca, junto a un peque&ntilde;o lago, justo a tiempo para escapar de sus garras y acabar con &eacute;l sin peligro con el fuego de mis queridas pistolas, de las que nunca me separo en este tipo de aventuras.</P>

<P ALIGN="JUSTIFY">Desde esta roca segu&iacute; trepando por una cornisa y, despu&eacute;s de saltar a una peque&ntilde;a plataforma natural, otro tigre apareci&oacute; al fondo del valle. Desde mi posici&oacute;n privilegiada fue sencillo eliminarlo. Entonces, por pura casualidad, gir&eacute; mi cabeza hacia la derecha y contempl&eacute;, en otra plataforma adyacente, lo que parec&iacute;a una estatuilla de color gris. Mi curiosidad se impuso y tras un nuevo salto me hice con ella. Era una hermosa escultura de piedra con forma de drag&oacute;n, de gran valor como objeto de coleccionista. A lo largo de mi aventura encontrar&iacute;a muchas m&aacute;s como esta esculpidas en diversos materiales como oro y jade que, sin embargo, nada ten&iacute;an que ver con el motivo principal de mi viaje.</P>



<center><table>

<td><img src="jpg/tr2gw01.jpg"><br>

<b><font size=1><center>Orificio en la pared de roca, por el<br> que me introduje</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Desde el punto en que recog&iacute; la estatuilla, al girarme, pude observar un orificio en la pared de roca por el que, tras un par de saltos y algo m&aacute;s de escalada, me introduje en lo que parec&iacute;a un puesto de vigilancia de la muralla. Me lanc&eacute; al agua atravesando una reja, la cual parec&iacute;a ser la &uacute;nica salida, llegando a una habitaci&oacute;n con una escalera. Al final de esta escalera —tras otro peque&ntilde;o salto—, una palanca me permiti&oacute; abrir la puerta que me bloqueaba el paso hacia la parte superior de la Gran Muralla.</P>

<P ALIGN="JUSTIFY">Nada m&aacute;s atravesar la puerta, una bandada de enormes cuervos me atac&oacute; con violencia, oblig&aacute;ndome a hacer uso de mis armas de nuevo. Siempre me he preguntado por qu&eacute; causo tan mal efecto a todo tipo de animales, incluso a los aparentemente m&aacute;s inofensivos, pero es algo que he de asumir como inherente a mi persona. ¿O ser&aacute; el desodorante? Tras acabar con ellos me dirig&iacute; a la siguiente torre de vigilancia de la muralla pero, para mi desgracia, se hallaba bien cerrada con llave. Tuve que volver sobre mis pasos y, mientras exploraba una rotura en el lateral de la muralla, resbal&eacute;, cayendo hacia lo que tem&iacute; ser&iacute;a una muerte segura. Afortunadamente todo qued&oacute; en un gran susto y una buena zambullida en el estrecho y profundo lago que me esperaba m&aacute;s abajo y en el cual —en una peque&ntilde;a cavidad lateral— encontr&eacute; una llave que result&oacute; ser la que andaba buscando. No acab&oacute; ah&iacute; la cosa ya que, cuando sal&iacute;a del agua, otro tigre se abalanz&oacute; sobre m&iacute;. Con mi natural habilidad, lo despach&eacute; sin sufrir m&aacute;s herida que alg&uacute;n leve ara&ntilde;azo.</P>

<P ALIGN="JUSTIFY">Ayud&aacute;ndome de un peque&ntilde;o promontorio volv&iacute; a la parte superior de la muralla y abr&iacute; la puerta con la llave. Al entrar me recibi&oacute; una comitiva de… ¡argh! Odio las ara&ntilde;as, solo de recordarlo se me ponen los pelos de punta. Escalando hasta la parte superior —donde hab&iacute;a otra ara&ntilde;a— obtuve una nueva llave que me abri&oacute; la siguiente puerta. Me esperaban m&aacute;s de esos repulsivos bichejos y los restos de un pobre desgraciado que no tuvo suerte en su empresa, aunque algunas de sus pertenencias me resultaron muy &uacute;tiles. Tengo adquirida la costumbre de robar las pertenencias de los muertos, se que no es muy &eacute;tico pero, a veces, resulta sumamente &uacute;til. Tras quitar de en medio un gran bloque de piedra pude continuar mi camino hasta una piscina de aspecto inofensivo que, observada con m&aacute;s atenci&oacute;n, me revel&oacute; unas hendiduras de donde sal&iacute;an unos peligrosos discos cortantes. Opt&eacute; por agarrarme a la cornisa de la pared izquierda y, de esta forma, llegar al otro lado sin peligro.</P>

<P ALIGN="JUSTIFY">El corredor que se extend&iacute;a ante m&iacute; ten&iacute;a un suelo de apariencia poco estable as&iacute; que lo cruc&eacute; a la carrera —lo cual fue muy buena idea, ya que bajo el suelo, que se desplomaba a mi paso, hab&iacute;a unos pinchos capaces de acabar con cualquiera—. Finalizado el pasillo sal&iacute; a una cueva y me pareci&oacute; o&iacute;r un temblor extra&ntilde;o. Cuando vi las enormes rocas rodantes que ven&iacute;an a mi encuentro sal&iacute; a toda velocidad hacia la derecha, huyendo de ellas. A&uacute;n despu&eacute;s tuve que saltar para evitar unos pinchos, aterrizando en una sala con un par de cad&aacute;veres y dos paredes m&oacute;viles con m&aacute;s pinchos que no invitaban precisamente a quedarse un rato curioseando, aunque tuve el tiempo justo para recoger la munici&oacute;n de uno de los difuntos antes de izarme hacia la salvaci&oacute;n. De correr iba la cosa, ya que el siguiente pasillo tuve que cruzarlo a buen ritmo y saltando sobre unas cuchillas de aspecto nada tranquilizador. A&uacute;n m&aacute;s paredes m&oacute;viles me aguardaban y, casi sin tiempo para recoger un drag&oacute;n de jade segu&iacute; corriendo por el pasillo hasta caer en una sala con una trampilla por la que pude eludir finalmente el peligro. Necesit&eacute; unos minutos para recuperarme de la carrera antes de continuar mi periplo.</P>

<P ALIGN="JUSTIFY">Me encontraba en una caverna donde, tras evitar un par de ruedas cortantes y liquidar un mont&oacute;n de ara&ntilde;as observ&eacute; un cable que cruzaba el enorme abismo que me imped&iacute;a continuar. Un examen m&aacute;s exhaustivo de la pared de roca me llev&oacute; a identificar una diminuta plataforma hasta la que pude descolgarme hasta alcanzar una fisura que daba acceso a una cueva con una largu&iacute;sima y oscura escalera que descend&iacute;a hasta el fondo, donde me esperaban grandes problemas —en forma de tiranosaurios rex— y otra estatuilla drag&oacute;n, esta vez de oro macizo. El mordisco de una de aquellas enormes fauces repletas de dientes hubiera significado mi muerte inmediata pero mi peque&ntilde;o tama&ntilde;o, en comparaci&oacute;n con aquellas bestias, me daba una ventaja en movilidad que aprovech&eacute; convenientemente. Adem&aacute;s no era la primera vez que me enfrentaba con bestias semejantes, ya que en mi aventura en pos del Scion tambi&eacute;n tuve oportunidad de hab&eacute;rmelas con alguno de su especie, saliendo bien librada del encuentro. De vuelta a la zona superior me agarr&eacute; fuertemente al cable y me deslic&eacute; hasta el otro extremo del abismo, donde un par de tigres amenizaron mi aterrizaje.</P>



<center><table>

<td><img src="jpg/tr2gw04.jpg"><br>

<b><font size=1><center>Ante las puertas que guardaban <br>la daga de Xian</center></font></b></td>

</table></center>





<P ALIGN="JUSTIFY">¡Por fin! Hab&iacute;a llegado hasta las puertas que guardaban en su interior la daga de Xian. Pero cuando me acerqu&eacute; a ellas una figura vestida de negro se abalanz&oacute; sobre m&iacute;, dispar&aacute;ndome. Tuve suerte al ser capaz de controlar la situaci&oacute;n, aunque no fue mucha la informaci&oacute;n que pude sacar de aquel hombre antes de que se suicidara tomando un potente veneno. Lo &uacute;nico que averig&uuml;&eacute; fue que las puertas s&oacute;lo se abrir&iacute;an en el momento adecuado y para la persona adecuada y que deb&iacute;a ofrecer mi lealtad a un tal Marco Bartoli si quer&iacute;a merecer el poder de la daga. Mediante un ordenador port&aacute;til que este hombre dej&oacute; abandonado descubr&iacute; que los seguidores de ese Bartoli se escond&iacute;an en Venecia por lo que, si quer&iacute;a seguir adelante con mi misi&oacute;n, tendr&iacute;a que desplazarme hasta el pa&iacute;s transalpino.</P></FONT></BODY>

<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>



