<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 13. Las Catacumbas del Talión</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Me encontraba de nuevo atrapada sin posibilidad de vuelta atr&aacute;s en un lugar de t&eacute;trico aspecto. Eludiendo unos car&aacute;mbanos descend&iacute; los pelda&ntilde;os que me llevaban hasta una escala en la pared. Baj&eacute; por ella y una especie de furioso hombre de las nieves me sali&oacute; al paso; no tuve m&aacute;s remedio que eliminarlo. Al lado de una reja de madera hall&eacute; una palanca que, al accionarla, abri&oacute; un puerta cercana. Ascend&iacute; de nuevo y recog&iacute; un drag&oacute;n de piedra escondido tras el muro de la izquierda. La plataforma que ten&iacute;a ante m&iacute; era de dif&iacute;cil acceso pero desliz&aacute;ndome por la rampa y saltando de espaldas en el &uacute;ltimo momento logr&eacute; alcanzarla. Un felino malintencionado me esperaba unos escalones m&aacute;s abajo. Segu&iacute; el descenso hasta una gran estancia con una piscina en el centro y cuando llegaba abajo unos mercenarios me sorprendieron por la espalda… o, m&aacute;s bien, lo intentaron los pobrecillos. Mi exploraci&oacute;n de la sala s&oacute;lo se vio interrumpida por otros dos felinos que deb&iacute;an ser familiares del anterior por lo agresivos que se pusieron.</P>

<P ALIGN="JUSTIFY">Desde las escaleras salt&eacute; a una cornisa al final de la cual hab&iacute;a una rampa con bolas de nieve que amenazaban con aplastarme. Pude saltar lateralmente y caer en la piscina, que fue mi salvaci&oacute;n. Volv&iacute; de nuevo a la cornisa ya sin las molestas moles de nieve y desde all&iacute; ascend&iacute; hasta una jaula en cuyo interior reposaba una especie de m&aacute;scara o t&oacute;tem ritual. No pod&iacute;a hacer nada —de momento— para recuperarla as&iacute; que me encamin&eacute; al lugar del que hab&iacute;an salido los leopardos y me ic&eacute; hasta otra cornisa natural que desembocaba en un suelo bastante quebradizo y una escala en la pared. Me agarr&eacute; de un salto a esta &uacute;ltima y ascend&iacute; por ella hasta el techo. No hab&iacute;a salida visible pero yo sab&iacute;a que detr&aacute;s de mi, en el lugar donde previamente reposaban las bolas de nieve, hab&iacute;a una plataforma as&iacute; que salt&eacute; a ciegas hacia atr&aacute;s, aterrizando sana y salva. La palanca que encontr&eacute; abri&oacute; la jaula, permiti&eacute;ndome tomar la m&aacute;scara, y tambi&eacute;n dren&oacute; la piscina, al tiempo que se abr&iacute;a una compuerta en el fondo de &eacute;sta. Esta compuerta daba a un oscuro pasadizo con una traidora trampa de pinchos en el medio que apenas se percib&iacute;a en la penumbra reinante. Usando la m&aacute;scara a modo de llave abr&iacute; una reja al final del pasadizo y un mont&oacute;n de bolas de nieve se abalanzaron sobre m&iacute;. Las esquiv&eacute; por uno de los laterales de la rampa y me encaram&eacute; a un bloque de hielo justo a tiempo de evitar los fieros ataques de toda una familia de leopardos. Cuando acab&eacute; con ellos explor&eacute; la zona y descubr&iacute;, al fondo y a la derecha, una puerta que necesitar&iacute;a de otra m&aacute;scara igual a la anterior. No pod&iacute;a seguir por ah&iacute; as&iacute; que me dirig&iacute; hacia una abertura en la pared de roca en el lado izquierdo. Me ic&eacute; hasta a

ll&iacute; y acced&iacute; a otra estancia con el suelo helado donde varias parejas m&aacute;s de leopardos me hicieron sudar para esquivarlos. Continu&eacute; hacia la cueva tras la arcada —por la que hab&iacute;a aparecido la &uacute;ltima pareja de felinos— y, tras unas rocas, descubr&iacute; una oscura cavidad subacu&aacute;tica donde hall&eacute; la m&aacute;scara que necesitaba.</P>

<center><table>

<td><img src="jpg/tr2ct01.jpg"><br>

<b><font size=1 face=arial><center>Con la m&aacute;scara abr&iacute; la reja tras<br> la cual me esperaban un mont&oacute;n <br>de bolas de nieve</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Al salir, varios hombres me estaban aguardando con sus armas listas —me refiero a las de fuego, naturalmente— pero no supusieron mayor problema del que ya ven&iacute;a siendo habitual. As&iacute; pues volv&iacute; hasta la puerta y, con la ayuda de la m&aacute;scara, la abr&iacute;. En su interior todo era oscuridad y unos terribles rugidos no hac&iacute;an presagiar nada bueno. Haciendo uso de una bengala, explor&eacute; la habitaci&oacute;n hasta encontrar una palanca. Al accionarla se abrieron las jaulas que reten&iacute;an en su interior a cuatro feroces hombres de las nieves que me dieron m&aacute;s de un dolor de cabeza. Tras acabar con ellos descubr&iacute; otra palanca —tras las rejas inicialmente cerradas— que abr&iacute;a un nuevo acceso en la zona de la abertura en la pared. Pero al accionar dicha palanca yo misma quedaba atrapada, as&iacute; que volv&iacute; a abrirla y mov&iacute; un bloque de piedra que hab&iacute;a por all&iacute; cerca hasta bloquear una de las rejas. De esta forma pude accionar la palanca por &uacute;ltima vez y salir de all&iacute;. De camino al nuevo acceso tuve que quitar de en medio a un buen n&uacute;mero de mercenarios que salieron no s&eacute; muy bien de d&oacute;nde. La puerta reci&eacute;n abierta daba a una pasarela con una trampa de bolas de nieve. Las esquiv&eacute; saltando hacia la izquierda sobre una cornisa de roca y continu&eacute; adelante. A mi derecha colgaba una escala hasta la que llegu&eacute; de un salto —por los pelos, eso s&iacute;— y ascend&iacute; hasta alcanzar un orificio en el suelo situado justo sobre un lago. Me zambull&iacute; y, tras liquidar a unos molestos &quot;pescaditos&quot;, desde la orilla continu&eacute; por el agua hasta la siguiente gruta. Camin&eacute; por la derecha con cuidado ya que algunos car&aacute;mbanos eran muy peligrosos.</P>

<center><table>

<td><img src="jpg/tr2ct02.jpg"><br>

<b><font size=1 face=arial><center>A mi derecha colgaba una escala hasta <br>la que ten&iacute;a que llegar</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Al final del camino, justo a mi espalda, hab&iacute;a una escala. Ascend&iacute; por ella hasta toparme con el techo de roca y observ&eacute; a mi alrededor hasta darme cuenta de que con unos saltos bien calculados en las rocas de los lados pod&iacute;a aterrizar sana y salva en la peque&ntilde;a cueva que intu&iacute;a, m&aacute;s que verla, a mi espalda. As&iacute; lo hice y la recompensa fue una estatuilla de jade. Volv&iacute; abajo y me zambull&iacute; de nuevo hasta encontrar una roca en la que pude izarme. De all&iacute; salt&eacute; a una escala cercana y, de &eacute;sta, de espaldas hasta una pasarela de roca donde hab&iacute;a una palanca que, al accionarla, abri&oacute; una puerta de doble hoja cercana. En su interior me esperaba otro fiero leopardo y una palanca que abri&oacute; las puertas situadas en la sala principal a la que acced&iacute; mediante la primera m&aacute;scara. El camino m&aacute;s r&aacute;pido para regresar all&iacute; era saltar desde el soporte derecho del enorme pebetero —que colgaba sobre la sala con el suelo helado— hasta una peque&ntilde;a cornisa situada enfrente y de &eacute;sta al suelo.</P>

<P ALIGN="JUSTIFY">Me acerqu&eacute; a las puertas y cruc&eacute; el abismo de un salto. Los rugidos de varios felinos me anticiparon que deb&iacute;a tener cautela antes de descolgarme hasta el foso. Mat&eacute; a todos los que pude desde el borde y con el resto tuve que enfrentarme abajo; el premio fue un peque&ntilde;o bot&iacute;n. Para salir accion&eacute; una palanca y volv&iacute; a la zona superior donde activ&eacute; varias trampas de bolas de nieve. Una de ellas me abri&oacute; paso hacia la derecha a una estancia que hab&iacute;a permanecido oculta a mi escrutinio. All&iacute;, al caminar sobre una zona del suelo distinta al resto se abri&oacute; una puerta temporizada por la que segu&iacute; a continuaci&oacute;n. El suelo estaba lleno de pinchos por lo que tuve buen cuidado de caminar despacio. Al fondo hab&iacute;a otra puerta que no parec&iacute;a haber forma de abrir y a mi derecha otra puerta que se abr&iacute;a al acercarme y daba a la sala anterior. Record&eacute; entonces que en dicha sala, ahora frente a m&iacute;, hab&iacute;a visto otra zona de diferente color, igual a la que abr&iacute;a la primera de las puertas y eso me dio la clave. Salt&eacute; hasta dicha zona a toda velocidad y regres&eacute; de igual forma antes de que las puertas se cerrasen saltando hasta una escalera tras la segunda de las puertas. Baj&eacute; por ella y continu&eacute; por el pasadizo hasta…</P>

</FONT>











<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas)</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





