<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 16. Las Islas Flotantes</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">¡Vaya sitio m&aacute;s raro! Parec&iacute;a sacado de una pel&iacute;cula surrealista o de ciencia-ficci&oacute;n. Todos esos diminutos islotes flotando en medio de la nada, y esos tonos verdosos tan irreales. Por un momento tem&iacute; haber ca&iacute;do en alg&uacute;n tipo de trance o incluso haber muerto y estar en una versi&oacute;n macabra del cielo o en el mism&iacute;simo infierno. Pronto una enorme figura voladora, una especie de guerrero medieval de terrible espada, vino a sacarme del ensimismamiento en que me hallaba. Como movida por un resorte, fruto del entrenamiento, saqu&eacute; mis armas y lo llen&eacute; de plomo, viendo como se deshac&iacute;a en mil pedazos de cristal verdoso. Cuando recobr&eacute; parcialmente la compostura me dediqu&eacute; a explorar los alrededores y descubr&iacute; a mi izquierda y abajo una estatua de jade que representaba a otro guerrero similar al anterior. Segu&iacute; caminando y, al poco, o&iacute; un ruido a mi espalda. Me di la vuelta para contemplar como la estatua hab&iacute;a cobrado vida y se acercaba peligrosamente. Acab&eacute; con &eacute;l de la misma forma que hab&iacute;a hecho con el otro y definitivamente fui consciente de que estaba viva en alg&uacute;n tipo de realidad paralela a la que hab&iacute;a accedido desde el templo de Xian. Pero mi misi&oacute;n no hab&iacute;a terminado. Ten&iacute;a que recuperar la daga…</P>

<P ALIGN="JUSTIFY">Volv&iacute; a ascender hasta la parte superior y, con un salto hacia mi izquierda, aprovech&eacute; una pendiente verdosa para llegar hasta una estructura dorada en forma de jaula que hab&iacute;a frente a m&iacute;. Dentro encontr&eacute; una palanca, la cual accion&eacute;. El hecho de encontrarme con un elemento familiar dentro de esa realidad tan extra&ntilde;a contribuy&oacute; a tranquilizarme. Segu&iacute; caminando por el corredor, al final del cual se hab&iacute;a abierto una reja, y me deslic&eacute; por la pendiente. De un salto acab&eacute; en otra isla cercana donde, nada m&aacute;s aterrizar, otra estatua cobr&oacute; vida. Esta contaba con dos lanzas como armas y se acerc&oacute; a m&iacute; con gran velocidad. Apenas pude reaccionar para desenfundar mi escopeta y darle su merecido. Otras dos estatuas segu&iacute;an en su letargo, esperando qui&eacute;n sabe que acontecimiento para cobrar vida. En seguida lo supe ya que, en mi exploraci&oacute;n de la isla, pronto activ&eacute; a otra. En el centro del tejadillo hab&iacute;a una compuerta abierta, seguramente accionada por la palanca anterior. Sub&iacute; al interior del tejadillo y obtuve un extra&ntilde;o objeto para mi colecci&oacute;n, una especie de placa. Esto pareci&oacute; activar a la tercera estatua por lo que tuve que bajar a enfrentarme con ella. Cerca del lugar por el que hab&iacute;a accedido a la isla, pr&oacute;ximo a un &aacute;rbol, encontr&eacute; un acceso hasta la parte superior del tejado, donde hall&eacute; una estatua drag&oacute;n de jade. Mi problema era que no sab&iacute;a como salir de la isla, no parec&iacute;a haber acceso alguno hasta que, descolg&aacute;ndome por el lado derecho, observ&eacute; una estructura en la parte inferior de la isla. Me descolgu&eacute; hasta all&iacute; y accionando una palanca consegu&iacute; bajar una reja por la que, de un salto, escape hacia… el vac&iacute;o.</P>

<center><table>

<td><img src="jpg/tr2fi01.jpg"><br>

<b><font size=1 face=arial><center>Las puertas que abr&iacute; mediante las dos placas</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Saltando por una serie de peque&ntilde;os islotes verdosos acab&eacute; en uno con forma de escalera desde cuya zona superior ten&iacute;a acceso a la especie de jaula dorada donde ya hab&iacute;a estado. Mirando hacia el otro lado observ&eacute; unas enormes puertas, guardadas por dos estatuas, una de las cuales ya se acercaba a m&iacute;. Tras acabar con ella me dirig&iacute; de nuevo hacia la jaula, momento en el que la otra cobr&oacute; igualmente vida. Acab&eacute; en un peque&ntilde;o saliente de roca que llegaba hasta dicha jaula. Desde aqu&iacute; salt&eacute; a mi derecha, resbalando por otra pendiente verdosa y cayendo hasta una peque&ntilde;a plataforma. Desde aqu&iacute; acced&iacute; hasta un islote sobre el que reposaba otra de esas placas, que tambi&eacute;n cog&iacute;. Por medio de otro min&uacute;sculo islote, llegu&eacute; de nuevo a la isla de las tres estatuas y recorr&iacute; todo el camino de nuevo hasta la zona superior de las escaleras. Realic&eacute; un delicado salto y me agarr&eacute; al borde de un saliente frente a aquellas enormes puertas. Las dos placas que llevaba conmigo me abrieron el paso hasta el interior. Tras liquidar a otro de esos guerreros voladores descubr&iacute; en una esquina oscura, tras un &aacute;rbol a la derecha del puente, un pasadizo que me llev&oacute; hasta una estatua drag&oacute;n de piedra. Con otro delicado salto, volv&iacute; por donde hab&iacute;a venido. A la izquierda del puente hab&iacute;a una bola verdosa y tras ella varias rampas. Salt&eacute; por encima de la bola y me deslic&eacute; por la rampa. La bola ven&iacute;a tras de m&iacute;, as&iacute; que salt&eacute; a la plataforma enfrente de m&iacute;, por la cual ven&iacute;a otra bola. Inmediatamente salt&eacute; de nuevo hacia atr&aacute;s y de esta forma sal&iacute; librada sin un rasgu&ntilde;o.</P>

<P ALIGN="JUSTIFY">Ascend&iacute; hasta el tejadillo a mi izquierda y me col&eacute; por un par de huecos hasta el piso inferior, donde despach&eacute; a otra de esas estatuas voladoras y recog&iacute; alg&uacute;n objeto sin importancia. Volv&iacute; a ascender hasta el tejadillo y de &eacute;ste, por la parte derecha, hasta las rampas verdosas. Me situ&eacute; en la rampa m&aacute;s alejada y, de un salto, acab&eacute; en una peque&ntilde;a plataforma con una de esas divertidas cuerdas para deslizarse. Llegu&eacute; de esta forma hasta el puente inferior, en uno de cuyos extremos otras tres estatuas guardaban una palanca. Accion&eacute; la palanca, liquidando a sus vigilantes, lo que provoc&oacute; la apertura de una compuerta en la pared de roca al final del descenso de cuerda. Mediante otra de estas cuerdas me deslic&eacute; hasta una pared por la que escal&eacute;, regresando finalmente al piso inferior de la isla. Ascend&iacute; de nuevo hasta la plataforma desde la que ahora pod&iacute;a prolongar mi descenso hasta m&aacute;s all&aacute; del puente inferior. Me encontraba en una habitaci&oacute;n dividida en dos por la mitad por un canal de lava. Al lado izquierdo mov&iacute; un bloque de piedra hasta el pie de una abertura en el techo. Liquid&eacute; a otra estatua guerrera y ascend&iacute;. Arriba localic&eacute; una palanca que, al accionarla, cre&oacute; una peque&ntilde;a plataforma en medio del canal de que surcaba toda la habitaci&oacute;n. Descend&iacute; all&aacute; abajo, con cuidado de evitar los discos cortantes que sal&iacute;an de la pared y accion&eacute; otra palanca, la cual abri&oacute; una nueva trampilla en la habitaci&oacute;n.</P>

<center><table>

<td><img src="jpg/tr2fi02.jpg"><br>

<b><font size=1 face=arial><center>Mediante un bloque de piedra acced&iacute; <br>hasta la abertura del techo</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Sub&iacute; de nuevo hasta la ubicaci&oacute;n de la primera palanca y escal&eacute; el muro bajo. De un gran salto me col&eacute; por la reci&eacute;n abierta trampilla, aunque tuve que hacer un escorzo en el aire a mitad de vuelo para lograrlo. Ca&iacute; en una peque&ntilde;a piscina y accion&eacute; una nueva palanca. Sal&iacute; de la piscina por un agujero lateral hasta un pasillo con espadas m&oacute;viles. A mi espalda encontr&eacute; una palanca que las detuvo, haciendo posible la salida. Estaba en el final del descenso de cuerda. Salt&eacute; de nuevo al interior de la sala y, de nuevo, hacia la puerta reci&eacute;n abierta, situada encima del pasillo del que acababa de salir. Encontr&eacute; una reja cerrada y una oscura habitaci&oacute;n. Salt&eacute; al vac&iacute;o, agarr&aacute;ndome de una fisura en la pared. Me desplac&eacute; hacia la derecha, donde pude erguirme y accionar una palanca que abri&oacute; la reja. Salt&eacute; hacia la zona inferior y salv&eacute; con un escorzo las afiladas p&uacute;as del suelo. Volv&iacute; a la zona superior por el mismo camino de la vez anterior y penetr&eacute; en la sala reci&eacute;n abierta. Las puertas estaban cerradas as&iacute; que me col&eacute; por el agujero en medio de la sala, con cuidado de no hacerme da&ntilde;o. Me encontraba ahora en una jaula que, al accionar la palanca en su interior, se abri&oacute;, dando paso a cuatro guerreros ninjas, vestidos de negro y muy malas pulgas pero con poca capacidad de salto por lo que f&aacute;cilmente hall&eacute; refugio para sus ataques. Tras acabar con ellos tuve que enfrentarme a otras cuatro estatuas con el mismo problema f&iacute;sico que los ninjas, por lo que tampoco representaron problema alguno. Accion&eacute; dos palancas m&aacute;s en la habitaci&oacute;n y continu&eacute; por las escaleras, reci&eacute;n abiertas, al fondo. Al abrir la puerta del final de las escaleras otras dos estatuas me recibieron con ferocidad por lo que tuve que actuar r&aacute;pido y contundentemente. T

ras acabar con ellas me dirig&iacute; a la otra puerta, abierta por una de las palancas anteriores, y ascend&iacute; por la pared. Tras girarme dos veces en el aire, de una pared a otra, ascend&iacute; hasta una zona plana a mi izquierda donde liquid&eacute; a otro ninja. Apartando el bloque situado a la izquierda salt&eacute; hasta las rocas laterales y llegu&eacute; hasta un pasadizo situado bajo ellas. Continuando por dicho pasadizo obtuve una estatuilla drag&oacute;n dorada y, al regreso, de un par de saltos encadenados ascend&iacute; hasta la plataforma situada encima del pasadizo y, de &eacute;sta, al interior de…</P>

</FONT><FONT FACE="Arial"><h4>La Guarida del Drag&oacute;n</h4>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">En el interior me recibi&oacute; otra de esas estatuas guerrero y, tras pulsar unos interruptores, las otras tres tambi&eacute;n hicieron lo propio. Las convert&iacute; a todas en fragmentos de roca. En la siguiente habitaci&oacute;n me esperaban, ocultos en las sombras, varios ninjas a los que tambi&eacute;n tuve que dar su merecido, hasta que uno de ellos solt&oacute; una placa m&iacute;stica con la que pude abrir la puerta que proteg&iacute;a a Bartoli. Lo encontr&eacute; en un pedestal, aparentemente inconsciente y con la daga de Xian clavada en su pecho. Cuando intent&eacute; acercarme el poder de la daga entr&oacute; en acci&oacute;n, convirti&eacute;ndolo en un enorme drag&oacute;n. Me persigui&oacute; por toda la estancia y nunca hab&iacute;a sido una lucha tan desigual. Quiero decir que el pobre drag&oacute;n no ten&iacute;a la m&aacute;s m&iacute;nima opci&oacute;n de vencerme, ¡claro! No, ahora en serio, fue una de las confrontaciones m&aacute;s peligrosas en que me haya visto envuelta en toda mi vida. Tuve que emplear toda mi rapidez y habilidad para sobrevivir y aunque intentaba chamuscarme con su f&eacute;tido aliento de fuego yo me escond&iacute;a tras las columnas o me sumerg&iacute;a en la piscina bajo la sala por alguna de las aberturas.</P>

<center><table>

<td><img src="jpg/tr2dl01.jpg"><br>

<b><font size=1 face=arial><center>Finalmente acab&eacute; con el drag&oacute;n<br> y le rob&eacute; la daga de Xian</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Finalmente acab&eacute; con &eacute;l o, al menos, lo tumb&eacute; de forma temporal. Aprovech&eacute; la ocasi&oacute;n para sacar de su pecho la daga de Xian y derrotarlo definitivamente. Entonces su guarida empez&oacute; a desplomarse y tuve el tiempo justo de escapar por la puerta que se abri&oacute; hacia el exterior. No se cuanto tiempo estuve inconsciente pero, al despertar, la Gran Muralla estaba destrozada a mi alrededor. Me levant&eacute; y me dirig&iacute; a mi casa a tomar un merecido descanso…</P>

</FONT><FONT FACE="Arial"><h4>Hogar Dulce Hogar</h4>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">¡A veces! Como dice el t&iacute;tulo de la pel&iacute;cula. Cuando me dispon&iacute;a a acostarme, ataviada como estaba con mi camis&oacute;n m&aacute;s sexy, mientras contemplaba la daga, o&iacute; un ruido procedente del exterior. Al parecer ten&iacute;a una visita inesperada y seguramente no deseada. Abr&iacute; rauda mi armario de municiones, al lado de mi cama, y sal&iacute; al encuentro de los visitantes. Eran m&aacute;s secuaces de la secta del drag&oacute;n. Por toda la casa se escondieron en esquinas oscuras para emboscarme, mas no lo lograron. Tuve que salir al jard&iacute;n a liquidar a los que all&iacute; me esperaban. No qued&oacute; ni uno, ni su jefe se salv&oacute; de los disparos de mi escopeta. Cuando acab&eacute; con todos por fin pude tomar esa ducha de agua caliente que tan merecida ten&iacute;a. Aunque para eso necesitaba un m&iacute;nimo de intimidad, lo comprend&eacute;is ¿verdad?</P>

<center><table>

<td><img src="jpg/tr2fin.jpg"><br>

<b><font size=1 face=arial><center></center></font></b></td>

</table></center>







<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





