<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 11. Las Colinas Tibetanas</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Debi&oacute; ser por el estruendo del avi&oacute;n al estrellarse pero, inmediatamente, se abalanz&oacute; sobre m&iacute; un &aacute;guila con intenciones asesinas y no tuve m&aacute;s remedio que matarla. Fue una suerte encontrar en el avi&oacute;n la cazadora de piel del piloto, porque si no estar&iacute;a pasando mucho fr&iacute;o. Por el &uacute;nico sitio posible sal&iacute; del lugar donde me encontraba. Me deslic&eacute; por la pendiente nevada y al caer al suelo unas enormes bolas de hielo se abalanzaron sobre m&iacute;. Las salt&eacute; como pude y me ic&eacute; hasta el lugar del que vinieron, para descubrir ante m&iacute; un enorme precipicio por el que ten&iacute;a que saltar, atravesando una cortina de hielo que se hizo a&ntilde;icos a mi paso. Al otro lado hab&iacute;a otra pendiente y otro enorme abismo que apenas tuve tiempo de evitar saltando y agarr&aacute;ndome a la pared frente a m&iacute;. Por ella pude finalmente llegar hasta la zona de la derecha, donde puse pie en tierra de nuevo. Continu&eacute; mi camino hasta la siguiente salida a cielo abierto, donde se repiti&oacute; el ataque de dos &aacute;guilas producto del cual estuve a punto de caer una altura terrible. Ante m&iacute;, al otro lado del abismo, hab&iacute;a una moto de nieve y una choza a las que no pod&iacute;a llegar. Estuve estudiando un rato por donde podr&iacute;a seguir hasta que decid&iacute; saltar al agua. Por la plataforma m&aacute;s baja sal&iacute; a la superficie y escal&eacute; por la pared de hielo hasta encontrar una abertura en la pared de roca. Con un poco de habilidad consegu&iacute; aterrizar en una peque&ntilde;a plataforma de roca ante dicha abertura y seguir mi camino. Entr&eacute; en una peque&ntilde;a cueva y cuando saltaba un peque&ntilde;o charco, unos car&aacute;mbanos de hielo casi me parten en dos. Suerte que pude escabullirme otra vez en el agua y los evit&eacute;. Continu&eacute; mi camino hacia el exterior de nuevo y por una cornisa natural que 

cruzaba hasta el otro lado del tremendo muro de roca. Segu&iacute; hacia arriba y me encontr&eacute; con una reja que no pod&iacute;a traspasar, al otro lado de la cual me esperaban un drag&oacute;n de piedra y la moto de nieve.</P>

<center><table>

<td><img src="jpg/tr2tf01.jpg"><br>

<b><font size=1 face=arial><center>Al otro lado me esperaban un drag&oacute;n de <br>piedra y la moto de nieve</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Baj&eacute; hacia la otra ramificaci&oacute;n del t&uacute;nel y, tras deslizarme por una pendiente nevada, llegu&eacute; a un peque&ntilde;o lago subterr&aacute;neo con peligrosos car&aacute;mbanos colgando del techo. Los evit&eacute; como pude y llegu&eacute; hasta el lado contrario del abismo donde por otra cornisa lateral y tras un par de saltos acab&eacute; en una plataforma donde hab&iacute;a un interesante malet&iacute;n que adquir&iacute; para mi colecci&oacute;n. Desde aqu&iacute; ya pude trepar hasta la parte superior, donde me esperaban un par de tipos a los que no les deb&iacute;a gustar mi presencia all&iacute;. Despu&eacute;s de razonar con ellos la situaci&oacute;n pude recoger el drag&oacute;n de piedra. La choza estaba cerrada con llave as&iacute; que me sub&iacute; en la moto y baj&eacute; por el &uacute;nico t&uacute;nel accesible, atropellando a otro que me esperaba m&aacute;s abajo. Llegu&eacute; hasta un claro con varias rampas, una de las cuales conduc&iacute;a a una entrada bloqueada por un muro. A su izquierda hab&iacute;a un hueco por el que pude colarme a pie para encontrarme con dos hermosos leopardos que me dieron la bienvenida. M&aacute;s adelante hab&iacute;a un salto que no podr&iacute;a realizar sin la moto as&iacute; que volv&iacute; a por ella. Desde la rampa central cruc&eacute; hasta el otro lado del recorrido y, girando a la izquierda por el estrecho pasillo, llegu&eacute; hasta otra rampa a ras de suelo. De &eacute;sta y con una serie de saltos di la vuelta a todo el claro y me col&eacute; por el lado izquierdo del muro hasta el interior de la guarida de los leopardos. Realic&eacute; el siguiente salto y aparqu&eacute; la moto. Un poco m&aacute;s adelante el camino se bifurcaba en dos. Por el lado izquierdo una puerta me imped&iacute;a el paso as&iacute; que volv&iacute; sobre mis pasos y continu&eacute; por la derecha donde encontr&eacute; una palanca que abri&oacute; la puerta que me bloqueaba.</P>

<P ALIGN="JUSTIFY">Recuper&eacute; la moto de nieve y atraves&eacute; la puerta, bajando por la pendiente helada. Segu&iacute; por una estrecha pasarela natural en medio de un enorme precipicio, con mucho cuidado de no desviarme pues habr&iacute;a significado la muerte segura. Por si esto fuera poco un hombre armado me esperaba en el camino, as&iacute; que aceler&eacute; y le pas&eacute; por encima, igual que a otros dos que me esperaban al final, en una peque&ntilde;a cueva. Atraves&eacute; esta cueva y volv&iacute; a encontrarme a cielo abierto, con una enorme rampa en mitad del vac&iacute;o. A mi derecha, en una peque&ntilde;a cornisa, descansaba un drag&oacute;n de jade. Me baj&eacute; de la moto y salt&eacute; a por &eacute;l pero, al volver, un par de felinos me esperaban. Tras acabar con ellos, me sub&iacute; a la moto de nuevo y realic&eacute; el gran salto, acabando al otro lado del abismo por los pelos. Segu&iacute; hacia la izquierda a toda velocidad por una zona helada y de gran pendiente lateral, esquivando unas bolas de nieve tambi&eacute;n a duras penas. Cuando llegu&eacute; al otro lado y me pude bajar de la moto respir&eacute; un poco m&aacute;s tranquila. Estudiando la zona que acababa de atravesar me fij&eacute; en un orificio en la pared de roca y tambi&eacute;n en que, enfrente hab&iacute;a una zona de la pared de hielo por la que me pod&iacute;a descolgar hasta una abertura a media altura del precipicio. As&iacute; lo hice y encontr&eacute; una llave en su interior.</P>

<center><table>

<td><img src="jpg/tr2tf02.jpg"><br>

<b><font size=1 face=arial><center>Con una enorme salto <br>atraves&eacute; el abismo</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Una vez con la llave en mi poder se hizo evidente que no podr&iacute;a salir por donde hab&iacute;a entrado as&iacute; que segu&iacute; por un agujero en la cueva que daba a un t&uacute;nel donde me esperaba otro individuo armado. Tras despacharlo continu&eacute; hasta una palanca y una puerta. Al acercarme a la palanca tuve buen cuidado de evitar los car&aacute;mbanos que colgaban del techo. Accionando la palanca abr&iacute; la puerta y continu&eacute; hasta llegar al fondo del abismo sobre el que hab&iacute;a hecho mi anterior n&uacute;mero circense con la moto. Explorando, encontr&eacute; alguna munici&oacute;n y elimin&eacute; varios felinos m&aacute;s. Finalmente regres&eacute; escalando hasta donde ten&iacute;a mi moto de nieve. Un salto m&aacute;s y me hice de nuevo con ella. Segu&iacute; hasta otra cueva con el suelo helado y all&iacute; utilic&eacute; la llave para accionar un puente levadizo que me permiti&oacute; llegar hasta una zona con m&aacute;s bolas de nieve. Aceler&eacute; a fondo para evitarlas y entr&eacute; en otra cavidad. Entonces hubo un gran derrumbamiento que me oblig&oacute; a realizar otro salto tras lo cual sal&iacute; de nuevo a la cueva mayor. El hielo del suelo se hab&iacute;a roto, dejando a la vista una llave de la que me apoder&eacute; enseguida. En ese instante un tipo montado en una moto de nieve me dio bastantes complicaciones, ya que la moto llevaba ametralladoras montadas en los laterales. Finalmente acab&eacute; con &eacute;l y quise llevarme su moto como recuerdo pero pronto me di cuenta de que no era tan r&aacute;pida como la m&iacute;a y con ella no podr&iacute;a saltar el abismo de regreso a la choza, as&iacute; que regres&eacute; a por la otra moto y emprend&iacute; el camino de vuelta. Poco antes de llegar hube de abandonar la moto ya que un peque&ntilde;o desnivel vertical me imped&iacute;a continuar.</P>

<center><table>

<td><img src="jpg/tr2tf03.jpg"><br>

<b><font size=1 face=arial><center> En el interior de la choza, una palanca <br>abr&iacute;a un nuevo t&uacute;nel</center></font></b></td>

</table></center>



<P ALIGN="JUSTIFY">Tal como hab&iacute;a supuesto, la llave abr&iacute;a la choza. Recog&iacute; todo lo que encontr&eacute; y accione una palanca, que abri&oacute; la puerta que bloqueaba el otro t&uacute;nel. Por ella penetraron tambi&eacute;n varios hombres armados hasta los dientes, que no fueron presa f&aacute;cil. Por el reci&eacute;n abierto t&uacute;nel llegu&eacute; hasta una cueva donde otro tipo montado en una de esas motos &quot;retocadas&quot; cay&oacute; bajo mis disparos y, de esta forma, me hice con una nueva moto. Continu&eacute;, bordeando un nuevo abismo por el lateral izquierdo y observ&eacute; que pod&iacute;a descenderse por una de sus paredes. As&iacute; lo hice y, tras evitar unas bolas de nieve, obtuve un nuevo drag&oacute;n de oro. Regres&eacute; hasta la moto y segu&iacute; adelante. Otros dos tipos en motos aparecieron como por arte de magia, as&iacute; que el duelo de motos de nieve estaba servido. Huelga decir qui&eacute;n sali&oacute; victoriosa del enfrentamiento. Explor&eacute; toda la zona hasta descubrir una roca que pude empujar para abrirme paso. Otros dos individuos, estos a pie, me esperaban al otro lado, as&iacute; que les di su merecido con el armamento de una de las motos. En el precipicio que hab&iacute;a ante mi liquid&eacute; a otro que estaba agazapado en una cornisa lateral y despu&eacute;s salt&eacute; con la moto al agua. Podr&iacute;a haber bajado a pie pero la altura de las cornisas era mucha y tuve miedo de herirme as&iacute; que, de esta forma acab&eacute; sana y salva, aunque no as&iacute; la moto. Sal&iacute; del agua y me encamin&eacute; hacia un pasadizo en la roca.</P>

</FONT>







<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>



<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





