<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 6. Área de Buceo.</h3>

</FONT>



<FONT FACE="Arial" SIZE=2>

<table align="right">

<td><img src="jpg/tr2da01.jpg"><br>

<b><font size=1><center>En lugar de lanzarme al agua<br> salt&eacute; hasta la escalera<br> que ten&iacute;a enfrente</center></font></b></td>

</table>







<P ALIGN="JUSTIFY">Sub&iacute; unas escaleras y llegu&eacute; a un tanque de agua. Ya iba a lanzarme al vaci&oacute; cuando advert&iacute; las palas de una enorme h&eacute;lice. El poder de succi&oacute;n de la h&eacute;lice me hubiera atra&iacute;do hacia una muerte segura as&iacute; que, en lugar de lanzarme al agua, cog&iacute; carrera y salt&eacute; hasta la escalera que ten&iacute;a enfrente. Sub&iacute; y descubr&iacute; un interruptor que detuvo la h&eacute;lice. Ya dentro del tanque, encontr&eacute; una palanca que abri&oacute; la puerta del otro lado del mismo y tras la h&eacute;lice encontr&eacute; tambi&eacute;n algo de munici&oacute;n. Atraves&eacute; la puerta y un par de tipos —con su perro— me estaban esperando al otro lado. Les di su jarabe de plomo y segu&iacute; a lo m&iacute;o. Buceando no hab&iacute;a salida as&iacute; que parec&iacute;a que tendr&iacute;a que saltar por entre esos ganchos m&oacute;viles. Midiendo bien el salto consegu&iacute; evitarlos pero no fue nada f&aacute;cil, por no mencionar los otros dos colegas que me esperaban al otro lado. Ahora callan para siempre.</P>

<P ALIGN="JUSTIFY">Segu&iacute; mi camino hasta una pendiente por la que me deslic&eacute; evitando caer en un l&iacute;quido verdoso que no ten&iacute;a pinta de ser muy saludable de haberme dado un ba&ntilde;o en &eacute;l. A mitad de descenso, en un peque&ntilde;o foso encontr&eacute; una estatuilla drag&oacute;n de piedra. ¡Un sitio un tanto raro para esconderla! Segu&iacute; hacia la izquierda y sub&iacute; por una largu&iacute;sima escalera hasta llegar a un hueco en el suelo por el que no se ve&iacute;a nada excepto una rampa. Pens&eacute; que suele irme mejor cuando desciendo las rampas de espaldas as&iacute; que lo hice de esta manera. Si no hubiera sido as&iacute; ahora estar&iacute;a bien muerta ya que no habr&iacute;a podido agarrarme al final de la misma. Me descolgu&eacute; hasta la pasarela inferior y cuando me izaba me recibi&oacute; un t&iacute;o bruto a balazos. Le contest&eacute; con sus mismos argumentos. Esta pasarela daba a una puerta de nivel azul que estaba cerrada, pero desde el otro extremo pude divisar una tarjeta de este color en un orificio en la pared. Salt&eacute; hasta all&iacute; y tome la tarjeta volviendo a subir hasta la dichosa puerta por el &uacute;nico sitio posible.</P>



<center><table>

<td><img src="jpg/tr2da02.jpg"><br>

<b><font size=1><center>Tarjeta de nivel azul en un <br>orificio en la pared</center></font></b></td>

</table></center>







<P ALIGN="JUSTIFY">Abr&iacute; la puerta y entr&eacute; con decisi&oacute;n. Otra segunda puerta se cerr&oacute; tras de m&iacute; as&iacute; que sospechando una trampa desenfund&eacute; a tiempo para liquidar a cuatro hermosos chuchos. Su amo apareci&oacute; instantes despu&eacute;s dispuesto a chamuscarme as&iacute; que le despach&eacute; antes de que tuviera oportunidad de hacerlo. Abr&iacute; una de las puertas de manivela y ascend&iacute; por unas escaleras hasta una puerta que no pude franquear. A trav&eacute;s de los barrotes pude ver un helic&oacute;ptero con los motores en marcha. Volv&iacute; al lugar anterior y abr&iacute; la otra puerta. Aqu&iacute; las escaleras eran en descenso y abajo me esperaba un se&ntilde;or muy simp&aacute;tico, pero sus chistes no me hicieron gracia y as&iacute; se lo hice saber. Me zambull&iacute; y, cuando comenzaba la exploraci&oacute;n de un conducto bajo el agua, un hombre rana me cort&oacute; el paso. Tras acabar con &eacute;l segu&iacute; la exploraci&oacute;n y tras un rato de jaleo con puertas y palancas —siempre con los pulmones al l&iacute;mite— consegu&iacute; abrir la puerta donde estaba el helic&oacute;ptero y volver sana y salva a la piscina.</P>

<P ALIGN="JUSTIFY">Me dirig&iacute; hacia el helic&oacute;ptero, que estaba muy bien guardado, pero huy&oacute; al llegar yo. Pas&eacute; el hangar de largo y llegu&eacute; a una peque&ntilde;a habitaci&oacute;n con dos pulsadores que apagaban sendos quemadores en un pasillo. Hice dos excursiones por dicho pasillo, obteniendo un M-16 —ahora ver&iacute;an esos mamones— y un chip que no sab&iacute;a como utilizar pero tom&eacute; igualmente. Volv&iacute; a la sala con la piscina y, al no encontrar m&aacute;s salida, mov&iacute; una caja situada al lado de una puerta cerrada esperando encontrar un interruptor mas lo que encontr&eacute; fue un circuito al que le faltaba una pieza. La pieza result&oacute; ser el chip que yo acababa de encontrar. Dentro me esperaba otro t&iacute;o con un lanzallamas y un amigo suyo, a los que no di cuartel hasta liquidarlos. En el agua hab&iacute;a dos hombres rana que tambi&eacute;n quer&iacute;an algo de m&iacute;. Una vez despejado el camino recorr&iacute; buceando el pasadizo hasta otra sala con piscina donde hubo m&aacute;s muertos cortes&iacute;a de la casa. No era posible acceder al resto de la sala y a los dos pasillos que pod&iacute;a ver desde mi situaci&oacute;n pero puls&eacute; un bot&oacute;n all&iacute; que abri&oacute; una puerta en otra sala.</P>

<P ALIGN="JUSTIFY">Volv&iacute; hasta esa sala, donde tuve que lidiar con los nuevos tipejos que hab&iacute;an quedado sueltos y, ya en su garita, puls&eacute; un bot&oacute;n que activ&oacute; una gr&uacute;a. As&iacute; consegu&iacute; pasar al otro lado de la piscina y pulsar un bot&oacute;n escondido tras unas cajas. De una sierra que hab&iacute;a all&iacute; protegiendo una tarjeta de nivel rojo, por el momento, ni hablar hasta que averiguase como pararla. Volv&iacute; hasta el hangar de donde despeg&oacute; el helic&oacute;ptero anteriormente, liquidando a cuantos encontr&eacute; a mi paso. ¡Parec&iacute;a como si saliesen de debajo de las piedras! El suelo del hangar hab&iacute;a descendido o desaparecido as&iacute; que baj&eacute; y di cuenta de otros dos. Uno de ellos ten&iacute;a en su poder otro chip que use en un panel cercano a la sierra para detenerla y as&iacute; coger la tarjeta de nivel rojo. Con ella en mi poder volv&iacute; a la zona inferior del hangar, donde estaba situada la puerta correspondiente a esa tarjeta. Segu&iacute; adelante y un tipo bastante duro de roer me las hizo pasar canutas.</P>

<P ALIGN="JUSTIFY">Segu&iacute; hasta aquella habitaci&oacute;n con agua en la que ya hab&iacute;a estado: los dos cad&aacute;veres lo confirmaban. Continu&eacute; por el siguiente pasillo —un poco laber&iacute;ntico y con zonas de agua— hasta que empec&eacute; a escuchar voces y luego unos golpes. Aceler&eacute; el paso y elimin&eacute; a otros dos que ven&iacute;an hacia m&iacute;. Recog&iacute; un drag&oacute;n dorado en una celda adyacente y me acerqu&eacute; al monje herido. Me estaba contando una historia ciertamente interesante acerca de un artefacto llamado &quot;seraf&quot; o algo as&iacute;, cuando un hombre de negro le dispar&oacute; acabando con &eacute;l e intent&oacute; despu&eacute;s hacer lo mismo conmigo. Cuando me enfrent&eacute; a &eacute;l sali&oacute; huyendo en un peque&ntilde;o submarino amarillo —como el de los Beatles—. Yo me puse el traje de buceo y me lance en pos del submarino. Enganchada a &eacute;l nos fuimos sumergiendo en el oc&eacute;ano hasta una gran profundidad, pero cuando est&aacute;bamos llegando, al idiota del piloto le asust&oacute; un tibur&oacute;n y se estrell&oacute; contra una roca, dej&aacute;ndome a mi suerte y con los pulmones a punto de reventar…</P>



<center><table>

<td><img src="jpg/tr2da05.jpg"><br>

<b><font size=1><center>Me acerqu&eacute; al monje herido,<br> que me cont&oacute; una interesante<br> historia</center></font></b></td>

</table></center>







<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta </A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas </A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





