<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">



<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>

<HR>

<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>istas y Soluciones</B></FONT></a>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>



<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">





<br><br><br><br>

<P align="justify">



<h3>Soluci&oacute;n de Tomb Raider II.<br>

Capítulo 14. El Palacio de Hielo</h3>

</FONT>

<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Me encontraba en una peque&ntilde;a sala con una enorme campana en su interior y de la que no parec&iacute;a haber salida, ya que la &uacute;nica puerta existente no quer&iacute;a abrirse. Tampoco pod&iacute;a volver atr&aacute;s as&iacute; que estaba empezando a preocuparme de verdad. Como el &uacute;nico objeto a mi disposici&oacute;n era la campana, intent&eacute; hacerla sonar —mediante un disparo— y ¡funcion&oacute;! La maldita puerta se abri&oacute; por fin. Acced&iacute; a una sala bastante grande con jaulas en las que varios hombres de las nieves estaban atrapados. En el suelo hab&iacute;a varias plataformas que, al pisarlas, me lanzaban disparada a gran altura. Utilizando la m&aacute;s ancha vol&eacute; hasta agarrarme a una cornisa en la que una palanca me permiti&oacute; abrir las jaulas y eliminar a los fieros prisioneros antes de que ellos me eliminaran a m&iacute;. Una de las rejas, situada en la pared, al mismo nivel que el suelo entarimado de madera, daba acceso a un pasillo oscuro, donde otro de estos lindos monstruitos me esperaba y, tras unas cortas escaleras, una nueva palanca que iz&oacute; una plataforma con un prop&oacute;sito para m&iacute; desconocido de momento. En esta estrecha jaula hab&iacute;a un bloque de piedra en la pared que parec&iacute;a estar desencajado. Lo apart&eacute; y descubr&iacute; tras &eacute;l una sala donde me aguardaba un drag&oacute;n de oro del que me separaba un vac&iacute;o infranqueable. Fue entonces cuando le saqu&eacute; partido a haber visto tantas pel&iacute;culas de Indiana Jones —con el que mucha gente me compara, no s&eacute; por qu&eacute;— y, sin dudarlo ni un instante (¡Ja! Que te crees t&uacute; eso, ya lo creo que lo dud&eacute;) me lanc&eacute; al vac&iacute;o para descubrir una pasarela invisible que soportaba mi peso y me llevaba hasta el ansiado tesoro.</P>

<P ALIGN="JUSTIFY">De vuelta en la sala tom&eacute; la &quot;catapulta&quot; de la derecha para llegar a otra enorme campana a la que, por asociaci&oacute;n de ideas, tambi&eacute;n dispar&eacute;, descubriendo que alzaba una de las rejas que me imped&iacute;an seguir mi camino tras el arco de piedra. All&iacute; observ&eacute; que otra &quot;catapulta&quot; me pod&iacute;a alzar hasta la plataforma que hab&iacute;a izado anteriormente con lo que sub&iacute; hasta ella y dispar&eacute; a otra campana enfrente de m&iacute;. Esto acab&oacute; con el &uacute;ltimo obst&aacute;culo, abriendo la segunda de las rejas, la cual atraves&eacute; sin demora para encontrarme frente a otra de esas malditas &quot;catapultas&quot; que, tomadas en la direcci&oacute;n equivocadas pod&iacute;an ser tan da&ntilde;inas para la salud. Tras un par de intentos infructuosos comprend&iacute; la t&aacute;ctica que deb&iacute;a emplear as&iacute; que afront&eacute; la plataforma desde el lateral para agarrarme a una superficie inclinada y desde ella saltar hacia atr&aacute;s hasta otra superficie igualmente pendiente. Continu&eacute; saltando entre ambas hacia la zona plana de la izquierda s&oacute;lo para comprobar que una reja bloqueaba mi camino. Lo intent&eacute; hacia la derecha y encontr&eacute; otra campana a la que dispar&eacute;; cuando volv&iacute; a la izquierda la reja se hab&iacute;a levantado.</P>

<center><table>

<td><img src="jpg/tr2ip01.jpg"><br>

<b><font size=1 face=arial><center>Saltando de rampa en rampa llegu&eacute; hasta<br> la campana que abri&oacute; la reja</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Ascend&iacute; por una escala en la pared hasta una nueva zona. Apenas aterrizaba en una estrecha pasarela en medio del vac&iacute;o, otro hombre de las nieves se abalanz&oacute; sobre m&iacute;. Lo mat&eacute; y continu&eacute; por la &uacute;nica ventana que no ten&iacute;a rejas. All&iacute; me esperaban unos fieros tigres albinos que guardaban celosamente una m&aacute;scara. En un lateral del pasillo de roca que llevaba a la sala de la m&aacute;scara encontr&eacute; una estatua drag&oacute;n de piedra y un pasadizo por el que continuar mi camino. Otro hombre de las nieves me atac&oacute; con escaso &eacute;xito y uno de sus hermanos de raza rug&iacute;a m&aacute;s abajo aunque la oscuridad no me dejaba ver donde. Me descolgu&eacute; hasta all&iacute; con la fortuna —quiz&aacute;s fue el destino— de caer en el &uacute;nico lugar que no estaba plagado de afiladas puntas de acero. Liquid&eacute; al yeti y explor&eacute; el lugar ayud&aacute;ndome con una bengala. Encontr&eacute; una cerradura en la que mi nueva m&aacute;scara encajaba a la perfecci&oacute;n. Una puerta cercana se abri&oacute; y con ella el camino hacia una pasarela que cruzaba por encima de la sala principal de las catacumbas del Tali&oacute;n. Al otro lado accion&eacute; una palanca que derram&oacute; el contenido del enorme pebetero sobre el suelo helado, fundi&eacute;ndolo por completo. Aprovechando la misma cornisa que la vez anterior que hab&iacute;a estado all&iacute; baj&eacute; hasta el suelo donde otros dos tigres formaban el comit&eacute; de bienvenida.</P>

<P ALIGN="JUSTIFY">Me zambull&iacute; por la abertura creada en el hielo y tom&eacute; una especie de maza o martillo que reposaba en una tarima. Segu&iacute; buceando hasta la siguiente estancia donde me enfrent&eacute; a varios yeti m&aacute;s hasta que, finalmente, ascend&iacute; por unas enormes escaleras de hielo. En la cueva en que me encontraba hac&iacute;a un mont&oacute;n de bolas de nieve esperando aplastarme. Las evit&eacute; con mi habilidad innata y me dirig&iacute; hacia la salida situada al final, a la derecha. Un enorme precipicio se abr&iacute;a ante m&iacute;. Salt&eacute; y me agarr&eacute; al borde del otro lado hasta que, en la parte derecha pude izarme en la zona llana. Otro precipicio y una pared agrietada que me permiti&oacute; escalar hasta un peque&ntilde;o hueco. La ca&iacute;da desde este &uacute;ltimo era muy grande as&iacute; que me deslic&eacute; de espaldas y agarr&aacute;ndome al borde salt&eacute; al vac&iacute;o; termin&eacute; algo lastimada, pero estaba viva. Ca&iacute; junto a un enorme Gong con la figura de un &aacute;guila grabada en &eacute;l. Prob&eacute; el mazo que acababa de encontrar y el estruendo reson&oacute; por toda la caverna. Me deslic&eacute; hasta el suelo con cautela y explor&eacute; la zona, evitando caer por las estrechas simas laterales. En una de las paredes hab&iacute;a una escala que me llev&oacute; al fondo de una de estas profundas aberturas donde encontr&eacute; una palanca que abri&oacute; una puerta m&aacute;s arriba. Ascend&iacute; de nuevo por la escala y saltando hacia atr&aacute;s acab&eacute; de nuevo en tierra firme. En la peque&ntilde;a estancia a la que conduc&iacute;a esta puerta encontr&eacute; un drag&oacute;n de jade. Me dirig&iacute; al lado opuesto, por donde trep&eacute; el hielo hasta entrar en el interior del Palacio de Hielo, bajo el Gong. All&iacute;, descansando inocentemente sobre un pedestal con el s&iacute;mbolo del drag&oacute;n, hall&eacute; el Tali&oacute;n, objeto que me permitir&iacute;a por fin entrar en el templo de l

a daga.</P>

<center><table>

<td><img src="jpg/tr2ip02.jpg"><br>

<b><font size=1 face=arial><center>El grabado del enorme Gong <br>era un aviso de lo que me esperaba si <br>tomaba el Tali&oacute;n</center></font></b></td>

</table></center>

<P ALIGN="JUSTIFY">Tom&eacute; posesi&oacute;n, pues, de tan preciado objeto pero no saldr&iacute;a librada f&aacute;cilmente del trance ya que el Tali&oacute;n estaba guardado por una enorme &aacute;guila sin alas que me persigui&oacute; sin descanso tratando de golpearme con sus poderosas extremidades. Me alc&eacute; de nuevo hasta el lateral del Palacio por el que hab&iacute;a penetrado antes y, desde la altura, pude dispararle sin correr peligro hasta darle muerte. Escap&eacute; de all&iacute; y volv&iacute; al exterior, donde un campamento de mercenarios esperaba quiz&aacute;s que yo hiciera el trabajo sucio por ellos para despu&eacute;s arrebatarme lo que era m&iacute;o. Consegu&iacute; robar uno de sus veh&iacute;culos y se organiz&oacute; una impresionante persecuci&oacute;n en medio de la noche. De un disparo me deshice de uno de los perseguidores y saltando valientemente un precipicio hice lo mismo con el otro. Volv&iacute; al pie de la muralla y por su interior hasta la puerta del Templo de la Daga. Us&eacute; el Tali&oacute;n y acced&iacute; al templo, por fin, despu&eacute;s de tantas aventuras. Ahora me esperaba la mayor de todas…</P>

</FONT>









<font face=arial size=2><hr>

<OL>

<LI><a href="str2_1.htm">La Gran Muralla</A></LI>

<LI><a href="str2_2.htm">Venecia</A></LI>

<LI><a href="str2_3.htm">El Escondite de Bartoli</A></LI>

<LI><a href="str2_4.htm">La Casa de la &Oacute;pera</A></LI>

<LI><a href="str2_5.htm">El Complejo Mar Adentro</A></LI>

<LI><a href="str2_6.htm">&Aacute;rea de Buceo</A></LI>

<LI><a href="str2_7.htm">40 Brazas</A></LI>

<LI><a href="str2_8.htm">Naufragio del Mar&iacute;a Doria</A></LI>

<LI><a href="str2_9.htm">Los Camarotes</A></LI>

<LI><a href="str2_10.htm">En Cubierta</A></LI>

<LI><a href="str2_11.htm">Las Colinas Tibetanas</A></LI>

<LI><a href="str2_12.htm">El Monasterio Barkhang</A></LI>

<LI><a href="str2_13.htm">Las Catacumbas del Tali&oacute;n</A></LI>

<LI><a href="str2_14.htm">El Palacio de Hielo</A></LI>

<LI><a href="str2_15.htm">El Templo de Xian</A></LI>

<LI><a href="str2_16.htm">Las Islas Flotantes</A></LI>

</OL>

<br>

<a href="str2_0.htm">Volver al índice.</A>

<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>

<A HREF="arcadec.htm"><font FACE="ARIAL"><B>[Pistas y Soluciones]</B></font></a>

</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>





