<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>S</B></font><FONT color="#000000" size=6 face="arial"><B>umario.<br>Macedo<FONT COLOR="#CC0000">n</FONT>ia número 6</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>


<table align="center"><img src="g_misc/act6.gif"></table>
</center>
<br><br>
<P ALIGN=justify>
<FONT color="#000000" size=2 face="arial">

<p align="justify">¡A por otro señor sumario!. En esta ocasi&oacute;n hemos vuelto 
a poner el list&oacute;n un poquito m&aacute;s alto que en la ocasi&oacute;n 
anterior ya que poseemos m&aacute;s de 40 art&iacute;culos, bastantes m&aacute;s, 
a la vez que interesantes mejoras como pueden ser 
&quot;<B><a href="galeria.htm">La Galer&iacute;a de Editoriales</a></B>&quot; que va a permitir, tanto a vosotros como a nosotros, ir analizando el rumbo tomado por la publicaci&oacute;n a trav&eacute;s de las sucesivas editoriales realizadas. Espero que, como m&iacute;nimo, os resulte curioso ver lo que pon&iacute;amos cuando est&aacute;bamos comenzando con todo este maravilloso &quot;tinglado&quot; llamado Macedonia.</P>
<P ALIGN="JUSTIFY"></P>
<P>Pero bueno, pasemos a lo que nos interesa, el sumario general...</P>
<h4><A HREF="firmas.htm">Entrevistas y firmas invitadas</a></h4><p align="justify">
Ha sido una auténtica lástima pero no hemos podido disponer de la entrevista y la
firma invitada que teníamos previsto. En el primero de los casos,
los ilustres fundadores de Opera como Jose Antonio Morales, creador del Livinstong Supongo,
Paco Menéndez, del Abadia del Crimen o Paco Suárez, desarrollador de juegos tan inmortales
como "La Pulga" no han podido tener completa la entrevista por falta de tiempo. Pero bueno, si no es para esta edición será para la siguiente que, os
aseguro, no faltarán a la cita (no les dejaremos escapar :-). <BR>
En el caso de las "Firmas Invitadas", pues bueno, es un tema diferente pues recibimos
un no. Un no que, dicho sea de paso, es el primero que recibimos y, como no esperábamos que esto nunca fuera a suceder, nos apoyamos
en exceso en la entrevista la cuál, como acabáis de leer, no ha podido ser editada en
este número.
<br><br>
Pera ya sabéis, al mal tiempo buena cara y si para este numero no tenemos nada por aquí, 
eso significa que, para el próximo que va a ser un número especial, tendremos doble
ración todos. Tanto vosotros como nosotros. No olvidéis, que nosotros mismos somos
lectores de nuestra propia revista y somos los primeros en sentir tales faltas.
<h4><A HREF="index01.htm">Artículos de opinión y reportajes varios</a></h4>
<p align="justify">
Para la edici&oacute;n sexta de Macedonia disponemos de 4 excelentes <B>"Art&iacute;culos de Opini&oacute;n"</B> 
marca de la casa. Como siempre, el habitual de esta secci&oacute;n,
<I> Antonio Montesinos</I>, vuelve a la carga. Esta vez lo hace con 2 estupendos 
art&iacute;culos. El primero de ellos &quot;<B><a href="monte6.htm">Revoluci&oacute;n... ¿de qu&eacute;?</a></B>&quot;, 
es una reflexi&oacute;n en voz alta sobre el sentido de utilizar la palabra 
revoluci&oacute;n para referirnos a Internet cuando, realmente, la proporci&oacute;n de 
individuos, en todo el mundo, que pueden beneficiarse de tal &quot;invento&quot; 
es irrisoria comparada con los que, desgraciadamente, no tienen ni para encender 
una bombilla. El otro de los art&iacute;culos de opini&oacute;n, el titulado 
&quot;<B><a href="monte7.htm">Telef&oacute;nica, hijo &uacute;nico</a></B>&quot; es una dura cr&iacute;tica,
cargada de iron&iacute;a, al monopolio que esta compa&ntilde;&iacute;a 
est&aacute; ejerciendo sobre todos los usuarios de internet que, encima 
de hacer progresar al pa&iacute;s, tienemos que aguantar unos obst&aacute;culos 
econ&oacute;micos, es decir, tarifas, insostenibles. Muy interesante. 
Por su parte, <I>Jos&eacute; Antonio Su&aacute;rez</I>, el responsable del curso 
de Delphi, entre otras muchas cosas, de Macedonia, realiza un 
an&aacute;lisis muy ir&oacute;nico (en este n&uacute;mero estamos 
todos ir&oacute;nicos ;-) sobre lo que va a suponer, presumiblemente, 
la &uacute;ltima &quot;criatura&quot; del se&ntilde;or Gates, el Windows 98. 
Lo puedes leer en &quot;<B><a href="w98.htm">¿Qu&eacute; es lo que espero 
de Windows 98?</a></B>&quot;. </P>
<P ALIGN="JUSTIFY">Y ya para finalizar el recorrido de esta secci&oacute;n, 
dar la bienvenida a un nuevo y joven miembro de Macedonia, 
<I>Samuel R&iacute;squez</I> que, utilizando los argumentos que en 
su d&iacute;a se expusieron en el art&iacute;culo &quot;PC vs Consolas&quot;, 
muestra su propia visi&oacute;n sobre tal &quot;enfrentamiento&quot;. 
No perd&aacute;is de vista el art&iacute;culo porque resulta extremadamente 
divertida la forma que Samuel tiene de explayarse sobre el tema. 
Desc&uacute;brelo en &quot;<B><a href="samuel1.htm">Otra forma de ver PC vs Consolas</a></B>&quot;.</P>
<P ALIGN="JUSTIFY"></P>

<h4><A HREF="index02.htm">Recuerdos de 8 bits</a></h4><p align="justify">
Y llegamos a una secci&oacute;n que promete, a partir de ahora, tomar nuevos 
rumbos, si cabe, m&aacute;s din&aacute;micos. No s&oacute;lo estrena coordinador 
sino que, ese mismo coordinador, es el director del fanzine m&aacute;s importante 
sobre el Spectrum. ¿Os suena el nombre de &quot;<I>El Mundo del Spectrum</I>&quot;?. 
Pues su director, <I>Alejandro</I> <I>Ib&aacute;&ntilde;ez</I>, ha fichado por 
Macedonia y se dispone a asentar la secci&oacute;n con estupendos art&iacute;culos.</P>
<P ALIGN="JUSTIFY">Para empezar tenemos un excelente art&iacute;culo en la 
subsecci&oacute;n &quot;<B>Recuerdos Nost&aacute;lgicos</B>&quot; que no 
est&aacute; realizado por Alejandro Ib&aacute;&ntilde;ez, sino por otro de 
nuestros estupendos redactores, se trata del art&iacute;culo 
&quot;<B><a href="8suenyo.htm">Un sue&ntilde;o hecho realidad</a></B>&quot; realizado por 
<I>Pedro Ferrera</I>. 
Este art&iacute;culo supone una vuelta atr&aacute;s recordando aquellos tiempos en 
los que todos &eacute;ramos m&aacute;s j&oacute;venes y en los que todos, 
independientemente de la m&aacute;quina utilizada, &quot;nos educamos&quot; a 
<P ALIGN="JUSTIFY">Y ahora s&iacute; que le toca el turno a 
<I>Alejandro Ib&aacute;&ntilde;ez</I> que, intern&aacute;ndose por la 
secci&oacute;n de &quot;<B>Compa&ntilde;&iacute;as Legendarias</B>&quot;, 
realiza un an&aacute;lisis directo y claro sobre una de las casas m&aacute;s 
carismáticas de aquella &eacute;poca 
&quot;<B><a href="8imagine.htm">Imagine: The Name of the Game</a></B>&quot;. 
Pero no s&oacute;lo se habla de Imagine, 
tambi&eacute;n <I>Alejandro</I> nos ofrece un an&aacute;lisis a uno de los 
juegos m&aacute;s adictivos de aquella &eacute;poca, el inimitable 
&quot;<B><a href="8risland.htm">Raibow Islands</a></B>&quot; que Ocean (c&oacute;mo no) se encargo de convertir a aquellas m&aacute;quinas. Leedlo porque realmente ha conseguido un art&iacute;culo que te hace revivir aquellas magn&iacute;ficas e inolvidables tardes que todos pasamos con este juego. ¡Genial!.</P>


<h4><A HREF="index03.htm">Aula Macedonia</A></h4><p align="justify">
Bueno, llegamos al lugar en el que hay que tomar aire para decir todo lo que hay 
que decir. En esta ocasi&oacute;n no se inicia ning&uacute;n curso nuevo pero los 
que hab&iacute;an, que son m&aacute;s que numerosos, han aportado significativos 
avances a la vez que una maquetaci&oacute;n, mucho m&aacute;s cuidada. </P>

<P ALIGN="JUSTIFY">Comenzamos con el &quot;<B>Curso de Programaci&oacute;n 
Gr&aacute;fica con OpenGL</B>&quot; que dirige <I>Oscar Garc&iacute;a</I>. En este 
n&uacute;mero tenemos un extenso art&iacute;culo, el que configura el 
cap&iacute;tulo 4 del curso y el que es tambi&eacute;n, todo hay que decirlo, 
m&aacute;s largo de todos. Lo pod&eacute;is leer en 
&quot;<B><a href="open4.htm">Capítulo 4. Interacci&oacute;n. Dispositivos 
de entrada</a></B>&quot;. Le va a la zaga el de Delphi cuyo mandam&aacute;s, 
<I>Jos&eacute; Antonio Su&aacute;rez</I>, ha decidido entrar &quot;a saco&quot; 
para ense&ntilde;ar a realizar una componente. As&iacute;, el cap&iacute;tulo 5 
se titula &quot;<B><a href="jjose6.htm">Capítulo 5. Desarrollo de un componente</a></B>&quot;. 
Ver&eacute;is c&oacute;mo, en esta ocasión, ten&eacute;is c&oacute;digo, 
¡vaya que si ten&eacute;is! ;).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entramos ahora en los dominios de 
<I>Fernando Rodr&iacute;guez</I> el cu&aacute;l se encarga de trabajar en el 
&quot;<B>Curso de POO con C++</B>&quot;. Para esta edici&oacute;n se han pulido 
determinados detalles del cap&iacute;tulo 4, es decir, 
&quot;<B><a href="poo4.htm">Capítulo 4. La piedra angular del C++: las clases</a></B>&quot; y, 
c&oacute;mo no, se ha construido un nuevo cap&iacute;tulo, el quinto, que entra ya 
en la pr&aacute;ctica ofreciendo un ejemplo moderadamente largo. Desc&uacute;brelo 
en &quot;<B><a href="poo5.htm">Capítulo 5. Jerarqu&iacute;a de clases y herencia en la pr&aacute;ctica</a></B>&quot;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">De la Programaci&oacute;n Orientada a Objetos pasamos al 
apartado de <I>I&ntilde;aki Ecenarro</I> el cual, ha experimentado un importe 
avance en cuanto contenido. Para este n&uacute;mero, disponemos de dos 
cap&iacute;tulos m&aacute;s para el &quot;<B>Curso de Programaci&oacute;n en VBA 
para Excel</B>&quot; los cuales, todo hay que decirlo, cuentan de una 
maquetaci&oacute;n exquisita. As&iacute;, pod&eacute;is leer ya el 
cap&iacute;tulo 2 titulado 
&quot;<B><a href="excel2.htm">Capítulo 2. Celdas, rangos, libros y hojas</a></B>&quot; y el 
cap&iacute;tulo 3 con el nombre 
&quot;<B><a href="excel3.htm">Capítulo 3. Cuadros de di&aacute;logo (Userforms)</a></B>&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A estas alturas deber&iacute;an de hacer acto de presencia los 
dos &quot;Linuxeros&quot; de Macedonia (que, casualidades de la vida, se llaman 
igual :-) y, en efecto, aqu&iacute; est&aacute;n. Por su parte 
<I>Pedro A. Carrasco</I> sigue adelante con su complet&iacute;simo 
&quot;<B>Curso de introducci&oacute;n y uso del Linux</B>&quot;. Para esta 
ocasi&oacute;n tenemos dos cap&iacute;tulos m&aacute;s del curso dispuestos a 
ser &quot;devorados&quot; por vosotros. En primer lugar, en el cap&iacute;tulo 2, 
aprenderemos a configurar el famoso entorno X-Window de Linux, tan s&oacute;lo 
tienes que visitar &quot;<B><a href="linux2.htm">Capítulo 2. Configuraci&oacute;n de X-Window</a></B>&quot; 
y aprender c&oacute;mo hacerlo. En el cap&iacute;tulo 3, sin embargo, ya entramos 
m&aacute;s en materia empezando a dar &quot;ca&ntilde;a&quot; de verdad a este 
famoso S.O aprendiendo a trabajar con el n&uacute;cleo. Desc&uacute;brelo 
en &quot;<B><a href="linux3.htm">Capítulo 3. Instalaci&oacute;n y compilaci&oacute;n del n&uacute;cleo</a></B>&quot;. </P>
<P ALIGN="JUSTIFY">No tenemos que ir muy lejos para descubrir &quot;el lado 
oscuro&quot; del Linux ya que la subsecci&oacute;n &quot;<B>Breve 
Introducci&oacute;n al Mundo del Hacking</B>&quot; avanza a pasos de gigante. 
¡3 extensos cap&iacute;tulos para esta sexta edici&oacute;n de Macedonia ha 
preparado <I>Pedro Ferrera</I>!. Comenzando por el cap&iacute;tulo 2 tenemos un 
art&iacute;culo destinado a sentar las bases que debemos de poseer para el buen 
entendimiento del curso, en 
&quot;<b><a href="hack2.htm">Capítulo 2. Manejando Linux, entendiendo Unix</a></b>&quot; 
entender&eacute;is a qu&eacute; me refiero.  En el cap&iacute;tulo 3, 
<I>Pedro</I> decide continuar &quot;engordando&quot; la base te&oacute;rica con 
un &quot;<B><a href="hack3.htm">Capítulo 3. Breve an&aacute;lisis a los sistemas Unix</a></B>&quot; que 
sirve de preludio para que, en el siguiente cap&iacute;tulo, el cuarto, comencemos 
ya a hacer de las nuestras: 
&quot;<B><a href="hack4.htm">Capítulo 4. Entrar en un sistema y "enrootarse</a></B>&quot;. Sin comerlo ni 
beberlo, tenemos en Macedonia dos potent&iacute;simos cursos que utilizan el Linux 
como base, creemos que empezamos a tocar y de una forma seria, todos los terrenos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Y qu&eacute; hay de <I>Carlos Alonso</I>?. Bueno, nuestro 
redactor sigue adelante con su original &quot;<B>La</B> <B>’Cl&iacute;nica’ 
del Dise&ntilde;ador Gr&aacute;fico</B>&quot; destinada a ense&ntilde;ar a 
utilizar y sacar el m&aacute;ximo rendimiento a los diversos paquetes de 
edici&oacute;n que hay en el mercado. Todo con una forma clara, directa y, 
ciertamente, muy amena que es, y mucho, de agradecer. En esta ocasi&oacute;n, 
<I>Carlos</I>, muestra, con todo lujo de detalles, c&oacute;mo realizar &quot;
<B><a href="clini3.htm">Paisajes Naif en Corel Draw</a></B>&quot; adem&aacute;s de comenzar la primera 
parte de una serie de art&iacute;culos destinados a la tipograf&iacute;a. 
Descubre este primero en &quot;<B><a href="clini4.htm">Las Tipograf&iacute;as (I)</a></B>&quot;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Seguro que m&aacute;s de uno echa en falta alg&uacute;n art&iacute;culo bueno, la verdad es que no hemos podido localizar a tiempo ni a <I>Emilio Rubio</I> ni a <I>Juan Carlos Gilarranz</I> responsables de los apartados de &quot;<B>SQL Server bajo Windows NT</B>&quot; y &quot;<B>Word 97</B>&quot; respectivamente. Esperamos, desde la redacci&oacute;n, que sea debido a que est&aacute;n de vacaciones y no por causa grave.<br>
Otros de los aspectos que también hay que señalar es el hecho de haber suprimido el
curso sobre programación en WIN32 en C ya que llevaba varios números apartado y, para
seros sinceros, el tiempo que requería llevarlo adelante era demasiado para compaginarlo
con otras secciones de la revista. Tal vez más adelante.... Por otro lado, se han aglutinado
los artículos de "<b>Sistemas Operativos</b>", "<b>Algorítmica</b>" y "<b>La Cacharrería</b>" dentro de
un apartado llamado "<b>Artículos Varios</b>" con el fin de tenerlo todo aún más
localizable.</P>
<P ALIGN="JUSTIFY">¡Buff!, soltemos aire chicos ;)</P>

<h4><A HREF="index04.htm">Zona de juegos</A></h4><p align="justify">
Parece que la suerte no est&aacute; con esta secci&oacute;n que, pese a contar con 
un importante n&uacute;mero de redactores fijos, siempre se ve mermada en 
n&uacute;mero significativo por distintos percances. En esta ocasi&oacute;n de 
los 7 redactores que habitualmente trabajan en ella, tan s&oacute;lo 3 han podido 
llevarla adelante. De todos modos, como en Macedonia &quot;semos los mejores ;)&quot; 
parece como si no hubiera ninguna ausencia. Comenzamos, como siempre, en orden de 
apartados.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La secci&oacute;n de noticias sobre juegos, es decir, 
&quot;<B>Lo que Debes Saber</B>&quot;, se ve enriquecida de forma sobresaliente y 
es que <I>Fernando Rodr&iacute;guez</I> pone sobre la mesa nada menos y nada 
m&aacute;s que 7 interesantes noticias todas ellas sobre el mundo de los juegos y, 
tal vez, haya alguna que te interese <B>personalmente</B>. Os ponemos los 
nombres: &quot;<B><a href="n6comen.htm">¡En Macedonia publicamos t&uacute; juego¡</a></B>&quot;, 
&quot;<B><a href="lome3.htm">Lo mejor del E3</a></B>&quot;, 
&quot;<B><a href="commnot.htm">Commandos sale a la venta y arrasa</a></b>&quot;, 
&quot;<b><a href="eadina.htm">EA quiere ‘comerse’ a Dinamic Multimedia</a></B>&quot;, 
&quot;<B><a href="n6caad.htm">El CAAD 34 ya est&aacute; casi listo</a></B>&quot;, 
&quot;<B><a href="stradom.htm">Stratos ya tiene dominio</a></B>&quot; y 
&quot;<B><a href="emula.htm">Emulatronia vuelve a la carga</a></B>&quot;. C&oacute;mo 
veis esta subsecci&oacute;n ha crecido tanto a lo ancho como a lo largo ;).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Saltamos ahora a una subsecci&oacute;n que ha agrupado a otras 
que antes estaban por separado. Ahora, bajo el nombre de 
&quot;<B>Reportajes</B>&quot;, podr&eacute;is encontrar los art&iacute;culos que 
antes se publicaban en &quot;<B>Compa&ntilde;&iacute;as Espa&ntilde;olas</B>&quot;, 
&quot;<B>Grandes Programadores</B>&quot; y, l&oacute;gicamente, los mismos 
reportajes. De esta forma creemos que todo se encuentra menos disperso y 
f&aacute;cilmente localizable. Pero vamos a comentar qu&eacute; es lo nuevo de 
esta edici&oacute;n n&uacute;mero 6 de Macedonia. Para empezar, 
<I>Fernando Rodr&iacute;guez</I> vuelve a la carga con un reportaje sobre la casa 
nacional &quot;<B><a href="rpendulo.htm">P&eacute;ndulo Studios</a></B>&quot;, en dicho reportaje, se analiza 
la historia de esta carism&aacute;tica firma. Por otro lado, 
<I>Carlos P&eacute;rez - G&aacute;ndaras</I>, vuelve a hacer acto de presencia en 
Macedonia a lo grande ya que concluye de una forma estupenda el reportaje sobre 
los &quot;First Person Shooting&quot; que iniciara hace dos n&uacute;meros. 
Pod&eacute;is acceder a su segunda parte en 
&quot;<B><a href="fps2.htm">Historia de los First Person Shooting (II).</a></B>&quot;. Para todos 
aquellos que os perdisteis la primera parte del reportaje o que simplemente 
quer&eacute;is consultarla ahora pod&eacute;is pulsar en 
&quot;<B><a href="fps1.htm">Historia de los First Person Shooting (I).</a></B>&quot;</P>
<B><P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Despu&eacute;s de estos dos extensos e interesantes 
reportajes pasamos a la subsecci&oacute;n que parece crecer con un ritmo asombroso. 
Se trata de los<B> &quot;An&aacute;lisis de Juegos</B>&quot; y es que, en esta 
ocasi&oacute;n, analizamos un total de 6 t&iacute;tulos.</P>
<P ALIGN="JUSTIFY">Empezamos por &quot;<B><a href="sulfato.htm">El Sulfato At&oacute;mico</a></B>&quot; de 
la casa <I>Alcachofa Soft</I>. Este juego se basa en una historia de Mortadelo y 
Filem&oacute;n creada por el famos&iacute;simo<I> Francisco Ib&aacute;&ntilde;ez</I>. 
Macedonia es una de las primeras publicaciones (por no decir la primera), que va a 
contar con un an&aacute;lisis de este juego, es decir, lo que vais a poder leer es 
en <B>rigurosa exclusiva</B> ;). Si quer&eacute;is saber m&aacute;s de esta 
estupenda aventura gr&aacute;fica espa&ntilde;ola s&oacute;lo ten&eacute;is que 
consultar el an&aacute;lisis a &quot;<B>El Sulfato At&oacute;mico</B>&quot; 
realizado por el incansable <I>Fernando Rodr&iacute;guez</I>. </P>
<P ALIGN="JUSTIFY">Del mismo redactor tambi&eacute;n tenemos un comentario a uno 
de los &uacute;ltimos juegos de rol llegados a nuestro pa&iacute;s, el 
&quot;<B><a href="fallout.htm">Fallout</a></B>&quot;.</P>
<P ALIGN="JUSTIFY">De <I>Carlos P&eacute;rez – G&aacute;ndaras</I> llega un 
&quot;cargamento&quot; entero de comentarios a juegos. As&iacute;, vamos a poder 
ver en Macedonia otro comentario a un juego espa&ntilde;ol, el juego más laureado,
por ahora, fuera de nuestras fronteras , el 
&quot;<B><a href="comand.htm">Commandos: Behind Enemy Lines</a></B>&quot; y todo de la forma tan 
profesional que nuestro redactor gusta en utilizar. Suyos son tambi&eacute;n los 
comentarios a juegos tan novedosos como el &quot;<B><a href="scraft.htm">StarCraft</a></B>&quot; 
y el &quot;<B><a href="unreal.htm">Unreal</a></B>&quot;. ¿Tendr&aacute;n el &quot;preciado&quot; sello de 
‘Macedonia Magazine Recomendado’ ;) ?.</P>
<P ALIGN="JUSTIFY">Y los seguidores, que los habr&aacute;, de los particulares 
comentarios <I>de Antonio Monreal</I>, est&aacute;n de enhorabuena pues nuestro 
redactor, despu&eacute;s de hacer lo imposible para sacar algo de tiempo, nos 
ofrece otro trabajado an&aacute;lisis. Esta vez la v&iacute;ctima se llama 
&quot;<B><a href="ultimate.htm">Ultimate Race Pro</a></B>&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y despu&eacute;s de tanto an&aacute;lisis de &uacute;ltima 
generaci&oacute;n, regresamos a lo cl&aacute;sico, a la secci&oacute;n 
&quot;<B>T&iacute;tulos de&#9;Coleccionistas</B>&quot; de la mano de 
<I>Fernando Rodr&iacute;guez</I> con un art&iacute;culo en honor a la saga de los 
juegos de rol &quot;<B><a href="colec4.htm">Eye of the Beholder</a></B>&quot;.  Ahhhh, que tiempos ¿eh?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, pues hasta aqu&iacute; la secci&oacute;n de juegos. Para 
ser s&oacute;lo tres los valientes hay bastante m&aacute;s de lo que cabr&iacute;a 
esperar. Para el siguiente n&uacute;mero, el 7, como todos sab&eacute;is Macedonia 
vestir&aacute; sus mejores galas, es decir, todos sus redactores estar&aacute;n 
listos y dispuestos para romper moldes as&iacute; que, hasta entonces, que os 
gusten los art&iacute;culos de este n&uacute;mero, que no tienen ni un 
&aacute;pice de desperdicio.</P>

<h4><A HREF="inet.htm">Macedonia Internet</A></h4><p align="justify">
Y llegamos a la secci&oacute;n que crece y crece y... Es realmente importante la 
extensi&oacute;n y calidad que est&aacute; alcanzado esta &quot;recien 
nacida&quot; de Macedonia pero s&oacute;lo ten&eacute;is que visitarla, leer los 
art&iacute;culos y daros cuenta.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Para este n&uacute;mero, en la subsecci&oacute;n 
&quot;<b>Reportajes sobre Internet</b>&quot;, nuestro prestigioso redactor 
<I>Koldobika Meso Ayerdi,</I> vuelve a la carga con otro de sus 
extens&iacute;simos art&iacute;culos. En esta ocasi&oacute;n realiza un 
estudio (porque no se le puede llamar de otra manera a su art&iacute;culo) sobre 
las diferentes formas de viajar con Internet. Todo tipo de informaci&oacute;n 
para organizar nuestras vacaciones fuera de nuestro lugar de residencia habitual 
o, c&oacute;mo no, para disfrutarlo visitando lugares ex&oacute;ticos por medio de 
Internet. Puedes consultarlo en &quot;<B><a href="minet11.htm">De viaje con Internet</a></B>&quot;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Despu&eacute;s de este &quot;viaje&quot;, podemos descansar a 
saciar nuestra &quot;hambruna&quot; de conocimientos de Internet en la 
secci&oacute;n &quot;<B>Aula Internet</B>&quot;. En esta ocasi&oacute;n, un nuevo 
e importante colaborador de Macedonia, <I>Andr&eacute;s Almansa</I>, realiza 
un primer y completo acercamiento a lo que son las redes. S&oacute;lo tienes que 
visitar el art&iacute;culo &quot;<B><a href="minet8.htm">Introducci&oacute;n a las redes (I)</a></B>&quot;. 
Siguiendo a Andr&eacute;s, <I>aparece Antonio Montesinos</I> con 4 interesantes 
trabajos para ayudar a aumentar la cultura que debemos de tener sobre la &quot;red 
de redes&quot;. El primero de ellos trata sobre la USENET. Antonio realiza un 
breve pero conciso art&iacute;culo sobre la historia de este popular servicio que 
nos ofrece la red. Puedes consultar su trabajo en 
&quot;<b><a href="minet6.htm">Breve historia de USENET</a></B>&quot;. Si continuamos, nos 
&quot;toparemos&quot; con otro importante y b&aacute;sico art&iacute;culo, pues 
todos los usuarios de correo electr&oacute;nico deber&iacute;an de leer. 
En &quot;<B><a href="minet7.htm">Introducci&oacute;n al PGP</a></B>&quot; obtendr&eacute;is las respuestas 
a muchas de las dudas que os puedan surgir entorno a la seguridad de usar correo 
electr&oacute;nico.</P>
<P ALIGN="JUSTIFY">Otro de los importantes an&aacute;lisis de nuestro redactor, 
lo podr&eacute;is hallar en &quot;<B><a href="minet9.htm">¿Qu&eacute; riesgos tiene el WWW?</a></B>&quot;.
<B> </B>En d&oacute;nde se nos comentar&aacute;n una serie de aspectos que hay que 
tener en cuenta para que, un fallo de seguridad, no nos pille desprevenidos. Si 
quieres saber qu&eacute; es lo que puede atentar contra tu seguridad cuando 
est&aacute;s conectado a Internet, este art&iacute;culo es imprescindible. </P>
<P ALIGN="JUSTIFY">A este anterior trabajo de <I>Antonio Montesinos</I> se le une 
el &uacute;ltimo de los art&iacute;culos que podemos encontrar en 
&quot;<B>Macedonia Internet</B>&quot;. Se trata del titulado 
&quot;<B><a href="minet10.htm">Recomendaciones para hacer un buen uso de Internet</a></B>&quot; y que, como 
su propio t&iacute;tulo deja entrever, no son m&aacute;s que peque&ntilde;as 
recomendaciones para no pecar de &quot;novatos&quot; a la hora de utilizar los 
recursos de la red en cualquiera de sus facetas.
<br><br>
Para finalizar avisaros que hemos decidido incluir en "<b>Macedonia Internet</b>" la
sección "<b>Los Mejores Links de la Red</b>" de este modo intentamos darle el caracter
que se merece a la sección sobre Internet convirtiendo a la de Liks, poco a poco,
en subsidiaria de la primera. Así, avisaros que <b>sólo si os pasáis</b> por "<b>Macedonia
Internet</b>" sabréis que links se han actualizado.
</P>

<h4><A HREF="index05.htm">La biblioteca</A></h4><p align="justify">
<P ALIGN="JUSTIFY">Esta secci&oacute;n va creciendo poco a poco como es natural 
dada su condici&oacute;n y teniendo en cuenta que a nosotros nadie nos cede los 
libros para realizar alg&uacute;n tipo de an&aacute;lisis. Pero, como hemos dicho, 
esta secci&oacute;n crece, aunque sea poco a poco y, para este n&uacute;mero, ya 
tenemos un comentario a un libro sobre el popular lenguaje Java. 
<I>Jos&eacute; Antonio Su&aacute;rez</I>, es el encargado de dar su opini&oacute;n 
y poner en donde se merece al libro de Anaya 
&quot;<B><a href="b_jose1.htm">Manual Fundamental de Java</a></B>&quot;. Bueno, no os pod&eacute;is quejar, 
cada vez tocamos m&aacute;s temas.</P>

<h4><A HREF="index06.htm">Macedonia de ocio</A></h4><p align=justify>
Para este sexto n&uacute;mero de Macedonia se abre un importante camino de 
expansi&oacute;n para esta secci&oacute;n pues de manos de un nuevo y flamante 
redactor, <I>Miguel Angel Fern&aacute;ndez</I> podemos ya inaugurar una nueva subsecci&oacute;n que toda la 
redacci&oacute;n ten&iacute;amos ganas de abrir, se trata del apartado dedicado a 
la &quot;<B>Narrativa Fant&aacute;stica</B>&quot; y, como sabemos lo que nos 
llevamos entre manos, empezamos como ten&iacute;amos que empezar, con un estupendo 
primer art&iacute;culo sobre un genio de la literatura llamado J.R.R Tolkien. 
Puedes descubrir el primero de una serie de art&iacute;culos en 
&quot;<B><a href="tolki1.htm">J.R.R. Tolkien: Vida y obra de un genio (I)</a></B>&quot;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A parte de esta estupenda novedad, tambi&eacute;n seguimos 
teniendo a nuestro valioso redactor Pablo V&aacute;zquez movi&eacute;ndose entre 
las diversas subsecciones de &quot;<B>Macedonia de Ocio</B>&quot;. 
En esta ocasi&oacute;n le toca el turno al libro &quot;<B><a href="cromo6.htm">Cromosoma 6</a></B>&quot; 
pasar por el ojo cr&iacute;tico de Pablo.<br>
Pero, no contento con esto, Pablo hace una especie de "2 en 1" y nos ofrece, en otro artículo,
el comentario a dos libros de un mismo autor. Puedes leer la comparación y el ánalisis
de Pablo a <a href="ramis4.htm"><b>"El Manifiesto Negro" y "El Negociador"</a></b></P>

<h4><A HREF="index07.htm">Bájate algo interesante</A></h4><p align="justify">
Bueno chicos/as, si no te hab&iacute;as pasado por aqu&iacute; desde hac&iacute;a 
mucho tiempo puede que te lleves una sorpresa, agradable sorpresa, por supuesto, 
pues esta secci&oacute;n a pegado un cambio m&aacute;s que radical. Ahora 
tendr&aacute;s, adem&aacute;s de m&aacute;s novedades, todo mucho m&aacute;s 
ordenado y accesible para que bajarte las cosas te sea m&aacute;s f&aacute;cil 
y c&oacute;modo. Destacamos en novedades la posibilidad de bajarte dos estupendos 
fanzines. Por un lado tienes a nuestra revista hermana 
&quot;<B>GargonScene</B>&quot;, a la cual aprovechamos para dar un 
&quot;maced&oacute;nico&quot; saludo y, por otro lado, a uno de los mejores cursos 
sobre programaci&oacute;n de juegos que jam&aacute;s se ha hecho en Espa&ntilde;a. 
Pese a que el <B>CPV</B> ya tiene unos cuantos a&ntilde;itos, la forma tan genial 
en que fue llevado a cabo, merece que nunca se olvide. Es una forma de mostrar 
nuestra admiraci&oacute;n a gente que estuvo antes que nosotros. ¿A que esperas 
para leer otra cosa que no sea Macedonia?, ahora bien, no te nos aficiones mucho 
que te queremos ver aqu&iacute; en otro n&uacute;mero ;-).</P>


<h4><A HREF="index08.htm">Los mejores links de la red</a></h4><p align="justify">
Esta secci&oacute;n no para de crecer y de ofrecer lugares estupendos para 
visitar. Os recordamos que los apartados que podéis visitar en nuestra sección de
links son:<br><A HREF="link1.htm"><B>Links a páginas de nuestros colaboradores</B></A>,
donde incluimos las páginas que cada uno de nosotros tenemos por separado en la Red
<A HREF="link2.htm"><B> Links a los mejores fanzines en español</B></A>, en donde
se analizan links a fanzines "colegas" de Macedonia,
<A HREF="link3.htm"><B>Links a asociaciones y grupos de programación</b></a>, 
donde os mostramos las páginas WEB tanto de grupo de programación como de
páginas oficiales sobre alguna determinada aplicación eso sí, intentado siempre
favorecer a los productores independientes. En
<A HREF="link4.htm"><B> Links a páginas interesantes en español</B></A> hacemos un
hueco a los enlaces en castellano que son de obligada visita para todo el buen
internauta y, ya por último, en 
<A HREF="link5.htm"><B>Otros links interesantes</B></A> echamos un vistazo a enlaces
que no estén en idioma castellano</P>

<h4><A HREF="offline.htm">Proyecto Macedonia Off-Line</a></h4><p align="justify">
<P ALIGN="JUSTIFY">Macedonia Off-Line ha dejado de ser un sue&ntilde;o para 
convertirse en una realidad. Para el siguiente n&uacute;mero ya te podr&aacute;s 
bajar el mejor <B>visor bajo Windows</B> que una publicaci&oacute;n de este tipo 
pueda tener. Ahora s&iacute; que no tendr&aacute;s que pagar absolutamente nada 
por leernos pues tambi&eacute;n funcionaremos sin que tengas que estar en contacto 
mediante Internet. Bastar&aacute; que tengas instalado nuestro visor y... 
¡voil&aacute;! Macedonia, enterita, en t&uacute; disco duro. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bueno, para que te enteres de m&aacute;s cosas y puedas ver 
<B>las primeras capturas del visor</B> en un estado muy beta, tenemos esta 
secci&oacute;n. P&aacute;sate y prep&aacute;rate para el pr&oacute;ximo 
n&uacute;mero que, coincidiendo con nuestro primer aniversario, prepararemos la 
conquista de todos los hogares espa&ntilde;oles definitivamente (lo sentimos, 
pero es que estamos muy emocionados con todo esto sinfff :,-)</P>

<h4><A HREF="index09.htm">Colabora con nosotros</a></h4><p align="justify">
<P ALIGN="JUSTIFY">Macedonia nunca se cansar&aacute; de ampliar el equipo. 
Cuanta m&aacute;s gente mejor pero ¡<B>OJO</B>!, hay unas <B>normas estrictas</B> 
y que, adem&aacute;s, han sido <B>actualizadas recientemente</B>. Si quieres 
ser miembro del equipo tendr&aacute;s que aceptar todo lo que se te expone en 
este apartado que, recuerda, ha sido actualizado. Buscamos gente pero <B>gente 
responsable</B>.</P>

<h4><A HREF="index10.htm">Equipo Macedonia Magazine</a></h4><p align="justify">
¿Que quienes somos?, pues si accedes a esta sección lo sabrás. Ahora bien,
te aviso que el equipo de Macedonia intimida y no sólo por la cantidad y calidad
de sus miembos sino por los agradecimientos especiales con los que cuenta...
<br>
¡Jo!, después de tanto trabajo altruista teniamos derecho a poner cosas como estas
¿o no? X-D
<br><br>
<p align="right"><font size="3" color="#000000"><a href="index10.htm" ><b>L</a>a Redacción</b></font></p>
<br><br>
<br>

<center><a href="umario.htm"><B>Volver al sumario actual</a></center>

<hr><br>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">SUMARIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>

