<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>rogramación y Desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:i9808685@petra.euitio.uniovi.es">Fernando Rodríguez</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Tecnología vs Desarrollador
</FONT>
</H3>

<FONT color="#000000" size =2 face="arial" >        
<P ALIGN=JUSTIFY>
No hace falta ser un experto para darse cuenta de que el panorama 
inform&aacute;tico actual está realmente saturado. Antes, era mucho m&aacute;s 
sencillo aprender. Era relativamente f&aacute;cil decidirse por un campo u otro. 
Uno se pod&iacute;a dedicar al &aacute;rea de la programaci&oacute;n, al del 
dise&ntilde;o, pod&iacute;as abarcar y seguir el día a día de los avances en el 
hardware (nuevos perif&eacute;ricos, nuevas m&aacute;quinas, procesadores, 
tarjetas...) y del software (paquetes gr&aacute;ficos, de dise&ntilde;o, 
compiladores...) Todo pod&iacute;a ser perfectamente asimilado. 
Est&aacute;bamos al d&iacute;a. Sab&iacute;amos en d&oacute;nde nos mov&iacute;amos
 pero... ¿y ahora?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ahora ya no basta con saber un lenguaje de 
programaci&oacute;n. Ahora tienes que saber tambi&eacute;n desenvolverte con 
otras muchas herramientas. Ya no s&oacute;lo hace falta saber que existe un 
procesador que acaba de salir y las caracter&iacute;sticas que incorpora. Ahora 
hay que medir el tiempo en que tardar&aacute; en salir el siguiente para que 
tu aplicaci&oacute;n o proyecto no quede obsoleto antes, si quiera, de ponerte a realizarlo. 
Ahora hay que aguantar al conocido que se acaba de comprar un ordenador hablándote 
de cosas que t&uacute; a&uacute;n no has tenido tiempo de leer porque 
est&aacute;s embarcado en el aprendizaje de una nueva herramienta o porque se te 
ha olvidado echar un vistazo, desde hace un par de d&iacute;as, a 
la &uacute;ltima lista de novedades de hardware.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Todo este ambiente puede llegar a acabar con el 
inform&aacute;tico que ha crecido poco a poco, con el informático que ha crecido 
sabiendo dominar todos y cada uno de los entresijos que su herramienta le 
ha proporcionado. Ahora, cuando crees que estas empez&aacute;ndole a coger el 
tranquillo a un paquete de software, a desenvolverte con un entorno 
gr&aacute;fico o a captar las ideas del lenguaje que has decidido utilizar 
para tus proyectos futuros, oyes c&oacute;mo se anuncia la inminente 
llegada de la siguiente versi&oacute;n que promete mejorar, en todos los aspectos, 
a la herramienta anterior... Y lo m&aacute;s gracioso de todo es que 
a&uacute;n no te ha dado tiempo a poner en pr&aacute;ctica todo lo que has 
aprendido porque te has pasado sufriendo una curva de aprendizaje durante 6 
largos meses. ¿Cu&aacute;ndo vas a poder trabajar realmente sobre lo que 
has estado preparándote?. ¿Cu&aacute;ndo vas a poner en pr&aacute;ctica todos 
tus conocimientos sin que estos se vean obsoletos antes de ser llevados a la práctica?. 
¿Cu&aacute;ndo vas a poder ser el verdadero profesional que esperas ser?.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El desarrollador actual se convierte en una persona que 
se ha ido haciendo a base de saber de muchas cosas pero "por encima" y esto, 
bajo mi humilde opini&oacute;n, no es algo bueno. 
El esp&iacute;ritu de la inform&aacute;tica actual es el de saberte mover por 
muchos lugares pero sin profundizar realmente en ninguno de ellos y así sacar el 
m&aacute;ximo partido a lo que tienes delante de ti.
  </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">¿Qui&eacute;n tiene la culpa?. ¿La tecnolog&iacute;a o 
las empresas productoras de herramientas?. Yo creo que la respuesta se encuentra 
en las casas productoras. La tecnolog&iacute;a avanza y debe avanzar con paso 
firme, sin vuelta atr&aacute;s, pero hay que saber administrarla y dosificarla. 
De poco vale lanzar una versi&oacute;n quinta de un producto si al a&ntilde;o 
siguiente tenemos una sexta versi&oacute;n que no a&ntilde;ade m&aacute;s 
que unas pocas novedades y hace que el programador pase por un mar de 
incertidumbre que va desde el anuncio de la &quot;nueva&quot; herramienta 
hasta el de la campa&ntilde;a de marketing de las casas productoras que 
lo venden como la herramienta &quot;&uacute;nica&quot; para que tus producciones 
&quot;est&eacute;n a la altura de la tecnolog&iacute;a&quot;. Este hecho de sacar
 herramienta tras herramienta con la etiqueta de "versión n+1" en lugar de 
 "versión n+ 0.1", contribuye a alejar aún más a los futuros desarrolladores de su
 meta "llegar a controlar el 75% de la plataforma de desarrollo en cuestión". Ahora, lo único que veo, son a 
 supuestos entendidos que saben controlar tres o cuatro opciones, soltar una 
 parrafada que se han memorizado para intentar impresionar a los dem&aacute;s 
 pero que, a fin de cuentas, no saben desenvolverse ni un 10% con ella y que al 
 primer &quot;no se qu&eacute; pasa&quot; aplican el &quot;apaga y enciende&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si est&aacute;is aprendiendo, concentraros en la 
&uacute;ltima herramienta que teng&aacute;is disponible cuando 
comenc&eacute;is pero no la cambi&eacute;is por la siguiente versi&oacute;n hasta 
no dominar la que ten&eacute;is al completo. 
Ese es el principal reto para el desarrollador, en cualquiera de sus facetas, 
actual. No hay que dejarse arrastrar por las "ambiciones" y las "prisas" pues esos 
factores son los peores compa&ntilde;eros de viaje de cualquier aprendizaje. 
Estudiar lo que ten&eacute;is, sin prisa pero sin pausa y, cuando lo 
domin&eacute;is, ya os aprender&eacute;is las, en el 90% de los casos, 
m&iacute;nimas mejoras de la siguiente versi&oacute;n las cuales, quiz&aacute;s 
nunca llegu&eacute;is a utilizar en vuestros desarrollos. 
No dej&eacute;is que la tecnolog&iacute;a os domine, dominarla vosotros y 
utilizarla cuando haya que utilizarla no cuando quieran que la utilic&eacute;is.</P>





<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionb.htm"><font FACE="ARIAL"><B>[Opinión Programación / Desarrollol]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</HTML>


