<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>C</B></font><FONT color="#000000" size=2 face="arial"><B>rítica de Cine</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A href="mailto:ramis@lettera.net">Pablo Vázquez "Ramis"</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>
<H3>
Tesis. <br>
Dirigida por Alejandro Amenábar.
</H3>
<FONT color="#000000" face="arial">
<FONT color="#000000" size=2 face="arial">
<P ALIGN=justify>

Es la &oacute;pera prima de un nuevo director que ha irrumpido en el &aacute;mbito del cine espa&ntilde;ol con mucha fuerza: Alejandro Amen&aacute;bar. En ella participan actores y actrices de la talla de Ana Torrent, Fele Mart&iacute;nez, Eduardo Noriega, Miguel Picazo y Javier Elorriaga.</P>
<P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">&quot;&Aacute;ngela prepara una tesis sobre la violencia audiovisual. Figueroa, su director, de tesis, descubre accidentalmente una pel&iacute;cula y al d&iacute;a siguiente aparece muerto.<br>
&Aacute;ngela y Chema, un compa&ntilde;ero de facultad, deciden llevarse la cinta, descubriendo que s trata de una &quot;snuff-movie&quot; en la que una chica es torturada y asesinada.<br>
Un mundo audiovisual diferente y peligroso se abre ante ellos. &Aacute;ngela puede ser la protagonista del siguiente &quot;snuff-movie&quot;... &quot;</P>
<P ALIGN="JUSTIFY"></P>
</I><P ALIGN="JUSTIFY">Este es, en pocas palabras, el argumento de uno de los mejores thrillers que ha producido el cine espa&ntilde;ol en los &uacute;ltimos a&ntilde;os. Es realmente curioso que un director novel debute cinematogr&aacute;ficamente con este tipo de pel&iacute;culas, pero es una apuesta que Amen&aacute;bar sac&oacute; adelante con muy buena nota. La pel&iacute;cula tiene en tensi&oacute;n al espectador durante toda la proyecci&oacute;n, ya que lo que en un principio parece una entrada al tema por la puerta de atr&aacute;s y de casualidad va a dar lugar, seg&uacute;n avanza la cinta, a una investigaci&oacute;n en toda regla de una organizaci&oacute;n, si quieres un poco &quot;pachangera&quot;, que se dedica a grabar en cinta torturas y asesinatos de chicas, para su posterior comercializaci&oacute;n en el mercado negro, con el peligro que ello conlleve.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En cuanto a los aspectos de la realizaci&oacute;n cabe destacar escenas como la de &Aacute;ngela cuando va a ver la primera pel&iacute;cula sabiendo que por ella muere su tutor de tesis o cuando se est&aacute;n preparando para el snuff de la propia &Aacute;ngela donde el director llega a unos niveles de dramatismo y de angustia para el espectador muy elevados. En esta &uacute;ltima escena es curioso la cantidad de iron&iacute;a que les ponen ambos protagonistas (asesino y v&iacute;ctima) a la situaci&oacute;n, como si fuera algo normal, de la vida cotidiana, vaya.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">El resto de las escenas de la pel&iacute;cula se podr&iacute;a dividir en dos partes. En la primera que se desarrolla en las aulas de la facultad, en casa de &Aacute;ngela (fondos claros) y en la casa de Chema (de aspecto muy sombr&iacute;o, como todos los gustos del &quot;chaval&quot; ) y la segunda que accede a los s&oacute;tanos de la facultad, en la videoteca y en casa del asesino, con un grado de oscuridad muy elevado en todas las escenas, para darle m&aacute;s dramatismo, si cabe, a todo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Muy a destacar son las actuaciones de Ana Torrent como &Aacute;ngela, donde su actuaci&oacute;n marca todav&iacute;a m&aacute;s esa sensaci&oacute;n de angustia, de estarte metiendo en la boca del lobo, sin ninguna garant&iacute;a, y de miedo ante lo que va a descubrir. Otra gran actuaci&oacute;n es la de Fele Mart&iacute;nez, como Chema, chaval de gustos t&eacute;tricos y oscuros que da m&aacute;s &quot;morbo&quot; a toda la actuaci&oacute;n. Eduardo Noriega, como el asesino, que es un chivo pijo de clase alta, creido y pretendiente de  &Aacute;ngela. Este hecho es el que adem&aacute;s, pone la &quot;guinda&quot; a toda la situaci&oacute;n ya que no es precisamente un psic&oacute;pata sino todo lo contrario.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por &uacute;ltimo comentar que la pel&iacute;cula fue ganadora de 7 premios Goya:  mejor pel&iacute;cula, mejor director novel (Alejandro Amen&aacute;bar), mejor gui&oacute;n original (Alejandro Amen&aacute;bar), mejor actor revelaci&oacute;n (Fele Mart&iacute;nez), mejor direcci&oacute;n de producci&oacute;n (Emilio Otegui), mejor montaje (Mª Elena S. de Rozas) y mejor sonido (Alejandro Amen&aacute;bar y Mariano Mar&iacute;n).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Destacan tambi&eacute;n cr&iacute;ticas recibidas como: &quot;Una pel&iacute;cula sorprendente que rebosa cine y talento...&quot; [ABC]; &quot;Un thriller intenso y perturbador&quot; [El Mundo]; &quot;Un excelente ejercicio de filmaci&oacute;n&quot;. [El Pa&iacute;s].</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Por &uacute;ltimo decir que no est&aacute; recomendada para menores de 18 a&ntilde;os, dura 126 minutos aproximadamente, est&aacute; distribuida por Sogepaq V&iacute;deo y est&aacute; subvencionada por el Ministerio de Cultura.</P></FONT>



<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ocioc.htm"><font FACE="ARIAL"><B>[Crítica de Cine]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


