<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>randes Autores</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mafer@ctv.es">Miguel Angel Fernández "Raistlin".</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">
J.R.R. Tolkien (III): &quot;El Hobbit&quot; (cont.)
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">

<h4>Acertijos en la Oscuridad</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Hab&iacute;amos dejado al pobre Bilbo inconsciente y solo en medio de un oscuro t&uacute;nel. Cuando despert&oacute; no estaba precisamente lleno de optimismo por su situaci&oacute;n pero eso era porque no sab&iacute;a que un gran hallazgo estaba a punto de cambiar el rumbo de los acontecimientos. Mientras a&uacute;n se debat&iacute;a a gatas por incorporarse encontr&oacute; un peque&ntilde;o anillo de metal en el suelo y se lo guard&oacute; en uno de sus bolsillos. Era, por supuesto, el Anillo Regente creado por Sauron y que contaba con gran parte de su poder.</P>

<table width=210 align="right">
<td><center><img src="jpg/tkhob03.jpg" ></center></td>
<tr>
<td><center><FONT color="#000000" face=Arial size=1>Gollum tal como lo imagin&oacute; Nicholas Bayrachny, uno de los ilustradores de Tolkien menos conocidos pero de indudable talento</font></center></td>
</table>

<P ALIGN="JUSTIFY">En su deambular a oscuras, Bilbo pronto lleg&oacute; a un lago subterr&aacute;neo donde tuvo un extra&ntilde;o encuentro con Gollum, una desgraciada criatura que, "esclavizada" por el poder del anillo —del que hab&iacute;a sido el anterior propietario—, se hab&iacute;a recluido en tan solitario lugar. Con Gollum disput&oacute; Bilbo una muy particular competici&oacute;n de adivinanzas con su vida en juego y de la que sali&oacute; vencedor. Pero Gollum quer&iacute;a recuperar su anillo y, sospechando que el hobbit lo ten&iacute;a, intent&oacute; asesinarlo. Por fortuna Bilbo hizo uso del anillo y, al volverse invisible pudo escapar de las iras de la criatura y seguirla hasta la salida.</P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Gollum es un personaje ciertamente peculiar  y que tendr&aacute; un papel fundamental en la historia que se desarrolla en "El Se&ntilde;or de los Anillos". Tiene unos enormes ojos en una cabeza tambi&eacute;n desproporcionada con respecto al cuerpo, miembros delgados y garras casi prensiles. Sin embargo se intuye que, en principio, Gollum era un hobbit al que el poder del anillo corrompi&oacute; no solo espiritualmente sino tambi&eacute;n en lo f&iacute;sico, hasta llevarle a su desgraciada y solitaria existencia bajo la monta&ntilde;a. Su mayor peculiaridad es su voz sibilante y estridente. Tolkien hace uso, como en &eacute;l es habitual, de tretas ling&uuml;&iacute;sticas para poner esta caracter&iacute;stica de manifiesto de forma magistral. Es una pena que tambi&eacute;n estos detalles se hayan perdido, al menos en parte, en la traducci&oacute;n. El ejemplo m&aacute;s tangible es el doble plural que emplea en palabras como "bolsillos", "manos", "huevos" o "goblins" que aparecen en varias ocasiones como "pocketses", "handses", "eggses" y "goblinses" reforzando la sensaci&oacute;n de siseo de su voz, como en este pasaje:</P>

<I><P ALIGN="JUSTIFY">"We guesses, precious, only guesses. We can't know till we find the nassty creature and squeezes it. But it doesn't know what the present can do, does it? It'll just keep it in its pocketses. […] The goblinses will catch it then."</P></I>

<H4>Lobos, águilas, osos y arañas</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Como acabo de relatar Bilbo consigui&oacute;, gracias al anillo, escapar no s&oacute;lo de Gollum sino tambi&eacute;n de los goblins. Al poco encontr&oacute; a sus amigos y les dio un buen susto gracias a su invisibilidad, aunque del anillo no les dijo nada por el momento. Pero no fue este el final de sus problemas, ni mucho menos. Pronto fueron cercados en el bosque por una manada de lobos salvajes —wargos para ser m&aacute;s exactos—. Estos lobos eran aliados de los goblins y parec&iacute;a que hab&iacute;an salido de un gran problema para caer en otro a&uacute;n peor.</P>

<P ALIGN="JUSTIFY">En su ayuda acudi&oacute; el Se&ntilde;or de las Aguilas con varios de sus cong&eacute;neres. Tom&aacute;ndolos con sus garras remontaron el vuelo poni&eacute;ndolos a salvo en el &uacute;ltimo momento, ya que los goblins hab&iacute;an prendido fuego a los &aacute;rboles en los que se hab&iacute;an refugiado huyendo de los wargos. Siguieron camino hasta los dominios de Beorn, un personaje bastante peculiar con la habilidad de transformarse en un enorme oso, de quien recibieron ayuda tras relatarle los avatares de su viaje.</P>
<P ALIGN="JUSTIFY">Tras reponerse durante unos d&iacute;as los aventureros emprenden camino hacia el Bosque Negro, el cual tendr&aacute;n que cruzar si quieren llegar a su destino. El peligro que este bosque encierra no es un aliciente para ellos sobre todo si tenemos en cuenta que el mago Gandalf les abandona temporalmente para "atender otros asuntos urgentes". Muchas aventuras corrieron en este bosque, en las cuales Bilbo nuevamente vino a demostrar sus recursos en los momentos m&aacute;s desesperados. De todas ellas la m&aacute;s peligrosa fue la lucha con las enormes ara&ntilde;as que habitaban el bosque.</P>

<P ALIGN="JUSTIFY">Aqu&iacute; voy a hacer otro peque&ntilde;o inciso para comentar un nuevo detalle de tema ling&uuml;&iacute;stico. El nombre original en ingl&eacute;s del Bosque Negro es "Mirkwood". Si buscamos en el diccionario la palabra "mirk" o "murk" encontramos que su significado es "oscuridad" o "lobreguez". Se me ocurre que si Tolkien hubiese querido llamarlo el Bosque Negro habr&iacute;a empleado la palabra "Blackwood" en lugar de "Mirkwood". Qu&eacute; duda cabe que resulta mucho m&aacute;s inquietante y sugerente esta segunda elecci&oacute;n respecto a la primera, gracias al uso de un vocablo de uso mucho menos corriente. Siguiendo esa idea de Tolkien me inclino por una traducci&oacute;n diferente y el propio diccionario, en su segunda acepci&oacute;n, viene en mi ayuda con una palabra cargada de esa evocaci&oacute;n a la que vengo aludiendo en m&aacute;s de una ocasi&oacute;n: el Bosque L&oacute;brego.</P>
<h4>Barriles en el río</h4>
<table width=249 align="left">
<td><center><img src="jpg/tkhob04.jpg" ></center></td>
<tr>
<td><center><FONT color="#000000" face=Arial size=1>Bilbo y los enanos huyendo r&iacute;o abajo en los barriles de los elfos. Ilustraci&oacute;n del propio J.R.R. Tolkien</font></center></td>
</table>

<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Del Bosque Negro no salieron de forma f&aacute;cil ya que, de las ara&ntilde;as, fueron a parar a manos de los elfos del bosque, que los retuvieron como prisioneros por entrar en sus dominios sin previo aviso. Nuevamente el ingenio de Bilbo, ayudado por los poderes de su anillo, vino a salvar la situaci&oacute;n. Roba a uno de los guardias las llaves de las celdas de sus amigos y escapan escondidos en unos barriles que los elfos mandaban regularmente r&iacute;o abajo como forma de comercio con los humanos de la Ciudad del Lago.</P>

<P ALIGN="JUSTIFY">Los pobres enanos acabaron un poco mojados en el mejor de los casos —y casi ahogados en el peor—, pero todos vivos y a salvo. Fueron calurosamente recibidos en la Ciudad del Lago cuando Thorin Oakenshield… perd&oacute;n, Thorin Escudo de Roble se present&oacute; ante el gobernador de la ciudad como Thorin, hijo de Thrain, hijo de Thror Rey bajo la Monta&ntilde;a que regresaba a sus dominios. La noticia de su llegada pronto corri&oacute; de boca en boca entre los habitantes de la ciudad que recordaron viejas canciones que anunciaban su llegada. A continuaci&oacute;n reproduzco una estrofa original:</P>

<I><P ALIGN="CENTER">"The King beneath the mountains,<BR>
The king of carven stone,<BR>
The lord of silver fountains,<BR>
Shall come into his own!"</P></I>

<P ALIGN="JUSTIFY">No debe enga&ntilde;arnos, no obstante, esta acogida ya que muy feliz qued&oacute; el gobernador cuando, pocos d&iacute;as despu&eacute;s, continuaron camino hacia la Monta&ntilde;a Solitaria. Su presencia en Ciudad del Lago estaba perjudicando sus negocios y su relaci&oacute;n con el Rey de los Elfos del Bosque.</P>

<h4>La puerta secreta, el tesoro y el dragón</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
R&iacute;o arriba fueron los enanos y el hobbit hasta las desoladas estribaciones de la Monta&ntilde;a Solitaria. Muchos d&iacute;as de b&uacute;squeda fueron necesarios pero finalmente encontraron la puerta secreta o, al menos, en lugar donde supon&iacute;an que &eacute;sta se encontraba ya que de la puerta no hab&iacute;a ni rastro. Hasta que un d&iacute;a, con el &uacute;ltimo rayo de sol en la &uacute;ltima luna de oto&ntilde;o, tal como dec&iacute;a el mapa, un enorme y viejo zorzal golpe&oacute; la roca con el pico y el ojo de la cerradura qued&oacute; al descubierto. La llave que Thorin portaba en una cadena alrededor de su cuello funcion&oacute; a la perfecci&oacute;n y la puerta se abri&oacute; para ellos.</P>

<table width=241 align="right">
<td><center><img src="jpg/tkhob05.jpg" ></center></td>
<tr>
<td><center><FONT color="#000000" face=Arial size=1>Bilbo espiando al drag&oacute;n Smaug, que duerme recostado sobre su tesoro. Ilustraci&oacute;n de la edici&oacute;n portuguesa de 1962</font></center></td>
</table>

<P ALIGN="JUSTIFY">De las aventuras que el pobre hobbit tuvo que afrontar, penetrando por el oscuro t&uacute;nel hasta la guarida del drag&oacute;n Smaug, nada puedo decir pues no hay palabras que describan con justicia la valent&iacute;a que Bilbo demostr&oacute; en tan peligroso trance. Lo cierto es que el tesoro de los enanos estaba all&iacute; y era de una magnificencia tal que la mente no llegaba a abarcarlo, pero su nuevo due&ntilde;o no estaba ni mucho menos dispuesto a cederlo f&aacute;cilmente.</P>

<P ALIGN="JUSTIFY">De la conversaci&oacute;n que hobbit y drag&oacute;n mantuvieron poco queda escrito, salvo lo que el propio Bilbo pudo recordar despu&eacute;s y relat&oacute; a sus camaradas. Pero enga&ntilde;ar a un drag&oacute;n no es tarea sencilla, ni siquiera para alguien de los recursos de Bilbo Bols&oacute;n, de Bols&oacute;n Cerrado bajo la Colina. La furia de Smaug no tiene parang&oacute;n con nada que pod&aacute;is imaginar y, como resultado, los compa&ntilde;eros quedaron atrapados en el interior de la monta&ntilde;a, sin muchas esperanzas de escapar. Ten&iacute;an un inmenso tesoro a su alcance pero, ¿de qu&eacute; les servir&iacute;a si no pod&iacute;an salir de all&iacute;?</P>

<P ALIGN="JUSTIFY">El desenlace de esta aventura no lo voy a desvelar aqu&iacute;, ya que arruinar&iacute;a toda la diversi&oacute;n a quien est&eacute; leyendo este art&iacute;culo y a&uacute;n no sepa como acab&oacute; todo. Si los compa&ntilde;eros pudieron escapar o no y qu&eacute; fue del drag&oacute;n Smaug no lo sabr&eacute;is sin leer el libro por vosotros mismos, aunque seguro que pod&eacute;is imaginarlo si hac&eacute;is un peque&ntilde;o esfuerzo. Pero una cosa s&iacute; es cierta y es que Bilbo Bols&oacute;n sali&oacute; con bien del trance puesto que sabemos que disfrut&oacute; de una larga vida por los relatos posteriores, de los cuales el m&aacute;s importante es el que se cuenta en "El Se&ntilde;or de los Anillos". Pero si Thorin Escudo de Roble volvi&oacute; a ocupar el trono bajo la monta&ntilde;a, si Gandalf volvi&oacute; a aparecer en el momento m&aacute;s propicio, si Bofur, Bifur o Bombur, Oin o Gloin, Dwalin o Balin, Fili o Kili o cualquiera de los otros enanos tuvo alg&uacute;n papel destacado en lo que resta de relato, … todo eso no saldr&aacute; de mis labios.</P>

<h4>Conclusión</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
¿Qu&eacute; m&aacute;s se puede decir de un libro tan especial, tan &uacute;nico como El Hobbit? A los ni&ntilde;os les encantar&aacute;, a sus padres les gustar&aacute; a&uacute;n m&aacute;s le&eacute;rselo, a los amantes del g&eacute;nero les enamorar&aacute; y a los indiferentes solamente les recomendar&iacute;a… ¡leedlo! A pocas personas conozco que no les haya gustado este libro y su principal queja es que se aburr&iacute;an de tanto enanito caminando por el bosque… ¡qu&eacute; se le va a hacer! Est&aacute; claro que incluso una joya literaria como esta no siempre gustar&aacute; a todo el mundo pero s&iacute; a la gran mayor&iacute;a. Es todo un compendio de aventura, amistad, simpat&iacute;a, … Muchas veces os encontrar&eacute;is riendo a carcajada limpia ante el relato de lo que est&aacute; sucediendo.</P>

<P ALIGN="JUSTIFY">Quiero finalizar con las palabras del propio Tolkien, procedentes de una carta escrita en 1951 en la que resume el tema central del hobbit desde su punto de vista. ¿Qui&eacute;n mejor que el propio autor para resumir su obra?</P>

<I><P ALIGN="JUSTIFY">"[El Hobbit] es en realidad el estudio de un hombre del todo corriente que no es artista, ni noble, ni heroico (aunque en &eacute;l lleva dormida la semilla de esas cualidades) en un marco grandioso; y de hecho (como lo observ&oacute; un cr&iacute;tico) el tono y el estilo cambian con el desarrollo del hobbit, pasando del cuento de hadas a la nobleza y la elevaci&oacute;n, para recaer otra vez luego del regreso."</P></I></FONT>

<FONT FACE="Arial" SIZE=1><P>Fuente:<BR>
"The Hobbit" – Ballantine Books, 1982<BR>
"El Hobbit Anotado" – Ediciones Minotauro, 1990 (Anotado por Douglas A. Anderson)<BR><BR>
Im&aacute;genes:<BR>
Rolozo Tolkien – <a href="http://godzilla.eecs.berkeley.edu/rolozo/" TARGET="_NEW">http://godzilla.eecs.berkeley.edu/rolozo/</a><BR>
"El Hobbit Anotado" – Ediciones Minotauro, 1990 (Anotado por Douglas A. Anderson)</P>
</FONT>

<br>
<FONT FACE="Arial" SIZE=1><P ALIGN="RIGHT"><a href="tolki3a.htm">[Volvamos a la primera hoja …]</a></P>
<BR>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JUNIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ociob.htm"><font FACE="ARIAL"><B>[Grandes Autores]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


