<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">
<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>

<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>G</B></font><FONT color="#000000" size=2 face="arial"><B>randes Autores</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mafer@ctv.es">Miguel Angel Fernández "Raistlin".</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">
J.R.R. Tolkien (III): &quot;El Hobbit&quot;
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<table width=200 align="left">
<td><img src="jpg/tkhob00.jpg" ></td>
<tr>
<td><center><FONT color="#000000" size=1 face=arial>Portada de la edici&oacute;n de bolsillo de &quot;El Hobbit&quot; en ingl&eacute;s, publicada por Ballantine Books</font></center></td>
</table>
<P ALIGN=justify><I>"In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort."</I></P>

<P ALIGN="JUSTIFY">Este p&aacute;rrafo es, casi con seguridad, uno de los m&aacute;s conocidos y repetidos de toda la historia de la literatura de fantas&iacute;a. Como ya habr&eacute;is adivinado, a pesar del idioma, se trata del primer p&aacute;rrafo de "El Hobbit", la obra de Tolkien que dio paso a "El Se&ntilde;or de los Anillos". Lo que quiz&aacute;s muchos no sabr&eacute;is es que fue inicialmente concebida como un cuento para sus hijos y que, en el momento de escribirla, Tolkien distaba mucho de haber concebido en su imaginaci&oacute;n todos los acontecimientos que se sucedieron en el tiempo a los relatados en "El Hobbit". Tanto es as&iacute; que, tras la publicaci&oacute;n de "El Se&ntilde;or de los Anillos" el texto de "El Hobbit" tuvo que ser revisado y modificado en algunos pasajes para adaptarse a los necesarios cambios introducidos por la evoluci&oacute;n de la historia.</P>

<P ALIGN="JUSTIFY">El ejemplo m&aacute;s claro de estas modificaciones es el cap&iacute;tulo en el que Bilbo Bols&oacute;n (¿sab&iacute;ais que su nombre original es Bilbo Baggins en ingl&eacute;s?) vence a Gollum en el concurso de acertijos y se queda con el anillo. En la primera edici&oacute;n Tolkien simplemente concibi&oacute; dicho anillo como una joya con ciertos poderes m&aacute;gicos que Gollum ten&iacute;a la intenci&oacute;n de ceder sin demasiada reticencia a Bilbo tras la competici&oacute;n. No fue hasta mucho despu&eacute;s que dicho anillo se convirti&oacute; en el Anillo Unico de Sauron, objeto capaz de atrapar la voluntad de quien lo usara y atraerlo hacia el mal. Esta nueva identidad del anillo oblig&oacute; a reescribir el cap&iacute;tulo tal y como lo conocemos en la actualidad, donde Gollum intenta asesinar a Bilbo para recuperar su "preciosso", su "regalo de cumplea&ntilde;os".</P>

<h4>A vueltas con el idioma</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
A estas alturas del art&iacute;culo todav&iacute;a os estar&eacute;is preguntando una cosa: ¿a qu&eacute; viene el p&aacute;rrafo de introducci&oacute;n en ingl&eacute;s? Lo cierto es que no tengo una respuesta definida para esta pregunta. Quiz&aacute;s se deba a mi admiraci&oacute;n, ya reconocida en anteriores art&iacute;culos de la serie, por Tolkien y su dominio del lenguaje. Tal vez con el prop&oacute;sito de conseguir interesar a alguno de vosotros en la lectura de sus textos sin intermediarios, tal y como salieron de su pluma. Porque para traducir a un genio de la literatura hace falta mucho m&aacute;s que el dominio de dos idiomas y, a&uacute;n en el mejor de los casos, no todo es traducible y gran parte de la "sensaci&oacute;n" que transmite el original se pierde con el cambio.</P>

<P ALIGN="JUSTIFY">No puedo resistirme a ofrecer, desde mi m&aacute;s profundo respeto a Tolkien, un peque&ntilde;o estudio de traducci&oacute;n sobre este primer p&aacute;rrafo de "El Hobbit" en el que espero poderos transmitir la dificultad de la tarea y el por qu&eacute; de mi continua recomendaci&oacute;n sobre la lectura original. La traducci&oacute;n es un tanto "libre" y presenta ciertas diferencias con la traducci&oacute;n "oficial" al castellano realizada por Manuel Figueroa para Ediciones Minotauro.</P>

<I><P ALIGN="JUSTIFY">"En un agujero en la tierra, viv&iacute;a un hobbit. No un agujero nauseabundo, sucio y h&uacute;medo, repleto de restos de gusanos y con olor cenagoso; ni siquiera un agujero seco, sencillo y arenoso, sin nada en &eacute;l para sentarse o para comer: era un agujero hobbit, y eso significa comodidad."</P></I>

<P ALIGN="JUSTIFY">Es sabido que Tolkien gustaba de dar un "sabor arcaico" a su prosa, precisamente con el prop&oacute;sito de ambientar adecuadamente sus relatos. Incluso en "El Hobbit", orientado a un p&uacute;blico infantil, se siente esta influencia de forma notable. Tratando de mantener ese mismo tono, la sonoridad y capacidad de evocaci&oacute;n de palabras como "nauseabundo" y "cenagoso" me parece m&aacute;s adecuada que las oficiales "repugnante" y "fango", aunque en el segundo caso no encuentro ninguna palabra en castellano que sustituya satisfactoriamente a "oozy". Tambi&eacute;n prefiero traducir "ground" por "tierra" en lugar de por "suelo", ya que este &uacute;ltimo tiene unas connotaciones de "superficie artificial" que no me acaban de encajar con el ambiente de La Comarca, mientras que "tierra" me parece un t&eacute;rmino m&aacute;s ligado a la naturaleza y, por tanto, m&aacute;s apropiado.</P>

<P ALIGN="JUSTIFY">Podr&iacute;a seguir as&iacute; durante p&aacute;rrafos y p&aacute;rrafos, horas y horas, hasta llegar a la &uacute;ltima p&aacute;gina del libro. Y no habr&iacute;a labor que m&aacute;s me agradase que poder ofrecer al mundo mi propia y modesta "visi&oacute;n" —m&aacute;s que traducci&oacute;n— de la obra de este hombre de talento singular. Quiz&aacute;s alg&uacute;n d&iacute;a emprenda la tarea pero eso no ser&iacute;a sin adquirir antes profundos conocimientos de filolog&iacute;a anglosajona que actualmente, y por desgracia, no poseo.</P>
<P ALIGN="JUSTIFY">Bueno, ya est&aacute; bien de hablar del idioma. Si es que a&uacute;n hay alguien despierto entre la audiencia os invito a todos los pacientes lectores que sig&aacute;is conmigo a penetrar en el fascinante mundo de los hobbits.</P>

<table width="247" align="right">
<td><img src="gif/tkhob01.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Representaci&oacute;n de Bilbo y Gandalf en la puerta de Bols&oacute;n Cerrado tomada de una edici&oacute;n portuguesa del a&ntilde;o 1962</center></font></td> 
</table>

<h4>Pero, ¿qué es un Hobbit?</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Seg&uacute;n la descripci&oacute;n del propio Tolkien, los hobbits son gente peque&ntilde;a, aproximadamente la mitad de nuestra estatura, lo que quiere decir que son incluso m&aacute;s bajos que los enanos, de los que tambi&eacute;n se diferencian por ser barbilampi&ntilde;os. Les gusta la paz y la quietud y la buena tierra cultivada. Les disgustan las m&aacute;quinas pero son h&aacute;biles con las herramientas. Son &aacute;giles mas no les gusta apresurarse. Sus ojos son vivos y sus orejas ligeramente puntiagudas, aunque menos que las de los elfos. Tienen cierta tendencia a engordar y les gusta la ropa de colores llamativos, aunque casi nunca llevan calzado, ya que la planta de sus pies es de piel gruesa y resistente y el empeine est&aacute; cubierto de un pelo denso y rizado. Les encanta re&iacute;r y, sobre todo, comer, lo que hacen con tanta frecuencia como pueden. Con estas caracter&iacute;sticas, no es de extra&ntilde;ar que adoren las fiestas y los regalos, tanto hacerlos como recibirlos. El protagonista de "El Hobbit", sin embargo, pronto va a descubrir que la paz y la tranquilidad que disfrutaba van a verse truncadas por una visita inesperada que le conducir&aacute; a multitud de aventuras y peligros.</P>

<h4>Una visita inesperada</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Si alguien a&uacute;n dudaba que "El Hobbit" sea fundamentalmente un cuento para ni&ntilde;os, tras leer el primer cap&iacute;tulo es probable que cambie de opini&oacute;n. ¿De qu&eacute; otra forma podr&iacute;a ser? El hilarante relato de la reuni&oacute;n de enanos en casa del pobre Bilbo no deja lugar a dudas. Y los nombres de los protagonistas refuerzan esta impresi&oacute;n: Dwalin, Balin, Kili, Fili, Dori, Nori, Ori, Oin, Gloin, Bifur, Bofur y Bombur. Nada menos que una docena de enanos, sin contar a Thorin Escudo de Roble —Thorin Oakenshield en ingl&eacute;s—, cuyos nombres riman por parejas y tr&iacute;os, peculiaridad de la que se servir&aacute; Tolkien en todo momento en su narraci&oacute;n para aligerar la prosa y hacer el relato m&aacute;s divertido.</P>

<P ALIGN="JUSTIFY">Las continuas canciones y versos que pueblan el relato tambi&eacute;n ayudan a incrementar la sensaci&oacute;n de cuento para ni&ntilde;os. Pero cuidado, no malinterpret&eacute;is mis palabras: cualquier adulto que conserve un m&iacute;nimo de esp&iacute;ritu juvenil encontrar&aacute; este libro fascinante, refrescante, divertido y merecedor de una o varias lecturas. El trabajo de traducci&oacute;n de estas canciones es, si cabe, mucho m&aacute;s dificultoso que el resto; tratar de mantener las rimas y la "melod&iacute;a" es pr&aacute;cticamente imposible. Para muestra la primera estrofa original de la canci&oacute;n que cantan los enanos en casa de Bilbo:</P>

<I><P ALIGN="CENTER">"Chip the glasses and crack the plates!<BR>
Blunt the knives and bend the forks!<BR>
That's what Bilbo Baggins hates!<BR>
Smash the bottles and burn the corks!"</P></I>

<P ALIGN="JUSTIFY">En este primer cap&iacute;tulo, Bilbo recibe la visita del mago Gandalf y, a partir de ese momento, todo empieza a complicarse. Pronto se encuentra con m&aacute;s de una docena de enanos tomando el t&eacute; en su c&oacute;modo agujero hobbit y poni&eacute;ndolo todo patas arriba. Le hablan de recuperar un tesoro protegido por el drag&oacute;n Smaug y le piden su ayuda. Incluso tienen un mapa del supuesto tesoro que persiguen, dibujado por un enano llamado Thror, el abuelo de Thorin. A la ma&ntilde;ana siguiente a tan extra&ntilde;a fiesta se encuentra, sin comerlo ni beberlo, metido en la que ser&aacute; la mayor aventura de su vida. ¡Y los hobbits odian las aventuras! Al menos la mayor&iacute;a de los hobbits lo hacen…</P>

<h4>DE Bolsón Cerrado a Rivendel</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Tras un inicio de viaje bastante tranquilo, pronto los enanos y el hobbit se encuentran en su primer aprieto cuando tropiezan con unos trolls en el camino. Gandalf llega justo a tiempo para evitar que sean cocinados y, mediante h&aacute;bil enga&ntilde;o, consigue entretener a los trolls hasta el amanecer, convierti&eacute;ndose &eacute;stos en estatuas de piedra al recibir la luz del sol.</P>

<P ALIGN="JUSTIFY">Los aventureros prosiguen su camino y se adentran en las primeras estribaciones de las Monta&ntilde;as Nubladas camino del valle de Rivendel. All&iacute; les esperaba el semielfo Elrond en la Ultima Morada, donde descansaron por un tiempo antes de continuar. Gracias a los conocimientos de Elrond descubren que las espadas que hab&iacute;an encontrado en la guarida de los trolls no eran otras que Orcrist y Glamdring, fabricadas por los Altos Elfos del Oeste en tiempos antiguos.</P>

<P ALIGN="JUSTIFY">Elrond descubre tambi&eacute;n unas runas lunares en el mapa que portan y las lee para ellos. El mapa que muestro a continuaci&oacute;n nunca ha sido traducido, que yo sepa, al castellano por lo que las runas contienen el texto original en ingl&eacute;s:</P>

<I><P ALIGN="CENTER">"Stand by the grey stone when the thrush knocks,<BR>
and the setting sun with the last light of Durin's Day<BR>
will shine upon the key-hole."</P></I>

<BR>
<center><table width="247">
<td><img src="gif/tkhob02.gif"></TD> 
<TR> 
<TD><font size=1 face=arial><center>Imagen del Mapa de Thror, que los enanos portaban para guiarse en su aventura, con las runas lunares visibles en el centro</center></font></td> 
</table></center>

<h4>Problemas con los Goblins</h4>
<P ALIGN="JUSTIFY"><FONT color="#000000" size=2 face="arial">
Tras abandonar la Ultima Morada, los enanos, el hobbit y el mago contin&uacute;an viaje a trav&eacute;s de las peligrosas Monta&ntilde;as Nubladas. Una noche de terrible tormenta se refugiaron en una cueva aparentemente deshabitada pero pronto la realidad se encarg&oacute; de demostrar lo contrario. Unos goblins los capturaron a todos menos a Gandalf y se los llevaron, encadenados, al interior de su guarida bajo las monta&ntilde;as.</P>

<P ALIGN="JUSTIFY">Nuevamente el mago lleg&oacute; en el momento justo. Con la ayuda de su magia y de las espadas Orcrist y Glamdring, dio muerte al Gran Goblin y a muchos otros de los suyos. Emprendieron entonces la huida por los t&uacute;neles hacia el interior de la monta&ntilde;a perseguidos por el resto de los iracundos goblins y, en la confrontaci&oacute;n, el pobre Bilbo qued&oacute; abandonado inconsciente sin que nadie notase su falta.</P>

<P ALIGN="JUSTIFY">Y hablando de problemas con los goblins, yo tambi&eacute;n tengo uno. La traducci&oacute;n habitual de "goblin" al castellano es "trasgo". Al menos en las obras de Tolkien &eacute;sta ha sido la norma. Pero no acaba de parecerme una traducci&oacute;n adecuada, aunque esto es una opini&oacute;n muy personal probablemente influenciada por las mitolog&iacute;as locales de origen celta. Se supone que los goblins son seres malvados, de estatura aproximadamente humana y que van siempre en grupos numerosos. Sin embargo no puedo dejar de imaginar a un trasgo como un ser peque&ntilde;ito, a lo sumo travieso pero nunca perverso, que gusta de gastar bromas y vagabundear en solitario por los bosques. Por este motivo he decidido mantener la palabra goblin en este art&iacute;culo. El propio Tolkien abandon&oacute; su denominaci&oacute;n y, en "El Se&ntilde;or de los Anillos", se refiere a estos seres con la palabra "orc", que fue acertadamente traducida por "orco".</P>

</FONT><FONT FACE="Arial" SIZE=1><P ALIGN="RIGHT"><a href="tolki3b.htm">[Quiero saber m&aacute;s cosas acerca de "El Hobbit"…]</a></P>

</BODY>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>
<A HREF="ociob.htm"><font FACE="ARIAL"><B>[Grandes Autores]</B></font></a> 

</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>


