<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:dgarcfer@iees.es">David García "Gato".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Tombraider II.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> EIDOS.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Proein.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Arcade 3D.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 65%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<P ALIGN="JUSTIFY">
<FONT color="#000000" size=2 face=arial><p align="justify">

El verano pasado lleg&oacute; a mis manos el Tomb Raider. Al principio no le hice mucho caso, pero enseguida me enganch&oacute; por su originalidad y entretenimiento. Ahora &eacute;ste espl&eacute;ndido juego se renueva con una segunda parte prometedora, el Tomb Raider II, y ha ca&iacute;do en mi poder hace unos d&iacute;as. Veamos lo que nos espera en el TR-II. </P>
<P ALIGN="JUSTIFY">

<table align="right">
<td><IMG SRC="jpg/tomb1.jpg"></td>
</table>
<P ALIGN="JUSTIFY">

Esta vez, la aventurera Lara Croft, deber&aacute; encontrar una daga que concede la inmortalidad a su poseedor, pero no es la &uacute;nica interesada en el m&aacute;gico artefacto...</P>
<P ALIGN="JUSTIFY">De la fant&aacute;stica primera parte a esta secuela, la mayor innovaci&oacute;n es la mejora de los gr&aacute;ficos. Desgraciadamente necesitar&aacute;s de una aceleradora 3D para disfrutar del TR-II en todo su esplendor, en caso contrario no se ve mucha diferencia con la primera parte. Pero no vale una aceleradora sin m&aacute;s, deber&aacute;s disponer de 4Mg de RAM en tu tarjeta gr&aacute;fica para ver el juego en una buena definici&oacute;n, y de un potente ordenador, como Pentium 200 MMX &oacute; un Pentium II. Dispone el programa de un men&uacute; donde podremos controlar todos los par&aacute;metros gr&aacute;ficos y de sonido. Aqu&iacute; encontramos una opci&oacute;n llamada &quot;Dither&quot; que elimina los molestos cuadritos que forman los gr&aacute;ficos del escenario consiguiendo una calidad gr&aacute;fica muy superior, pero a base de &quot;comerse&quot; memoria y CPU hasta atragantar a tu ordenador. A parte de este &quot;defectillo&quot; que supone el necesitar un buen trasto para ejecutar el TR-II veremos que las texturas con las que se mapean todos los objetos del juego, y que tan buenos resultados consigue, no funcionan bien con ciertas tarjetas gr&aacute;ficas, como las populares Virge DX y GX.</P>

<table align="left">
<td><IMG SRC="jpg/tomb2.jpg"></td>
</table>
<P ALIGN="JUSTIFY">


Respecto al juego en si mismo, se ha mejorado a Lara, la protagonista, animando su coleta y d&aacute;ndole diferentes vestidos dependiendo del lugar donde est&eacute;. Se le han a&ntilde;adido nuevos movimientos, como escalar y conducir lanchas, y se ha ampliado mucho el n&uacute;mero de enemigos que nos encontraremos. As&iacute; podremos tener desagradables encuentros con skinheads, mafiosos, perros, enormes tiburones, ara&ntilde;as, ratas, tigres... y un sinf&iacute;n de bichos parecidos. Todos ellos mapeados con texturas y con mucha mala leche. </P>
<P ALIGN="JUSTIFY">Otra de las novedades del juego a sido el tutorial. Ya s&eacute; que en la primera parte ya se pod&iacute;a encontrar, pero ahora se ha programado toda la casa de Lara, al completo, con jardines incluidos. Podremos visitar desde el ba&ntilde;o de su habitaci&oacute;n hasta la cocina, todo  esto acompa&ntilde;ados del anciano mayordomo de Lara, que nos persigue con un refrigerio para cuando decidamos descansar...</P>
<P ALIGN="JUSTIFY">Si en la primera parte con las impresionantes animaciones iniciales se desvelaba perfectamente la trama, ahora son peores y no se entera uno de nada. Lara salta de un lugar a otro sin sentido, pasando de China a Venecia por la buenas, como si tropezase y cayese por casualidad en la ciudad italiana (un tir&oacute;n de orejas a Eidos por esto). Despu&eacute;s de &quot;teletransportarse&quot; nuestra hero&iacute;na hasta Europa comienza su aventura en una Venecia dominada por la mafia. Los gr&aacute;ficos de la ciudad son espl&eacute;ndidos y destaca el hecho de que siempre nos movamos por los mismos edificios, aunque pasemos de fase, de tal manera que desde una ventana podamos ver los callejones por los que nos movimos en fases anteriores o por los que nos moveremos m&aacute;s adelante. Nada m&aacute;s iniciar nuestras peripecias notaremos algo que, a mi parecer, desluce mucho este juego, el considerable aumento de dificultad respecto al Tomb Raider I (&oacute; puede que sea yo m&aacute;s torpe que hace un a&ntilde;o). Tras salir de Venecia volaremos, escondidos en un avi&oacute;n de la mafia, hasta una plataforma petrol&iacute;fera. Sin saber muy bien c&oacute;mo, despertaremos encerrados y desarmados en su interior (¿y c&oacute;mo es que somos atrapados? ¿otro teletransporte de Lara, esta vez a una celda? Otro fallo por parte de Eidos en la trama). As&iacute; seguiremos por diversos lugares, como el T&iacute;bet y un barco hundido en el fondo del mar.</P>
<P ALIGN="JUSTIFY">
<table align="right">
<td><IMG SRC="jpg/tomb3.jpg"></td>
</table>
<P ALIGN="JUSTIFY">


El ambiente de cada una de las fases est&aacute; muy conseguido, mucho mejor que en la primera parte, y la diversidad de ambientes y situaciones hacen que el TR-II no se quede solo en una copia de la primera parte. Pero no esper&eacute;is encontrar nada fuera de lo normal en el TR-II ni grandes novedades respecto al primer t&iacute;tulo de la serie.</P>
<P ALIGN="JUSTIFY">No hay mucho m&aacute;s que contar del Tomb Raider II. Si eres un apasionado de Lara, seguro que te  encantar&aacute; esta doble raci&oacute;n de la asaltatumbas por excelencia, por lo que te lo recomiendo. Si no conoces la primera entrega te aconsejo que la consigas antes de jugar al TR-II para compararla t&uacute; mismo. Y si eres, como yo, un jugador espor&aacute;dico, sin m&aacute;s, no ver&aacute;s ning&uacute;n atractivo, a parte de los gr&aacute;ficos, en este juego de ordenador, que al principio puede atraerte, pero al ir pasando fases se vuelve mon&oacute;tono y aburrido.</P>
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadeb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

