<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>A</B></font><FONT color="#000000" size=7 face="arial"><B>rcade Total</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:caramon@interlink.es">Carlos Pérez-Gándaras "Caramon".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<br><br><br><br>
<P align="justify">

<FONT color="#000000">
<P align="justify">
<HR>
<font FACE ="ARIAL" size="3"><b>Título:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Unreal.</b></font><br>
<HR>
<font FACE ="ARIAL" size="3"><b>Compañía:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Epic.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Distribuidora:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> GT Interactive.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Género:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Arcade 3D.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Idioma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Inglés.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Plataforma:</b></font>
<font FACE ="ARIAL" size=3 color="#008800"><B> Windows 95.</b></font><br>
<font FACE ="ARIAL" size="3"><b>Nota:</b></font>
<font FACE ="ARIAL" size=3 color="#FF0000"><B> 88%.</b></font>
<HR>

<BR>
<BR>

<FONT color="#000000">

<P ALIGN="JUSTIFY">

<table align="left">
<td><img src="jpg/punreal.jpg" ></td>
</table>
<FONT color="#000000" size=2 face=arial><p align="justify">

El esperado Unreal est&aacute; por fin aqu&iacute;.
Tras a&ntilde;os de retrasos, los chicos de Epic han conseguido que tengan
que tragarse sus palabras los incr&eacute;dulos que pensaban que una compa&ntilde;&iacute;a
que programaba casi exclusivamente pinballs no era capaz de hacer un First
Person Shooter. &iexcl;Y vaya un FPS!. Unreal iba a ser un juego que iba
a aprovechar el fil&oacute;n reci&eacute;n abierto por Doom, pero lo cierto
es que no s&oacute;lo Quake, sino Quake 2 y algunos otros juegos del sector
acabaron saliendo antes. Los programadores de Unreal tuvieron varias oportunidades
de sacar el juego y hacer caja, pero prefirieron esperar a estar contentos
antes de lanzarlo. &iquest;Ha merecido la pena la espera?.
<P ALIGN=JUSTIFY><B>Argumento</B>: Aunque el argumento de entrada no es demasiado bueno,
se desenvuelve realmente bien a lo largo del juego. Viajamos como prisioneros
a bordo de la nave Vortex Rikers, cuando esta es atrapada por el campo
gravitatorio de un planeta. Con el tortazo la nave pierde la mayor parte
de los sistemas, entre ellos el que nos mantiene prisioneros. Por un vez
no se recurre al t&oacute;pico de que "eres el &uacute;nico superviviente",
aunque lo cierto es que pocos humanos m&aacute;s veremos. Lo que si veremos
principalmente son los componentes de otras dos razas alien&iacute;genas:
los Skaarj y los Nali. Los Nali son los pac&iacute;ficos habitantes del
planeta, seres muy religiosos con 4 brazos que, curiosamente recuerdan
a Dhalsim (Street Fighter 2 ;). Los Skaarj son unos aliens que, como nosotros,
han quedado atrapados por el planeta, s&oacute;lo que ellos han aprovechado
para montar la juerga. A lo largo de los niveles, los Nali nos echar&aacute;n
una pata de vez en cuando, mostr&aacute;ndonos lugares secretos u objetos,
aunque habr&aacute; que ir con cuidado, pues muchas veces un bicho que
ande cerca se lo fundir&aacute; antes de que nos ayude.
<P ALIGN=JUSTIFY><table align="right"><td><img src="jpg/unre1.jpg"></td></table><P ALIGN=JUSTIFY><P ALIGN=JUSTIFY>
<B>Gr&aacute;ficos</B>: En este apartado, Unreal se lleva la palma.
Los gr&aacute;ficos de Unreal, incluso en modo Software, son realmente
incre&iacute;bles. Los efectos de luz, ya sean las coronas o los colores,
son incre&iacute;bles, y de lo m&aacute;s realista. El <I>agua</I> y el
<I>fuego</I> tienen su propio engine, lo que los hace de lo m&aacute;s
reales. Los cielos no pueden describirse en un screenshot, ten&eacute;is
que verlos en movimiento. La variedad de texturas es impresionante, y por
una vez tenemos muchos escenarios a cielo abierto, algo que las limitaciones
del engine no permit&iacute;a en otros juegos del sector. Por desgracia,
como pod&eacute;is imaginaros, todo esto no sale gratis. Unreal pide micro
y, sobre todo, memoria. La &uacute;nicas aceleradoras soportadas por el
momento son las basadas en el chip 3Dfx o en el Power VR, aunque desde
Epic prometen que pronto llegar&aacute; el parche para Direct3D que permita
que los poseedores de otras tarjetas aceleren su juego. De cualquier forma,
si no ten&eacute;is al menos (siendo generosos) un P200 y 64 Mb de RAM,
mejor que ampl&iacute;eis de equipo antes de comprar Unreal.
<P ALIGN=JUSTIFY><B>Sonidos y M&uacute;sica</B>: Sonidos. &iexcl;&iexcl;&iexcl;MMX sirve
para algo!!!. Si, por una vez, MMX es algo m&aacute;s que tres letras bonitas
en la car&aacute;tula de la caja. Si vuestro micro es MMX, podr&eacute;is
liberarle de parte de su carga, lo que permitir&aacute; que oig&aacute;is
<P ALIGN=JUSTIFY>sonidos a 22 KHz, en vez de los consabidos 11. Adem&aacute;s, si ten&eacute;is
una tarjeta A3D (Monster Sound, Turtle Beach Montego), adem&aacute;s de
la mejora del sonido, podr&eacute;is disfrutar de sonido Dolby con posicionamiento
digital, es decir, el futuro. Nada de "&iquest;viene por la derecha o por
la izquierda?", podr&eacute;is localizar perfectamente todos los sonidos.
<P ALIGN=JUSTIFY> En cuanto a la m&uacute;sica, la banda sonora de
Unreal viene en formato MOD, por lo que al igual que el sonido, beneficiar&aacute;
mucho su calidad el que teng&aacute;is un MMX. &iquest;Y por qu&eacute;
en formato MOD?, os preguntar&eacute;is. Porque as&iacute; pueden crear
m&uacute;sica din&aacute;mica al estilo del conocido iMuse de LucasArts,
esto es, la m&uacute;sica cambiar&aacute; seg&uacute;n la situaci&oacute;n
en que os encontr&eacute;is. No ten&eacute;is m&aacute;s que encontraros
con un bicho y ver&eacute;is el cambio de ritmo ;).
<P ALIGN=JUSTIFY><table align="left"><td><img src="jpg/unre2.jpg"></td></table><P ALIGN=JUSTIFY>
<P ALIGN=JUSTIFY><B>Jugabilidad</B>: Como siempre en los FPS, dividimos esto en dos subsecciones:
<P ALIGN=JUSTIFY> Single Player, o sea, jugar uno solito. El argumento
est&aacute; trabajado y los niveles est&aacute;n realmente bien dise&ntilde;ados
y no aburren, pues son de lo m&aacute;s variados, pues pasaremos por escenarios
tan variados como la nave en que se estrellaron los Skaarj, un Coliseo
o un poblado Nali. Unreal proporcionar&aacute; muchas horas de juego, m&aacute;s
que nada porque para terminarlo ten&eacute;is que pasar por nada menos
que <B>38</B> niveles. Los enemigos esta vez est&aacute;n mucho mejor programados
que el enemigo medio en un FPS, y dar&aacute;n mucha m&aacute;s guerra,
por su mayor movilidad y su Inteligencia Artificial. No en vano est&aacute;n
programados por un verdadero experto, Steven Polge, conocido por su trabajo
en los Reaper Bots de Quake. La inclusi&oacute;n de los Nali como aliados
hace que tengamos que pensarlo un poco antes de disparar a algo que se
mueve, pues nos est&aacute;bamos convirtiendo en verdaderos Terminators
;). Las armas son originales, algo bastante de agradecer, pues parece que
hasta ahora todo ven&iacute;a cortado por el mismo patr&oacute;n. En definitiva,
un buen trabajo.
<P ALIGN=JUSTIFY> MultiPlayer. Al principio parece que esto va a ser
el bombazo, pero por desgracia falla. A Unreal le falta la tensi&oacute;n
de Quake 2. Aunque Unreal tiene numerosas opciones de DM, como por ejemplo
el DarkMatch (el escenario est&aacute; completamente a oscuras, y cada
jugador lleva una linterna que puede o no usar), lo cierto es que la jugabilidad
no est&aacute; ah&iacute;. Desde Epic, c&oacute;mo no, prometen que con
un parche quedar&aacute; todo arreglado. Una opci&oacute;n muy buena que
trae Unreal es que viene con bots incluidos, una vez m&aacute;s de la mano
de Mr. Polge, que nos ayudar&aacute;n a pulir nuestros reflejos si no tenemos
acceso a Internet o a una red local. En cuanto a los protocolos que soporta,
de momento, s&oacute;lo TCP/IP. Parece que el IPX cada vez impresiona menos.
<br><br>
<center><table><td><img src="jpg/unre3.jpg"></td></table></center>
<br><br>
<P ALIGN=JUSTIFY>
<P ALIGN=JUSTIFY><B>Extensibilidad</B>: Unreal ha sido dise&ntilde;ado con un objetivo
en la cabeza: extensibilidad. Todo en Unreal puede cambiarse. Modelos,
skins, mapas, reglas. Al igual que Quake, Unreal funciona mediante un lenguaje
propio, que sirve para crear nuestras propias variedades de juego. En cuanto
a mapas, Unreal viene con un editor propio, que los dise&ntilde;adores
de niveles adorar&aacute;n aunque sea por una s&oacute;la caracter&iacute;stica:
los mapas de Unreal se crean excavando un gigantesco cubo s&oacute;lido,
y no creando habitaciones en un gran cubo vac&iacute;o. Se acabaron las
grietas que no hab&iacute;a quien encontrara y que fastidiaban vuestros
mapas.
<P ALIGN=JUSTIFY><B>Puntos Negros</B>: El MultiPlayer y alg&uacute;n que otro bug. Todo
esto se arreglar&aacute; con futuros parches, pero mucho me temo que esto
se est&aacute; empezando a convertir en una malsana costumbre con las compa&ntilde;&iacute;as
de juegos, el sacarlo, forrarse, y luego sacar algunos remiendos para que
no se queje la gente. De momento Unreal tiene problemas con los micros
Cyrix y con las tarjetas de sonido Aureal. Le deseamos mejor suerte que
a Quake 2, que aunque sali&oacute; hace 8 meses, todav&iacute;a sigue siendo
parcheado y reparcheado sin que parezca que los chicos de id resuelvan
el problema. Y nosotros cogi&eacute;ndo cada parche a costa de nuestros
bolsillos.
<P ALIGN=JUSTIFY><B>En resumen</B>: Unreal es un buen juego, aunque le falta un poquito
en todos los sentidos, como era de esperar viendo que es el primer juego
de este tipo que programa Epic. Si ten&eacute;is m&aacute;quina suficiente,
no pod&eacute;is perd&eacute;roslo, pues es el primer FPS que veo desde
hace tiempo que logra que no me aburra con el Single Player. En cuanto
al MultiPlayer habr&aacute; que ver qu&eacute; al queda tras los parches.
&iexcl;Nos vemos en Unreal 2!.
<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="arcade.htm"><font FACE="ARIAL"><B>[Arcade Total]</B></font></a> <hR>
<A HREF="arcadeb.htm"><font FACE="ARIAL"><B>[Análisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

