<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:PAKALOLO@santandersupernet.com">José Manuel Hernández "Diablillo".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<FONT color="#000000">        <br><br><br><br>

<H3>Los atributos de nuestro personaje</h3>
<P align="justify">

Los atributos como dec&iacute;a en el anterior artículo, son tres: 
fuerza (strength), destreza (dexterity), e inteligencia (inteligence). 
Como cosa importante os dir&eacute; que existe un limite m&aacute;ximo para subir
 todos los atributos y es de 221 puntos. A medida que os acerqu&eacute;is al 
 limite al subir un atributo os bajara otro y os desesperaréis un poco ya que 
 parece como si se volvieran locos. As&iacute; que tener mucho cuidado con los que 
 no necesit&eacute;is, sobre todo con la destreza, pues son mucho mas importantes 
 la fuerza y la inteligencia.</P>
<P ALIGN="JUSTIFY"></P>
<B><I><P ALIGN="JUSTIFY">La fuerza</B></I> nos da los puntos de Hits del personaje 
(o sea nuestros puntos de vida), as&iacute; como la cantidad de peso que podremos 
llevar y el tipo de armaduras y armas que podremos usar, es por tanto, el atributo 
más importante de todos y tambi&eacute;n el que más cuesta subir. Para que os 
hag&aacute;is una idea la mayoria de las armas hasta 35 o 40 de fuerza no las 
podremos usar. Para llevar casco, gorget (cuello), brazos y guantes plate mail 
necesitaremos 40 de fuerza, pero para llevar la armadura plate mail completa 
hasta 60 de fuerza no podremos.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un truquito para subir la fuerza: lo mejor que 
podr&eacute;is hacer es picar en una mina (subir el skill de mining). 
De esta manera sube muy r&aacute;pido. Un sitio ideal para esto es la ciudad 
minera de Minoc situada al norte de Britannia.</P>
<P ALIGN="JUSTIFY"></P>
<center><IMG SRC="jpg/uo7.jpg"></center>
<B><I><P ALIGN="JUSTIFY">
La destreza</B></I> nos da la stamina del personaje 
(o sea nuestros puntos de energ&iacute;a). Sobre la destreza lo que más 
apreciaréis será la velocidad con la que golpe&aacute;is: a más destreza más 
golpes y en menos tiempo. La verdad es que no sirve para mucho mas. Con 60 o 70
 puntos como m&aacute;ximo estar&eacute;is mas que "sobrados" de ella ya que son 
 mucho más importantes los otros atributos. Como curiosidad os dir&eacute; que 
 al poneros armaduras plate mail la destreza os descender&aacute; un poco, ya que 
 te restarán agilidad (eso sí, los puntos no desaparecen. Al quitaros la armadura 
 volver&aacute;n a subir). Para subir la destreza lo mejor es que os 
 compr&eacute;is un Lute (un instrumento musical, La&uacute;d en espa&ntilde;ol) 
 y os pong&aacute;is a tocar como unos condenados. Aunque os gritarán 
 los dem&aacute;s y desearán mataros por dar el co&ntilde;azo con la 
 m&uacute;sica... ;)</P>
<P ALIGN="JUSTIFY"></P>
<B><I><P ALIGN="JUSTIFY">La inteligencia</B></I> os dar&aacute; los puntos de 
mana del personaje. Es lo mas importante para realizar magia, as&iacute; que si 
quer&eacute;is hacer un mago poderoso vais a necesitar mucha inteligencia. 
Bueno como aclaraci&oacute;n os dir&eacute; que para realizar un hechizo del 
octavo circulo son necesarios 50 puntos de mana, as&iacute; que si no 
quer&eacute;is hacer hechizos del s&eacute;ptimo y octavo circulo 
(tendr&iacute;ais que subir much&iacute;simo el skill de magery para eso) 
y si tenemos en cuenta que para un hechizo del sexto circulo se necesitan 20 puntos
de mana, con 50 puntos de inteligencia tendr&iacute;ais de sobra. 
Para subir la inteligencia no hay nada mejor como subir el skill de spirit 
speak o el de item identification. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si os sirve de ayuda os dir&eacute; que yo en mi 
&uacute;ltimo personaje que cree le di 40 puntos a la fuerza, 15 puntos a la 
inteligencia y 10 puntos a la destreza, (10 puntos es el m&iacute;nimo que tienes 
que darle.</P>
<P ALIGN="JUSTIFY"></P></FONT><FONT color="#000000">
<P ALIGN="JUSTIFY">En el próximo artículo sobre el Ultima On-Line en Macedonia,
hablaremos de un montón de cosas nuevas, entre ellas, los Skills. ¡No vemos!</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

