<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:PAKALOLO@santandersupernet.com">José Manuel Hernández "Diablillo".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<FONT color="#000000">        <br><br><br><br>
<H3>Dónde conseguir Ultima On-Line y cómo instalarlo</H4>
<P align="justify">

Por desgracia nuestra, el juego oficialmente no ha salido en Espa&ntilde;a y aunque he o&iacute;do 
rumores de que Origin lo piensa lanzar pronto, ninguno esta confirmado, 
as&iacute; que o bien esper&aacute;is a que salga, o no os queda otra 
opci&oacute;n que la comprarlo por correo. Yo lo compre a una tienda 
on-line de USA cuya direcci&oacute;n es: <A HREF="http://www.cdmag.com/" target="_new"><FONT FACE="Arial" SIZE=2>http://www.cdmag.com</FONT></A></P>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Pero un amigo lo acaba de conseguir en una casa dedicada a la venta de 
software que se anuncia en varias revistas 
de inform&aacute;tica y que esta en Espa&ntilde;a. Se llama:</P>
<I><P>MEDIA MADRID<BR>
</I>c/Marqu&eacute;s J. Real 22-7º A<BR>
28019 Madrid<BR>
tel&eacute;fono (91) 5698264 <BR>
(91) 4693426 (FAX)</P>
<P ALIGN="JUSTIFY"><BR>
Solo hay que llamar por tel&eacute;fono, hacer el pedido y te lo mandan<BR>
por correo contrarembolso (siempre preguntan si quieres por correo<BR>
urgente pero esta opci&oacute;n es m&aacute;s cara). </P>
<B><P ALIGN="JUSTIFY">NOTA:</B> <I>Yo no tengo intereses en ninguno de 
estos sitios, su nombramiento es puramente informativo. Y no me hago 
responsable de ninguna gesti&oacute;n o problema que pudierais tener 
con ellos, yo sólo indico como conseguir el juego.</P>
</I>
<h4>Y al fin llegó...</h4><P ALIGN="JUSTIFY">
<P ALIGN="JUSTIFY"><table align="left">
<td><img src="gif/uo2.gif" ></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Y nosotros corremos rapidamente, lo desempaquetamos y metemos el cd-rom 
para instalar el juego... Sin embargo, tomaros una pausa que las prisas 
son malas y, sobretodo en este juego, ya que primero habrá que realizar unos 
pasos muy importantes...</P>
<P ALIGN="JUSTIFY">Pasemos a analizar lo que tenemos. El juego viene en una 
caja de un tama&ntilde;o similar a las de otros juegos pero con un anexo que 
es un mapa de tela de Britannia. A&ntilde;adir que el mapa esta muy detallado 
y en él vienen hasta los caminos de toda Britannia as&iacute; que os recomiendo
que lo teng&aacute;is muy a mano porque es un buen elemento de consulta.</P>
<P ALIGN="JUSTIFY">Al abrir la caja nos encontraremos con otra caja de 
cart&oacute;n dentro de la que sobresale el cd-rom del juego.</P>
<P ALIGN="JUSTIFY">Dentro de la citada caja de cart&oacute;n nos esperamos 
encontrar un enorme y detallado manual de instrucciones, sin embargo, de eso nada.... </P>
<P ALIGN="JUSTIFY">Lo &uacute;nico que hay es una gu&iacute;a de 
instalaci&oacute;n peque&ntilde;a y, por supuesto, en inglés (se entiende que 
el juego en teor&iacute;a no ha salido fuera de USA a la venta) y 
tambi&eacute;n (aparte de 2 folletos de propaganda de juegos), hay un mapa de la 
Web de Ultima On-Line en donde se encuentra toda la informaci&oacute;n e 
instrucciones sobre el juego. Un verdadero co&ntilde;azo porque la Web no es 
precisamente de las rapiditas y para hacer, por ejemplo la consulta de los 
hechizos que hay, te puedes tirar perfectamente mas de media hora. 
Finalmente nos en el interior de la caja, una especie de mini instrucciones 
sobre cómo mover el personaje y usar las cosas pero está escrito con una letra 
pesad&iacute;sima y lleno de siglas que, seguro que los guiris las entienden, 
pero yo no, total que ni me lo he le&iacute;do. As&iacute; que, resumiendo, 
con respecto a la documentaci&oacute;n que acompa&ntilde;a al juego le doy a 
Origin un se&ntilde;or suspenso.</P>
<P ALIGN="JUSTIFY">Una vez introducido el CD, aparece la pantalla de 
instalaci&oacute;n del juego, y en ella aparecen dos opciones de:  
la <B>typical</B> y la <B>Advanced</B> de las cuales recomiendo la typical, 
ya que sólo se diferencian en que la advanced posee la opci&oacute;n de 
instalar el navegador (es de suponer que todos tenemos uno) y la 
opci&oacute;n de instalar los drivers DirectX 5.0 (que tambi&eacute;n es de 
suponer que teng&aacute;is instalada). Las dos opci&oacute;nes dan la posibilidad 
de instalar el software de un proveedor de internet que nos regala un mes de 
conexi&oacute;n pero no lo hag&aacute;is ya que es un proveedor americano y no 
estamos en USA... </P>
<P ALIGN="JUSTIFY">As&iacute; escogida una u otra opci&oacute;n acabaréis 
d&aacute;ndole a un bot&oacute;n que pone <B>Install Ultima Online</B>. Una vez 
hecho esto os saldr&aacute; la opci&oacute;n para escoger si dese&aacute;is 
instalar el juego completo que son 500 megas y en la que no necesitaréis el CD 
para jugar. O bien, la opci&oacute;n m&iacute;nima que son 256 megas. </P>
<P ALIGN="JUSTIFY">Aqu&iacute; he de recomendaros la 
instalaci&oacute;n m&aacute;xima, por el principal motivo de que ganaréis en 
jugabilidad. El equipo que recomienda tener Origin para jugar es un 
<I>P166 con 32MB de ram</I>,  aunque pone que funciona en un <I>P133 
con 16MB de ram.</P>
</I><P ALIGN="JUSTIFY">Cuando finalice la instalaci&oacute;n lo siguiente que 
tendr&eacute;is que hacer ser&aacute; el registro en la web de Ultima On-line. 
Para proceder deber&eacute;is dar al bot&oacute;n que pone <B>Setup Account</B> 
(aseguraros de estar conectados a internet y de tener el navegador configurado).
En la p&aacute;gina a la que acceder&eacute;is (</FONT><A HREF="http://www.ultimaonline.com/" target="_new">
<FONT FACE="Arial" SIZE=2>www.ultimaonline.com</FONT></A>
<FONT FACE="Arial" SIZE=2>) tendr&eacute;is que darle a la opci&oacute;n de 
<B>CREATE ACCOUNT</B>, ah&iacute; os pedir&aacute;n el número que aparece 
detr&aacute;s del CD para poder seguir. Despu&eacute;s tendr&eacute;is que 
darle un nombre y un password a vuestra cuenta. Seguidamente deber&eacute;is meter 
vuestros datos personales y os pedir&aacute; un numero de VISA para pagar las mas 
o menos 1000 pts al mes que tendr&eacute;is que pagar por los servicios del 
servidor. Hecho todo esto ya pod&eacute;is cancelar el navegador y darle al 
bot&oacute;n de <B>PLAY ULTIMA ONLINE.</P></B></FONT>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

