<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:PAKALOLO@santandersupernet.com">José Manuel Hernández "Diablillo".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<FONT color="#000000">        <br><br><br><br>
<H3>En tierras de Britannia.</h3>
<P align="justify">

Era una ma&ntilde;ana fr&iacute;a, sent&iacute;a los m&uacute;sculos doloridos 
de tanto picar piedra, y forjar esa espada milenaria (actividad que tendr&iacute;a que 
dejar para otro d&iacute;a porque aún se me resistían algunos 
secretos del oficio del herrero).<br> Me dirig&iacute; al banco y, allí, de 
mi caj&oacute;n privado, cog&iacute; mis armas y armaduras.
¡Al fin mi piel sintió, de nuevo, el contacto con el acero!, me gustaba
esa sensación y, adem&aacute;s, me 
sientía desprotegido y raro sin ella en este mundo unas veces salvaje 
y otras veces tranquilo de Britannia, 
(todav&iacute;a recordaba a ese bandido que 
mate la noche anterior).<br><br> Una vez con mis armas y armadura, me dispuse a 
tomar camino hacia esa ciudad envuelta en canales y que recibía el
nombre de Vesper. Mientras avanzaba por un sendero, pensaba en que
Vesper me resultaba, quizás, un lugar cómodo y seguro, al menos más seguro
que en la ciudad de mineros, esto es, que en Minoc (en la cual había pasado la noche
anterior). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><table align="left">
<td><img src="gif/union.gif" ></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
Tomé el camino que salía del sureste de Minoc para ir a 
Vesper, era un corto camino de un par de leguas hasta Vesper. Para amenizar mi viaje,
clumplí la tradición y me dispuse a tocar una "alegre" melod&iacute;a en mi maltrecho La&uacute;d, 
y, aunque los viajeros no apreciaban mucho mis canciones, me daba igual, arte incomprendido a fin de
cuentas eran todos unos b&aacute;rbaros... </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En breve se alzaron ante mi las primeras 
casas de Vesper, y, cómo no, el banco de la ciudad.<br> <BR>Allí, entre el ajetreo, pude 
vislumbrar sus ropas de color amarillento, ropas que envolv&iacute;an esa armadura 
completa y signo indicativo de su inmensa fuerza. Los dem&aacute;s 
guerreros se apartaban de el y donde el andaba se alejaban todos.<br> El se re&iacute;a 
de ellos, no le importaba, la mitad de los presentes no le habr&iacute;an 
significado ni un ara&ntilde;azo en su imponente armadura y lo único que le hubieran supuesto 
habría sido otra muesca 
en la empu&ntilde;adura de su espada. Su nombre era ATILES.<br><br> Yo me acerqué sin demasiado
temor al caballero. Al instante present&iacute; la maldad en el, ¡era un bastardo!,
 aunque se le ve&iacute;an se&ntilde;as 
en su cara de haber sido algo mucho peor. Sí, en tiempos fue 
un dread lord, un asesino de hombres y sembr&oacute; el terror por 
todos los dungeons de Britannia, ahora comprendo sus risas ante el 
temor de los dem&aacute;s. Si el quisiera matar&iacute;a a 20, pensé, y ni 
siquiera le habr&iacute;an da&ntilde;ado.
<br><br> Me pidi&oacute; que le 
acompa&ntilde;ara a su "humilde morada" en la isla de hielo. Nos 
alejamos del banco y de sus gentes para huir de las vistas de los 
curiosos.<br> En el depósito, esa rara piedra marcada por alg&uacute;n 
mago poderoso en otras épocas inmemoriables, yacía en el suelo. Yo ya las 
conoc&iacute;a y sabía cúales eran las instrucciones.<br> Me despojé de 
mis armas para disponer de mis manos libres, consulte el libro de 
hechizos y pronuncie esas palabras secretas, conocidas por muy 
pocos privilegiados<b>---Por Oak kal---</b> <br><br>Al instante el suelo se desvaneci&oacute;, 
el cielo se convirti&oacute; en una masa borrosa y m&oacute;vil 
donde las nubes pasaban a velocidades incre&iacute;bles, la tierra 
tambi&eacute;n se mov&iacute;a... Durante instantes dislumbr&eacute; 
montes y bosques lejanos, luego el mar en toda su inmensidad
 y de repente todo se paro sentí --- Fr&iacute;o mucho fr&iacute;o, 
unos 30 grados bajo cero, hielo por todos los lados. Yo ya sabía dónde 
estaba, era la isla de hielo, estaba rodeado de peque&ntilde;as 
casas particulares y enfrente m&iacute;a se alzaba la boca de una mina. 
<BR><BR>Era una colonia minera, pero all&iacute; no hab&iacute;a banco ni guardias, 
ni ning&uacute;n puesto oficial. En esta isla los guardias de lord British no eran 
bienvenidos. En un instante mi amigo apareci&oacute; y comprendí: hab&iacute;a sido llamado para hacerle un 
"trabajito". <br>Durante esa noche me pase picando y sacando 
mineral de la mina, el cual llevaba a una casa p&uacute;blica 
con una forja donde convert&iacute;a el mineral en lingotes, 
(despu&eacute;s de darle unos cuantos a mi temido amigo). <BR>Más tarde, el 
<table align="right">
<td><img src="gif/uo1.gif" ></td>
</table>
<FONT color="#000000" size=2 face=arial>
<P ALIGN=justify>
sugiri&oacute; la idea de entrenarnos. Para ello me proporcionó un casco, brazos, 
cuello y guantes de un material que hasta ahora no hab&iacute;a 
podido sostener por su peso. Al coloc&aacute;rmelos me sent&iacute; 
menos &aacute;gil pero pod&iacute;a llevarlos sin que me cayera 
al suelo como hab&iacute;a pasado tiempo antes. El sabedor de su 
terrible fuerza se despojó de parte de sus armaduras y nos pusimos a pelear.
Nos pusimos a pelear, sí, sin embargo, a pesar de que yo estaba armado hasta 
los dientes, aunque usaba 
una maza en vez de mi espada, y el que solo usaba sus pu&ntilde;os, 
consigui&oacute; tumbarme hasta dejarme al borde de la muerte 5 o 6 veces. Esto
se arreglaba con sus increibles hechizos de curación que me permitían
recuperar mi energía vital para volver a empezar y as&iacute; 
aprender el arte de la lucha...</P>
<P ALIGN="JUSTIFY"></P>
<h4>Ahora ya podemos presentarnos...</h4>
<P ALIGN="JUSTIFY">As&iacute; transcurre cualquier d&iacute;a en el mundo de 
Britannia, he de puntualizar que lo relatado anteriormente no me lo he inventado 
sino que me ocurri&oacute; realmente a mi. Antes de comentar el juego me 
presentaré: Se me conoce por <B>Diablillo</B> y llevo junto con unos amigos 
sobreviviendo como buenamente puedo por las tierras de <B>Britannia</B>. 
Jugamos en el <i>servidor de sonoma</i> y si bien empezamos y solemos andar por 
Vesper nuestra base de operaciones y principal fuente de ingresos se encuentra en 
la isla de hielo donde nos hemos instalado<BR> Pero el 
relataros como vivir, luchar y morir en Brittania lo dejaré para despu&eacute;s 
as&iacute; si es que estás dispuesto a seguir la mejor guía en castellano
sobre el mundo On-Line de Brittania...</P>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

