<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>D</B></font><FONT color="#000000" size=7 face="arial"><B>imensión CRPG</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>E</B></font><FONT color="#000000" size=2 face="arial"><B>n Tierras de Britannia</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<A HREF="mailto:PAKALOLO@santandersupernet.com">José Manuel Hernández "Diablillo".</A>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<FONT color="#000000">        <br><br><br><br>
<H3>Las habilidades o skills</h3>
<P align="justify">

Una vez decidamos los puntos de atributos a distribuir lo siguiente que tendremos que hacer ser&aacute; escoger los <B>skills</B> o habilidades principales que tendr&aacute; que tener el personaje. El skill que m&aacute;s alto tengamos dar&aacute; la profesi&oacute;n de nuestro personaje, o sea, si nuestro skill mas alto es el de Magery y lo tenemos en 63 puntos pues entonces nuestro personaje ser&aacute; un Journeymant mage. El m&aacute;ximo en que se puede subir un skill es 100.</P>
<P ALIGN="JUSTIFY">Sobre los skills he de aclarar varias cosas muy importantes; existe un m&aacute;ximo en la puntuaci&oacute;n de todos los skills que es de 700 puntos reales, eso s&iacute;, la puntuaci&oacute;n que nos aparecer&aacute; en nuestro pergamino de skills no es la real, ya que una parte del Skill que aparecer&aacute; ah&iacute; viene dada por la fuerza, inteligencia o destreza que tengamos. </P>
<P ALIGN="JUSTIFY">Ejemplo: un 7.5% del skill de magery viene dado por la inteligencia que tengamos o sea, si tenemos 50 puntos de inteligencia tendremos 3.3 puntos en magery, y estos puntos que funcionaran como tales para los hechos de lanzar hechizos no se contabilizar&aacute;n en el tope m&aacute;ximo de Skills del juego.</P>
<P ALIGN="JUSTIFY">Tened much&iacute;simo cuidado con el tope m&aacute;ximo de skills, a medida que os acerqu&eacute;is al subir un skill os bajar&aacute; otro y no os har&iacute;a gracia si hab&eacute;is estado 3 horas para subir el skill de magery 3 puntos que os descendiera enseguida por subir cualquier otra cosa. </P>
<P ALIGN="JUSTIFY">Nuestro personaje poseer&aacute; todas las habilidades aunque algunas m&aacute;s y otras menos desarrolladas. Las habilidades o skills que existen son las siguientes:</P>

<UL>
<B><P ALIGN="JUSTIFY"><LI>Alchemy</B>: Se usa para hacer pociones m&aacute;gicas. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Anatomy</B>: Nos permitir&aacute; conocer la fuerza y destreza de otros personajes.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Animal Lore</B>: Nos dar&aacute; informaci&oacute;n sobre cualquier animal, sobre lo que comen y si est&aacute;n contentos o no. Muy &uacute;til si nos dedicamos a amaestrar animales.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Item Identification</B>: Nos dar&aacute; informaci&oacute;n sobre los objetos y nos identificar&aacute; los m&aacute;gicos que poseamos.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Arms Lore:</B> Te dar&aacute; informaci&oacute;n sobre las armas y armaduras y sobre su estado de conservaci&oacute;n as&iacute; como el da&ntilde;o que infringen (armas) o la protecci&oacute;n que dan (armaduras).</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Parrying: </B>La habilidad de usar escudos en combate. Cuanto mayor sea mas protecci&oacute;n nos dar&aacute; el escudo. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Begging:</B> Es la habilidad de mendigar o pedir dinero a personajes NPCs. Tened mucho cuidado con el porque hace descender la notoriedad, as&iacute; que no usarlo por la cuenta que os toca...</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Blacksmithy: </B>La habilidad de herrero. Con esto podr&eacute;is fabricar armas y armaduras as&iacute; como repararlas.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Bowcraft/Fletching: </B>La habilidad de fabricar arcos y flechas. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Peacemaking: </B>La habilidad de escapar a un combate tocando instrumentos musicales. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Camping : </B>La habilidad de hacer hogueras y as&iacute; poder hacer un campamento para hacer <I>LOG</I> <I>OUT</I> de forma segura.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Carpentry: </B>La habilidad de carpintero con lo que podr&aacute;s fabricar objetos de madera. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Cartography:</B> La habilidad de fabricar mapas geogr&aacute;ficos. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Cooking:</B> La habilidad de cocinar comida.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Detecting Hidden: </B>La habilidad de detectar a personajes ocultos. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Enticement: </B>La habilidad de convencer a NPC´s y criaturas para que se acerquen. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Evaluating Intelligence:</B> Te dar&aacute; informaci&oacute;n sobre la inteligencia de otros personajes. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Healing: </B>La habilidad de curarte heridas aplicando vendajes.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Fishing:</B> La habilidad de pescar.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Forensic Evaluation:</B> La habilidad de determinar qui&eacute;n mat&oacute; un cad&aacute;ver y qui&eacute;n lo ha mirado para recoger cosas de &eacute;l.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Herding: </B>Es usado para hacer que los animales se muevan hacia donde uno quiere (pastoreo). </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Hiding: </B>Te permite ocultarte y que nadie te vea mientras que no te muevas. La mejor manera de desconectar es esta, hacer hiding y luego LOG OUT<B>.</B> <B>Nunca</B> hacer LOG OUT si vuestro personaje no esta oculto ya que le podr&iacute;an robar y matar.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Provocation:</B> La habilidad de enfurecer las bestias para que ataquen a quien queramos. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Inscription:</B> La habilidad de crear scrolls o conjuros en pergaminos para luego venderlos o usarlos.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Lockpicking: </B>La habilidad de forzar cerraduras de puertas y ba&uacute;les. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Magery: </B>La habilidad de lanzar hechizos m&aacute;gicos.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Resisting Spells:</B> La habilidad de resistir hechizos m&aacute;gicos lanzados contra ti. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Tactics:</B> La habilidad de luchar.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Snooping:</B> La habilidad de ver el contenido de la mochila de otro jugador, hace descender la notoriedad.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Musicianship: </B>La habilidad de tocar instrumentos musicales.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Poisoning:</B> La habilidad de envenenar comida, bebida y armas de filo. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Archery:</B> La habilidad de utilizar un arcos o ballestas.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Spirit Speak: </B>La habilidad de hablar con personajes muertos. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Stealing:</B> La habilidad de robar un objeto a otro personaje o un objeto del suelo que no te pertenezca. Es ilegal utilizarlo en ciudades y hace descender la notoriedad.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Tailoring:</B> La habilidad de crear ropas y armaduras de cuero.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Animal Taming:</B> La habilidad de domar animales y tenerlos como mascota. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Taste Identification:</B> La habilidad de saber, sin riesgo, si alg&uacute;n alimento est&aacute; envenenado. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Tinkering:</B> La habilidad de fabricar herramientas. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Tracking: </B>La habilidad de rastrear animales, criaturas y otros hombres alrededor de un &aacute;rea.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Veterinary:</B> La habilidad de curar animales aplicando vendajes. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Swordsmanship: </B>La habilidad de utilizar armas de filo en combate (espadas, hachas, picas, etc.) </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Mace Fighting:</B> La habilidad de utilizar armas sin filo en combate (mazas, martillos, etc.) </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Fencing: </B>La habilidad de utilizar armas punzantes sin filo en combate (lanzas, tridentes, etc.). </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Wrestling: </B>La habilidad de luchar sin armas. </LI></P>
<B><P ALIGN="JUSTIFY"><LI>Lumberjacking:</B> La habilidad de cortar le&ntilde;a de los &aacute;rboles.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Mining: </B>La habilidad de extraer mineral de las monta&ntilde;as y minas (nota: las minas son el suelo de las cuevas).</LI></P></UL>

<P ALIGN="JUSTIFY">Sobre los Skills de lucha, el de <B>Tactics</B>, indica el da&ntilde;o que realizaremos con el arma. O sea, si el Skill esta en 50 realizaremos el 100% del da&ntilde;o que causa un arma si esta en 60 realizaremos el 110% del da&ntilde;o que causa esa arma. As&iacute; hasta un m&aacute;ximo de 150% que seria con el skill de tactics en 100. </P>
<P ALIGN="JUSTIFY">Los Skills de las armas indican el porcentaje de acierto al usarlo, o sea, si tenemos el Skill de Sworman en 50 y estamos golpeando con una espada, tenemos un 50% de posibilidades de dar en cada golpe que damos, y el da&ntilde;o que infrinjamos depender&aacute; de la clase de arma y del skill de tactics.</P>
<P ALIGN="JUSTIFY">Seg&uacute;n el nivel del Skill mas alto, o sea de nuestra profesi&oacute;n, tendremos uno u otro titulo. Los titulos son <B><I>Nerwby, Novice, Apprentice, Journeymant, Expert, Adept, Master y GrandMaster. </P>
</B></I><P ALIGN="JUSTIFY">Como ayuda no os recomiendo escoger al principio ning&uacute;n Skill de armas ni de lucha sino alguno para ganar dinero. Lo mejor ser&iacute;a magery a 50 ya que es el uno de los mas dif&iacute;ciles, importantes y caros de subir, y el otro, pues cualquiera... el de ganar dinero, por ejemplo, tailoring o bowcraft/fletching tambi&eacute;n a 50, ¿y por qu&eacute; a 50?, pues por una sencilla raz&oacute;n; pagando a los due&ntilde;os de las tiendas estos os pueden ense&ntilde;ar algunos skills y siempre os lo ense&ntilde;an m&aacute;s o menos hasta 30. As&iacute; que es una tonter&iacute;a coger un skill con 30 cuando lo puedes poner ah&iacute; con 200 monedas.</P>
<h4>
Me pongo las meleneas o no...</h4>
<P ALIGN="JUSTIFY">Una vez escogido los skills de nuestro personaje llegar&aacute; el momento de ponerle el &quot;careto&quot; que queramos. Aparecer&aacute; una ventana en donde podremos configurar la cara, color de piel, sexo, tama&ntilde;o y color de pelo y dem&aacute;s caracter&iacute;sticas.</P>
<center><IMG SRC="jpg/uo8.jpg"></center>
<P ALIGN="JUSTIFY">Cuando lo hayamos terminado, s&oacute;lo nos quedara elegir la ciudad de Britannia en la que deseamos aparecer y ya estaremos en el juego.</P>
<P ALIGN="JUSTIFY">Antes de aparecer en el juego se nos presentar&aacute;n unas ventanas en las que se explica c&oacute;mo usar los skills y c&oacute;mo moverte por el juego. Debido a que no les prestaremos atenci&oacute;n (ya que tendr&eacute;is prisa por empezar a jugar... ;-D ), sobre esas ventanas fotograf&iacute;as explicatorias os dir&eacute; que se encuentran grabadas en un directorio llamado tutorial el cual, a su vez, se encuentra dentro del directorio donde instalamos el juego. Os recomiendo que las mir&eacute;is detenidamente todas ya que os ayudar&aacute;n mucho.</P></FONT></BODY>


</FONT>

<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="rpg.htm"><font FACE="ARIAL"><B>[Dimensión CRPG]</B></font></a> <hR>
<A HREF="rpgd.htm"><font FACE="ARIAL"><B>[En Tierras de Britannia]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

