<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [en] (WinNT; I) [Netscape]">
   <BASE TARGET="TEXTO">
</HEAD>
<BODY BGCOLOR="#FFFFFF">
&nbsp;
<CENTER><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=2 WIDTH="80%" HEIGHT="0" BGCOLOR="#009933" >
<TR>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=2 WIDTH="100%" HEIGHT="0" BGCOLOR="#FDEDBD" >
<TR>
<TD>
<CENTER><B><FONT FACE="arial"><FONT SIZE=+3><FONT COLOR="#009933">A</FONT><FONT COLOR="#000000">rt&iacute;culos
de Opini&oacute;n</FONT><FONT COLOR="#CC0000"> &amp;</FONT><FONT COLOR="#000000">
</FONT><FONT COLOR="#009933">R</FONT><FONT COLOR="#000000">eportajes</FONT></FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE></CENTER>

<P>
<HR>
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=2 WIDTH="0" HEIGHT="0" BGCOLOR="#009933" >
<TR>
<TD>
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=2 WIDTH="0" HEIGHT="0" BGCOLOR="#FDEDBD" >
<TR>
<TD><B><FONT FACE="arial"><FONT COLOR="#009933"><FONT SIZE=+0>R</FONT></FONT><FONT COLOR="#000000"><FONT SIZE=-1>eportajes
varios</FONT></FONT></FONT></B></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:caralo@infotel2.com.ar">Carlos Alonso</a>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>
<H3>
<FONT FACE="arial"><FONT COLOR="#000000">2&ordf; Visita no guiada al Museo
del Futuro</FONT></FONT></H3>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Y como no podr&iacute;a ser de otra manera, una de las salas m&aacute;s importantes de nuestro Museo del Futuro se halla dedicada &iacute;ntegramente al transporte, m&aacute;s espec&iacute;ficamente al aut&eacute;ntico &iacute;cono del pasado Siglo XX: el autom&oacute;vil. Aqu&iacute;, como en otras &aacute;reas, no todo ha cambiado tan radicalmente como auguraban las pel&iacute;culas de ciencia-ficci&oacute;n. O al menos, no tan completamente. Para aquellos amantes de los motores, que se deleitan acertando al momento m&aacute;s apropiado para acelerar en una curva, o introducir un rebaje haciendo rugir el motor, los autom&oacute;viles poseen todav&iacute;a un no tan c&oacute;modo puesto de manejo, que en un 30% de la red vial puede usarse. Para el resto de los mortales, que desean disfrutar del paseo o trabajar mientras viajan, la electr&oacute;nica ha tomado por completo el control del veh&iacute;culo. Basta con tomar asiento y ser identificado –por si no lo recuerdan los aparatos personales de transmisi&oacute;n de voz llevan un identificador personal que registra qu&iacute;micamente la identidad del titular del auto, compar&aacute;ndolo regularmente con bancos de datos de s&oacute;lo lectura- para que la memoria del veh&iacute;culo acomode el asiento activo a nuestra talla y peso, ajuste los cinturones de seguridad y "back-heads" –apoya cabeza- y nos ofrezca un men&uacute; de los destinos m&aacute;s frecuentes en funci&oacute;n de la situaci&oacute;n. Para ello la l&oacute;gica lee el d&iacute;a de la semana y hora actuales, cu&aacute;ntos y qui&eacute;nes viajan con nosotros y se vincula con nuestra agenda para ver si tenemos citas a las que estemos acudiendo o que pudi&eacute;ramos haber olvidado. Adem&aacute;s chequea con el verificador de identidad nuestro estado de salud y &aacute;nimo para evaluar nuestra capacidad de respuesta, a la vez que cumplir con la reglamentaci&oacute;n vigente de no permitirnos controlar el autom&oacute;vil m&aacute;s all&aacute; de cierto nivel de substancia
s t&oacute;xicas en la sangre. En casos extremos, la unidad seg&uacute;n nuestras propias &oacute;rdenes pre-grabadas, podr&iacute;a optar por llevarnos a la unidad de salud m&aacute;s cercana -seg&uacute;n nuestro plan social lo autorice-. Una vez reconocidos, si vivimos en una zona alejada, a menos que indiquemos lo contrario, nos llevar&aacute; hasta el acceso m&aacute;s pr&oacute;ximo mientras comunicamos el destino final. Esto implica que a&uacute;n en calles no "conectadas" el autom&oacute;vil puede desplazarse por propia l&oacute;gica, claro que a una velocidad m&aacute;s baja y utilizando el juego completo de sensores de que dispone. Una vez "en ruta" el equipo eval&uacute;a permanentemente la velocidad &oacute;ptima entre nuestra ansiedad y el consumo de combustible, el estado del tr&aacute;nsito, el informe de destino de cada uno de los m&oacute;viles circundantes y su autodiagn&oacute;stico, junto con punteros inteligentes ubicados regularmente en la ruta que se&ntilde;alan el estado del pavimento, y el nivel de congesti&oacute;n m&aacute;s all&aacute; de donde los "sentidos" del auto pueden ver. Asimismo un HUD –Head Up Display- imprime informaci&oacute;n sobre el parabrisas, como se&ntilde;alarnos en rojo alg&uacute;n autom&oacute;vil que no tenga su sistema inteligente encendido –y al que, en minutos, la patrulla extraer&aacute; del camino-, puntos de inter&eacute;s tur&iacute;stico o informaciones generales o de &uacute;ltimo momento.</P>
<P ALIGN="JUSTIFY">Si el caso fuera que dese&aacute;ramos tomar el transporte p&uacute;blico –con el auge del trabajo a distancia, los accesos a la ciudad no se encuentran tan congestionados como antes, y el transporte p&uacute;blico circula algo m&aacute;s espaciado-, se lo comunicaremos a nuestro organizador personal, el cual transmitir&aacute; la informaci&oacute;n al poste m&aacute;s cercano para que est&eacute; disponible para el conductor –electr&oacute;nico, claro, aunque en los transportes p&uacute;blicos se mantiene una presencia humana despu&eacute;s de ciertos sucesos algo desagradables que ocurrieron al implantarse el automatismo completo- Asimismo, el poste nos informar&aacute; la hora en que el pr&oacute;ximo transporte pase por all&iacute;, y nuestro organizador, conociendo nuestro paso, nos recomendar&aacute; que aceleremos la caminata, o que ya no tiene caso pues lo vamos a perder.</P>
<P ALIGN="JUSTIFY">¿Pocos ordenadores a la vista? Bueno, a la vista s&iacute;, pero todo el proceso es ahora controlado por voz, hasta el mantenimiento y la carga de combustible, y el dise&ntilde;o de autom&oacute;viles cada vez m&aacute;s se compenetra con el dise&ntilde;o de programas "conductores" de mayor eficiencia y m&aacute;s amigables para el humano.</P>
<P ALIGN="JUSTIFY">¿La pr&oacute;xima sala? Bueno, no deber&iacute;a dec&iacute;rselos, pero vamos a ver c&oacute;mo trabajan los que trabajan... ahora s&iacute;... en ordenadores. ¿Vienen?</P></FONT></BODY>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT>

<BR>
<HR>
<CENTER><TABLE CELLPADDING=2 WIDTH="100%" >
<TR>
<TD ALIGN=LEFT VALIGN=TOP WIDTH="50%">
<TABLE BORDER CELLSPACING=0 CELLPADDING=2 WIDTH="100%" HEIGHT="0" BGCOLOR="#CC0000" >
<TR>
<TD>
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=2 WIDTH="100%" HEIGHT="0" BGCOLOR="#FDEDBD" >
<TR>
<TD>
<CENTER><B><FONT FACE="ARIAL"><FONT SIZE=-1><A HREF="index01.htm">[Opini&oacute;n
y Reportajes]
<HR></A><A HREF="repor.htm">[Reportajes
varios]</A></FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE></CENTER>

<CENTER>
<P>
<HR></CENTER>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y
REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA
Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>

</BODY>
</HTML>
