<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>P</B></font><FONT color="#000000" size=2 face="arial"><B>rogramación y Desarrollo</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:aradriel@geocities.com">José Antonio Suárez.</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
¿Qué es lo que espero de Windows 98?
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
Bien es cierto que soy bastante reacio a cambiar, en cualquier circunstancia, de Sistema Operativo, pero ante la avalancha de publicidad masiva que se avecina con la llegada del Windows 98 a Espa&ntilde;a (oficialmente, ya que en los CDROM piratas lleva unos cuantos meses) mucho me temo que si quiero seguir utilizando las herramientas de &uacute;ltima generaci&oacute;n voy a tener que cambiar de mi OSR2 al  "nuevo" Windows.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Yo  me dedico profesionalmente a la inform&aacute;tica, y como profesional, se me exige continuamente la renovaci&oacute;n de mis conocimientos tanto a nivel de programaci&oacute;n, como a nivel de usuario. Esto provoca que si un Sistema Operativo cambia, debido a las estrategias comerciales de las casas desarrolladoras de Software que aprovechan estas salidas para sacar su versi&oacute;n X+1 especial para Windows 9X, yo tambi&eacute;n tendr&eacute; que cambiar a las nuevas versiones de los programas que tengo que utilizar. (de PhotoShop 4 al 5, de Delphi 3 al 4, de Premiere 4 al 5, del 3DMax 2 al 2.2...).</P>
<P ALIGN="JUSTIFY">S&eacute; perfectamente que no deber&iacute;a quejarme ya que esto es algo a lo que los inform&aacute;ticos tenemos que estar resignados, y no me equivoco al decir que puede que sea la ciencia que mayor nivel de actualizaci&oacute;n exige a sus profesionales. </P>
<P ALIGN="JUSTIFY">Pero hay una pega cuando se cambia de un sistema operativo tipo Windows.</P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Cuando un programador est&aacute; desarrollando una aplicaci&oacute;n tiene que saber perfectamente c&oacute;mo funciona el sistema operativo sobre el que trabaja, ya que a la hora de detectar los fallos (que siempre existir&aacute;n) se debe poder decidir si es una debilidad de su c&oacute;digo o uno de los sempiternos fallos de Windows para atajarlo cuanto antes (el tiempo es dinero en este tema). </P>
<P ALIGN="JUSTIFY">Cuando se conoce lo suficiente a Windows 95 se sabe cu&aacute;les son sus puntos flancos, qu&eacute; es lo que en teor&iacute;a se podr&iacute;a hacer, pero en la realidad no se puede, lo que pasa cuando se fuerzan determinadas librer&iacute;as que no est&aacute;n del todo bien hechas (como casi todo Windows desde que se cre&oacute;)... </P>
<P ALIGN="JUSTIFY">Seg&uacute;n de qu&eacute; aplicaciones estemos tratando, el nivel de conocimiento sobre Windows sube o baja. Por ejemplo, para una aplicaci&oacute;n de bases de datos no falta saber casi nada del sistema de mensajes sobre el que est&aacute; basado Windows, pero cuando un programa tiene que bregar con Windows a tan bajo nivel que su &uacute;nico medio de programaci&oacute;n es mediante las interrupciones del sistema de mensajes, del propio n&uacute;cleo del sistema operativo, cuando toda la filosof&iacute;a cambia, cuando alguno de sus aspectos m&aacute;s importantes es modificado, se puede decir pr&aacute;cticamente que lo que sab&iacute;a no sirve para nada y que "simplemente" vuelve a ser un inexperto cuando antes era considerado un maestro. </P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Lo que yo espero del nuevo Windows es lo que esperaba del antiguo Windows, o sea, ¡Que no casque cuando estoy trabajando!... o que al menos me permita guardar mi trabajo en lugar de tener delante un absurdo cursor sobre una inm&oacute;vil pantalla en la que no puedo hacer nada a menos que reinicie el ordenador. </P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Quiero que Windows 98, aparte de todas sus supuestas mejoras de FAT32, de sistema de archivos mejorados, de mejor soporte de PlugIns, de m&aacute;s control sobre las aplicaciones, de m&aacute;s interactividad sobre la forma en que aparecen en nuestro escritorio las cosas, lo que quiero es que no envejezca. </P>
<P ALIGN="JUSTIFY"> </P>
<P ALIGN="JUSTIFY">Existe entre algunos inform&aacute;ticos una teor&iacute;a muy curiosa, y esta es: </P>
<P ALIGN="JUSTIFY">Windows reci&eacute;n instalado sobre una m&aacute;quina nuevecita funciona a las mil maravillas, con velocidades de v&eacute;rtigo sin poseer la &uacute;ltima y m&aacute;s sofisticada m&aacute;quina del momento, pero a la semana despu&eacute;s de haberlo instalado y tras haber instalado a su vez varias aplicaciones la cosa empieza a envejecer. </P>
<P ALIGN="JUSTIFY">Se puede decir que el sistema se degrada, el registro del propio Windows va engordando poco a poco, por mucho que le digamos desde el panel de control "Agregar o quitar programas", muchos enlaces van a permanecer, muchas DLLs, y LIBs, y ActiveX, y CuchufletasX se van a quedar en el System.</P>
<P ALIGN="JUSTIFY">Y al mes, el Registro del Sistema que se carga enterito en memoria sin que podamos evitarlo, ocupar&aacute; 20 Megas de RAM, y si, como me gusta a m&iacute;, os da por instalar y desinstalar todo lo que caiga en vuestras manos, a los 2 meses el Registro ocupar&aacute; toda la memoria RAM, y cualquier cosita que se haga empezar&aacute; a maltratar nuestro disco duro pidiendo "una poquita de memoria adicional po-fav&oacute;" para ejecutarse... hasta que el colapso nos lleve a algo muy temido por un programador que basa su trabajo en mantener la m&aacute;quina en la que programa "estable". Esto tan temido es la corrupci&oacute;n de las DLLs, algo muy habitual cuando el sistema casca en medio de la carga de una librer&iacute;a... y entonces comienzan a surgir los fallos... y entonces comienzan las preguntas al aire que nos caen escupidas sobre la propia cara:</P>
<P ALIGN="JUSTIFY">¿Por qu&eacute; casca, por mi c&oacute;digo o por el maldito sistema operativo?</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y en este momento, con conocimiento de causa si se es un programador de sistemas (o sea, que se programa a bajo nivel de verdad), puedo afirmar que se da uno cuenta de lo absurda y malamente que est&aacute; hecho Windows por dentro.</P>
<P ALIGN="JUSTIFY">Bien es cierto que es necesario, "un mal necesario" dir&iacute;an algunos.</P>
<P ALIGN="JUSTIFY">Yo s&eacute; que muchas cosas son muy dif&iacute;ciles de programar, hasta el punto de que podr&iacute;a decir que si Windows estuviese bien programado (o sea, sin fallos), lo que consigue hacer chapuceramente ahora ser&iacute;a una maravilla de la programaci&oacute;n. ¡Una aut&eacute;ntica maravilla!, ya que las pretensiones son ambiciosas... pero aun a pesar de ser desarrollado por decenas de equipos de programaci&oacute;n dirigidos por Analistas Programadores, aun a pesar de tener una millonada en presupuesto, que ya querr&iacute;a alg&uacute;n pobre pa&iacute;s para su propio manejo..., aun a pesar de eso, no puedo dejar de pensar que Windows es una aut&eacute;ntica chapuza. Es como un globo con muchos dibujitos, que por dentro est&aacute; lleno de aire, y que si se produce un peque&ntilde;o rasgu&ntilde;o, explota y se lleva a todo por delante.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Los que nos ganamos la vida trabajando sobre &eacute;l (porque no nos queda otro remedio ya que es lo que se vende), sabemos los aut&eacute;nticos juegos de malabares que tenemos que montar para que el usuario no se d&eacute; cuenta de que m&aacute;s que darle justamente lo que quiere, se intenta darle lo que buenamente se puede. Yo, cuando termino un programa de bajo nivel, tengo la sensaci&oacute;n de que no tengo el absoluto control de lo que pueda pasar, que mi programa es un pobre jinete sobre un caballo salvaje y loco.</P>
<P ALIGN="JUSTIFY">Si pudiese quitar todas las comprobaciones tipo "por si acaso", todos los manejos de errores (que no sean para evitar que el usuario haga el bestia), todos los saltos, atajos y muros para esquivar las funciones peligrosas... si no tuviera que poner nada de esto, mis programas ser&iacute;an much&iacute;simo m&aacute;s eficientes, no perder&iacute;a tanto tiempo en dar rodeos, acabar&iacute;a antes, no tendr&iacute;a que pasar d&iacute;as enteros buscando un maldito fallo que casca toda la aplicaci&oacute;n... pero esto, hoy por hoy, es imposible de hacer.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cuando una aplicaci&oacute;n seria maneja decenas, cientos de archivos, cuando el ejecutable se vuelve terriblemente grande porque al compilarlo se activan todos los chequeos habidos y por haber, cuando lo que prima muchas veces es la velocidad que hay que sacrificarla en aras de la estabilidad, cuando todo esto pasa y no es culpa de un mal dise&ntilde;o o de una mala codificaci&oacute;n... algo falla y no es el jefe de la aplicaci&oacute;n ni sus programadores.</P>
<P ALIGN="JUSTIFY">Un "creador" de software, un "programador" de aplicaciones tiene la necesidad de sentir que controla lo que est&aacute; sucediendo. Cuando se manejan doscientas mil l&iacute;neas de c&oacute;digo se tiene que tener la seguridad de que lo que se dice que se haga, se haga de verdad, y no esperar que se haga ¡POR FAVOR!.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pues bien, si Windows 98 es capaz de al menos aliviar esta parte, bienvenido sea, aunque haya que tragarse su navegador por la fuerza, aunque los programadores tengamos que aguantar tantas tonter&iacute;as de confirmaciones y reconfirmaciones, aunque tengamos que cambiar de m&aacute;quina para que "simplemente" vaya igual de r&aacute;pido que antes.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">No quiero que Windows 98 envejezca, que su registro engorde y que sus DLLs se arruguen.</P>
<P ALIGN="JUSTIFY">No quiero que Windows 98 me deje planchado con un maldito fallo que cierre mi aplicaci&oacute;n cuando un usuario estaba haciendo algo importante y todav&iacute;a no lo hab&iacute;a grabado.</P>
<P ALIGN="JUSTIFY">No quiero tener que reinstalarlo cada dos meses para que mi lento ordenador resurja de sus cenizas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quiero que sea estable, que no me la juegue, que los usuarios de mis programas no me echen la culpa porque su impresora no imprime y no le saca mis estad&iacute;sticas, que no me pongan verde porque su tarjeta de v&iacute;deo va lenta y mis animaciones se quedan pilladas, que no me den la lata diciendo que han grabado las cosas y al volver a arrancar ya no est&aacute;n... </P>
<P ALIGN="JUSTIFY">¡Quiero que sea un Sistema Operativo de VERDAD, porque si forzosamente tengo que cambiar, al menos que no me traicione!</P></FONT></BODY>


<br><br>
<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="opinionb.htm"><font FACE="ARIAL"><B>[Opinión Programación / Desarrollol]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

