<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>W</B></font><FONT color="#000000" size=2 face="arial"><B>ataro Yoshizumi</B></FONT></a>
<hr>
<FONT COLOR="#009933" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=2 face="arial"><B>armalade Boy</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<H3>
<FONT FACE="arial"><FONT COLOR="#000000">Resumen del tomo 2. Cap&iacute;tulo 2.</FONT></FONT></H3>
<FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Yuu no puede creerlo... Est&aacute;
ah&iacute;, en la biblioteca, escondido tras una estanter&iacute;a... Con
Meiko y Natchan bes&aacute;ndose algo m&aacute;s all&aacute;.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Llaman a Natchan por el altavoz
para que vaya a atender una llamada telef&oacute;nica. Entonces Yuu se
va por donde a entrado, la ventana, pero... al abrirla no puede evitar
que haga chirrido y Meiko le descubre. Ella se asusta mucho, pero &eacute;l
le promete que no dir&aacute; nada... Despu&eacute;s, Meiko le dice que
tampoco se lo diga a Miki, pues ella... no lo sabe.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Al d&iacute;a siguiente,
Miki tiene de nuevo algunos problemillas con la televisi&oacute;n del colegio...
Han invitado a Yuu para que hable del partido amistoso, y ya de paso le
preguntan sobre el rumor del tri&aacute;ngulo amoroso entre &eacute;l,
Ginta y Miki... Yuu dice, con una sonrisa (el muy ...), que no har&aacute;
comentarios. Todo el mundo se estremece pues, aunque no lo afirme, tampoco
lo niega... y Ginta y Miki, que lo estaban viendo, se ponen furiosos, aunque,
al contrario de lo que podr&iacute;a parecer, es por razones distintas...
Miki porque ahora se morir&aacute; de verg&uuml;enza ante todo el colegio,
que ir&aacute; a preguntarle, y Ginta... Porque ahora habr&aacute; m&aacute;s
gente que ir&aacute; a ver el partido... y eso le pone nervioso. En fin...</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>De camino a casa, Yuu y Miki
discuten, pero se callan. Miki se lo queda mirando, y empieza a pensar
en si de verdad est&aacute; enamorada... Pero Yuu interrumpe sus pensamientos.
Quiere saber si el club femenino har&aacute; tambi&eacute;n la competici&oacute;n.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Entonces Miki, a parte de
explicarle que pondr&aacute;n un puesto de Oden (un tipo de sopa t&iacute;pica
japonesa), aprovecha para darle un ticket para que pueda pedir eso mismo
(gratuitamente). Pero... Es imaginable la cara que pone cuando Yuu abre
la cartera... y se le caen decenas de tickets que le han regalado otras
chicas. Entonces Miki empieza a caminar m&aacute;s r&aacute;pido, pero
Yuu la para y le exije (literalmente) que se lo d&eacute;, que usar&aacute;
ese. Miki le dice que m&aacute;s le vale que as&iacute; sea.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Llega el d&iacute;a de la
competici&oacute;n. Miki est&aacute; encantada sirviendo. Entonces llega
Yuu... muy bien acompa&ntilde;ado por cierto. Arimi est&aacute; con &eacute;l,
y eso saca de quicio a Miki, multiplic&aacute;ndose cuando sus compa&ntilde;eras
empiezan a hablar sobre tal hecho. Y cuando esos dos quedan para ir al
cine ya no puede m&aacute;s... Aunque finalmente no lo hacen porque Yuu
tiene el partido.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Entonces Arimi le explica
a Yuu que ha venido a animarle, pues su instituto tambi&eacute;n participa...
Yuu se levanta sobresaltado. Al parecer, cierta persona de &eacute;se mismo
instituto del club de tenis va a estar ah&iacute;, y &eacute;l no tiene
ni pizca de ganas de verle.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Miki y Arimi acompa&ntilde;an
a Yuu al partido. &Eacute;l le explica a Ginta que no quiere volver a encontrarse
con esa persona. Le explica que &eacute;l est&aacute; enamorado de su exnovia
y encima siempre ha tenido complejo porque no le ha ganado jugando a tenis...
Ginta se extra&ntilde;a de que Yuu haya tenido novia. Entonces le presenta
a Arimi. &Eacute;l la reconoce de cuando Miki huy&oacute; de &eacute;l
acompa&ntilde;ado de ella, pero no dice nada.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Bueno, el caso es que Ginta
le dice “&iquest;esa persona no podr&iacute;a ser...?” y ambos dicen a
la vez un nombre: Tsutomu Rokutanda. Entonces Yuu pregunta si no ser&aacute;
esa la persona contra la que no quiere perder...</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Entonces llega ese tal Rokutanda.
Les amenaza con que matar&aacute; dos p&aacute;jaros de un tiro. Yuu les
pregunta a Ginta y a Roku de qu&eacute; se conocen... resulta que son primos.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>En cuanto sabe que es su
primo, Miki recuerda un pin que Ginta le regal&oacute; hac&iacute;a unos
a&ntilde;os (por lo que empez&oacute; a sospechar de que estaba enamorado
de ella) que le hab&iacute;a tra&iacute;do un primo suyo, y le pregunta
si &eacute;se primo es Rokuitanda. &Eacute;l le dice que s&iacute;, y le
pregunta si entonces ella es, literalmente, “aquella que Ginta rechaz&oacute;
aunque estaba enamorado”. Y no tiene ning&uacute;n cuidado en decirlo bajo.
Todos los que andaban por ah&iacute; se acercan y se ponen a hablar de
ello. Miki se derrite de la verg&uuml;enza, y le dice a Ginta que es un
bocazas y que no le quiere ver nunca m&aacute;s, tras lo cual sale corriendo.</FONT></FONT>

<p align="justify"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Los dos primos, totalmente
enfadados entre s&iacute;, acuerdan, mientras Yuu se cambia, que el que
pierda se... rapar&aacute; el pelo. Ginta, sobretodo al ver el vestuario
de Yuu para el partido, piensa que no se lo toma en serio, as&iacute; que
deciden aumentar la apuesta a sus parejas. La pareja de Roku no quiere,
pero el le convence, mientras que Yuu empieza, por fin, a tomarse el partido
en serio...</FONT></FONT>
<BR>&nbsp;
<DIV ALIGN=right><FONT FACE="arial"><B><FONT COLOR="#0080C0"><FONT SIZE=-1>&Uacute;</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>LTIMA
REVISI&Oacute;N EN</FONT><FONT SIZE=-1> </FONT></FONT><B><FONT COLOR="#CC0000"><FONT SIZE=-1>JULIO</FONT></FONT></B><FONT COLOR="#000000"><FONT SIZE=-2>
DE </FONT></FONT><B><FONT COLOR="#CC0000"><FONT SIZE=-1>1999</FONT></FONT></B></FONT></DIV>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="wtfmn.htm"><font FACE="ARIAL"><B>[Marmalade Boy]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







