<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>W</B></font><FONT color="#000000" size=2 face="arial"><B>ataro Yoshizumi</B></FONT></a>
<hr>
<FONT COLOR="#009933" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=2 face="arial"><B>intna Bokura</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<h3>Resumen Mintna Bokura; Tomo 1</h3>
<FONT FACE="Arial,Helvetica">
<p align="justify"><font size=2 face=arial>
<font size=2 face=arial>
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Noel y Mar&iacute;a siempre hab&iacute;an sido dos gemelos (hermano y hermana respectivamente) muy unidos. Pero poco a poco, ella se va alejando de &eacute;l. Noel no le presta mayor importancia hasta que llega la separaci&oacute;n definitiva: Mar&iacute;a se ha enamorado de un misterioso chico durante unos campeonatos de B&aacute;sket, y le ha comido el coco a su madre para que le dejase trasladarse a su colegio. Mientras todo esto ocurre, Noel y su padre est&aacute;n de vacaciones, s&oacute;los, en Hawaii.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces Noel reacciona y se da cuenta de que no puede perder a su hermana de &eacute;sta forma, as&iacute; que se traslada tambi&eacute;n a &eacute;se colegio para impedir cualquier tipo de relaci&oacute;n. Pero hay un &quot;peque&ntilde;o&quot; problema: s&oacute;lo queda una plaza en el colegio... y pertenece al sexo femenino. A&uacute;n as&iacute;, Noel no desiste, y convence a su padre para que le deje hacerse pasar por una chica. Se pone una peluca que se sujeta con una diadema, ¡y a la aventura!</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Y ya os pod&eacute;is imaginar la cara que pone Mar&iacute;a cuando se entera de todo. Se enfada much&iacute;simo con &eacute;l, y le pega varias broncas, alegando que es bueno relacionarse con otras personas, a&uacute;n m&aacute;s si esa relaci&oacute;n es por amor. Noel no sabe entenderlo... Al menos hasta que conoce y empieza a tratar a su compa&ntilde;era de habitaci&oacute;n, Miyu. Es una chica muy misteriosa a la que por el momento no consigue arrancarle demasiadas palabras seguidas.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tambi&eacute;n conoce a Sasa, un jugador del equipo de B&aacute;sket. &Eacute;l se ha hecho secretaria del equipo para poder espiar a su hermana, pues sabe que el sujeto en cuesti&oacute;n est&aacute; all&iacute;. As&iacute; que, nada m&aacute;s ver a Sasa, lo primero que hace es preguntarle si &eacute;l es popular. Sasa dice que no, pero le dice qui&eacute;n s&iacute;... el entrenador del equipo, Hirobe. Y la comprobaci&oacute;n no se hace esperar: inmediatamente, aparece Mar&iacute;a hablando como un zombie con dicho entrenador, y su cara no expresa ganas de largarse...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces el equipo queda para ir a un parque de atracciones, Katchan Land. En efecto, Katchan es el mismo personaje que en otra historia de Yoshizumi, Marmalade Boy, es un peluche que Yuu regala a Miki. &Eacute;se personaje existe en la realidad.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Noel decide que ha de hacer lo imposible por que Mar&iacute;a y el entrenador no entren en ninguna conversaci&oacute;n. Pero se entretiene con una compa&ntilde;era, y cuando quiere darse cuenta, su hermana y su adorado se han esfumado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero al contrario de lo que se podr&iacute;a pensar, no est&aacute;n juntos. Mar&iacute;a est&aacute; sola en una tienda mirando art&iacute;culos de Katchan para comprar, pero todo es muy caro. Finalmente, aparece Hirobe y... Mantienen una corta conversaci&oacute;n sobre que ambos se han decidido por el mismo art&iacute;culo, una especie de llavero de la suerte...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero Noel los ha localizado, ha apuntado bien el objetivo... y ha lanzado su provisi&oacute;n de bebida sobre Mar&iacute;a. &Eacute;sta sale corriendo hacia el lavabo, perseguida por &eacute;l. Por cierto que, hasta ahora, NADIE sabe que Noel es un chico.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Entonces tienen una nueva discusi&oacute;n. A Mar&iacute;a no le gusta que Noel continuamente le atosigue, quiere que le d&eacute; una oportunidad con el entrenador, ahora mismo estaban tan cerca... Por primera vez, se aprecia en la expresi&oacute;n de Noel un cambio de actitud, pero todav&iacute;a no dice nada.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al salir, Hirobe ha tenido un gran detalle: ha comprado dos llaveros iguales, uno para &eacute;l y otro para Mar&iacute;a. Ella se empieza a hacer ilusiones... De repente, se dan cuenta de que Noel se ha esfumado.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En efecto, &eacute;l se ha ido s&oacute;lo, realmente le ha afectado la discusi&oacute;n. Entonces, se encuentra con Miyu acompa&ntilde;ada de un hombre bastante mayor... Y es que hab&iacute;a estado escuchando muchas barbaridades sobre ella: una amiga de Mar&iacute;a, Kanako, que tambi&eacute;n es compa&ntilde;era de habitaci&oacute;n de &eacute;sta, ya les hab&iacute;a dicho que se dec&iacute;a que Miyu sal&iacute;a con personas mayores... Y la directora del colegio (&uacute;nica persona aparte de Mar&iacute;a que sabe el sexo de Noel) ya le hab&iacute;a dicho que le ten&iacute;a preocupada, y le hab&iacute;a pedido a Noel que se interesase por ella e intentase ser amable. Se queda muy confuso por esto.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En su habitaci&oacute;n, con Miyu cerca haciendo los deberes, no puede dejar de pensar en ello. Miyu no se enter&oacute; de su presencia, as&iacute; que no ha de dar explicaciones. Pero Noel no deja de mirarla, ella se da cuenta, se gira y Noel tambi&eacute;n, para disimular... &Eacute;ste juego se repite varias veces.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&Eacute;ste no es el &uacute;nico problema que tiene: resulta que, al ser un chico, se aburre estando con chicas, pero al ser una chica delante de todos, no puede ir con chicos... As&iacute; que nunca sabe qu&eacute; decir y lo &uacute;nico que hace es seguir a su hermana, con quien, a pesar de todo, se lleva bastante bien.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero esto no tardar&aacute; en solucionarse... ¿o deber&iacute;a decir en complicarse? Entre papeleo y papeleo por su ingreso en el secretariado del equipo, encuentra en el suelo un llavero de un pez. Resulta ser de Sasa. Entonces emprenden una conversaci&oacute;n sobre pesca, y &eacute;ste &uacute;ltimo se extra&ntilde;a de que a una &quot;chica&quot; le guste. Pero finalmente quedan para irse a pescar juntos...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Se hacen muy amigos a causa de eso, y continuamente hablan, a todas horas. Eso crea confusi&oacute;n en el colegio... Un chico de gustos dudosos (se rumoreaban cosas no muy agradables sobre &eacute;l) con una chica tan extra&ntilde;a como Noel... A&uacute;n as&iacute;, dan por hecho que son pareja, y Mar&iacute;a quiere fundirse cada vez que hablan de ello.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero resulta que, a pesar de los rumores, hab&iacute;an chicas a quienes Sasa les gustaba... as&iacute; que cogen celos, pero Sasa defiende a Noel y queda clar&iacute;simo que all&iacute; hay algo...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Mar&iacute;a advierte a Noel de los rumores, pero &eacute;l pasa: tiene cosas que hacer con Sasa... Continuamente est&aacute;n juntos: comen juntos, pasean juntos, hablan ellos dos a solas...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero Noel es un chico con todas las de la ley, como deja bien claro una conversaci&oacute;n con Miyu en la que &eacute;l se empieza a interesar por ella. Resulta que le hace una broma bastante pesada (no quiero decirlo, es uno de los mejores gags de la historia y eso hay que verlo), as&iacute; que, cuando ambos se tranquilizan, empiezan a hablar. Es la primera conversaci&oacute;n normal y de durada media que mantienen desde que se conocen. Entonces es cuando la ve por primera vez sonreir...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Finalmente, sale el tema de que Noel vio a Miyu con una persona bastante mayor. Se nota que la est&aacute; metiendo en un aprieto, pero apresuradamente pregunta &quot;¿era tu padre&quot; y Miyu, como aliviada, dice que s&iacute;. Pero no resulta muy convincente...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Noel y Sasa vuelven a irse juntos. Se paran a hacerse una foto, Noel lo coge y se lo lleva hac&iacute;a &eacute;l para que ambos salgan en el objetivo, Sasa lo coge como una indirecta y... Ya nadie podr&aacute; decir que su primer beso fue con una chica estupenda. Pero Sasa cree que s&iacute;... Noel se va corriendo.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Habla con Mar&iacute;a sobre lo ocurrido, pero descubre la incompetencia de &eacute;sta para tratar &eacute;ste tipo de asuntos: se le r&iacute;e en sus narices tras saberlo. Entonces noel descubre que la &uacute;nica soluci&oacute;n es hablar con Sasa...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero claro, no se atreve a decirle la verdad y nada m&aacute;s que la verdad, se creer&iacute;a que es un pervertido... As&iacute; que simplemente le dice que no est&aacute; &quot;preparada&quot;. Pero Sasa no lo acepta: no quiere mantener una relaci&oacute;n tan estrecha con una chica si no es una relaci&oacute;n amorosa. Ambos quedan destrozados, sobretodo Noel, que ha perdido a quien podr&iacute;a haber llegado a ser un gran amigo si hubiera sido sincero desde el principio.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">As&iacute; que se separan: ya no comen juntos, ya no hablan a solas... Todo el mundo cree que han roto. Noel no aguanta m&aacute;s, y se lleva a Sasa a su habitaci&oacute;n pese a que &eacute;ste &uacute;ltimo no muestra mucho inter&eacute;s. Entonces, Noel empieza a desnudarse ante el gran asombro de Sasa, que le dice que si cort&oacute; no fue porque a&uacute;n no la hab&iacute;a visto como hab&iacute;a venido al mundo... Pero todo cambia cuando ve la peluca de Noel en el suela. Mira arriba... ¡y ve un cuerpo de chico! Noel se lo intenta explicar, pero Sasa pierde el conocimiento...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Al d&iacute;a siguiente, Sasa no asiste a clase. Noel est&aacute; muy preocupado. Finalmente, viene, pero no se muestra muy amable con Noel en un principio... Pero desiste y todo vuelve a ser como antes, aunque ahora va con m&aacute;s cuidado... Noel sigue aparentando ser chica, pero con Sasa es totalmente sincero a partir de ahora. Y con Miyu empieza a tener largas conversaciones. Parece que poco a poco va echando ra&iacute;ces...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero su hermana no corre la misma suerte. En una conversaci&oacute;n con Hirobe, descubre que &eacute;ste le ha regalado el llavero de la suerte... a su novia. Mar&iacute;a no sabe qu&eacute; hacer: si llorar, cambiar el color de su cara, matar a Hirobe ah&iacute; mismo... Pero desiste en cuanto &eacute;l le cuenta que est&aacute;n muy distanciados, y que muy posiblemente romper&aacute;n. Mar&iacute;a muestra sus sentimientos y, al contrario de lo que hubiera sido lo normal, Hirobe se siente muy contento y le dice que ya tendr&aacute; su oportunidad. Mar&iacute;a est&aacute; por las nubes...</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pero ahora es Noel el que tiene problemas. Est&aacute; en su habitaci&oacute;n, aburrido y solo. Ya es tarde y Miyu a&uacute;n no ha llegado. Entonces, por casualidad, descubre un &aacute;lbum de fotos de ella, lo ojea, pero no le gusta ver el aspecto de su padre, que no corresponde con el que vio cuando se fug&oacute; del parque...</P>
<P ALIGN="JUSTIFY"></P>

<HR>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"><font face=arial size=1>Este resumen es una descripci&oacute;n superficial del primer tomo para hacer una idea. Agradezco a todos aquellos que escriben sinopsis, resumenes y traducciones de aquellos mangas que no pueden ser entendidos por todo el mundo. En ese caso, yo he entendido &eacute;ste tomo gracias a una traducci&oacute;n, pues no entiendo el japon&eacute;s. A pesar de ello, yo he sacado mis propias ideas y opiniones y tengo el tomo original (importado), as&iacute; que me considero con pleno derecho a resumirlo. A&uacute;n as&iacute;, para que no hayan malentendidos, las traducciones que yo he le&iacute;do las pod&eacute;is encontrar en Mintna Bokura Page <a href="http://www.swb.de/~zahara/yo/mint.html" target="_new">http://www.swb.de/~zahara/yo/mint.html</a>, en ingl&eacute;s.</P></FONT>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>MAYO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="wtfmn.htm"><font FACE="ARIAL"><B>[Marmalade Boy]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







