<HTML>

<BASE TARGET="TEXTO">

<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="*"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="center">

<FONT COLOR="#009933" size=7 face="arial"><b>M</B></FONT><FONT COLOR="#000000" size=7 face="arial"><B>acedo<FONT COLOR="#CC0000">n</FONT>ia de Ocio</B></FONT><BR>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE></center>

<br>

<HR>		  

<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="left">

<FONT COLOR="#009933" size=3 face="arial"><B>W</B></font><FONT color="#000000" size=2 face="arial"><B>ataro Yoshizumi</B></FONT></a>
<hr>
<FONT COLOR="#009933" size=3 face="arial"><B>M</B></font><FONT color="#000000" size=2 face="arial"><B>armalade Boy</B></FONT></a>
</FONT> / <FONT COLOR="#009933" size=2 face="arial"><B>M</B></font><FONT color="#000000" size=1 face="arial"><B>acedonia Nipona</B></FONT>

</DIV>

</TD>

</TR>

</TABLE></TD>

</TABLE>

<br><br>

<img src="g_misc/69.gif" align=right>

<P align=right>

<FONT color="#cc0000" size=2 face="arial">

<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>

<A HREF="mailto:srd@retemail.es">Samuel Rísquez</A>

</b></FONT>

<br><br><FONT color="#000000" size=2 face="arial">
<br><br><br><br>
<h3>Resumen del tomo I. Capítulo 1.</h3>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Miki hablaba sobre la charla
que hab&iacute;a mantenido con sus padres con Meiko, una amiga y compa&ntilde;era
de clase.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Le cuenta que todo empez&oacute;
cuando sus padres se fueron a Hawai, dej&aacute;ndola a ella sola en casa...</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>All&iacute; conocieron a
los Matsuura, una familia que, al igual que ellos, era “diferente”. Al
coincidir, empezaron a hablar, y a hablar... y a hacer algo m&aacute;s.
Rumi, la madre de Miki, se enamora apasionadamente de Yoji Matsuura, mientras
Chiyako, mujer de &eacute;ste, se enamora de Jin, que a su vez es... &iexcl;el
padre de Miki!</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Le explican que se tranquilice,
que ellos consideran que no pueden seguir c&oacute;mo matrimonio cuando
se han enamorado a la vez de otra pareja, a pesar de la opini&oacute;n
que Miki tiene sobre la p&eacute;rdida de pasi&oacute;n al cabo de los
a&ntilde;os. No hay forma de convencerles.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Meiko le dice que tampoco
es para tanto. Al menos, ellos expresan claramente sus sentimientos. Aqu&iacute;
se empiezan a vislumbrar los problemas de la gente que rodea a Miki: Meiko
proviene de una familia rica. Sus padres no se quieren entre ellos, lo
&uacute;nico que quieren es guardar las apariencias, mientras la hacen
sufrir a ella, que crece con el ejemplo de unos cuyas discusiones son la
base de su relaci&oacute;n.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Miki y su familia se va a
cenar con los Matsuura para que ella los conozca. Por el camino, conocemos
a otra amistad de Miki, en &eacute;ste caso un chico llamado Ginta que
al parecer guarda gran amistad con ella.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Se presenta a la cena, celebrada
en un lujoso restaurante, decidida a hacer retroceder a las dos enloquecidas
familias. Conoce al matrimonio Matsuura, y r&aacute;pidamente resuelve
el misterio: ellos tambi&eacute;n est&aacute;n locos.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Pero ellos son cinco, y en
la mesa hay cuberter&iacute;a para seis... Miki descubre que los Matsuura
tiene un hijo, al que “tambi&eacute;n quieren hacer la vida imposible”
seg&uacute;n sus palabras. Nada m&aacute;s ver al retrasado hijo, se da
cuenta de que... es demasiado irresistible para ella. Se llama Yuu, y nada
m&aacute;s verlo se pone roja, pero despu&eacute;s de pensarlo considera
que es m&aacute;s importante hacer volver a su familia a la normalidad,
o al menos devolverles la poca normalidad que ten&iacute;an.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Se ponen a discutir sobre
el asunto. Miki bombardea a los dos matrimonios con todo lo que hace impensable
lo que quieren hacer: las apariencias, la rareza del asunto... Pero se
lleva un gran chasco: Yuu, el &uacute;nico que pod&iacute;a haber sido
su aliado, parece estar de acuerdo con sus padres y los Koishikawa, y despu&eacute;s
de una amena discusi&oacute;n en que los padres demuestran una vez m&aacute;s
que est&aacute;n como una cabra, Yuu le hace ver que debe dejar libres
a sus padres.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Pero la cosa no acaba aqu&iacute;,
porque deciden que, para que no hayan separaciones, se pongan a vivir los
seis... en la misma casa. Miki ya no aguanta m&aacute;s.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Tras divorciarse, ambas ex-familias
se trasladan a una gran casa. Yuu y Miki tienen ahora sus primeras conversaciones.
Ella descubre que su nuevo “hermano” se parece m&aacute;s a sus padres
de lo que le gustar&iacute;a... Guarda bastante coherencia, aunque su forma
de pensar no le acaba re gustar.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Entonces Rumi se la lleva
a un lado para hablar ellas dos solas, y le pide un favor: ha de ser amable
con Yuu, pero no debe enamorarse de &eacute;l. A Miki le resulta extra&ntilde;o.
Rumi dice simplemente que no quiere m&aacute;s l&iacute;os en la familia.
Ja, mira quien habla. Miki considera que no le ser&aacute; muy dif&iacute;cil
llevar a cabo &eacute;se favor. Y es que, &iquest;qui&eacute;n podr&iacute;a
enamorarse de un tipo tan raro?</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Al d&iacute;a siguiente,
de camino al colegio, Miki cambia con Meiko sus primeras impresiones sobre
los Matsuura. Justo cuando hablaba de que durante las horas de colegio
no tendr&iacute;a que aguantar a mentes trastornadas... aparece Yuu por
detr&aacute;s. No hace falta que os explique el enfado que coge Miki al
enterarse de que Yuu no s&oacute;lo ir&aacute; a su mismo colegio, sino
a la misma clase...</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Yuu se lleva a Miki para
que le presente a los profesores. Entonces aparece Ginta, y tras ver su
asombro Meiko le dice que Yuu y Miki van a estar bastante rato juntos a
partir de ahora... La mirada de Ginta refleja que a &eacute;l no le va
a gustar mucho ese nuevo alumno.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Yuu, nada m&aacute;s llegar,
se lleva a todas las chicas del colegio tras &eacute;l, mientras Miki se
maldice a si misma. Pero ahora puede estar contenta: Ginta ha ido a buscarla
para ir a jugar a tenis, pues ambos pertenecen al club de dicho deporte
del colegio. Yuu no puede evitar sentir curiosidad (o algo m&aacute;s)
y les sigue. Se extra&ntilde;a de que se lleven tan bien, sobretodo cuando
Meiko, que ha salido a su paso, le explica que ella se le declar&oacute;
hac&iacute;a unos a&ntilde;os, si&eacute;ndo rechazada por Ginta.</FONT></FONT>

<P ALIGN="JUSTIFY"><FONT FACE="Arial,Helvetica"><FONT SIZE=-1>Y as&iacute; acaba esta breve
introducci&oacute;n a la anormal historia que Wataru Yoshizumi ha creado
con Marmalade Boy. Si os parece que no puede ser m&aacute;s rara... es
que no la hab&eacute;is le&iacute;do ;-)</FONT></FONT>

<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>ABRIL</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>



<hr>

<center><TABLE CELLPADDING=2 WIDTH="100%">



<TD  WIDTH="50%" VALIGN="TOP" align="left">



<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>

<TD>

<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>

<TR>

<TD>

<DIV align="CENTER">

<FONT SIZE=2>

<A HREF="index06.htm"><font FACE="ARIAL"><B>[Macedonia de Ocio]</B></font></a> <hR>

<A HREF="wtfmn.htm"><font FACE="ARIAL"><B>[Marmalade Boy]</B></font></a> 
</DIV>

</TD>

</TR>

</TABLE>

</TD>

</TABLE>

</TD>

</TABLE>





<br>

<HR>





<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >

<TR>

<TD>

<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">MACEDONIA DE OCIO</FONT></FONT></B></CENTER>

</TD>

</TR>

</TABLE>



<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >

<TR>

<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>

</TR>

</TABLE></CENTER>



<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >

<TR>

<TD>

<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>

</TD>

</TR>

</TABLE></DIV>

</TD>

</TR>

</TABLE></CENTER>

</HTML>







