<HTML>
<BASE TARGET="TEXTO">
<body bgcolor ="#FFFFFF">
<br>
<center><TABLE BORDER=0 align = center WIDTH="80%" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=6 face="arial"><B>A</B></font><FONT color="#000000" size=6 face="arial"><B>rtículos de Opinión<FONT COLOR="#cc0000" size=6 face="arial"> &</FONT> <FONT COLOR="#009933" size=6 face="arial">R</FONT>eportajes</B></FONT><BR>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>R</B></font><FONT color="#000000" size=2 face="arial"><B>eportajes Varios</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<b><FONT color="#cc0000" size=2 face="arial">
A</font><FONT color="#000000" size=2 face="arial">rtículo realizado por<br>
<A HREF="mailto:gustavo_herrera@yahoo.com">Gustavo Herrera</A>
</b></FONT>
<br><br>

<BR><BR><BR><BR><BR>

<H3>
<FONT color="#000000" face="arial">        
Y2K, Una Crisis Previsible.
</FONT>
</H3>

<FONT color="#000000" size=2 face="arial">
<P ALIGN=JUSTIFY>
<P ALIGN="JUSTIFY"><FONT FACE="Arial">Pese a tener ya una gran difusi&oacute;n,
la llamada crisis de las computadoras t&eacute;cnicamente conocida
como el problema Y2K, tomar&aacute; por sorpresa a much&iacute;simas
empresas y usuarios de sistemas automatizados y lo mismo propiciar&aacute;
fallos en algunos ascensores, como el mal funcionamiento de oleoductos
o sistemas de navegaci&oacute;n a&eacute;rea. El siguiente art&iacute;culo
pretende mostrar una panor&aacute;mica de este problema as&iacute;
como presentar algunas recomendaciones.</FONT></P>
<FONT FACE=ARIAL>
<H4>Antecedentes:</H4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">El siglo XX vio nacer la fusi&oacute;n entre
la mec&aacute;nica y la electr&oacute;nica en todo su esplendor.
Los procesos de automatizaci&oacute;n se desarrollaron en aplicaciones
industriales y con ello, la aparici&oacute;n del ordenador se
consolid&oacute; como uno de los momentos cumbres de la tecnolog&iacute;a
contempor&aacute;nea.</FONT></P>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">Estos &uacute;ltimos a&ntilde;os han sido
de cambios vertiginosos y por ello, a veces olvidamos que no hace
mucho tiempo las cosas eran muy diferentes. Y la llamada crisis
de las computadoras es sin duda un problema de tiempo. Veamos,
cuando alguien le pregunta que a&ntilde;o es, refiri&eacute;ndose
a la fecha de su nacimiento, inmediatamente contesta &quot;Soy
del 70 &oacute; 75&quot; seg&uacute;n el caso, Si escucha una
canci&oacute;n de B-52 alguien comenta &quot;T&iacute;pico grupo
de los 80&#146;s&quot;... Cuando los programadores de computadoras
crearon los primeros programas en las d&eacute;cadas de 1960 y
1970, tambi&eacute;n siguieron la misma convenci&oacute;n. Como
seres humanos, cuando lleguemos al nuevo siglo, haremos los ajustes
mentales necesarios en forma totalmente autom&aacute;tica: si
alguien habla del 96, nosotros asumiremos que se refiere a 1996.
Si alguien menciona el 02, asumiremos que quiere decir 2002. Sin
embargo, muchas computadoras no har&aacute;n ese ajuste intuitivo.
Y aqu&iacute; es donde est&aacute; el problema: conforme nos acerquemos
al siglo XXI, empezaremos a utilizar fechas del pr&oacute;ximo
siglo, tanto al hablar como al introducirlas en los programas
de c&oacute;mputo. Sin embargo muchos ordenadores no entender&aacute;n
que hemos llegado a una nueva centuria. Cuando digamos &quot;02&quot;,
significando 2002, la l&oacute;gica de la computadora y todos
los c&aacute;lculos subsecuentes asumir&aacute;n que nos referimos
al a&ntilde;o 1902. Este problema surge de una decisi&oacute;n
tomada en los primeros d&iacute;as del dise&ntilde;o de equipo
y programas de c&oacute;mputo para as&iacute; ahorrar memoria
y espacio de almacenamiento al s&oacute;lo usar los &uacute;ltimos
dos d&iacute;gitos del a&ntilde;o en las fechas y en todos los
campos de fecha de los programas. Inicialmente este era solo un
problema casi exclusivo del software, pero lleg&oacute; a introducirse
en el hardware de las grandes computadoras y, finalmente, tambi&eacute;n
en los componentes de las computadoras personales. Y m&aacute;s
todav&iacute;a, todos los circuitos de automatizaci&oacute;n que
se localizan en todo tipo de aparatos y dispositivos, muchos de
los cuales utilizan fechas como parte de sus programas internos.
De tal suerte que el 1&ordm; de Enero del 2000, un gran n&uacute;mero
de computadoras, sistemas, dispositivos, aparatos y m&aacute;quinas
no ser&aacute;n capaces de reconocer las fechas del nuevo milenio,
o har&aacute;n c&aacute;lculos err&oacute;neos al suponer que
son fechas de otro milenio, y cuando esto suceda, empezar&aacute;n
a surgir errores y problemas que nos afectar&aacute;n a TODOS
en nuestros negocios y vidas privadas.</FONT></P>

<FONT FACE=ARIAL>
<H3>Esto es el Y2K.</H3>
<FONT FACE=ARIAL>
<h4>El verdadero problema:</h4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">A&uacute;n cuando se comprenda la l&oacute;gica
del problema, una primera apreciaci&oacute;n nos conduce a pensar
que es algo simple de arreglar. Y esto es correcto, arreglar un
campo de fecha es algo operativamente viable y sencillo. El verdadero
problema es considerar el gran n&uacute;mero y variedad de campos
de fecha que deben ser corregidos. Hagamos una comparaci&oacute;n.
Suponga que hay que cambiar la chapa de su puerta porque ya no
servir&aacute;n tus llaves. Bien pues no hay problema. Se cambia
y ya. Asunto arreglado. Pero ahora suponga que le piden que cambie
todas las chapas de las puertas de su comunidad. Vaya, eso s&iacute;
es un problema. Primero porque son much&iacute;simas y ello le
va tomar un buen tiempo. Pero adem&aacute;s existen puertas que
no ve porque est&aacute;n escondidas en pasajes de edificios y
m&aacute;s edificios. Adem&aacute;s encontrara que hay chapas
que no pueden ser reemplazadas por ser muy especiales como las
que resguardan b&oacute;vedas de valores, en fin, tendr&aacute;
una misi&oacute;n imposible porque hay una fecha l&iacute;mite.</FONT></P>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">Esa es la verdadera naturaleza del problema
del a&ntilde;o 2000. Un reto de localizaci&oacute;n, acceso, an&aacute;lisis,
recursos, presupuesto, conocimiento y tiempo. Habr&iacute;a podido
arreglarse sin ning&uacute;n problema si hubi&eacute;ramos empezado
con tiempo suficiente. No lo hicimos as&iacute; y se ha acumulado
un problema que ser&aacute; imposible vencer en el tiempo que
nos queda.</FONT></P>
<FONT FACE=ARIAL>
<H4>&iquest;Porqu&eacute; preocuparse?</H4>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">Especialistas que trabajan en el proyecto
Y2K, manifiestan su nerviosismo por algunas compa&ntilde;&iacute;as
que no han tomado seriamente &eacute;sta amenaza. El <I>Dr. Edward
Yardeni</I>, experto en el tema, economista en jefe del <I>Deutsche
Bank</I>, en <I>Alemania</I>, predice serios problemas en computadoras
de negocios, en algunos gobiernos, sobre todo en pa&iacute;ses
subdesarrollados, en los sistemas de comunicaciones, transportaci&oacute;n,
hospitales, instalaciones militares y en el resto del mundo industrial.
Sin duda, la primera actitud coherente ante el Y2K es otorgarle
la importancia que tiene dado que nuestro entorno est&aacute;
plagado de dispositivos susceptibles de fallar el 01 de enero
del a&ntilde;o 2000.</FONT></P>
<FONT FACE=ARIAL>
<H4>La lista de acciones a seguir:</H4>

<P ALIGN="JUSTIFY"><B><FONT FACE="Arial">&iquest; Que es lo que podemos hacer?</FONT></B><FONT
 FACE="Arial"> Existen algunos procedimientos preventivos a fin
de que el Y2K, no nos tome por sorpresa.</FONT></P>


<P ALIGN="JUSTIFY"><FONT FACE="Arial">1. - <B>Pruebe todas sus computadoras, software
y hardware</B>. Realice un inventario de todo el hardware, software,
perif&eacute;ricos y equipo construido con chips de ordenadores,
esto incluye sistemas de telefon&iacute;a e incluso algunos autom&oacute;viles.
Tome en cuenta que muchos fabricantes cuentan ya con p&aacute;ginas
especiales acerca de soluciones Y2K en Internet. La mayor&iacute;a
de los ordenadores construidos despu&eacute;s de 1997 cuentan
en sus Bios con el soporte para el error del milenio. Si usted
tiene m&aacute;quinas m&aacute;s viejas, digamos una 486, se requiere
revisar el Bios para cerciorarse si cuenta o no con los cuatro
d&iacute;gitos en el campo del a&ntilde;o. En caso contrario se
puede llamar al fabricante para consultar la soluci&oacute;n propuesta
por &eacute;l. En todo caso, no se deber&aacute; alojar informaci&oacute;n
cr&iacute;tica, como contabilidad o bases de datos, en un equipo
de estas caracter&iacute;sticas. Si est&aacute; corriendo sistemas
operativos como Windows 95, 98, Windows NT, Unix o Macintosh OS,
seguramente no tendr&aacute; problemas con ellos. Sin embargo,
deber&aacute; revisar todas las aplicaciones que corren sobre
ellos para cerciorarse de que no tengan problemas.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">2. - <B>Realice un simulacro</B>. Si tiene
dudas sobre aplicaciones que no consideren el Y2K, o no puede
contactar con el fabricante para que le explique si tiene o no
soporte, usted puede realizar un simulacro con un backup del mismo
y adelantar la fecha de la computadora y del programa para simular
un cambio de siglo. Este simulacro deber&aacute; ser observado
minuciosamente para percatarse de los posibles errores en la informaci&oacute;n.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">3. - <B>Estreche su cadena de alimentaci&oacute;n</B>.
Esto es, contacte a quienes participan interactuando con usted
en su negocio, como proveedores, clientes, vendedores for&aacute;neos,
etc., a fin de observar si est&aacute;n tomando medidas para el
Y2K y si est&aacute;n totalmente percatados del problema. Recuerde,
un error de ellos, puede ocasionarle serios trastornos, sobre
todo si depende de sus servicios para alg&uacute;n proceso de
su negocio. Hable a su banco e indague si han considerado medidas.
No solo eso, no se f&iacute;e de la palabra de nadie. Si es posible,
solicite que por escrito le presenten un certificado de que un
servicio por usted contratado est&aacute; libre del llamado error
del milenio.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">4. - <B>No compre nuevo equipo o software</B>,
a no ser que est&eacute; absolutamente seguro de que est&aacute;
certificado para el Y2K.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">5. - <B>Aseg&uacute;rese financieramente</B>.
Pague todas sus deudas. Aseg&uacute;rese de tener documentaci&oacute;n
de sus pagos. Confirme si su tarjeta de cr&eacute;dito funcionar&aacute;
bien despu&eacute;s del 01 de Enero del a&ntilde;o 2000. Por su
propia seguridad, no realice movimientos con tarjetas durante
la transici&oacute;n al 2000, para cerciorarse que efectivamente
todo est&eacute; en orden. Tome nota de sus saldos en cuentas
e inversiones para que el 01 de Enero del a&ntilde;o 2000 usted
pueda confirmar que no haya modificaciones en sus balances.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">6. - Tenga, si le es posible, un <B>generador
de energ&iacute;a el&eacute;ctrica preparado</B>, suficiente abasto
de agua y comida, bater&iacute;as extra para su tel&eacute;fono
celular. No es una broma. Tampoco es un llamado alarmista. Pero
las medidas preventivas siempre son mejores que sufrir un evento
del que no est&aacute; preparado. Considere que el abasto de energ&iacute;a
el&eacute;ctrica puede fallar durante la transici&oacute;n al
2000, que las tiendas de autoservicio pueden cerrar temporalmente
debido a fallas en sus sistemas, en fin, adel&aacute;ntese a todo
ello.</FONT></P>



<P ALIGN="JUSTIFY"><FONT FACE="Arial">7. - <B>Organ&iacute;cese</B>. <I>William
Ulrich</I>, experto en Y2K, coautor del libro <I>&quot;El a&ntilde;o
2000, la crisis del software: cambio a un nuevo siglo&quot;</I>,
recomienda contactar con nuestra c&aacute;mara local de comercio,
Club de Rotarios, Escuelas y organizaciones diversas a fin de
enlazar un grupo en cadena. De esta manera, podremos aprender
acerca de las experiencias de soluciones de otros y considerar
cosas que no hab&iacute;amos pensado.</FONT></P>

<P ALIGN="JUSTIFY"><FONT FACE="Arial">A continuaci&oacute;n algunas direcciones
en las que podr&aacute; encontrar m&aacute;s informaci&oacute;n:</FONT></P>

<FONT FACE="Arial" size=2><A HREF="http://www.year2000.com/" target="_new">http://www.year2000.com/</FONT></A><BR>
<FONT FACE="Arial" size=2><A HREF="http://www.y2klinks.com/" target="_new">http://www.y2klinks.com/</FONT></A><BR>
<FONT FACE="Arial" size=2><A HREF="http://www.y2kjournal.com/" target="_new">http://www.y2kjournal.com/</FONT></A><BR>
<FONT FACE="Arial" size=2><A HREF="http://www.sba.gov/y2k/" target="_new">http://www.sba.gov/y2k/</FONT></A><BR>
<FONT FACE="Arial" size=2><A HREF="http://www.microsoft.com/latam/technet/hoy/a2000/default.asp" target="_new">http://www.microsoft.com/latam/technet/hoy/a2000/default.asp</FONT></A>
<br><br>
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>FEBRERO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="index01.htm"><font FACE="ARIAL"><B>[Opinión y Reportajes]</B></font></a> <HR>
<A HREF="repor.htm"><font FACE="ARIAL"><B>[Reportajes Varios]</B></font></a>
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">OPINION Y REPORTAJES</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>

