<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Lamborghini Diablo SV / Country Woods
</H3>

<table width="320" align="left"> 
<td><img src="jpg/nfs3f01.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Un deportivo con una belleza en sus l&iacute;neas y unas prestaciones del calibre de las que atesora el Lamborghini Diablo SV no pod&iacute;a quedar fuera de nuestro garaje de ensue&ntilde;o</center></font></td> 
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Apenas fue hace un par de meses cuando estuvimos por &uacute;ltima vez en nuestra villa natal —me refiero al circuito de Hometown— probando cuatro estupendos deportivos y comparando sus prestaciones. Entonces era oto&ntilde;o —deb&eacute;is tener en cuenta que est&aacute; ubicada en el hemisferio sur y, por tanto, las estaciones est&aacute;n cambiadas con respecto a las del continente europeo— pero ahora estamos en pleno invierno y la nieve ha ca&iacute;do en abundancia. A pesar de las inclemencias del tiempo, no hemos podido resistir la tentaci&oacute;n de volver a casa para dar envidia a nuestros vecinos con nuestra &uacute;ltima adquisici&oacute;n: un flamante Lamborghini Diablo SV de color amarillo con el logotipo del modelo pintado en negro en los laterales.</P>

<P ALIGN="JUSTIFY">Como estamos algo cansados del trazado que hemos empleado ya en dos ocasiones preparamos para este evento una ruta alternativa, que se adentra en los bosques cercanos por unas estrechas y retorcidas carreteras secundarias haciendo la prueba mucho m&aacute;s entretenida a la par que larga, ya que el recorrido total es de 8.3 km de longitud. Los arcenes est&aacute;n cubiertos de nieve y hielo, lo que hace de la conducci&oacute;n al l&iacute;mite un reto todav&iacute;a mayor que en condiciones normales. Esto, unido a la no demasiado buena estabilidad del Diablo SV —dotado de una zaga bastante nerviosa— nos dar&aacute;, con total seguridad, m&aacute;s de un quebradero de cabeza para conseguir que los tiempos de vuelta caigan.</P>

<P ALIGN="JUSTIFY">Pero no todo son inconvenientes porque no en vano el Diablo SV es uno de los deportivos con mejores prestaciones que se pueden encontrar en el mercado. Su aceleraci&oacute;n es fulgurante, tanto es as&iacute; que la primera velocidad, usada sin cuidado, puede acabar con los neum&aacute;ticos quemados en el asfalto y con nosotros mirando en la direcci&oacute;n equivocada de la pista. No es que esta circunstancia no sea divertida y provocada incluso por nosotros en m&aacute;s de una ocasi&oacute;n pero, cuando lo que se busca son los tiempos de vuelta r&aacute;pida, no es lo m&aacute;s aconsejable. Y es que el Diablo SV cuenta con un excelente motor V12 de 5.707cc con cuatro v&aacute;lvulas por cilindro que genera la nada desde&ntilde;able cifra de 529 CV. Con estas cartas de presentaci&oacute;n no es de extra&ntilde;ar que este aut&eacute;ntico "diablo" de la carretera se ponga de 0 a 100 kmh en 3.9 segundos y de 0 a 160 en 8.1 segundos, alcanzando una velocidad m&aacute;xima de 335 kmh. Y eso que el cambio de s&oacute;lo 5 velocidades penaliza algo estas cifras. Por otro lado, sus frenos de f&oacute;rmula 1 y sus enormes neum&aacute;ticos ayudan a detener el veh&iacute;culo en un suspiro. Pero lo que m&aacute;s llama la atenci&oacute;n de este deportivo nada m&aacute;s verlo es su agresiva l&iacute;nea y sus puertas en "ala de gaviota", muy en la l&iacute;nea de su hermano peque&ntilde;o el Countach.</P>

<h4>Toma de contacto con el Diablo SV</h4><P ALIGN="JUSTIFY">
Las cifras no mienten en absoluto y las primeras vueltas de toma de contacto se tornan un divertido carrusel de trompos, derrapadas salvajes y aceleraciones brutales quemando goma en primera velocidad. Y lo cierto es que los desarrollos del SV son tan largos, para acomodarse a su enorme potencia, que en curvas lentas es necesario insertar esta marcha para sacar todo el potencial del coche. En todo momento tenemos la sensaci&oacute;n de estar tratando de domar un potro salvaje al que no le gustan las riendas en absoluto. El sonido del V12 es m&uacute;sica para los o&iacute;dos de cualquier aficionado y su posici&oacute;n central hace que lo notemos vibrar a nuestra espalda con total nitidez, a pesar del correcto aislamiento sonoro del coche. El chasis de tubo de acero, aleaci&oacute;n de aluminio y fibra de carbono es ligero pero a pesar de la suspensi&oacute;n semiactiva la potencia es a veces excesiva para lo que tolera el conjunto.</P>

<P ALIGN="JUSTIFY">Tras las primeras vueltas jinete y montura empezamos a conocernos mejor y, poco a poco, se va creando una relaci&oacute;n de buena amistad entre ambos. Nosotros tratamos el pedal del acelerador con algo m&aacute;s de suavidad y, a cambio, el coche se vuelve algo m&aacute;s d&oacute;cil. Ahora es cuando empezamos a sacarle verdadero partido. Conocemos el circuito como la palma de nuestra mano pero nunca lo hab&iacute;amos recorrido montados en un "monstruo" de m&aacute;s de 500 CV por lo que, en estos momentos, el trazado descubre nuevos aspectos hasta ahora ignorados. Sin demasiadas prisas, sin ir realmente "a tope", obtenemos los primeros tiempos de vuelta significativos: una mejor vuelta de 2' 43" 21 y un tiempo total de 11' 10" 56, con una velocidad m&aacute;xima bien por encima de los 260 kmh nada menos (exactamente 262.73), en un circuito de lo m&aacute;s virado.</P>

<h4><P ALIGN="JUSTIFY">Un paseo a más de 250 KM/H por Country Woods</h4>
La l&iacute;nea de salida la hemos situado en el mismo lugar que para el trazado de Hometown y las tres primeras curvas son comunes con esta pista. La tercera a izquierdas no se puede hacer a fondo, sobre todo con este coche, y habremos de sacrificarla un poco para tomar la siguiente, a derechas, que da entrada a los dos puentes de madera, ya conocidos tambi&eacute;n. A la salida del segundo puente tenemos una peque&ntilde;a recta y, de inmediato, empezamos la nueva ruta de Country Woods con un brusco giro a izquierdas de 3ª velocidad que se puede tomar m&aacute;s r&aacute;pido de lo que en un principio pueda parecer.</P>

<P ALIGN="JUSTIFY">Enseguida nos topamos con una nueva curva ascendente a derechas y, a continuaci&oacute;n, otra a la izquierda, ambas de 2ª o 3ª. Tras una corta recta llegamos a la curva de la gasolinera, de derechas para seguir, pisando a fondo, por un tramo pr&aacute;cticamente recto, pasando frente a una f&aacute;brica de Donuts. Giramos levemente a la derecha para tomar un salto ciego seguido por una curva a izquierdas. El conjunto es bastante traicionero si no estamos prevenidos. Salimos de la curva en 3ª acelerando hasta llegar a una lenta horquilla de 2ª. Hay que tomarla con mimo para no cruzar el coche. Salimos de la horquilla acelerando hasta poner 3ª y cortamos gas ligeramente para tomar una curva a izquierdas en descenso, r&aacute;pidamente seguida de otra en ascenso a derechas.</P>

<P ALIGN="JUSTIFY">Ahora viene una serie de curvas de 90º que debemos tomar a base de forzar una ligera derrapada de la zaga del coche. La primera es a la izquierda, la segunda a la derecha pasando bajo un puente, la tercera saliendo del puente a la izquierda y la &uacute;ltima de nuevo a la izquierda dando paso a una recta bastante larga. Todas estas curvas se pueden tomar en 2ª velocidad. La carretera pronto comienza a descender y llegamos a una curva r&aacute;pida de derechas, larga y abierta de 3ª / 4ª velocidad en la que debemos controlar una cierta dosis de derrapada para no salirnos hacia el exterior. Al final de la curva la carretera comienza un nuevo ascenso que nos deja ante otra curva de similares caracter&iacute;sticas esta vez a izquierdas.</P>

<br>
<center><table width="320" align="center"> 
<TR><td><img src="jpg/nfs3f02.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>El Diablo SV se porta como un aut&eacute;ntico fuera de serie en el revirado trazado de Country Woods pero requiere unas manos expertas para llevarlo por el sitio</center></font></td></tr>
</table></center>
<br>

<P ALIGN="JUSTIFY">De nuevo, mientras trazamos esta &uacute;ltima curva, la carretera desciende fuertemente para llegar a la tercera curva de similar trazado. Nuevamente a derechas pero algo m&aacute;s cerrada que las anteriores. Hay que tener cuidado de no salirse del asfalto ni lo m&aacute;s m&iacute;nimo porque eso supone irse hacia el exterior completamente, tardando un tiempo precioso en recuperar el control del veh&iacute;culo o incluso teniendo un accidente al coger la zona nevada de la izquierda. Al final de esta curva la carretera asciende de nuevo. Reducimos un poco, quiz&aacute;s hasta 2ª velocidad, dependiendo de nuestros desarrollos, para tomar otra curva a izquierdas que se cierra al final.</P>

<P ALIGN="JUSTIFY">Salimos de esta curva pisando el acelerador, atravesando una corta recta hasta una curva a derechas en ascenso. Frenamos ligeramente a la entrada y bajamos una marcha, posicionando el coche para la peque&ntilde;a "chicane" a la que nos enfrentamos, con el quitamiedos a nuestra izquierda. Seguimos a fondo hasta la siguiente curva, otra de 90º a la derecha, de 2ª velocidad. A la salida de esta curva podemos pisar sin miedo hasta la l&iacute;nea de meta. Tras un tramo recto pasaremos por un largo t&uacute;nel que asciende y a cuya salida daremos un buen salto, quedando en una zona ya conocida del circuito de Hometown: la recta previa a los dos arcos de piedra. Tomaremos el descenso ligeramente hacia la izquierda, después una curva a la derecha, otra a la izquierda comenzando de nuevo a ascender y, por &uacute;ltimo, dos r&aacute;pidas curvas enlazadas a derecha e izquierda que nos llevan hasta la l&iacute;nea de meta.</P>

<h4>Puesta a punto del Diablo SV</h4><P ALIGN="JUSTIFY">
Lo primero que salta a la vista despu&eacute;s de rodar unas cuantas vueltas con este coche por Country Woods es el desajuste que se produce entre su tremenda potencia acompa&ntilde;ada, como es l&oacute;gico, de largos desarrollos y lo "ratonero" que se vuelve el trazado en ocasiones. Nos vemos obligados a emplear la primera velocidad demasiado a menudo y, sin embargo, la quinta es pr&aacute;cticamente in&uacute;til ya que no hay zonas lo suficientemente rectas y r&aacute;pidas para que este coche desarrolle toda su velocidad. Otra cosa a tener en cuenta es que, en estas condiciones de hielo y nieve en la calzada, no es en absoluto aconsejable calzar neum&aacute;ticos lisos ya que, en cuanto pisamos los arcenes helados, el coche comienza a patinar de forma ostensible haci&eacute;ndose muy complicado su manejo.</P>

<P ALIGN="JUSTIFY">De todas formas, vamos a comenzar como siempre por lo m&aacute;s b&aacute;sico: una suspensi&oacute;n m&aacute;s firme y un retoque de la curva de par motor que favorezca la respuesta en alta. Con estos reglajes se nota que el coche empuja algo m&aacute;s y en las zonas r&aacute;pidas ganamos velocidad punta, llegando a superar los 275 kmh. Eso s&iacute;, el aumento de potencia hace del coche un aut&eacute;ntico desaf&iacute;o para el piloto, m&aacute;s dif&iacute;cil a&uacute;n de dominar que antes. Esto se traduce en una gran dificultad para mejorar los tiempos ya que el m&aacute;s m&iacute;nimo error tiene serias repercusiones en el tiempo total. Tras mucho practicar obtenemos un tiempo de 2' 41" 46 pero no quedamos muy contentos con el resultado ya que hemos cometido varios errores en dicha vuelta que nos han privado con seguridad de un resultado mucho m&aacute;s positivo.</P>

<br>
<center><table width="320" align="center"> 
<TR><td><img src="jpg/nfs3f03.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>Estamos a punto de aterrizar de nuevo sobre el asfalto tras el impresionante vuelo desde la salida del t&uacute;nel</center></font></td></tr>
</table></center>
<br>

<P ALIGN="JUSTIFY">A pesar del aumento de potencia el circuito a&uacute;n se nos queda corto y la quinta velocidad muy larga en su desarrollo. En la zona m&aacute;s r&aacute;pida apenas llegamos a 5.500 vueltas de motor. As&iacute; que reducimos todo lo posible los desarrollos lo que se traduce en una mejora notable de la aceleraci&oacute;n y un mejor aprovechamiento del motor que ahora sube hasta m&aacute;s all&aacute; de las 6.000 en 5ª en la zona r&aacute;pida antes de meta. A pesar de todo sigue sin ser ni mucho menos sencillo el mejorar los tiempos de vuelta. Este coche parece igualmente bueno de serie como con los reglajes m&aacute;s id&oacute;neos que podamos encontrar. Despu&eacute;s de mucho pelearnos con el volante, por fin las mejoras se hacen notar ligeramente y conseguimos un tiempo de vuelta de 2' 40" 84. No mejoramos la velocidad m&aacute;xima pero, al menos, conseguimos un tiempo "decente" en el total de las cuatro vueltas: 10' 56" 18.</P>

<P ALIGN="JUSTIFY">Este coche a&uacute;n da m&aacute;s juego, lo sabemos, pero nos quedamos con las ganas de seguir intentando extra&eacute;rselo. Y es que, sencillamente, nos duelen el cuello y los hombros de tanto pelearnos con &eacute;l. Pilotar este coche buscando el l&iacute;mite es un ejercicio agotador y si el trazado est&aacute; tan plagado de curvas como el de Country Woods a&uacute;n peor. Quiz&aacute;s retocando el apoyo aerodin&aacute;mico y el reparto de frenada podr&iacute;amos ganar alg&uacute;n segundo pero tambi&eacute;n queremos dejar algo para vosotros.</P>

<h4>Conclusión</h4><P ALIGN="JUSTIFY">
Nuestra colecci&oacute;n de veh&iacute;culos de altas prestaciones se enorgullece de contar con semejante ejemplar entre sus filas. El Diablo SV es tremendamente divertido de conducir pero, como acabamos de decir, tambi&eacute;n es agotador. En cualquier caso nos ha dejado mucha mejor impresi&oacute;n que el anterior coche probado de la marca, el Countach, y se convierte en uno de nuestros favoritos. Nos quedamos con ganas de probarlo en condiciones de seco y con unos neum&aacute;ticos lisos que mejoren el agarre porque la brutal potencia de su motor necesita de esa sujecci&oacute;n adicional a todas luces.</P>
<P ALIGN="JUSTIFY">Como siempre, si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
