<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Ferrari 355 F1 Spider / Hometown
</H3>

<table width="319" align="left"> 
<td><img src="jpg/nfs3a01.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Nuestro flamante Ferrari 355 F1 Spider esperando a que nos subamos en él y lo subamos "un poco" de vueltas</center></font></td> 
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Nos ha costado hasta el &uacute;ltimo euro que ten&iacute;amos en la cuenta bancaria pero por fin es nuestro ese maravilloso Ferrari 355 F1 Spider que durante tanto tiempo hemos deseado poseer. Vamos a darnos un paseo por nuestra villa natal en este coche de ensue&ntilde;o… bueno, lo de "paseo" es una forma de hablar. ¿Qui&eacute;n se comprar&iacute;a un "cavallino" de pura sangre para rodar tranquilamente por la carretera? Seamos sinceros: nos gusta pisar el acelerador a fondo y est&aacute;bamos hartos ya de la limitada potencia de ese peque&ntilde;o deportivo con motor 2.0 16v que tantas alegr&iacute;as nos dio en un principio pero que ahora nos parece ins&iacute;pido y aburguesado.</P>

<P ALIGN="JUSTIFY">Hemos elegido, para dar un buen estreno al coche, un circuito que circunda la peque&ntilde;a ciudad. No demasiado complicado pero con suficiente variedad como para ser entretenido, con zonas r&aacute;pidas donde sentir el v&eacute;rtigo de la velocidad con may&uacute;sculas y zonas viradas donde sentir el impresionante agarre y capacidad de aceleraci&oacute;n de este aut&eacute;ntico juguetito.</P>

<H4>Toma de contacto con el 355 Spider</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
La primera sensaci&oacute;n que tenemos al subirnos al 355 Spider es la de estar en otra dimensi&oacute;n. El impresionante sonido del motor a nuestra espalda, incluso al ralent&iacute;, nos transporta de inmediato al mundo de la competici&oacute;n y nos hace sentir parte de la historia, llena de &eacute;xitos deportivos, de una marca legendaria como es Ferrari. Aceleramos en vac&iacute;o solo para sentir como la adrenalina nos invade al ritmo de los cada vez m&aacute;s r&aacute;pidos latidos de nuestro coraz&oacute;n, que trata en vano de imitar el ritmo del motor. El bramido de la mec&aacute;nica cuando llega a las proximidades de la zona roja es indescriptible. Cada vez estamos m&aacute;s convencidos de que ha sido un dinero bien gastado.</P>

<P ALIGN="JUSTIFY">Engranamos la primera velocidad —mediante el mando situado en el volante— y comenzamos la primera vuelta sin forzar demasiado, tratando de familiarizarnos con el coche y con la pista. Enseguida nos habituamos al cambio semiautom&aacute;tico, que nos hace sentirnos como en un aut&eacute;ntico monoplaza de F&oacute;rmula 1 —de ah&iacute; la denominaci&oacute;n F1 del coche—, y tomamos las primeras curvas r&aacute;pidas en busca de la primera dificultad del circuito. El coche se muestra en todo momento d&oacute;cil para sus 375 CV de potencia m&aacute;xima —ofrecida a 8.250 rpm—. El motor estira f&aacute;cilmente hasta las 8.500 vueltas, lo que unido a las 6 relaciones de cambio hace de la conducci&oacute;n una verdadera gozada, pudiendo mantener siempre un par motor &oacute;ptimo. El coche se muestra muy estable y divertido de pilotar. Despu&eacute;s de unas pocas vueltas nos sentimos con &aacute;nimos de empezar a pisar a fondo, as&iacute; que vamos con el primer an&aacute;lisis superficial del circuito:</P>

<H4>Primeras vueltas a Hometown</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Como dec&iacute;a, las tres primeras curvas, a derechas, izquierdas y nuevamente a izquierdas se pueden tomar a fondo, reduciendo m&iacute;nimamente para tomar la cuarta a derechas que da entrada a un puente de madera. Recto y a fondo hasta el segundo puente, con un salto entre ambos que a m&aacute;s de uno quitar&aacute; la respiraci&oacute;n la primera vez. A la salida del puente apuntaremos levemente el morro hacia la derecha para tomar las dos curvas siguientes, muy abiertas, sin problemas y tambi&eacute;n con el gas a fondo. La curva siguiente —la curva de la iglesia— es a derechas y tiene doble radio; debemos tomarla bastante cortada, bien pegados a la valla puesto que se cierra ligeramente a la salida. De esta manera no hay problema para seguir en sexta velocidad en pos de la siguiente a izquierdas pr&aacute;cticamente inexistente. La siguiente curva, nuevamente a derechas y en pronunciada bajada, debemos tomarla con mucha anticipaci&oacute;n o de lo contrario nos iremos directos contra el muro de la izquierda ya que es ciega y se cierra bastante al final; tomada correctamente tambi&eacute;n se puede hacer a fondo.</P>
<P ALIGN="JUSTIFY">Otras dos curvas m&aacute;s sin problemas nos dan paso a la entrada a la ciudad con una primera curva a derechas que tomaremos a fondo y una segunda, tambi&eacute;n a derechas, mucho m&aacute;s cerrada que conviene tomar mediante una fuerte derrapada y con bastante anticipaci&oacute;n, apuntando el morro a la esquina del edificio y dejando deslizar el coche hacia la izquierda, dando gas de nuevo tan pronto como sea posible —y sin "tragarnos" ninguna farola por el camino—. Inmediatamente nos cerraremos a la izquierda para tomar la siguiente curva, algo enga&ntilde;osa si no tenemos cuidado, y pasaremos junto al molino virando levemente a derechas y pisando a fondo ya hasta la l&iacute;nea de meta. Seguiremos por una larga recta pasando bajo dos arcos de piedra, el segundo de los cuales da pie a una fuerte bajada que tomaremos por la izquierda. La siguiente curva a derechas da t&eacute;rmino a la bajada y debemos tener cuidado de no irnos demasiado pronto hacia la izquierda, donde nos espera la siguiente curva, ya en subida, seguida por una larga curva a derechas que tomaremos bien pegados al v&eacute;rtice hasta que veamos la siguiente, a izquierdas, que nos deja en la l&iacute;nea de llegada.</P>

<P ALIGN="JUSTIFY">Una vez memorizado el circuito nos preparamos para el primer cronometraje en serio. Nos colocamos en la salida, aceleramos a fondo y salimos disparados, tratando de no derrapar demasiado, lo que nos har&iacute;a perder valiosos segundos. Entre las 6.000 y las 7.000 vueltas es el r&eacute;gimen &oacute;ptimo para la arrancada. Vamos a dar cuatro vueltas y veremos qu&eacute; tal se nos da…</P>

<P ALIGN="JUSTIFY">Ya hemos llegado a la meta, realizando una salvaje derrapada. Quemar un poco de goma viene bien para liberar la adrenalina acumulada durante la carrera. Tomamos los tiempos y el total de las cuatro vueltas ha sido de 6' 22" 31, con una velocidad m&aacute;xima de unos 257 kmh. ¡Para ser la primera vez no est&aacute; nada mal! La primera vuelta la hemos completado en 1' 42" 50 y la mejor en 1' 31" 68. No ha sido un recorrido perfecto. Sabemos que, corrigiendo algunos errores de conducci&oacute;n, podemos bajar unos 4 &oacute; 5 segundos el tiempo con facilidad pero es un comienzo. Antes de seguir rodando, sin embargo, vamos a tratar de afinar un poco nuestro coche para obtener las mejores prestaciones.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3a02.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Derrapada salvaje tras cruzar la meta. Quemar un poco de goma viene bien para liberar la adrenalina acumulada durante la carrera</center></font></td> 
</table></center>
<br>

<H4>Puesta a punto del coche</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Por muy buenos pilotos que seamos, si el coche no est&aacute; en &oacute;ptimas condiciones no vamos a obtener buenos resultados as&iacute; que vamos a ver qu&eacute; podemos hacer… Probaremos las modificaciones una por una para observar mejor los cambios de comportamiento del coche.</P>

<P ALIGN="JUSTIFY">En primer lugar, puesto que vamos a rodar en asfalto seco, cambiaremos los neum&aacute;ticos por unos totalmente lisos. Esto nos debe proporcionar mejor agarre tanto en aceleraciones bruscas como en curvas cerradas. Probamos la nueva configuraci&oacute;n y, aunque la mejora no parece demasiado acusada, los tiempos obtenidos nos dicen lo contrario: 6' 13" 87 en el total de las cuatro vueltas, con una primera vuelta de 1' 39" 15 y una mejor vuelta de 1' 31" 03. La velocidad m&aacute;xima ha sido de casi 262 kmh. Pero se supone que el 355 Spider es capaz de alcanzar los 295 kmh as&iacute; que algo es susceptible de mejora todav&iacute;a.</P>

<P ALIGN="JUSTIFY">Antes de empezar a jugar con los desarrollos del cambio —que yo recomiendo dejar siempre para el final, cuando el resto del coche est&eacute; totalmente afinado— retocaremos el apoyo aerodin&aacute;mico. A estas alturas ya nos habremos dado cuenta de que, en este circuito, al 355 Spider le sobra agarre en curva, incluso en las m&aacute;s r&aacute;pidas. As&iacute; que aligeraremos la aerodin&aacute;mica todo lo posible para ganar velocidad punta. En estas condiciones el coche se vuelve un poco m&aacute;s delicado en las curvas pero a&uacute;n las podemos hacer a fondo como antes. El incremento de "potencia aparente" se deja sentir sobre todo en la zona de subida antes de la meta: donde antes el coche perd&iacute;a gas poco a poco ahora se mantiene sin problemas por encima de las 7.000 vueltas en sexta. El cron&oacute;metro no miente: una mejor vuelta de 1' 29" 93 mejorando en m&aacute;s de un segundo el mejor tiempo anterior; la velocidad m&aacute;xima tambi&eacute;n ha mejorado hasta los 268 kmh por las calles de la ciudad (una velocidad un tanto inadecuada para el casco urbano, ¿verdad?). Ya estamos en condiciones de bajar de los 6' 10" 00 pero a&uacute;n podr&iacute;amos ir un poquito m&aacute;s r&aacute;pido…</P>

<P ALIGN="JUSTIFY">Esta vez trataremos de ganar unos caballos extra retocando la curva de par motor. Puesto que el circuito es muy r&aacute;pido —no se baja de cuarta velocidad en todo el recorrido— nos interesa mejorar la respuesta del motor en alto r&eacute;gimen, sacrificando la capacidad de recuperaci&oacute;n que s&oacute;lo echaremos de menos en el cerrado &aacute;ngulo a derechas de la cuidad. Configuramos el motor para las m&aacute;ximas prestaciones en alta y volvemos al circuito. Tras la primera vuelta el coche parece otro; la velocidad punta es impresionante, superando ya los 282 kmh, pero como contrapartida los pasos por curva se vuelven mucho m&aacute;s delicados de hacer a fondo. A pesar de todo, el soberbio chasis del 355 a&uacute;n es capaz de absorber el aumento de fuerza centr&iacute;fuga y solo depende de nuestras "manos" ser capaz de volar por el circuito sin llevarnos una esquina por delante —por no hablar de la factura del taller mec&aacute;nico—. Conseguimos una mejor vuelta de 1' 26" 90, lo que nos da una proyecci&oacute;n de tiempo total alrededor del 5' 58" 00. Sin embargo no es f&aacute;cil rodar a un ritmo constante y perfecto a estas velocidades por lo que nos quedamos a unos segundos del tiempo te&oacute;rico. Con esta configuraci&oacute;n los desarrollos del cambio se nos empiezan a quedar algo cortos incluso, por eso mi consejo anterior de no tocarlos demasiado pronto. Un &uacute;ltimo comentario antes de seguir: tal como llevamos el coche en estos momentos es muy f&aacute;cil salir volando al comienzo de la bajada final —la que sigue a los dos arcos de piedra—. Para evitar perder esas d&eacute;cimas debemos afrontar la curva por la parte derecha, apuntar el morro bien hacia la izquierda antes de la bajada y no girar el volante para nada en el cambio de pendiente.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3a03.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Estamos llegando a la zona de los arcos de piedra, justo antes de la bajada final</center></font></td> 
</table></center>
<br>

<H4>Retoques finales</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Ya no es mucho lo que se puede hacer pero a&uacute;n hay unas d&eacute;cimas esperando ser limadas. Ahora intentaremos ganar estabilidad endureciendo la suspensi&oacute;n todo lo posible. El efecto negativo es que el coche se volver&aacute; un poco m&aacute;s nervioso. La mejora no es muy importante pero, a no ser que el circuito sea muy bacheado, siempre conviene llevar un tarado lo m&aacute;s firme que aguante nuestra espalda. Como el asfalto de este circuito es bastante bueno no hay raz&oacute;n para no hacerlo. Conseguimos una velocidad punta de 283 kmh y una mejor vuelta de 1' 26" 28, levemente inferior a nuestro r&eacute;cord hasta el momento. El tiempo total queda en 6' 00" 81, a unos cinco segundos de la perfecci&oacute;n pero muy cerca ya de nuestro objetivo de bajar de los seis minutos.</P>

<P ALIGN="JUSTIFY">El reparto de frenada no lo vamos a tocar as&iacute; como el &aacute;ngulo de la direcci&oacute;n ya que el coche est&aacute; perfectamente equilibrado en estos aspectos. Si decidimos experimentar con estos valores debemos tener en cuenta que un aumento del poder de frenada en el tren delantero nos dar&aacute; unas distancias de frenado m&aacute;s cortas aunque el coche tender&aacute; a "irse de morro" en frenadas fuertes al bloquearse las ruedas delanteras. Si desplazamos la frenada hacia el tren trasero obtenemos una mayor tendencia a sobrevirar frenando en curva. En cuanto a la direcci&oacute;n depende de nuestros gustos y tambi&eacute;n del circuito: en pistas lentas conviene una direcci&oacute;n r&aacute;pida que nos permita tomar las curvas m&aacute;s cerradas, mientras que en circuitos r&aacute;pidos es mejor una direcci&oacute;n lenta que ofrece mejor estabilidad en rectas y curvas abiertas.</P>

<P ALIGN="JUSTIFY">Por &uacute;ltimo vamos a jugar un poco con las relaciones de cambio. En las muchas vueltas que hemos dado al circuito habremos notado que, a medida que mejor&aacute;bamos otros aspectos, la velocidad alcanzada era mayor, llegando en sexta casi al corte en la zona m&aacute;s r&aacute;pida. Si establecemos unas relaciones de cambio m&aacute;s abiertas podemos ganar algo de velocidad punta a costa de la aceleraci&oacute;n pero en un circuito tan r&aacute;pido como &eacute;ste puede que nos compense. Las zonas de velocidad m&aacute;xima son, no obstante, muy pocas por lo que con una peque&ntilde;a variaci&oacute;n ser&aacute; bastante. Excedernos significar&aacute; perder demasiada aceleraci&oacute;n para obtener una velocidad m&aacute;xima que nunca llegaremos a alcanzar. Probamos con distintas configuraciones hasta dar con la que mejores resultados proporciona, alrededor del -14%. La mejora no es escandalosa pero se nota: algo m&aacute;s de 291 kmh de velocidad punta y una mejor vuelta de 1' 25" 34, dej&aacute;ndonos con la sensaci&oacute;n de que a&uacute;n se puede mejorar. En el total de las 4 vueltas conseguimos un tiempo de 5' 54" 68, tambi&eacute;n mejorable, al menos, hasta 5' 50" 00 o quiz&aacute;s por debajo de esa cifra, solo es cuesti&oacute;n de rodar perfecto con regularidad, nada m&aacute;s y nada menos.</P>

<H4>Conclusión</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Estos tiempos no son los mejores posibles. Todav&iacute;a podemos hacer peque&ntilde;os cambios para ajustar el coche a nuestro estilo personal de conducci&oacute;n y ganar algo de tiempo. Ahora es cuesti&oacute;n de cada uno afinar al m&aacute;ximo para batirlos. Ah&iacute; es donde empieza la diversi&oacute;n. Si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







