<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Chevrolet Corvette C5 / Redrock Ridge
</H3>






<table width="318" align="left"> 
<td><img src="jpg/nfs3b01.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Nuestro "Chevy" est&aacute; dispuesto para dar un paseo por el desierto americano</center></font></td> 
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Los americanos tienen unos gustos bastante diferentes a los de Europa en casi todos los &aacute;mbitos de la vida. Los coches no son, ni mucho menos, una excepci&oacute;n a esta regla. Incluso los deportivos americanos tienen un aire completamente distinto a los Ferrari, Porche, Mercedes o cualquier otro fabricante europeo de renombre que se nos ocurra. Eso no quiere decir que sean mejores ni peores, sino simplemente diferentes. Despu&eacute;s de unos a&ntilde;os viviendo en los Estados Unidos se nos han pegado los gustos de all&iacute;, as&iacute; que cuando decidimos comprarnos un coche nuevo acabamos decant&aacute;ndonos por un Chevrolet Corvette &uacute;ltimo modelo, en un color rojo intenso que nos apasiona. Como es preceptivo hay que "rodar" el motor un poco para quitarle el agarrotamiento t&iacute;pico de los coches reci&eacute;n estrenados.</P>

<P ALIGN="JUSTIFY">Hemos elegido, como corresponde al coche, un circuito muy americano que recorre el desierto por donde no tendremos molestia de tr&aacute;fico ni los dem&aacute;s inconvenientes de las zonas m&aacute;s transitadas. En algunos tramos la arena inunda e incluso esconde el asfalto pero nada que nos impida pisar el acelerador a fondo en busca del mejor tiempo.</P>

<H4>Toma de contacto con el Corvette</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Aunque, como ya he dicho, se nos han pegado los gustos americanos, a&uacute;n no estamos locos y, por supuesto, nos hemos comprado la versi&oacute;n con cambio manual de 6 velocidades —un deportivo con cambio autom&aacute;tico es un sacrilegio para nosotros—. Salimos del motel en el que nos alojamos y al lado del cual hemos decidido situar la meta. Nos introducimos en el coche y arrancamos. El sonido del coche no nos desagrada aunque no es comparable con el de un Ferrari, por ejemplo. El motor tiene un r&eacute;gimen de giro bastante bajo para un deportivo, no superando las 6.000 rpm pero, ¡qu&eacute; se le va a hacer! As&iacute; son los americanos.</P>
<P ALIGN="JUSTIFY">El comportamiento din&aacute;mico del coche es bastante aceptable pero da la sensaci&oacute;n de estar bastante m&aacute;s "domado" que los deportivos a los que estamos acostumbrados. Calza unos neum&aacute;ticos algo sobredimensionados que consiguen un buen agarre en curva pero en aceleraci&oacute;n no nos deja muy impresionados. Poco a poco nos familiarizamos con el tacto del veh&iacute;culo y nos empezamos a soltar con el acelerador. Las primeras vueltas al circuito las realizamos con los neum&aacute;ticos de serie y, como a&uacute;n tenemos cierta timidez, los tiempos no son precisamente buenos: la primera vuelta con salida parada la hacemos en un p&eacute;simo tiempo de 2' 58" 25 y la mejor de las cuatro en 2' 40" 84 para un tiempo total de 11' 04" 00 y una velocidad m&aacute;xima de casi 241 kmh. Tras sustituirlos por los preceptivos neum&aacute;ticos lisos los tiempos empiezan a caer y ya nos hacemos una idea m&aacute;s clara de las caracter&iacute;sticas del recorrido.</P>


<H4>Un recorrido por Redrock Ridge</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">

Salimos como un tiro desde el motel acelerando por un corto tramo recto y un par de curvas muy abiertas a derecha e izquierda. Llegamos a un puente tras el que nos espera un peque&ntilde;o salto que nos puede hacer bajar de 5ª a 4ª velocidad. Otro peque&ntilde;o tramo recto nos lleva hasta un complejo de acceso restringido con una enorme antena y, tras &eacute;l, una curva bastante pronunciada a derechas anunciada por tres carteles amarillos. Llegamos as&iacute; hasta la gasolinera situada en otra curva a derechas de caracter&iacute;sticas similares. Otro tramo recto y llegamos hasta una zona comprometida, con rocas en el medio de la carretera. La mejor trazada la haremos tomando la primera roca por la derecha, cruz&aacute;ndonos hacia la izquierda para tomar la segunda y de nuevo hacia la derecha para tomar la tercera y la cuarta, donde pondremos la 5ª velocidad. Aprovechando la curva a derechas que sigue a continuaci&oacute;n volveremos a pasarnos al lado izquierdo por el que seguiremos hasta salir de la zona de rocas. A continuaci&oacute;n viene una curva a izquierdas de doble radio al final de la cual pasamos por entre dos paredes verticales de roca para terminar en un salto y una fuerte bajada. Dos curvas hacia la derecha y la carretera tiende ahora hacia arriba.</P>
<P ALIGN="JUSTIFY">Tomamos un par de curvas a izquierdas sin problemas y llegamos, tras otra suave curva a derechas, a un nuevo t&uacute;nel seguido inmediatamente por otro. Daremos un peque&ntilde;o salto, bajaremos a 4ª y tenemos ante nosotros dos suaves curvas a izquierda y derecha tras las cuales viene la curva m&aacute;s lenta del recorrido, una horquilla a izquierdas de 2ª velocidad. Salimos de la curva acelerando por un tramo recto, ponemos 3ª y 4ª antes de llegar a un puente tras el cual nos encontramos de nuevo entre altas paredes de roca, con curvas a derecha, izquierda y derecha de nuevo. Otra curva ascendente y m&aacute;s cerrada a izquierdas, de doble radio, nos puede obligar a poner 3ª y nos deja en terreno despejado y recto. Ponemos de nuevo 4ª y tomamos una curva a derechas en bajada. Pasamos bajo unos arcos de roca y tomamos dos curvas abiertas a derechas poniendo 5ª. De nuevo salimos de entre las rocas y volvemos a bajar, esta vez hacia la izquierda llegando hasta una zona casi recta con un muro bajo de cemento al lado izquierdo.</P>
<P ALIGN="JUSTIFY">Ponemos 6ª y llegamos hasta la entrada de un largo t&uacute;nel que tiene algo de truco ya que el muro de cemento casi se interpone en la entrada. Bajaremos a 5ª haciendo la entrada al t&uacute;nel a derechas para, casi inmediatamente, tomar otra curva a derechas de doble radio, bastante enga&ntilde;osa puesto que se cierra al final. Un peque&ntilde;o tramo recto y otra curva a derechas que nos lleva a la salida del t&uacute;nel. Bajamos acelerando a fondo y tomamos cuatro curvas seguidas a la izquierda en 5ª con una valla de protecci&oacute;n al lado derecho. A continuaci&oacute;n una doble curva a izquierda y derecha nos deja bajo las v&iacute;as del tren y en una zona recta a dos saltos de la meta. Tras el segundo salto pondremos 4ª y seguiremos a fondo en 5ª por toda la zona que antes hicimos m&aacute;s despacio por salir de parados.</P>

<br>
<center><table width="361" align="center"> 
<td><img src="jpg/nfs3b02.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Nos hemos quedado cruzados por ir mirando el paisaje en lugar de la carretera</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">Con los neum&aacute;ticos lisos conseguimos bajar los tiempos pero no sabemos si es por la mayor familiaridad que tenemos ya con el circuito o por un verdadero efecto positivo del cambio. Probablemente una mezcla de ambas cosas. La primera vuelta la hacemos en un tiempo de 2' 47" 71 y la mejor de las cuatro en 2' 39" 21 para un tiempo total de 10' 47" 87 y una velocidad m&aacute;xima incluso peor que la anterior. Lo mejor ser&aacute; ir retocando el coche poco a poco para encontrar la configuraci&oacute;n con la que estemos m&aacute;s a gusto.</P>

<H4>Puesta a punto del coche</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">


A pesar de que el circuito es, en su mayor&iacute;a, bastante r&aacute;pido no hemos conseguido hasta el momento buenas cifras de velocidad. No es que el Corvette sea una maravilla en este aspecto comparado con otros deportivos de su categor&iacute;a pero algo s&iacute; que podemos mejorar. Preparamos el motor para una mejor respuesta a r&eacute;gimen elevado y volvemos al circuito a ver si esto consigue el efecto que busc&aacute;bamos. Desde el principio la diferencia es notoria, sobre todo en las zonas de subida, donde el coche aguanta mucho mejor el r&eacute;gimen, sin experimentar la acusada ca&iacute;da de vueltas que sufr&iacute;amos anteriormente. El tiempo conseguido lo deja muy claro: una mejor vuelta de 2' 34" 12 y un tiempo total de 10' 27" 75 con una velocidad m&aacute;xima de 253 kmh.</P>

<P ALIGN="JUSTIFY">Una suspensi&oacute;n m&aacute;s firme tambi&eacute;n nos puede ayudar en este circuito, sobre todo teniendo en cuenta la gran cantidad de saltos, peque&ntilde;os y grandes, que tenemos que dar si vamos a fondo. Es de suponer que el coche bote menos tras los saltos, recuperando antes la adherencia al asfalto. Con esta nueva configuraci&oacute;n salimos nuevamente al circuito y, en un par de intentos conseguimos bajar dos veces consecutivas el mejor tiempo anterior hasta dejarlo en 2' 32" 28, que empieza a ser un buen crono. No se puede negar que, de nuevo, parte de la mejora se debe al mejor conocimiento del circuito que vamos teniendo ya que en pistas tan largas como esta la perfecci&oacute;n es algo que cuesta mucho conseguir y siempre parece que hay sitio para la mejora. Por otra parte, al ser un recorrido largo, tambi&eacute;n es m&aacute;s dif&iacute;cil conseguir una vuelta realmente perfecta. La velocidad m&aacute;xima tambi&eacute;n la hemos mejorado hasta los 263 kmh.</P>

<P ALIGN="JUSTIFY">Como dijimos al principio el coche cuenta con buen agarre en curva as&iacute; que vamos a eliminar todo el apoyo aerodin&aacute;mico que podamos esperando mejorar a&uacute;n m&aacute;s esa velocidad punta algo mediocre que estamos consiguiendo. De no resultar tendremos incluso que bajar algo los desarrollos ya que apenas podemos poner 6ª velocidad en todo el recorrido. Hay que estudiar bien los resultados obtenidos ya que el apoyo aerodin&aacute;mico es un arma de doble filo; ganaremos velocidad en las rectas largas pero podemos perderla en curvas r&aacute;pidas debido a la menor capacidad de sujeci&oacute;n del coche al asfalto. Probamos y los tiempos parecen darnos la raz&oacute;n, aunque no por mucho margen: una mejor vuelta de 2' 31" 46 y un total de 10' 21" 15 con una velocidad punta de casi 269 kmh.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3b03.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Estamos a punto de llegar a la horquilla m&aacute;s lenta de todo el circuito, que est&aacute; claramente se&ntilde;alizada con avisos amarillos de peligro</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">A pesar de la menor carga aerodin&aacute;mica del coche a&uacute;n no conseguimos subir la 6ª a tope de vueltas en la recta del muro antes del t&uacute;nel largo. La tendencia de los deportivos americanos a unas relaciones de cambio excesivamente largas nos est&aacute; penalizando con una cierta falta de aceleraci&oacute;n. Bajaremos un poco los desarrollos —entre el 10% y el 30%— y veremos si esto nos hace mejorar. Notamos el cambio muy levemente y es que este Corvette C5 nos ha decepcionado un poco por su falta de "nervio". A pesar de la reducci&oacute;n de desarrollos el coche sigue mostr&aacute;ndose algo perezoso en las recuperaciones y el escaso r&eacute;gimen m&aacute;ximo que alcanza el motor es otro claro inconveniente. Mejoramos en velocidad m&aacute;xima hasta los 271 kmh pero no conseguimos bajar el tiempo de vuelta r&aacute;pida a pesar de emplearnos a fondo vuelta tras vuelta. Este esfuerzo s&iacute; se traduce en el tiempo total de 10' 14" 81 el mejor, con diferencia, de los obtenidos hasta el momento.</P>

<H4>Conclusión</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
El Corvette C5 es divertido de conducir aunque demasiado "tranquilo" para nuestro gusto. Para sacarle todo el partido posible hay que conducir muy fino ya que el m&iacute;nimo error te puede hacer perder la estrecha franja de par motor &oacute;ptimo. Como aficionado a la conducci&oacute;n deportiva encuentro mucho m&aacute;s apasionante la conducci&oacute;n de los modelos t&iacute;picamente europeos e incluso japoneses.</P>

<P ALIGN="JUSTIFY">En cuanto al circuito resulta bonito y exigente con la conducci&oacute;n, no tanto por tener muchos y fuertes cambios de ritmo sino porque hay que "hilar muy fino" para conseguir buenos tiempos. Con retoques m&iacute;nimos del coche a&uacute;n se puede experimentar y bajar estos tiempos uno o dos segundos por vuelta pero me permitir&eacute;is que os deje esa tarea a vosotros porque yo me voy a conducir a otras tierras menos &aacute;ridas y otros veh&iacute;culos con m&aacute;s raza. Como siempre, si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>


</FONT>
<br><br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







