<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Ferrari 550 Maranello / Atl&aacute;ntica
</H3>

<table width="320" align="left"> 
<td><img src="jpg/nfs3c01.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Nuestro segundo Ferrari tiene unas l&iacute;neas tremendamente elegantes y fluidas. No es pasi&oacute;n de ferrarista si a&ntilde;ado que esto es lo habitual en todos los modelos de la marca del "cavallino"</center></font></td> 
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">En contra de lo que es ya tradici&oacute;n en Ferrari, el 550 Maranello cuenta con motor delantero. Sin embargo esta es casi la &uacute;nica sorpresa que nos llevamos en nuestro primer contacto con este coche ya que el resto de sus cualidades nos recuerdan enormemente al resto de deportivos m&iacute;ticos de la casa. Si acaso detectamos un comportamiento ligeramente m&aacute;s civilizado de lo que estamos acostumbrados, dicho esto en t&eacute;rminos relativos por que no habr&aacute; mucha gente que coincida conmigo en que un coche de 485 CV pueda tener un comportamiento "civilizado".</P>

<P ALIGN="JUSTIFY">El motor V12 de casi 5.500cc empuja a esta bestia a m&aacute;s de 320 kmh y le hace pasar de 0 a 100 en poco m&aacute;s de 4 segundos. Por supuesto hace falta un buen calzado para transmitir toda esta potencia al suelo, nada menos que unos neum&aacute;ticos 295/35ZR18 en las ruedas traseras —las ruedas propulsoras—. Los asientos de cuero son fant&aacute;sticos y la palanca de cambio cuenta con la tradicional rejilla met&aacute;lica de Ferrari. El color plateado del coche es una maravilla, en contra del tradicional rojo Ferrari, pero como no es el primer deportivo de nuestra colecci&oacute;n hemos preferido un poco de variedad para el garaje.</P>

</FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Para estrenar nuestro tercer coche seleccionamos un circuito muy variado: Atl&aacute;ntica. Con abundancia de curvas largas y cerradas pero sin olvidar tambi&eacute;n las zonas r&aacute;pidas en las que un coche como este puede desarrollar todo su potencial. Hay que recalcar tambi&eacute;n que no todas las zonas r&aacute;pidas son rectas; existen varias chicanes en el circuito en las que el m&aacute;s m&iacute;nimo error puede acabar con nuestro flamante Ferrari estampado contra una pared —por no hablar de c&oacute;mo quedar&iacute;amos nosotros que vamos dentro—. Estas chicanes se pasan pr&aacute;cticamente a fondo y son la diferencia, casi siempre, entre un tiempo simplemente normalito y un verdadero tiempazo.</P>

<H4>Toma de contacto con el 550 Maranello</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
La experiencia de conducci&oacute;n con este coche es apabullante desde el principio. El motor sube de vueltas sin la m&aacute;s m&iacute;nima pereza y se deja estirar bastante m&aacute;s all&aacute; de las 7.000 rpm. El cambio manual de 6 relaciones es muy preciso y al coche le sobra potencia para subir la sexta al tope de vueltas si encontramos una recta lo suficientemente larga. El comportamiento del coche es irreprochable en todo momento pero el exceso de confianza nos puede jugar una mala pasada ya que no es tarea de aficionados domar casi 500 CV; un despiste a esas velocidades y nos comeremos el primer muro, valla o lo que sea que se nos cruce en el camino.</P>

<P ALIGN="JUSTIFY">Y la pista de Atl&aacute;ntica tiene gran abundancia de todos esos obst&aacute;culos. Desde luego no es recomendable ir a fondo en esta pista y con este coche antes de haberle cogido, y muy bien, la medida a ambos. Y si no me cre&eacute;is intentad, a la primera, tomar la chicane justo antes de meta en sexta a fondo… ya me contar&eacute;is como acaba la historia. As&iacute; pues nos lo tomamos con calma y salimos, en plan de paseo, a dar la primera vuelta al circuito. En la primera vuelta, como era de esperar, hacemos un tiempo horroroso, casi 3 minutos, pero en las siguientes vamos mejorando poco a poco hasta obtener un aceptable 2' 16" 43 y una velocidad m&aacute;xima algo superior a los 267 kmh. Tras esta primera vuelta sin errores graves y pis&aacute;ndole bastante al acelerador estamos en condiciones de hacer un an&aacute;lisis bastante exacto de las peculiaridades de la pista.</P>

<H4>Anális detallado de la pista de Atlántica</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Salimos quemando rueda desde la recta de meta, subiendo marchas sin parar tomamos una curva apenas perceptible a izquierdas y poco despu&eacute;s otra algo m&aacute;s cerrada a derechas. Ambas se pueden hacer a fondo sin problemas incluso en sucesivos pasos lanzados por meta. Encaramos una fuerte subida ya en 5ª o 6ª para terminar en una rasante y una pronunciada bajada que se curva poco a poco a la derecha. La curva es larga as&iacute; que hay que sujetar bien el coche para que no se nos vaya excesivamente pronto hacia el exterior. Pasamos bajo un puente y nos dirigimos a un paso elevado en semicurva a la derecha cuya m&aacute;xima dificultad es su estrechez y las dos parejas de columnas que lo escoltan en ambos extremos. Es la zona m&aacute;s r&aacute;pida del circuito. Acabaremos en 6ª a fondo para bajar hasta 4ª o 5ª trazando la pr&oacute;xima curva a izquierdas claramente se&ntilde;alizada por las flechas de la pared. Hay que tomarla con anticipaci&oacute;n porque se cierra bastante. Seguimos acelerando y pasamos otra ligera curva a la derecha y otra similar a la primera, tambi&eacute;n a izquierdas que podemos tomar igualmente en 4ª o 5ª dependiendo de c&oacute;mo tengamos configurado el coche.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3c02.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>El trazado de Atl&aacute;ntica es bonito y variado pero traicionero. Hay que estudiarla bien si queremos que los tiempos "nos salgan"</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">Aceleramos sin miedo hasta el siguiente puente donde hay un peque&ntilde;o salto esper&aacute;ndonos, con una ligera curva a la izquierda en pendiente que nos lleva a la primera curva realmente lenta del circuito, una circular de casi 360º en ascenso que habr&aacute; que hacer en 3ª. Salimos de la curva acelerando y con cuidado de no irnos contra el muro de la izquierda que es hacia donde sigue ahora la carretera. Otra imperceptible curva a la derecha y otro peque&ntilde;o salto que nos deja en una recta en bajada seguida de un par de curvas casi inexistentes. La siguiente curva un poco delicada es a derechas, seguida de otra a izquierdas cuyo &uacute;nico peligro es subirse por el talud interior de c&eacute;sped, cosa que debemos evitar para conservar la mejor estabilidad posible. Continuamos con otra curva a derechas que nos deja a las puertas de otra curva redonda, esta con dos pistas, una interior y otra exterior. Recomiendo tomar la interior pero hay que tener cuidado porque, a la velocidad que se toma esta curva, podemos acabar f&aacute;cilmente contra la valla o contra la pared.</P>

<P ALIGN="JUSTIFY">Salimos de esta curva en 5ª y cortamos por el c&eacute;sped a derechas y tras un tramo casi recto hacemos otra vez lo mismo, cortando la curva por el interior aprovechando el c&eacute;sped. En la siguiente usaremos la misma t&eacute;cnica pero esta vez la curva es a la izquierda. Tiene tambi&eacute;n dos alternativas que, para mayor complicaci&oacute;n, est&aacute;n a diferentes alturas. Ni que decir tiene que cambiarse de una a otra en plena curva y a esa velocidad puede resultar fatal. Recomiendo tomar la interior y, en la intersecci&oacute;n de ambas tomaremos cualquiera de las dos para hacer la siguiente curva a derechas. Comenzamos ahora una zona bastante estrecha y con peligrosos bordillos as&iacute; que cuidado. La primera curva al acabar la zona del c&eacute;sped es una de doble radio a derechas, la cual acabaremos en 4ª entrando en el estrecho paseo mar&iacute;timo. La superficie de entarimado no es la m&aacute;s propicia para conducir pero no podemos detenernos en esas minucias. Subimos hasta 5ª y hacemos la siguiente chicane a fondo. Otro tramo recto donde podemos llegar a poner 6ª pero debemos frenar m&iacute;nimamente y bajar a 5ª de nuevo para tomar la siguiente chicane, algo m&aacute;s cerrada que la anterior. Debemos abrirnos bien a la izquierda para tomar la primera curva de la chicane —hacia la derecha— o, de lo contrario, acabaremos empotrados en la pared.</P>

<P ALIGN="JUSTIFY">Salimos de la chicane a fondo de nuevo en 5ª y seguimos por una zona sin mayores problemas hasta un t&uacute;nel que se desv&iacute;a a la derecha. A la salida de este t&uacute;nel pondremos 6ª y tomaremos la desviaci&oacute;n de la izquierda, a fondo, para llegar a otra curva a derechas. Cuidado con esta &uacute;ltima porque nos deja directamente ante la chicane que da paso a meta. Si no salimos de esta curva perfectamente colocados para tomar la chicane estamos fastidiados y el amasijo de hierros puede ser hist&oacute;rico. La chicane es nuevamente una derecha - izquierda as&iacute; que, para tomarla, se aplica lo dicho para la anterior: bien colocados a la izquierda para tomar la primera de las curvas y la segunda ser&aacute; coser y cantar, pasando a toda velocidad por la l&iacute;nea de meta.</P>

<H4>¿Cómo se pone a punto un coche como este?</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
S&iacute;, as&iacute; es. Un coche de la brutal potencia de este 550 Maranello no es nada f&aacute;cil de afinar. Adem&aacute;s la pista es larga y complicada por lo que el proceso de puesta a punto es lento y pesado. Lo primero que vamos a hacer, como siempre, es sustituir los neum&aacute;ticos de serie por unos lisos de competici&oacute;n. M&aacute;s agarre en curva, m&aacute;s tracci&oacute;n al acelerar… en definitiva, m&aacute;s de todo. Los buenos tiempos tardan en llegar pero finalmente conseguimos una primera vuelta en 2' 21" 78 y una mejor vuelta en 2' 14" 50 para un tiempo total en las cuatro vueltas de 9' 22" 43 y una velocidad m&aacute;xima que ronda los 270 kmh.</P>

<P ALIGN="JUSTIFY">La firmeza de la suspensi&oacute;n a tope debe ayudarnos a salvar las curvas m&aacute;s r&aacute;pidas con algo m&aacute;s de confianza as&iacute; que sin esperar m&aacute;s hacemos la prueba correspondiente, porque hay veces que la l&oacute;gica y la pr&aacute;ctica se contradicen. Ni que decir tiene que debe ser esta &uacute;ltima la que confirme la validez de nuestro razonamiento y, por tanto, de la configuraci&oacute;n probada. Salimos a dar unas vueltas y, aunque no conseguimos mejorar el tiempo de vuelta anterior por culpa de errores de pilotaje, si que notamos la mayor estabilidad y logramos tambi&eacute;n mejorar la velocidad m&aacute;xima, llegando hasta los 274 kmh que son clara promesa de mejores tiempos si seguimos perseverando.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3c03.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>El m&aacute;s m&iacute;nimo error de pilotaje a estas velocidades puede acabar con nuestro coche estampado contra un muro o, como en este caso, volando por los aires</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">Para no perder tiempo vamos con el siguiente reglaje. Preparamos el motor para una mejor respuesta a r&eacute;gimen elevado y volvemos al circuito a ver si conseguimos una mejora m&aacute;s sensible. Lo cierto es que la aceleraci&oacute;n y velocidad mejoran ostensiblemente, hasta el punto de que el coche se vuelve casi demasiado r&aacute;pido para tomar ciertas curvas a fondo. La conducci&oacute;n se vuelve m&aacute;s delicada a&uacute;n si cabe y estropeamos vuelta tras vuelta por un peque&ntilde;o fallo que nos impide hacer un recorrido totalmente limpio. La velocidad m&aacute;xima ronda ya los 282 kmh y, por fin, logramos hacer una vuelta medianamente aceptable. El cron&oacute;metro habla por s&iacute; solo: 2' 11" 68 y sabemos que es mejorable. El tiempo total de las cuatro vueltas queda establecido en 9' 15" 18 que tampoco est&aacute; nada mal aunque lejos de un &oacute;ptimo te&oacute;rico que estar&iacute;a por debajo de los 9 minutos, rondando el 8' 50" 00.</P>

<P ALIGN="JUSTIFY">Como acabamos de comprobar, el coche est&aacute; pr&aacute;cticamente en su l&iacute;mite de adherencia en las curvas m&aacute;s r&aacute;pidas as&iacute; que, de momento, no parece aconsejable disminuir el apoyo aerodin&aacute;mico del veh&iacute;culo. Tampoco parece muy necesario aumentarlo ya que, aunque a duras penas, todav&iacute;a conseguimos sujetarlo. Lo que s&iacute; hemos podido comprobar es que no llegamos al tope de vueltas en 6ª velocidad por lo que una discreta reducci&oacute;n de las relaciones de cambio para hacerlas m&aacute;s cerradas puede hacernos ganar algo de aceleraci&oacute;n. Probamos inicialmente con una configuraci&oacute;n que ronda el 30% y conseguimos mejorar la velocidad m&aacute;xima al final del paso elevado hasta casi los 286 kmh, lo que indica que vamos en buena direcci&oacute;n. Como siempre, los tiempos tardan en llegar pero el aumento de aceleraci&oacute;n es perceptible. Tras muchos esfuerzos llega la recompensa: una mejor vuelta de 2' 09" 75 que, junto con una primera alrededor de 2' 18" 00 y otras dos vueltas mediocres —por encima del 2' 16" 00— nos da un tiempo total de 9' 01" 71.</P>

<P ALIGN="JUSTIFY">La sesi&oacute;n de entrenamientos ha sido dura y a&uacute;n hay espacio para la mejora, pero el tiempo se nos acaba. Quiz&aacute;s un peque&ntilde;o retoque en la aerodin&aacute;mica aument&aacute;ndola ligeramente permita un paso por curva r&aacute;pida m&aacute;s limpio que compense la ligera p&eacute;rdida de velocidad o quiz&aacute;s sea al contrario, aunque no parece que el veh&iacute;culo admita muchas m&aacute;s alegr&iacute;as en las dos chicanes r&aacute;pidas m&aacute;s comprometidas del circuito.</P>

<H4>Conclusión</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
El Ferrari 550 Maranello es toda una belleza tanto desde el punto de vista est&eacute;tico como el mec&aacute;nico. Su potencia y estabilidad lo convierten en uno de los deportivos que mejor compromiso ofrecen entre alt&iacute;simas prestaciones y facilidad de conducci&oacute;n. Claro que, como ya he repetido en m&aacute;s de una ocasi&oacute;n, conducirlo al l&iacute;mite es una tarea no apta para pilotos aficionados.</P>

<P ALIGN="JUSTIFY">El circuito resulta precioso, variado y muy exigente con la conducci&oacute;n. Tiene multitud de zonas que no perdonan el m&aacute;s m&iacute;nimo fallo y, para sacar todo el partido a su trazado hace falta conocerlo muy bien y experimentar bastante. No es extra&ntilde;o descubrir tras muchas vueltas una nueva trazada que ofrece mejores resultados que la que hab&iacute;amos dado por evidente y l&oacute;gica. Solamente un &uacute;ltimo consejo para hacer buenos tiempos, aunque pueda resultar un poco de perogrullo pero en este circuito es m&aacute;s cierto incluso que en otros: salir r&aacute;pido de las curvas a&uacute;n sacrificando un poco la entrada, sobre todo en aquellas que dan paso a largas zonas rectas.</P>

<P ALIGN="JUSTIFY">Como siempre, si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>







