<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Aston Martin DB7 / Rocky Pass
</H3>

<table width="320" align="left"> 
<td><img src="jpg/nfs3d01.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Aston Martin es una marca legendaria y no pod&iacute;amos dejar de contar con uno de sus modelos en nuestro garaje</center></font></td> 
</table>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Mi nombre es Bond, James Bond… perd&oacute;n, pero cuando hablamos de Aston Martin enseguida se nos vienen a la mente las pel&iacute;culas de 007. Y es que esta prestigiosa marca brit&aacute;nica siempre se ha distinguido por "confeccionar" —m&aacute;s que fabricar— preciosos deportivos que combinan la elegancia, el lujo y la distinci&oacute;n con un comportamiento din&aacute;mico que no tiene nada que envidiar a los coches de otras marcas.</P>

<P ALIGN="JUSTIFY">Aunque nos ha costado un ojo de la cara, para el cuarto coche de nuestra colecci&oacute;n hemos elegido un DB7 coup&eacute; color gris plata. El coche cuenta con una l&iacute;nea estilizada y fluida, rematada por un frontal y una parte posterior con mucha personalidad. Su motor de aleaci&oacute;n sobrealimentado de 3.200cc genera una potencia de 335 CV a 6.000 rpm, el cual impulsa al veh&iacute;culo a m&aacute;s de 270 kmh y lo pone de 0 a 100 en poco m&aacute;s de cinco segundos y medio. El cambio de 5 velocidades penaliza un poco las prestaciones, aunque el motor empuja sin titubeos a bajo r&eacute;gimen, lo que compensa ligeramente por lo anterior. En el interior el refinamiento es evidente en cada detalle, desde la tapicer&iacute;a de cuero hasta las incrustaciones en madera del salpicadero. Definitivamente un deportivo diferente y muy, muy atractivo.</P>

<P ALIGN="JUSTIFY">Para las caracter&iacute;sticas de este coche elegimos un circuito de monta&ntilde;a repleto de curvas y contra curvas, fuertes subidas y fulgurantes bajadas en las que este peque&ntilde;&iacute;n se desenvuelve con soltura. En el trazado de Rocky Pass no hay sitio para el error ya que, ante el m&aacute;s m&iacute;nimo descuido, nos podemos encontrar de frente con cualquier quitamiedos de los muchos que hay a lo largo del camino. Por el contrario si hay mucho que ganar si acertamos con la trazada correcta en las m&uacute;ltiples curvas. Cortar por el interior de forma correcta nos puede ahorrar valiosas d&eacute;cimas para que al final los tiempos sean buenos.</P>

<H4>Toma de contacto con el DB7</H4><FONT FACE=ARIAL SIZE=2><P ALIGN="JUSTIFY">
Acostumbrados a otros deportivos con m&aacute;s "fuerza bruta" bajo el cap&oacute;, es posible que encontremos al Aston Martin DB7 un poco falto de m&uacute;sculo pero esto es normal. No todos los coches pueden tener cerca de 500 CV como el Maranello que disfrutamos anteriormente. Sin embargo es mucho lo que se puede hacer con la "modesta" potencia de este cachorrito si sabemos sacarle lo mejor que lleva dentro. La conducci&oacute;n del DB7 es agradable; el coche ofrece confianza y sensaci&oacute;n de estabilidad en todo momento. Aunque la frenada no es su fuerte es f&aacute;cil deslizar la zaga en las curvas para conseguir una buena colocaci&oacute;n para afrontar la salida. Esto unido a lo retorcido del trazado, que impide desarrollar velocidades demasiado elevadas, permite obtener cronos respetables a pesar de la falta de potencia.</P>

<P ALIGN="JUSTIFY">Empezamos las primeras vueltas a la pista de Rocky Pass con la calma de quien a&uacute;n no conoce bien el coche ni el circuito pero pronto caemos ante la diversi&oacute;n que ambos en conjunto nos producen. A todo conductor, aficionado o profesional, le gusta el reto de las curvas. Conducir recto es algo que cualquiera puede hacer bien, incluso a altas velocidades, pero obtener pasos por curva r&aacute;pidos es algo que requiere buenas manos y mucha experiencia, adem&aacute;s de una buena dosis de sangre fr&iacute;a. Los primeros cronos conseguidos no son nada del otro mundo: una primera vuelta en 3' 39" 09, una mejor vuelta de 3' 29" 28 y un tiempo total bastante por encima de los 14 minutos, con una velocidad m&aacute;xima obtenida de 237 kmh.</P>

<H4>Rodando a tumba abierta en Rocky Pass</H4><FONT FACE=ARIAL SIZE=2><P ALIGN="JUSTIFY">
La l&iacute;nea de salida / meta est&aacute; situada en una larga recta, en bajada, en medio de un hermoso paisaje que contin&uacute;a a lo largo de todo el recorrido. Pisamos a fondo y tras una ligera rasante nos encontramos con la primera curva, a derechas y que podemos tomar a fondo. Le siguen otras tres, a izquierda, derecha e izquierda que, bien tomadas por el interior, tampoco suponen problema para ir a fondo. Conviene salir de la &uacute;ltima bien pegado a la izquierda para mejorar la entrada en la siguiente, a derechas que nos har&aacute; bajar a 3ª velocidad. Tras una corta recta nos enfrentamos a una curva contraperaltada a izquierdas en ligera subida. Nos abriremos a la derecha y la tomaremos en 2ª para seguir con una larga curva a derechas subiendo marchas para llegar en 4ª a un peque&ntilde;o salto que oculta casi una curva a izquierdas claramente indicada por se&ntilde;ales amarillas de advertencia. Bajamos una marcha para tomar esta curva y anticipamos mucho las dos curvas siguientes, a derecha e izquierda, para poder salir a fondo en 4ª de la &uacute;ltima y tomar el gran salto que hay a continuaci&oacute;n a la mayor velocidad posible y por la izquierda.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3d02.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>El trazado de Rocky Pass est&aacute; lleno de curvas, saltos y desniveles. Es de los m&aacute;s bonitos que hemos tenido la suerte de recorrer</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">La siguiente curva es a derechas y, dependiendo de las relaciones de cambio se puede hacer en 4ª levantando m&iacute;nimamente el pie o bien bajaremos a 3ª. Seguimos con otra a izquierdas y nuevamente a derechas. Una fuerte frenada, reduciendo a 2ª para tomar la siguiente, a izquierdas, con un muro lateral en el que es f&aacute;cil golpear si no andamos con ojo. Aceleramos fuerte ya que a la salida de la curva la carretera asciende bastante. Subimos marchas y tomamos a fondo dos ligeras curvas hasta llegar a una larga de derechas que nos obligar&aacute; a bajar a 3ª. Salimos pisando fuerte de nuevo hasta una recta seguida por otras tres curvas que tomaremos a fondo, la &uacute;ltima de las cuales, a izquierdas, nos deja en una subida que termina en un peque&ntilde;o salto y un t&uacute;nel.</P>

<P ALIGN="JUSTIFY">Entramos en el t&uacute;nel en 4ª y tomamos la curva a derechas sujetando fuerte el volante y sin dejar que el coche se vaya demasiado pronto a la izquierda. A la salida la carretera empieza a descender. Esta es la zona m&aacute;s r&aacute;pida del trazado. Ponemos 5ª y pisamos a fondo por las casi inexistentes curvas hasta llegar a la se&ntilde;al y el arco en la roca. El arco oculta dos curvas apenas perceptibles a derecha e izquierda que, a estas velocidades, pueden resultar fatales, acabando con el coche contra la pared de roca. Si nos posicionamos correctamente las haremos a fondo y seguiremos con otra a derechas que acaba en un nuevo t&uacute;nel. Nuevamente otras dos curvas muy abiertas que tomaremos a fondo y, tras una corta recta, cortaremos a derechas lo m&aacute;s posible, bajando una o dos marchas, con el morro apuntando a la impresionante pared de roca, pasando lo m&aacute;s cerca de ella que nos atrevamos. Cuidado con abrirnos en exceso a la salida ya que nos espera una valla colocada frontalmente que puede arruinar nuestra vuelta r&aacute;pida.</P>

<P ALIGN="JUSTIFY">A fondo de nuevo por un tramo recto hasta la entrada de otro t&uacute;nel con una bajada muy pronunciada que nos har&aacute; saltar una vez m&aacute;s al tomarlo en 4ª. A la salida ponemos 5ª y tomamos bien por el interior la siguiente curva a derechas que quiz&aacute;s nos obligue a bajar una marcha moment&aacute;neamente. La siguiente a izquierdas, tras la recta en bajada, es enga&ntilde;osa ya que da entrada a un puente y la calzada se estrecha. Si la anticipamos correctamente se puede tomar a fondo en 4ª sin problemas. A la salida del puente nos espera otra a izquierdas que podemos tomar en 3ª o 4ª seg&uacute;n los desarrollos. Seguimos hacia la derecha pisando a fondo por una larga bajada en la que ponemos 5ª. Pronto la carretera se desv&iacute;a a la izquierda pero solo es el preludio de una cerrada curva a derechas, as&iacute; que nos colocamos en el exterior y bajamos dos marchas para tomarla en 3ª. Salimos acelerando todo lo posible y evitando poner 4ª ya que enseguida nos encontramos con otra cerrada a izquierdas de 2ª velocidad. La siguiente, igualmente de 2ª es a la derecha y nos deja en una bajada con una doble curva muy peraltada en la que podremos acelerar a fondo y, sin llegar a poner 5ª, hacemos lo m&aacute;s recto posible un doble salto en medio de la ciudad. Si nos desviamos podemos acabar contra un edificio.</P>

<P ALIGN="JUSTIFY">Salimos de la ciudad trazando recto por tres curvas enlazadas muy suaves para acabar con una fuerte frenada ante la siguiente curva, en bajada y a la izquierda, que tomaremos en 2ª. Salimos de esta para encontrarnos inmediatamente con otra a derechas, de 2ª o 3ª. Aceleramos lo antes posible y bajamos por la recta que precede a la l&iacute;nea de meta, no sin antes volar varios metros en el salto m&aacute;s salvaje de todo el circuito.</P>

<H4>Puesta a punto del DB7</H4><FONT FACE=ARIAL SIZE=2><P ALIGN="JUSTIFY">
La lenta pista parece hecha a la medida de este coche. En la zona m&aacute;s r&aacute;pida llegamos casi al l&iacute;mite del veh&iacute;culo lo que hace que no desperdiciemos ni uno solo de los 335 CV. Por este motivo, el coche est&aacute; casi puesto a punto desde el principio. La mayor parte de la mejora en los tiempos la conseguiremos con una buena dosis de pilotaje experto. No obstante hay algunas cosas que podemos intentar para complementar nuestras habilidades con el volante. Lo primero que vamos a hacer es sustituir los neum&aacute;ticos de serie por unos lisos y endurecer la suspensi&oacute;n todo lo posible para obtener m&aacute;s agarre y, en general, un comportamiento m&aacute;s preciso y "deportivo". Los tiempos mejoran poco a poco gracias a los reglajes y al mejor conocimiento de las trazadas. Obtenemos una vuelta r&aacute;pida en 3' 20" 62 y una velocidad m&aacute;xima superior a los 240 kmh, con un tiempo total rondando los 13' 40" 00.</P>

<P ALIGN="JUSTIFY">Lo pr&oacute;ximo que hacemos es jugar con el par motor. Hacemos pruebas mejorando la respuesta a bajo r&eacute;gimen pero nos damos cuenta de que los resultados no son los apetecidos. A pesar de que el circuito es ratonero y nos obliga a cambiar de marcha en multitud de ocasiones, la p&eacute;rdida de potencia en alta nos penaliza demasiado, con lo que los tiempos finales son peores que antes. Probamos el reglaje contrario, mejorando la respuesta en alta y ahora s&iacute; que notamos una mejora. En el rango entre 5.000 y 6.000 rpm el motor sube m&aacute;s &aacute;gilmente de vueltas, lo que repercute en mayor velocidad punta. Finalmente obtenemos una mejor vuelta de 3' 15" 25 que, junto con una primera sobre 3' 22" nos da un tiempo total para las cuatro vueltas de 13' 34" 18, con una velocidad m&aacute;xima que ha mejorado notablemente: casi 249 kmh.</P>

<br>
<center><table width="320" align="center"> 
<td><img src="jpg/nfs3d03.jpg"></TD>
<TR> 
<TD><font size=1 face=arial><center>Esta es la zona m&aacute;s r&aacute;pida del circuito y tambi&eacute;n la m&aacute;s complicada. Un buen posicionamiento del veh&iacute;culo es primordial</center></font></td> 
</table></center>
<br>

<P ALIGN="JUSTIFY">Apenas hay curvas r&aacute;pidas y, en las lentas, el coche est&aacute; demostrando un formidable agarre as&iacute; que probamos a quitar el apoyo aerodin&aacute;mico. En este coche no se nota mucho la diferencia ya que no goza de los sobredimensionados alerones de otros modelos pero s&iacute; lo suficiente como para mejorar algo m&aacute;s esa velocidad m&aacute;xima. Y los resultados no se hacen esperar: mejor vuelta en 3' 14" 59 que, acompa&ntilde;ada de una primera en 3' 18" 28 y otras dos m&aacute;s alrededor del 3' 16" nos proporciona un tiempo total de 13' 05" 71, el mejor que vamos a conseguir en esta sesi&oacute;n de entrenamientos.</P>

<P ALIGN="JUSTIFY">Hemos notado vuelta tras vuelta que, a&uacute;n en la zona m&aacute;s r&aacute;pida del circuito, el motor no llega a alcanzar el tope de vueltas en 5ª, aunque no es mucho lo que falta as&iacute; que, para finalizar, vamos a acortar ligeramente los desarrollos. Probamos con una configuraci&oacute;n alrededor del 30% y la sensaci&oacute;n de mejora en la aceleraci&oacute;n es palpable aunque, en contrapartida, perdemos algo de velocidad m&aacute;xima, qued&aacute;ndonos en "tan s&oacute;lo" 251 kmh. Pero en conjunto el resultado es positivo y mejoramos la vuelta r&aacute;pida en m&aacute;s de un segundo, dej&aacute;ndola en 3' 13" 31 y eso que hemos cometido varios errores no demasiado graves pero que seguro nos han hecho perder varias d&eacute;cimas.</P>

<P ALIGN="JUSTIFY">Con gran pena despedimos esta sesi&oacute;n de entrenamientos esta vez m&aacute;s que ninguna otra porque sabemos que este circuito de Rocky Pass a&uacute;n guarda algunos secretos que no hemos podido arrancarle. La vuelta r&aacute;pida se puede bajar quiz&aacute;s otro par de segundos y, desde luego, la barrera de los 13 minutos en el tiempo total de las cuatro vueltas es f&aacute;cilmente franqueable. La tentaci&oacute;n est&aacute; ah&iacute; pero tendremos que dejarlo para otro d&iacute;a.</P>

<H4>Conclusión</H4><FONT FACE=ARIAL SIZE=2><P ALIGN="JUSTIFY">
Una colecci&oacute;n de coches deportivos que se precie no puede dejar en el olvido a los cl&aacute;sicos fabricantes brit&aacute;nicos como es el caso de este bello Aston Martin. El placer que obtenemos pilotando uno de estos coches no es comparable a otras marcas como Ferrari o Porsche en cuanto a la liberaci&oacute;n de adrenalina que produce pero lo compensa de sobra en otros apartados que tambi&eacute;n son muy importantes como la exclusividad y la elegancia. En definitiva, el DB7 es un "cacharro" de lo m&aacute;s recomendable.</P>

<P ALIGN="JUSTIFY">Y qu&eacute; podemos decir del circuito. El paisaje es hermos&iacute;simo, el trazado muy exigente para el piloto y la mec&aacute;nica… el sue&ntilde;o de un amante de la conducci&oacute;n deportiva. Como &uacute;ltimo consejo diremos: una colocaci&oacute;n correcta a la entrada de las curvas es primordial para obtener buenos tiempos y si sufrimos de v&eacute;rtigo lo mejor ser&aacute; que nos quedemos en casa viendo la tele porque algunos de los saltos y desniveles no son aptos para card&iacute;acos. Como siempre, si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
