<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>L</B></font><FONT color="#000000" size=2 face="arial"><B>ocos por el Asfalto</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
Need for Speed III: Comparativa Clase B
</H3>

<table width="320" align="right"> 
<tr>
<td><img src="jpg/nfs3e01.jpg"></TD>
</tr><tr> 
<TD><font size=1 face=arial><center>Para esta comparativa hemos pedido prestado un hermoso Ferrari 456M GT</center></font></td> 
</tr><tr>
<td><img src="jpg/nfs3e02.jpg"></TD>
</tr><tr>
<TD><font size=1 face=arial><center>Tampoco hemos podido resistirnos a la tentaci&oacute;n de pilotar el m&iacute;tico Lamborghini Countach</center></font></td>
</tr>
</table>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Nuestro garaje crece poco a poco, llen&aacute;ndose de hermosos deportivos que nos proporcionan un gran placer tanto al conducirlos como simplemente al admirarlos. Hemos conducido varios de ellos por diferentes carreteras y, pisando el acelerador a fondo, hemos sentido el v&eacute;rtigo de la conducci&oacute;n al l&iacute;mite de adherencia en cada curva, al l&iacute;mite de vueltas del motor en cada recta, al l&iacute;mite de nuestros reflejos en cada vuelta…</P>

<P ALIGN="JUSTIFY">Cada veh&iacute;culo de los que hemos ido adquiriendo tiene unas caracter&iacute;sticas que lo hacen &uacute;nico frente al resto pero… ¿C&oacute;mo se comparan uno frente a otro? ¿Cu&aacute;l de ellos es m&aacute;s r&aacute;pido o tiene mejor paso por curva? Para hacer una primera comparativa hemos seleccionado dos de nuestros veh&iacute;culos que, por sus caracter&iacute;sticas, entran dentro de una categor&iacute;a m&aacute;s o menos intermedia de prestaciones… porque tampoco se trata de comparar un 550 Maranello, con sus casi 500 CV y un comportamiento din&aacute;mico excepcional con un m&aacute;s modesto Corvette C5, por ejemplo. As&iacute; que seleccionamos el Ferrari 355 F1 Spider y el Chevrolet Corvette C5.</P>

<P ALIGN="JUSTIFY">Pero como dos coches nos parec&iacute;an poco y no desaprovechamos ni la m&aacute;s m&iacute;nima oportunidad para conducir un nuevo veh&iacute;culo hemos contactado con un colega nuestro tambi&eacute;n aficionado al mundo del motor y, de su propio garaje, ha aportado otros dos modelos para completar esta comparativa: el Ferrari 456M GT y el Lamborghini Countach. De esta forma, con estos cuatro modelos, cerramos la comparativa de lo que hemos dado en llamar la "Clase B" de autom&oacute;viles deportivos.</P>

<P ALIGN="JUSTIFY">Para realizar esta comparaci&oacute;n hemos elegido un circuito ya visitado: Hometown. Las razones de elegir este trazado son muchas. Es lo suficientemente corto como para permitir unos tiempos cortos de vuelta, lo cual agradeceremos ante la tarea de tener que conducir al l&iacute;mite nada menos que cuatro coches. Por otro lado tambi&eacute;n es lo suficientemente r&aacute;pido para permitir desarrollar a estos pura sangre todo su potencial y tiene las suficientes zonas delicadas como para contrastar las diferencias de comportamiento entre ellos.</P>

<H4>Lo que las cifras dicen</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Comparando fr&iacute;amente las cifras de prestaciones y comportamiento de los veh&iacute;culos podemos establecer una primera clasificaci&oacute;n que, posteriormente, vamos a tratar de contrastar en la pr&aacute;ctica mediante las pruebas en circuito. Para este primer paso elegimos cuatro caracter&iacute;sticas en las que puntuaremos a los distintos veh&iacute;culos: aceleraci&oacute;n, velocidad m&aacute;xima, estabilidad y comportamiento en general y frenada. Para la aceleraci&oacute;n tomaremos el tiempo oficial de paso de 0 a 100 kmh que, en los coches comparados, oscila entre las 4.5 segundos del Countach y los 5.2 del 456M. La velocidad m&aacute;xima oscila entre los 282 kmh del C5 y los m&aacute;s de 300 kmh del 456M. El comportamiento es algo bastante m&aacute;s subjetivo de valorar, aunque una buena medida ser&iacute;a el cronometraje de una prueba de slalom; las cifras ponen a los dos Ferrari en primer lugar con el Countach el &uacute;ltimo con clara diferencia. En cuanto a las distancias de frenado los cuatro modelos andan muy parejos. Los resultados, por orden alfab&eacute;tico, son los siguientes:</P></FONT>

<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=2 CELLPADDING=4 WIDTH=562 BGCOLOR="#FFFFFF">
<TR BGCOLOR="#FFAA00"><TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Veh&iacute;culo</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Aceleraci&oacute;n</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Vel. M&aacute;xima</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Estabilidad</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Frenada</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Chevrolet Corvette C5</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">2º</FONT></TD>
<TD WIDTH="12%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">######</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">4º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">####</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">3º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">######</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 355 F1 Spider</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">2º</FONT></TD>
<TD WIDTH="12%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">######</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">2º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">######</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 456M GT</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">4º</FONT></TD>
<TD WIDTH="12%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">####</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Lamborghini Countach</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="12%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
<TD WIDTH="6%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">2º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">######</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">4º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">###</FONT></TD>
<TD WIDTH="5%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">1º</FONT></TD>
<TD WIDTH="13%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">########</FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Sumando las cuatro caracter&iacute;sticas medidas y valor&aacute;ndolas de forma absoluta tenemos que, por escaso margen, el Ferrari 355 F1 Spider ser&iacute;a el primero, seguido del Ferrari 456M GT, el Lamborghini Countach y, finalmente, el Chevrolet Corvette C5. Si tomamos las cualidades de cada uno en comparaci&oacute;n con su importancia en la pista de pruebas de Hometown observamos varias cosas. En primer lugar, la combinaci&oacute;n de aceleraci&oacute;n y velocidad punta del 355 es muy buena y ya se ha demostrado en pruebas anteriores como casi perfecta, mientras que el 456M con una adecuada reducci&oacute;n de desarrollos puede suplir perfectamente lo que le falta en aceleraci&oacute;n y su ventaja en potencia —436 CV contra los 375 CV aqu&eacute;l— puede acabar siendo decisiva a su favor. El Countach, aunque con una excepcional aceleraci&oacute;n de 0 a 100 kmh, debe verse penalizado de ah&iacute; en adelante por su cambio de s&oacute;lo 5 relaciones y su, en teor&iacute;a, peor comportamiento din&aacute;mico. Por detr&aacute;s de todos parece quedar el Corvette, penalizado por su menor potencia y aceleraci&oacute;n, adem&aacute;s de contar con un motor con un estrecho margen aprovechable de vueltas.</P>

<P ALIGN="JUSTIFY">As&iacute; pues, a priori se prev&eacute; una dura pugna entre los dos Ferrari, con el Countach y el Corvette contemplando la batalla desde una prudente distancia. Si la pista ser&aacute; lo suficientemente r&aacute;pida para que prime la mayor potencia del 456M o, por el contrario, se impondr&aacute; la mayor ligereza y agilidad del 355 (340 kilos m&aacute;s ligero y notablemente m&aacute;s corto de batalla) esto s&oacute;lo la prueba real en el circuito nos lo dir&aacute;.</P>

<H4>Primera prueba: coches con los reglajes de serie</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
La primera prueba que vamos a efectuar ser&aacute; con los veh&iacute;culos en condiciones de serie, es decir, sin hacer el m&aacute;s m&iacute;nimo ajuste sobre las caracter&iacute;sticas de f&aacute;brica. Esta prueba puede resultar algo enga&ntilde;osa ya que en este circuito se prima la aceleraci&oacute;n sobre la velocidad m&aacute;xima lo que dar&aacute; ventaja a los coches con un cambio m&aacute;s corto como el 355 F1 Spider. Sin embargo es de esta prueba de la que obtendremos los resultados m&aacute;s realistas sobre las verdaderas cualidades de cada coche al poder probarlos sin ning&uacute;n tipo de "retoques".</P>

<P ALIGN="JUSTIFY">Empezamos con el Corvette y no tardamos muchas vueltas en darnos cuenta de que, en condiciones de serie y no siendo en un circuito de alta velocidad, la sexta marcha en este veh&iacute;culo es pr&aacute;cticamente inservible, debido a los desarrollos excesivamente largos que ya hemos comentado en anteriores ocasiones. Esto penaliza seriamente las prestaciones en Hometown, hecho que las cifras reflejan claramente. Obtenemos un mejor tiempo de vuelta bastante mediocre: 1' 32" 93. La velocidad m&aacute;xima alcanzada tampoco impresiona: 256 kmh.</P>

<P ALIGN="JUSTIFY">A continuaci&oacute;n probamos con el Ferrari 355 el cual no ofrece muchas sorpresas ya que fue nuestra primera adquisici&oacute;n y ya lo probamos en su d&iacute;a precisamente en este mismo circuito. Los tiempos obtenidos son bastante mejores que los de aquella vez con reglajes de serie. En parte se debe a una mejora en nuestra t&eacute;cnica de pilotaje —ya se sabe que la pr&aacute;ctica ayuda mucho en este sentido— y en parte porque entonces no fuimos realmente "a tope" sino que busc&aacute;bamos la forma de poner el coche a punto para el circuito. Obtenemos un mejor tiempo de 1' 28" 75 y una velocidad m&aacute;xima de 272 kmh, cifras netamente superiores a las del C5. La adecuaci&oacute;n casi perfecta del coche al circuito en cuanto a relaciones de cambio ha ayudado a obtener tan buenos registros.</P>

<table width="320" align="right"> 
<tr><td><img src="jpg/nfs3e03.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>Las prestaciones del Lamborghini Countach nos han decepcionado bastante</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">En tercer lugar damos nuestras primeras vueltas con el 456M GT que nos han "prestado". La sensaci&oacute;n de conducci&oacute;n es muy agradable, como era de esperar en un Ferrari, y los tiempos son buenos a pesar de que quiz&aacute;s es "demasiado coche para este circuito". Sin embargo, a pesar de no aprovechar a tope la sexta velocidad y de sus casi 1.700 kilos de peso, el cachorro se mueve con gran agilidad por el circuito. Tras una dura pugna con el 355 F1 Spider en la que vuelta tras vuelta &iacute;bamos mejorando con un coche los tiempos realizados con el otro obtenemos una vuelta r&aacute;pida de 1' 28" 62 rodando a una velocidad m&aacute;xima de 274 kmh, superando finalmente por muy poco al 355.</P>

<P ALIGN="JUSTIFY">Por &uacute;ltimo le toca el turno al Countach, que nos ha decepcionado bastante. Y no precisamente por su comportamiento que no es tan malo como pod&iacute;amos haber pensado tras la comparaci&oacute;n inicial de las cifras. Es su falta de empuje a alta velocidad lo que no ha dado la talla. Esto unido al cambio de solamente 5 velocidades se traduce en unos tiempos similares e incluso por debajo del Corvette. La mejor vuelta la realizamos en 1' 33" 06 con una velocidad m&aacute;xima de 257 kmh.</P>

<P ALIGN="JUSTIFY">Tras esta primera prueba los resultados son los siguientes:</P></FONT>

<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=2 CELLPADDING=4 WIDTH=462 BGCOLOR="#FFFFFF">
<TR BGCOLOR="#FFAA00"><TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Puesto</FONT></TD>
<TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Veh&iacute;culo</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Vuelta R&aacute;pida</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Vel. M&aacute;xima</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Valoraci&oacute;n</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1º</FONT></TD>
<TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 456M GT</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 28" 62</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">274 kmh</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">9</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">2º</FONT></TD>
<TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 355 F1 Spider</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 28" 75</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">272 kmh</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">9</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">3º</FONT></TD>
<TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Chevrolet Corvette C5</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 32" 93</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">256 kmh</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">6</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">4º</FONT></TD>
<TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Lamborghini Countach</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 33" 06</FONT></TD>
<TD WIDTH="20%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">257 kmh</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">5</FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">El primer asalto queda decidido favorablemente para Ferrari que aventaja a la competencia con claridad. Entre los dos coches de la marca transalpina no sabr&iacute;amos por cual decantarnos ya que, aunque los resultados son ligeramente mejores para el 456M GT no hay que olvidar que el 355 F1 Spider se defiende con un motor m&aacute;s peque&ntilde;o y de menor potencia, saliendo muy bien parado de la prueba. Por eso los puntuamos a ambos por igual. Vamos ya con la prueba de reglajes libres.</P>

<H4>Segunda prueba: coches con los reglajes libres</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
La segunda prueba la realizaremos sobre la base de unos reglajes totalmente libres, tratando de exprimir cada veh&iacute;culo al m&aacute;ximo de sus posibilidades. Esta ser&aacute; la confirmaci&oacute;n definitiva de lo que puede ofrecer cada uno de los coches ya en condiciones de carrera y afinados al m&aacute;ximo. Parece previsible un acercamiento de los tiempos entre los dos Ferrari y el resto ya que, por ejemplo, el Corvette puede ahora ajustar las relaciones de cambio a las necesidades del circuito recuperando de esta manera parte de la ventaja que le llevaban sus rivales. De todas formas no se puede decir nada seguro hasta que terminemos las pruebas sobre la pista.</P>

<P ALIGN="JUSTIFY">Vamos nuevamente con el Corvette en primer lugar. Aparte del l&oacute;gico cambio de neum&aacute;ticos por otros lisos de competici&oacute;n y el endurecimiento de la suspensi&oacute;n lo que m&aacute;s estaba necesitando el C5, como acabamos de decir, es una reducci&oacute;n del cambio para mejorar la aceleraci&oacute;n y aprovechar a tope la sexta velocidad. Adem&aacute;s realizamos el tambi&eacute;n l&oacute;gico retoque de la curva de par motor para ganar potencia a alto r&eacute;gimen. Por lo que respecta al apoyo aerodin&aacute;mico, en este circuito no es necesario ya que el coche cuenta con buen agarre as&iacute; que lo eliminamos para ganar velocidad. Todo ello se traduce en una mejora de varios segundos, con un tiempo final de 1' 29" 40 y una velocidad m&aacute;xima de m&aacute;s de 268 kmh. Quedamos algo decepcionados ya que es un tiempo incluso peor al conseguido con los dos Ferrari de serie.</P>

<P ALIGN="JUSTIFY">Le toca el turno ahora al 355 F1 y, aunque de serie parec&iacute;a el m&aacute;s ajustado a las condiciones del circuito y, por tanto, candidato a una mejora no demasiado importante, ya pudimos comprobar en la prueba que hicimos en solitario que pensar esto es un error. La eliminaci&oacute;n del apoyo aerodin&aacute;mico lo hace volar por el circuito e incluso hay que alargar ligeramente los desarrollos para no quedarnos "sin vueltas" en sexta. El tiempo logrado es un sensacional 1' 24" 53 y la velocidad m&aacute;xima superior a los 291 kmh. Incluso hemos mejorado en casi un segundo el crono de la prueba individual de Mayo. El tiempo total de las cuatro vueltas tambi&eacute;n ha sido sensacional: 5' 49" 56.</P>

<P ALIGN="JUSTIFY">El otro Ferrari, a pesar de la mayor potencia, lo va a tener dif&iacute;cil para vencer al peque&ntilde;o de la familia. El 456M GT se vuelve bastante delicado al liberarlo del apoyo aerodin&aacute;mico por lo que no podemos quitarlo por completo. Una m&iacute;nima reducci&oacute;n de desarrollos lo deja en condiciones &oacute;ptimas para el circuito y el resto lo debe poner nuestro pilotaje. Al principio parec&iacute;a que no ser&iacute;amos capaces de rodar al mismo ritmo que con el 355 pero tras habituarnos al manejo del coche hacemos unos retoques finales a los reglajes y bajamos hasta el 1' 24" 37 con una velocidad m&aacute;xima tambi&eacute;n superior a los 291 kmh y un tiempo total para las cuatro vueltas de 5' 49" 47, tan s&oacute;lo una d&eacute;cima por debajo del 355.</P>

<P ALIGN="JUSTIFY">Por &uacute;ltimo realizamos la misma prueba con el Countach, del cual no esper&aacute;bamos ya grandes cosas pero s&iacute;, al menos, un peque&ntilde;o lavado de cara despu&eacute;s del decepcionante resultado en condiciones de serie. Tratamos de mejorar algo la recuperaci&oacute;n reduciendo los desarrollos ligeramente y realizamos los mismos reglajes que en los dem&aacute;s veh&iacute;culos. El tiempo de vuelta r&aacute;pida obtenido fue de 1' 29" 12, superando esta vez por muy poco al Corvette pero sin acabar de convencer en absoluto. La velocidad m&aacute;xima de casi 275 kmh hace pensar en mejores cronos pero el comportamiento del coche tampoco parece dar para m&aacute;s.</P>

<P ALIGN="JUSTIFY">Los resultados de la segunda prueba son los siguientes (los reglajes que se muestran son los de relaciones de cambio y apoyo aerodin&aacute;mico respectivamente):</P></FONT>

<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=2 CELLPADDING=4 WIDTH=534 BGCOLOR="#FFFFFF">
<TR BGCOLOR="#FFAA00"><TD WIDTH="10%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Puesto</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Veh&iacute;culo</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Vuelta R&aacute;pida</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Vel. M&aacute;xima</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Reglajes</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">Valoraci&oacute;n</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="10%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1º</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 456M GT</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 24" 37</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">291 kmh</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">10, -50</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">9</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="10%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">2º</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Ferrari 355 F1 Spider</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 24" 53</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">291 kmh</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">-14, -100</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">9.5</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="10%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">3º</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Lamborghini Countach</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 29" 12</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">274 kmh</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">12, -100</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">6</FONT></TD>
</TR>
<TR BGCOLOR="#FFCC33"><TD WIDTH="10%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">4º</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">Chevrolet Corvette C5</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">1' 29" 40</FONT></TD>
<TD WIDTH="18%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">268 kmh</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">40, -100</FONT></TD>
<TD WIDTH="14%" VALIGN="TOP">
<FONT FACE="Arial" SIZE=2><P ALIGN="CENTER">6</FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">La segunda prueba ha estado tan re&ntilde;ida como la primera entre los dos Ferrari y, al igual que ocurri&oacute; con aquella, el hermano mayor acab&oacute; ganando al peque&ntilde;o por escaso margen. Sin embargo, en relaci&oacute;n precio / prestaciones est&aacute; claro que el 355 Spider se lleva el gato al agua y de ah&iacute; nuestra puntuaci&oacute;n de 9.5. El Corvette y el Countach volvieron a tener su particular duelo en la cola que tambi&eacute;n se resolvi&oacute; por una diferencia m&iacute;nima a favor de un deportivo legendario del que, sinceramente, esper&aacute;bamos bastante m&aacute;s.</P>

<table width="320" align="right"> 
<tr><td><img src="jpg/nfs3e04.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>El Ferrari 456M GT ha salido vencedor de la prueba. Aqu&iacute; le vemos trazando una de las curvas a toda velocidad</center></font></td></tr>
</table>

<H4>Conclusión</H4><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY">
Los fr&iacute;os n&uacute;meros de la prueba dan como ganador al Ferrari 456M GT pero la sensaci&oacute;n de conducci&oacute;n &aacute;gil, r&aacute;pida y trepidante que nos ha proporcionado el Ferrari 355 F1 Spider es dif&iacute;cil de igualar por cualquier otro modelo de potencia superior. Al final todo ser&aacute; cuesti&oacute;n de gustos aunque no debemos olvidar que, en un circuito m&aacute;s r&aacute;pido, el 456M habr&iacute;a obtenido mayor ventaja sobre sus competidores. La experiencia ha sido muy satisfactoria y le devolvemos a nuestro amigo los dos veh&iacute;culos prestados no sin cierta tristeza por el recuerdo de las sensaciones obtenidas al volante de estos peque&ntilde;os diablos de la carretera.</P>

<P ALIGN="JUSTIFY">Por cierto, los que no teng&aacute;is el Ferrari 456M GT lo pod&eacute;is conseguir gratis en la web oficial de <a href="http://www.needforspeed.com/nfs3/">The Need for Speed III</a> adem&aacute;s de otros tres veh&iacute;culos muy atractivos, incluyendo un Jaguar XKR igualito al empleado por Catherine Zeta-Jones y Sean Connery para su huida en la pel&iacute;cula reci&eacute;n estrenada: "La Trampa"</P>

<P ALIGN="JUSTIFY">Como siempre, si tus tiempos son mejores, tienes alguna configuraci&oacute;n ligera o claramente superior a &eacute;sta, discrepas de mi an&aacute;lisis o simplemente te apetece compartir cualquier otra informaci&oacute;n conmigo ya sabes donde puedes escribirme. Un saludo y feliz pilotaje.</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulac.htm"><font FACE="ARIAL"><B>[Locos por el Asfalto]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
