<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulación</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>

<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>T</B></font><FONT color="#000000" size=2 face="arial"><B>&iacute;tulos de Coleccionista</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fern&aacute;ndez "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">

<br><br><br><br>
<P align="justify">
<font face=arial>
<H3>
"The Need for Speed": El asfalto como único l&iacute;mite
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">¿Qui&eacute;n no ha visto alguna vez un bonito coche deportivo y ha tenido un sentimiento de sana envidia por el due&ntilde;o de tal preciosidad? ¿Qui&eacute;n no ha deseado dar aunque solamente fuera una breve vueltecilla al volante de semejante belleza? O&iacute;r el sonido del motor subiendo de vueltas, acelerar a fondo y sentir como los neum&aacute;ticos se queman en el asfalto, ponerlo a todo gas y sentir como la adrenalina se libera por nuestro torrente sangu&iacute;neo… dar la primera curva notando la fuerza centr&iacute;fuga que nos expulsa hacia el exterior mientras los enormes neum&aacute;ticos nos mantienen pr&aacute;cticamente pegados a la carretera m&aacute;s all&aacute; de la velocidad que nosotros, en principio, hab&iacute;amos considerado como prudente. Soltarnos poco a poco hasta que, en la siguiente curva, o&iacute;mos el chirriar de las gomas que nos indica que hasta aqu&iacute; hemos llegado, mejor no seguir forzando si no queremos enfrentarnos a una zaga que nos adelanta de improviso si no estamos atentos al contravolante…</P>
<P ALIGN="JUSTIFY">Todo eso no est&aacute; normalmente a nuestro alcance, pobres mortales que no tenemos los millones de pesetas necesarios para adquirir uno o varios de estos veh&iacute;culos de ensue&ntilde;o. Pero hubo un punto crucial en que todo esto cambi&oacute; de forma importante para los afortunados poseedores de un ordenador personal. Estoy hablando aproximadamente del a&ntilde;o 1995 y no, no me estoy refiriendo a la salida al mercado del sistema operativo Windows 95… Como los aficionados a los simuladores y arcades de conducci&oacute;n sabr&aacute;n muy bien, me estoy refiriendo a la aparici&oacute;n de "The Need for Speed", un juego de coches que dej&oacute; a m&aacute;s de uno, este redactor incluido, con la boca abierta ante su espectacularidad nunca vista hasta entonces.</P>
<P ALIGN="JUSTIFY">Un equipo de Electronic Arts, en colaboraci&oacute;n con la revista especializada del mundo del motor "Road &amp; Track", desarroll&oacute; este genial videojuego, perfecta mezcla de arcade y simulaci&oacute;n, que nos dej&oacute; a todos con unos pocos miles de pesetas menos en la cartera y algunas horas menos de sue&ntilde;o por estar demasiado tiempo al volante. Este juego, como ocurre casi siempre que se obtiene un &eacute;xito de ventas, dio lugar a una serie que en estos momentos saca a la calle su entrega n&uacute;mero 4, aunque esto es algo que podr&iacute;amos discutir ya que, visto de otra forma, podr&iacute;amos considerarla como la sexta, si tenemos en cuenta las "SE" o special edition que se sacaron de los dos primeros t&iacute;tulos de la serie.</P>

<h4>"THE NEED FOR SPEED": El genial inicio de la serie</h4>
<P ALIGN="JUSTIFY">El juego original estaba adelantado a su tiempo en m&aacute;s de un aspecto. Los gr&aacute;ficos eran soberbios, las melod&iacute;as "tecno" gozaban de una estupenda calidad y eran de lo m&aacute;s "ca&ntilde;eras", la recreaci&oacute;n de los coches era una verdadera gozada, tanto gr&aacute;ficamente como en su comportamiento… Acelerar a fondo en punto muerto, engranar la primera velocidad, girar el volante y comenzar a hacer "molinos" uno tras otro, dejando la goma marcada en el asfalto era algo que no hab&iacute;amos visto nunca en un juego de estas caracter&iacute;sticas. Las primeras vueltas me las pas&eacute; frenando y derrapando a prop&oacute;sito solamente para contemplar los preciosos gr&aacute;ficos. Las luces de freno se encend&iacute;an, pod&iacute;as golpear a los contrarios para sacarlos de la carretera y ellos te respond&iacute;an con una sonora "pitada" y te devolv&iacute;an la maniobra si les dabas oportunidad.</P>

<table width="320" align="center"> 
<tr><td><img src="jpg/nfscla01.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>The Need for Speed elev&oacute; las cotas del g&eacute;nero hasta l&iacute;mites incre&iacute;bles aunando calidad y diversi&oacute;n de una forma que no volvi&oacute; a repetirse en posteriores entregas</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">El comportamiento de los coches, a&uacute;n manteniendo la faceta arcade, era de lo m&aacute;s realista. No hab&iacute;a forma de tomar una curva a velocidades irreales sin acabar contra las vallas o contra los muros que bordeaban la pista. Y los veh&iacute;culos eran de aut&eacute;ntico lujo: el Ferrari 512 TR, el Lamborghini Diablo VT, el Porsche 911 Carrera, el Corvette ZR-1, el Dodge Viper RT/10, el Mazda RX-7, el Acura NSX y el Toyota Supra Turbo estaban a nuestro alcance con solo unas pulsaciones de rat&oacute;n. Adem&aacute;s, cada coche era totalmente distinto: el ruido del motor, el comportamiento din&aacute;mico, los volantes y salpicaderos… absolutamente todo estaba perfectamente recreado. Era muy f&aacute;cil distinguir la zaga un tanto nerviosa y tendente al sobreviraje del 911, el exceso de potencia del Viper para su chasis, apenas contenido por sus enormes neum&aacute;ticos, la tremenda aceleraci&oacute;n del 512 TR, la inestabilidad del Diablo… cada coche ten&iacute;a su personalidad definida.</P>
<P ALIGN="JUSTIFY">Los circuitos eran bonitos y detallados, llenos de curvas enlazadas y rectas de "pisar a fondo". Una gran idea fue la inclusi&oacute;n tanto de circuitos cerrados como de carreteras abiertas. Estas &uacute;ltimas, de trazado sinuoso, hac&iacute;an la memorizaci&oacute;n de cada curva mucho m&aacute;s dif&iacute;cil dada la gran extensi&oacute;n que ten&iacute;an los tramos. Se inclu&iacute;an todo tipo de paisajes: un circuito urbano, una carretera costera, rutas de alta monta&ntilde;a, … para todos los gustos. Los modos de juego eran tambi&eacute;n diversos: desde la carrera cara a cara, con tr&aacute;fico y polic&iacute;a de por medio, hasta las carreras y torneos m&aacute;s "civilizados", con la posibilidad de obtener circuitos extra, etc.</P>
<P ALIGN="JUSTIFY">No recuerdo cuantas horas pas&eacute; con este juego hasta lograr dominarlo y ganar todas las pistas en modo torneo. S&iacute; puedo decir que fueron muchas y que disfrut&eacute; a tope de todas y cada una de ellas. A&uacute;n instalo el juego de vez en cuando (solo funcionaba en MS-DOS) y me doy un paseo con mi preferido, el Ferrari 512 TR, pensando en cuando podr&eacute; conducir uno de verdad.</P>
<P ALIGN="JUSTIFY">Con posterioridad sali&oacute; al mercado una edici&oacute;n especial revisada que no llegu&eacute; a poseer y que, si mal no recuerdo, inclu&iacute;a alguna pista adicional y el soporte para Windows 95. Se llam&oacute; "The Need for Speed SE" y, a pesar de la excelente impresi&oacute;n que me caus&oacute; su predecesor, no cre&iacute; que las escasas novedades merecieran el desembolso. Para quien no hubiera tenido acceso al original seguro que esta edici&oacute;n especial fue una buena compra y una agradable sorpresa.</P>

<h4>"NEED FOR SPEED II": La esperada continuación</h4>
<P ALIGN="JUSTIFY">No pod&iacute;a ser de otra forma y la verdadera segunda parte no tard&oacute; mucho en aparecer en el mercado, para satisfacer la "Necesidad de Velocidad" de los aficionados que hab&iacute;amos quedado enganchados con la primera parte. Como todas las segundas partes, &eacute;sta ven&iacute;a avalada por las supuestas mejoras introducidas sobre la primera, como mejores gr&aacute;ficos, nuevos veh&iacute;culos, nuevos circuitos… m&aacute;s y mejor de todo.</P>

<table width="320" align="center"> 
<tr><td><img src="jpg/nfscla02.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>Car&iacute;simos prototipos, desconocidos en su mayor&iacute;a, poblaron la segunda entrega de la serie</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Pero en mi opini&oacute;n no lleg&oacute; a cubrir las expectativas creadas. Efectivamente, los gr&aacute;ficos hab&iacute;an mejorado, cosa l&oacute;gica debido al paso del tiempo y la consiguiente evoluci&oacute;n de los equipos. Sin embargo se perdieron por el camino las mejores cualidades que el original hab&iacute;a tenido para cautivar: desaparecieron los trazados abiertos en favor de los circuitos, los veh&iacute;culos ya no eran deportivos reales del mercado sino prototipos totalmente inalcanzables, como el McLaren F1 o el Ford GT90, que no tuvieron la misma capacidad de atraer mi inter&eacute;s y, por &uacute;ltimo pero no menos importante, el manejo de los coches se volvi&oacute; mucho m&aacute;s arcade perdiendo ese punto de simulaci&oacute;n que me hab&iacute;a hecho correr vuelta tras vuelta con el anterior juego. Si bien es cierto que se incluyeron novedades como la posibilidad de modificar algunos reglajes del coche para adaptarlo a las caracter&iacute;sticas del circuito.</P>
<P ALIGN="JUSTIFY">Al igual que ocurri&oacute; con el primer juego, poco despu&eacute;s apareci&oacute; una edici&oacute;n especial, Need for Speed II SE. Como novedad se inclu&iacute;a soporte para el ya incipiente mercado de aceleradoras gr&aacute;ficas adem&aacute;s de nuevos veh&iacute;culos, como el precioso Ferrari 355 F1. Los gr&aacute;ficos eran realmente alucinantes, distingui&eacute;ndose el brillo de la carrocer&iacute;a, adem&aacute;s de muchos otros efectos como la lluvia, iluminaci&oacute;n, etc.</P>

<h4>"NEED FOR SPEED III: HOT PURSUIT": Persecuciones a toda pastilla</h4>
<P ALIGN="JUSTIFY">Y lleg&oacute; el tercero. Ante esta entrega lo primero que me preguntaba es: ¿seguir&aacute; la tendencia del anterior o volver&aacute; a los or&iacute;genes siendo, por fin, digno sucesor de aqu&eacute;l…? Y tengo que decir que Need for Speed III: Hot Pursuit se qued&oacute; un poco a medio camino entre ambas alternativas. Por una parte los gr&aacute;ficos siguieron mejorando siendo a&uacute;n mejores que los de las entregas anteriores: hojas secas volando a nuestro paso, tierra desprendida por nuestros neum&aacute;ticos, conducci&oacute;n nocturna con unos efectos de luz francamente conseguidos, unos coches perfectamente modelados y unos circuitos cuidados hasta el m&aacute;s m&iacute;nimo detalle. Los coches volvieron a ser los deportivos m&aacute;s actuales del mercado: Ferrari 550 Maranello, Aston Martin DB7, Chevrolet Corvette C5, Lamborghini Countach, etc. Tambi&eacute;n volvi&oacute; la polic&iacute;a, ausente en la segunda entrega, y adem&aacute;s con una novedad: esta vez nosotros pod&iacute;amos ser la polic&iacute;a y tratar de detener a los conductores que infring&iacute;an el c&oacute;digo de la circulaci&oacute;n. Para ello dispon&iacute;amos de coches patrulla tan impresionantes como el Lamborghini Diablo SV. La capacidad para alterar los reglajes del veh&iacute;culo se mantuvo, incluso con un aumento en las opciones disponibles: reparto de frenada, aerodin&aacute;mica, par motor, suspensi&oacute;n, neum&aacute;ticos, direcci&oacute;n y relaciones de cambio, todas ellas eran ajustables.</P>

<table width="320" align="center"> 
<tr><td><img src="jpg/nfs3e04.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>NFS III: Hot Pursuit recuper&oacute; un poco la serie del peque&ntilde;o bache que supuso la segunda entrega, volviendo a ofrecer coches muy atractivos</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">Un aspecto muy positivo de este juego fue la entrega con algunas versiones (en Espa&ntilde;a no tuvimos esa suerte) de un editor de veh&iacute;culos. De todos es conocido el "efecto Doom" en Internet. Enseguida aparecieron m&uacute;ltiples p&aacute;ginas por toda la web en las que aficionados de todo el mundo daban rienda suelta a su creatividad dando vida a cientos de veh&iacute;culos que se pueden descargar e instalar con facilidad para extender la vida del juego. Algunos de estos coches son verdaderas obras de arte, dignas de haber formado parte del juego de manera oficial. La propia Electronic Arts potenci&oacute; esta faceta ofreciendo cuatro nuevos veh&iacute;culos en su web, algunos tan interesantes como el Ferrari 456M GT o el Jaguar XKR.</P>
<P ALIGN="JUSTIFY">Sin embargo, en otros aspectos Hot Pursuit volvi&oacute; a decepcionar ligeramente. La conducci&oacute;n sigui&oacute; siendo bastante m&aacute;s arcade que en el primero y los coches segu&iacute;an sin sufrir el m&aacute;s m&iacute;nimo desperfecto despu&eacute;s de los accidentes m&aacute;s salvajes. Incluso la representaci&oacute;n de estos accidentes baj&oacute; mucho en espectacularidad sobre los impresionantes vuelcos que ten&iacute;an lugar en el juego original. Es de suponer que la tendencia hacia el arcade se debe a un intento de Electronic Arts por llegar a un p&uacute;blico m&aacute;s amplio aunque es posible que el abandono de la colaboraci&oacute;n con Road &amp; Track, ya ocurrido en el NFS II, viniera a incidir en este aspecto ya que, ¿qui&eacute;n puede saber c&oacute;mo se comporta uno de estos deportivos mejor que los especialistas que los prueban a diario? A pesar de las peque&ntilde;as decepciones el juego result&oacute; muy entretenido, no nos enga&ntilde;emos, pero siempre quedaba esa pizca de nostalgia al pensar en lo que pudo haber sido y no fue, lo poco que le falt&oacute; para ser el mejor juego de la serie y una de las mejores mezclas de arcade y simulaci&oacute;n de todos los tiempos.</P>

<h4>"NEED FOR SPEED: HIGH STAKES": ¿Una apuesta equivocada?</h4>
<P ALIGN="JUSTIFY">No tengo muy claro el motivo, pero a esta nueva entrega no se le ha a&ntilde;adido el n&uacute;mero 4 que ser&iacute;a el que le corresponder&iacute;a en el orden cronol&oacute;gico de la serie. Hay quien opina que esto se debe a que, m&aacute;s que una nueva entrega, High Stakes, es una "special edition" del NFS III. Y puede que no les falte raz&oacute;n.</P>
<P ALIGN="JUSTIFY">En estos momentos y juzgando solamente por la demo que ya est&aacute; disponible en la web de Electronic Arts tengo que decir que la curva que mostrar&iacute;a la evoluci&oacute;n de mi inter&eacute;s por la serie ha vuelto a decaer tras el repunte temporal provocado por NFS III: Hot Pursuit. Los gr&aacute;ficos siguen siendo buenos, se incluyen nuevos efectos como niebla, iluminaci&oacute;n nocturna en los salpicaderos, … Los coches tambi&eacute;n siguen manteniendo la tendencia a los deportivos m&aacute;s prestigiosos, salvando algunas ausencias poco perdonables del anterior, como Porsche y BMW aunque tambi&eacute;n se repiten otros como el 550 Maranello. Los modos de juego se han aumentado y es posible jugarse el coche en una carrera a cara o cruz contra otro piloto. Tambi&eacute;n dispone de un modo parecido al del &eacute;xito de PlayStation "Gran Turismo" en el que, con unos fondos iniciales m&aacute;s bien escasos, tenemos que ganar dinero para mejorar el coche poco a poco y comprar uno nuevo, escalando as&iacute; en nuestra profesi&oacute;n.</P>

<table width="320" align="center"> 
<tr><td><img src="jpg/nfscla03.jpg"></TD></tr>
<tr><TD><font size=1 face=arial><center>En High Stakes el componente arcade parece que se elevar&aacute; a su m&aacute;xima expresi&oacute;n, en detrimento de la simulaci&oacute;n</center></font></td></tr>
</table>

<P ALIGN="JUSTIFY">La novedad que m&aacute;s llamar&aacute; la atenci&oacute;n es que, por fin, las prestigiosas marcas Ferrari, Porsche, etc. han permitido que sus coches se vean machacados por nuestros errores de conducci&oacute;n. Abollones, faros rotos, etc. ser&aacute;n incidentes muy comunes en las carreras a partir de ahora, aunque los da&ntilde;os que sufre el veh&iacute;culo son mucho, pero mucho menores de lo que ocurrir&iacute;a en la realidad.</P>
<P ALIGN="JUSTIFY">Sin embargo, la sensaci&oacute;n que he obtenido de la demo dista mucho de ser la que esperaba, por m&uacute;ltiples razones. El aspecto de los veh&iacute;culos ha bajado varios enteros en calidad, casi con toda seguridad debido a las necesidades del nuevo sistema de deformaci&oacute;n de la carrocer&iacute;a. El peque&ntilde;o mu&ntilde;equito que podemos ver ahora dentro del coche m&aacute;s parece un rid&iacute;culo Airgamboys que un piloto de verdad. Los tableros de mandos ya no tienen la calidad que sol&iacute;an ni se pueden leer apenas, siendo necesario mostrar la intrumentaci&oacute;n adicional para aclararnos.</P>
<P ALIGN="JUSTIFY">Y, lo peor de todo, el comportamiento de los veh&iacute;culos sigue siendo total, absoluta y absurdamente arcade, dir&iacute;a que mucho peor incluso que en los dos anteriores. Las curvas se pueden tomar a fondo sin importar lo cerradas que sean, simplemente dejaremos algo de goma en el asfalto y trazaremos sin mayor problema. Solamente he podido conducir el Porsche de la demo pero, si eso era un Porsche, me quedo con mi Renault Clio 1.4 que me proporciona sensaciones mucho m&aacute;s fuertes y me plantea muchos m&aacute;s retos de conducci&oacute;n. Sinceramente creo que los chicos de EA deber&iacute;an repasar a conciencia el significado de conceptos como: transferencia de masas, sobreviraje, subviraje… En definitiva: que esta vez me ahorrar&eacute; el dinero para gastarlo en un juego que me proporcione verdaderas sensaciones de pilotaje.</P>

<h4>En resumen</h4>
<P ALIGN="JUSTIFY">The Need for Speed fue algo m&aacute;s que un buen juego de coches. Proporcion&oacute; por vez primera la sensaci&oacute;n de estar conduciendo esos veh&iacute;culos con los que todos so&ntilde;amos y que solamente unos pocos pueden disfrutar en realidad. A pesar de los altibajos de calidad en la serie no se le pueden negar sus cualidades para entretener pero los m&aacute;s puros seguidores de la simulaci&oacute;n se habr&aacute;n encontrado con que el "sabor" del original se ha ido perdiendo poco a poco en las continuaciones. Al contemplar ahora los "soberbios" gr&aacute;ficos del The Need for Speed original no puedo evitar que una sonrisa aflore a mis labios… En aquel momento desde luego que lo eran y en diversi&oacute;n, adicci&oacute;n y jugabilidad ning&uacute;n otro le ha superado desde entonces. Cada vez saldr&aacute;n al mercado m&aacute;s nuevos y mejores juegos pero nunca podr&eacute; olvidar los primeros trompos con mi Ferrari 512 TR. Alguna vez me gustar&iacute;a conducir uno de verdad…</P>
</FONT>
<br>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="left">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulación]</B></font></a> <hR>
<A HREF="simulab.htm"><font FACE="ARIAL"><B>[T&iacute;tulos de Coleccionista]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>

<br>
<HR>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>
