<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">

<center><TABLE BORDER=0 align = center WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" align = center HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="center">
<FONT COLOR="#009933" size=7 face="arial"><B>Z</B></font><FONT color="#000000" size=7 face="arial"><B>ona de Simulaci&oacute;n</B></FONT>
<HR>
<p align="right"><FONT COLOR="#CC0000" size=3 face="arial"><B>Z</B></font><FONT color="#000000" size=3 face="arial"><B>ona de Juegos</B></FONT></p>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE></center>
<br>
<HR>
<TABLE align = left BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE align = left BORDER=0 WIDTH="*"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="left">
<FONT COLOR="#009933" size=3 face="arial"><B>A</B></font><FONT color="#000000" size=2 face="arial"><B>nálisis</B></FONT></a>
</DIV>
</TD>
</TR>
</TABLE></TD>
</TABLE>
<br><br>

<img src="g_misc/69.gif" align=right>
<P align=right>
<FONT color="#cc0000" size=2 face="arial">
<b>A</b></font><FONT color="#000000" size=2 face="arial"><b>rtículo realizado por<br>
<a href="mailto:mafer@ctv.es">Miguel Angel Fernández "Raistlin"</a>
</b></FONT>
<br><br><FONT color="#000000" size=2 face="arial">


<!-- INICIO DE SECCION PARA LA INSERCION DE LAS CARACTERISTICAS DEL JUEGO -->
<BR><BR><BR><BR><BR><BR>
<HR>
<FONT FACE ="ARIAL" SIZE="3"><B>Título: </B></FONT>
<FONT FACE ="ARIAL" SIZE=3 COLOR="#008800"><B>Sports Car GT.</B></FONT><BR>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Compañía: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Image Space / Electronic Arts.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Distribuidora: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Electronic Arts.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Género: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Simulador Automovil&iacute;stico.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Idioma: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Inglés.</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Plataforma: </B></FONT>
<FONT FACE ="ARIAL" SIZE=2 COLOR="#008800"><B>Windows 9x.</B></FONT><BR>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Puntuación </B></FONT><br>
<HR >
<FONT FACE ="ARIAL" SIZE="2"><B>Técnica: [</B><font size=2 face=arial color="#cc0000"><B>8</B></font><B>] | Jugabilidad: [</B><font size=2 face=arial color="#cc0000"><B>9</B></font><B>] | Originalidad: [</B><font size=2 face=arial color="#cc0000"><B>7</B></font><B>]</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Total: [</B><font size=2 face=arial color="#cc0000"><B>85%</B></font><B>]</B></FONT><BR>
<FONT FACE ="ARIAL" SIZE="2"><B>Comentarios / Observaciones: </B></FONT><br>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>Un sensacional simulador que destaca por el realismo alcanzado en el comportamiento del veh&iacute;culo.</li></FONT>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>Los gr&aacute;ficos y sonido tambi&eacute;n rayan a gran altura, sobresaliendo el modelado de los coches.</li></FONT>
<FONT FACE ="ARIAL" SIZE=1 COLOR="#008800"><li>El juego que har&aacute; olvidar a los usuarios de PC que "Gran Turismo" nunca sali&oacute; de la PlayStation.</li></FONT>
<HR>
<BR>
<!-- FIN DE SECCION PARA LA INSERCION DE LAS CARACTERISTICAS DEL JUEGO -->





<P align="justify">
 
<table width="270" align="left"> 
<TR><td><img src="jpg/scargt00.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>La carátula del juego ya nos imprime el deseo de pilotar uno de estos fantásticos deportivos.</center></font></td></tr>
</table>

<P align="justify">Todos aquellos que dispongan de una consola PlayStation o tengan alg&uacute;n amigo, sobrino, primo o conocido que la tenga habr&aacute;n o&iacute;do hablar de una de las grandes sensaciones del pasado a&ntilde;o en el terreno de la simulaci&oacute;n de coches para dicha consola. Me estoy refiriendo, como no, al juego "Gran Turismo" cuyo comentario pod&eacute;is leer en esta misma revista pinchando <a href="atfyp5.htm">aqu&iacute;</a>. Desde su puesta a la venta son muchos los imitadores que le han salido a este juego, sobre todo en el campo del PC donde, debido a la lamentable falta de conversi&oacute;n de dicho juego a esta plataforma, hab&iacute;a mucho m&aacute;s campo libre para disputarse el trono de la simulaci&oacute;n de GTs. De esta forma vieron la luz t&iacute;tulos como "Grand Touring" que, sin embargo, nunca llegaron, ni por asomo, a alcanzar el nivel de calidad y diversi&oacute;n proporcionado por el t&iacute;tulo de la PSX. El juego que comentamos en esta ocasi&oacute;n, "Sports Car GT", viene a llenar ese hueco con buena nota dej&aacute;ndonos con una sensaci&oacute;n predominante: "¡Vaya pedazo de simulador!"</P>

<P ALIGN="JUSTIFY">Efectivamente, porque si en algo sobresale este t&iacute;tulo sobre la media de los juegos de coches que podemos encontrar en las tiendas de inform&aacute;tica en estos momentos es en el aspecto de la simulaci&oacute;n. Es impresionante comprobar como las reacciones de nuestro veh&iacute;culo ante nuestra conducci&oacute;n son absolutamente reales, incluso en algunos momentos casi demasiado reales. Un leve toque al freno en un momento delicado al trazar una curva o, simplemente, una correcci&oacute;n poco suave de la trazada y acabaremos mirando en la direcci&oacute;n equivocada. El m&iacute;nimo fallo de c&aacute;lculo en la velocidad de entrada en la curva y obtendremos el mismo resultado, acabando con seguridad en la trampa de arena m&aacute;s pr&oacute;xima. La transferencia de masas del veh&iacute;culo est&aacute; soberbiamente representada, tanto la lateral como la longitudinal. Las frenadas contundentes provocan que el morro del veh&iacute;culo se hunda notablemente y la direcci&oacute;n perder&aacute; su capacidad de respuesta. Las aceleraciones provocan el efecto contrario, hundiendo la zaga y levantando el morro. Dar un toque excesivo de volante a cierta velocidad provoca que el coche comience a dar tumbos a un lado y a otro, y recuperar el control del mismo no ser&aacute; tarea f&aacute;cil.</P>

<P ALIGN="JUSTIFY">A todo esto debemos a&ntilde;adir los realistas efectos provocados en la mec&aacute;nica de nuestro auto por los accidentes. Aunque no se ven reflejados en el aspecto exterior —no, no hay chapa doblada en este juego— si que afectan a la conducci&oacute;n. Si chocamos y da&ntilde;amos alguna parte del coche notaremos los efectos y tendremos suerte si conseguimos llegar a boxes para reparar el desastre. Una rueda, el aler&oacute;n, el chasis, todo se puede ver afectado y los efectos en la conducci&oacute;n son muy reales: p&eacute;rdida de agarre, falta de control sobre la direcci&oacute;n, p&eacute;rdida de velocidad, etc. El &uacute;nico punto que resta algo a la credibilidad de la simulaci&oacute;n es el hecho de que al entrar en boxes el juego toma el control del veh&iacute;culo hasta que nos incorporemos de nuevo a la carrera. Tampoco veremos a los mec&aacute;nicos trabajar activamente alrededor de nuestro veh&iacute;culo ni otra serie de detalles que, sin influir en la jugabilidad, suelen estar presentes en otros juegos similares ayudando a dar "ambiente".</P>

<br><br>

<table width="320" align="center"> 
<TR><td><img src="jpg/scargt01.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>Los veh&iacute;culos tienen un aspecto sensacional. En esta imagen podemos ver nuestro primer veh&iacute;culo, un llamativo Porsche 911 GTQ en rojo y blanco.</center></font></td></tr>
</table>

<br>

<P ALIGN="JUSTIFY">En el apartado gr&aacute;fico y sonoro hay que resaltar las buenas cualidades del t&iacute;tulo aunque sin llegar al nivel alcanzado en el apartado de la simulaci&oacute;n. Los gr&aacute;ficos son muy buenos, sobre todo los modelos de los veh&iacute;culos que me parecen francamente sensacionales. Por supuesto que a nadie se le ocurra jugar con Sports Car GT sin disponer de una buena tarjeta aceleradora 3D, aunque es posible, ya que el juego cuenta con rendering por software, la calidad y la velocidad se ver&aacute;n ostensiblemente mermadas, lo cual es por otra parte totalmente habitual en cualquier juego que, hoy d&iacute;a, pretenda estar a la altura en cuesti&oacute;n de gr&aacute;ficos. En cuanto a la elecci&oacute;n de tarjeta no hay ning&uacute;n problema ya que soporta tanto Glide como Direct 3D.</P>

<P ALIGN="JUSTIFY">Como dec&iacute;a, los gr&aacute;ficos son muy buenos aunque sin llegar al sobresaliente. Algunos de los reproches m&aacute;s serios que le podemos hacer en este aspecto son una cierta monoton&iacute;a en las texturas del asfalto y un notable efecto de aliasing a larga distancia, sobre todo en las l&iacute;neas laterales de la pista y las vallas de protecci&oacute;n. Las texturas del asfalto llegan a producir, a ciertas velocidades, un molesto efecto de "arm&oacute;nico" que resta sensaci&oacute;n de velocidad al juego. Pero estos defectos no empa&ntilde;an una sensaci&oacute;n general positiva. El sonido tambi&eacute;n est&aacute; a una altura aceptable pero sin ser tampoco nada excepcional. Ambos aspectos cumplen con un notable dando el correcto acompa&ntilde;amiento a lo verdaderamente importante en un juego de estas caracter&iacute;sticas: la simulaci&oacute;n, las carreras, la competici&oacute;n, el ansia de victoria, … ¿no ol&eacute;is ya la gasolina y la goma quemada?</P>

<P ALIGN="JUSTIFY">Ya hemos hablado de las excepcionales cualidades de este simulador automovil&iacute;stico as&iacute; que no voy a repetir los mismos argumentos. El t&iacute;tulo dispone de tres modos de juego: carrera r&aacute;pida, modo "carrera" y modo multijugador. La carrera r&aacute;pida no tiene mucho m&aacute;s que decir, tenemos disponibles un par de coches (un BMW GT3 y un Porsche 911 GT2) adem&aacute;s de cualquier otro que hayamos obtenido en el modo "carrera". Por otra parte, en modo multijugador podemos enfrentarnos por IPX o TCP/IP a otros corredores con un m&aacute;ximo de seis jugadores simult&aacute;neos. Se advierte que el modo TCP/IP est&aacute; pensado para red local y que su uso por Internet no obtendr&aacute; buenos resultados debido a la lentitud de la conexi&oacute;n —a no ser que contemos con conexiones RDSI, ADSL o m&oacute;dem de cable, claro—. ¡Vaya novedad! Todos estamos hartos ya de experimentar los problemas del "lag" en Internet as&iacute; que no nos pilla por sorpresa la advertencia.</P>

<br><br>

<table width="320" align="center"> 
<TR><td><img src="jpg/scargt02.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>As&iacute; es como queremos ver siempre a nuestros rivales: detr&aacute;s de nosotros, aunque un poco m&aacute;s lejos estar&iacute;a mejor. Su IA es bastante buena y saben como presionarnos para que cometamos un error.</center></font></td></tr>
</table>

<br>

<P ALIGN="JUSTIFY">Donde se encuentra la verdadera "chicha" de este juego es en el modo "Carrera". Empezaremos con 100.000 cr&eacute;ditos en el bolsillo, lo justo para comprarnos un coche de las series clasificatorias GTQ y empezar a rodar por los circuitos tratando de ganar carreras, lo que se traduce en premios en met&aacute;lico con los que mejorar el veh&iacute;culo o comprarnos otro nuevo. Este aspecto es donde m&aacute;s nos recuerda el juego al ya mencionado "Gran Turismo" de PSX. Las piezas disponibles van desde colectores de escape m&aacute;s eficientes a cajas de cambio de seis velocidades, pasando por kits de reducci&oacute;n de peso, mejoras aerodin&aacute;micas, de suspensi&oacute;n, mejores neum&aacute;ticos, turbo m&aacute;s potente, intercooler, embrague, chips de gesti&oacute;n del encendido, etc. Por supuesto que no es suficiente con comprar un buen coche sino que tambi&eacute;n hay que saberlo poner a punto. En las sesiones de entrenamiento saldremos a la pista y despu&eacute;s nos tocar&aacute; volver al garaje para corregir los reglajes seg&uacute;n las sensaciones que nos haya transmitido el contacto con el circuito. Habr&aacute; que retocar relaciones de cambio, apoyo aerodin&aacute;mico, suspensiones —muelles, amortiguadores y barras estabilizadoras—, capacidad del dep&oacute;sito de combustible, compuestos de neum&aacute;ticos, …</P>

<P ALIGN="JUSTIFY">Cuando el coche est&eacute; a nuestro gusto saldremos a dar las vueltas de clasificaci&oacute;n. Un buen lugar en la parrilla de salida es fundamental para obtener una buena posici&oacute;n al final de la carrera y, con ella, los puntos que nos permitan ganar el campeonato GTQ y poder pasar as&iacute; a la siguiente categor&iacute;a, el campeonato GT3. As&iacute; seguiremos nuestra carrera como pilotos hasta llegar a ser campeones de la GT1, lo que nos abrir&aacute; las puertas para participar en la s&uacute;per exclusiva World GT. En cada una de las categor&iacute;as competiremos en diferentes circuitos, entre los cuales est&aacute;n los famosos Laguna Seca, Hockenheim, etc. Tambi&eacute;n estar&aacute;n a nuestra disposici&oacute;n diferentes veh&iacute;culos, como los sensacionales y espectaculares Mercedes CLK GTR o el McLaren F1, Lister Storm, Panoz y muchos otros, cada uno con sus caracter&iacute;sticas de comportamiento diferenciadas. Adem&aacute;s EA promete que en la p&aacute;gina web del juego estar&aacute;n poco a poco disponibles nuevos veh&iacute;culos que podremos descargar e instalar f&aacute;cilmente.</P>

<br><br>

<table width="320" align="center"> 
<TR><td><img src="jpg/scargt03.jpg"></TD></tr>
<TR><TD><font size=1 face=arial><center>Las posibilidades de configuraci&oacute;n del coche son muchas. Debemos decidir qu&eacute; mejoras ser&aacute;n las m&aacute;s &uacute;tiles para nosotros y aprovechar bien nuestro dinero.</center></font></td></tr>
</table>

<br>

<P ALIGN="JUSTIFY">El juego cuenta con varios niveles de dificultad, lo que lo hace apto para todos los p&uacute;blicos. Adem&aacute;s cuenta con opciones de ayuda a la conducci&oacute;n, como la sensibilidad progresiva de la direcci&oacute;n con la velocidad, muy aconsejable para no dar volantazos a m&aacute;s de 200 kmh. Tambi&eacute;n cuenta con la t&iacute;pica opci&oacute;n de cambio autom&aacute;tico y ayuda para frenado. Otra opci&oacute;n pr&aacute;cticamente imprescindible si jugamos con el teclado es la ayuda a la direcci&oacute;n que me recuerda much&iacute;simo a la opci&oacute;n de nombre similar del hist&oacute;rico F1 GP de Geoff Crammond y que tan necesaria era tambi&eacute;n en aqu&eacute;l juego. Aunque, no lo vamos a negar, lo ideal para este juego es contar con un volante y pedales para que la sensaci&oacute;n de simulaci&oacute;n sea total. Soporta Force Feedback para aquellos afortunados que posean un volante con esta caracter&iacute;stica.</P>
<P ALIGN="JUSTIFY">En resumen, un juego que merece la pena sin ning&uacute;n g&eacute;nero de dudas pero al que le ha faltado redondear algunos peque&ntilde;os detalles para convertirse en una obra maestra. Una simulaci&oacute;n s&uacute;per realista con un modelo f&iacute;sico de comportamiento del veh&iacute;culo como no ve&iacute;amos en mucho tiempo. No apto para amantes del arcade. Solo nos queda esperar por una m&aacute;s que probable segunda parte.</P>
</FONT>

<FONT FACE="Arial" SIZE=1><P>Para m&aacute;s informaci&oacute;n sobre el juego os pod&eacute;is dirigir a las siguientes direcciones:<BR>
P&aacute;gina Oficial del Juego (<A HREF="http://www.sportscargt.com/" TARGET="_NEW">http://www.sportscargt.com/</A>)<BR>
P&aacute;gina de Electronic Arts (<A HREF="http://www.ea.com/" TARGET="_NEW">http://www.ea.com/</A>)<BR>
P&aacute;gina de Image Space Incorporated (<A HREF="http://www.imagespaceinc.com/" TARGET="_NEW">http://www.imagespaceinc.com/</A>)</P>
</FONT>

<P ALIGN="RIGHT"><FONT COLOR="#0080C0" size=2 face="arial"><B>Ú</B></font><FONT color="#000000" size=1 face="arial">LTIMA REVISIÓN EN</FONT> <FONT color="#CC0000" size=2 face="arial"><B>JULIO</B></FONT><FONT color="#000000" size=1 face="arial"> DE </FONT><FONT color="#CC0000" size=2 face="arial"><B>1999</B></FONT><BR>

<hr>
<center><TABLE CELLPADDING=2 WIDTH="100%">

<TD  WIDTH="50%" VALIGN="TOP" align="left">

<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" cellspacing=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" cellspacing=0 CELLPADDING=2>
<TR>
<TD>
<DIV align="CENTER">
<FONT SIZE=2>
<A HREF="simula.htm"><font FACE="ARIAL"><B>[Zona de Simulaci&oacute;n]</B></font></a> <hR>
<A HREF="simulaa.htm"><font FACE="ARIAL"><B>[An&aacute;lisis]</B></font></a> 
</DIV>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>


<br>
<HR>


<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica"><FONT COLOR="#000000">ZONA DE JUEGOS</FONT></FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">a</FONT></TD>
</TR>
</TABLE></CENTER>

<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER><B><FONT FACE="Arial,Helvetica">MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</FONT></B></CENTER>
</TD>
</TR>
</TABLE></DIV>
</TD>
</TR>
</TABLE></CENTER>
</HTML>



