<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>H</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>ardware gen&eacute;rico</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@ctv.es">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
Kryotech Renegade
</H3>

<P ALIGN="JUSTIFY">Kryotech es una de esas empresas que s&oacute;lo se conoce si se est&aacute; muy metido en un mundo en particular, pero que ofrece una tecnolog&iacute;a realmente puntera. Ser&iacute;a como la Vector (fabricante de autom&oacute;viles) en versi&oacute;n inform&aacute;tica. Llevan poco tiempo en el mercado, pero ya se han ganado con creces el respeto y admiraci&oacute;n de los conocidos como &quot;power users&quot;.</P>
<P ALIGN="JUSTIFY">Los aparatos que vende Kryotech son kits formados por placa base, procesador, y una caja un poco especial. De hecho, congelan el procesador para poderlo acelerar hasta frecuencias imposibles de otro modo.</P>
<P ALIGN="JUSTIFY">El &uacute;ltimo invento que sacaron hace ya unos meses fue el Kryotech K6-3 500, que como su nombre indica consegu&iacute;a poner un K6-3 hasta 500 MHz reduciendo su temperatura hasta 40ºC bajo cero. El problema es que era una soluci&oacute;n muy cara (sal&iacute;a por unas 250.000 ptas) y ya inclu&iacute;a placa base y procesador, por lo que no pod&iacute;amos escoger nosotros en esta categor&iacute;a. La raz&oacute;n por la que no pueden es porque cada soluci&oacute;n esta dise&ntilde;ada expresamente para esa configuraci&oacute;n, y no para ninguna otra.</P>
<P ALIGN="JUSTIFY">Veamos a que problemas reales se tiene que enfrentar Kryotech, y como los han solucionado.</P>
<H4>Condensaci&oacute;n</H4>
<P ALIGN="JUSTIFY">Cuando enfriamos un objeto que est&aacute; radiando calor con una intensidad apreciable hasta la temperatura del aire de la habitaci&oacute;n en la que est&aacute;, como por ejemplo con un ventilador convencional, no tenemos que preocuparnos en absoluto por la condesaci&oacute;n. En cambio, cuando caemos por debajo de una cierta temperatura, aparece condensaci&oacute;n, o lo que es lo mismo, formaci&oacute;n de agua en las superficies que radian. Obviamente, si lo que estamos enfriando es un componente electr&oacute;nico, tenemos un problema puesto que agua y electricidad no combinan muy bien... o de hecho combinan demasiado bien, deberiamos decir.</P>
<P ALIGN="JUSTIFY">Aqu&iacute; es donde entra la KryoCavity de Kryotech, una c&aacute;mara de aislamiento donde el procesador debe mantenerse para asegurarnos que todo lo que se encuentro dentro de la cavidad se enfriar&aacute; por debajo del punto de &quot;dew&quot; (la temperatura por debajo de la cual aparece condensaci&oacute;n) del aire fuera de la cavidad, y sin formaci&oacute;n de condensaci&oacute;n.</P>
<P ALIGN="JUSTIFY">El problema con la soluci&oacute;n de la KryoCavity es el coste de la tecnolog&iacute;a asociada, que es excesivamente alto en la actualidad. A&uacute;n as&iacute;, Kryotech introdujo una mejora que redujo el precio de la tecnolog&iacute;a, y del producto por ende, en 60.000 ptas. Sin embargo, el precio continuaba siendo excesivo, y a&uacute;n no teniamos la flexibilidad que buscamos en el producto, para poder utilizarlo en combinaci&oacute;n con cualquier placa base y microprocesador. La soluci&oacute;n para eliminar el problema de la condensaci&oacute;n es no disminuir la temperatura del sistema por debajo de la temperatura ambiente.</P>
<H4>Refrigeraci&oacute;n en fase vapor</H4>
<P ALIGN="JUSTIFY">El Kryotech Renegade es un refrigerador de temperatura ambiente. Utilizando la tecnolog&iacute;a tr&aacute;s su producto anterior, elimina el problema de la condensaci&oacute;n manteniendo la temperatura alrededor del valor ambiental.</P>
<P ALIGN="JUSTIFY">Pero, &iquest;cual es el proceso utilizado en general por Kryotech en sus productos? Pues algo que todos tenemos en casa, un refrigerador en faso vapor, o sea, un frigor&iacute;fico. Un frigor&iacute;fico o congelador funciona comprimiendo un gas hasta volverlo s&oacute;lido, proceso en el que el gas, al pasar de estado gaseoso a l&iacute;quido pierde mucho calor, enfri&aacute;ndose r&aacute;pidamente. Este l&iacute;quido se hace pasar por el lugar que queremos enfriar, y dado que se encuentra a una temperatura muy baja, enfria todo lo que toca y vuelve al estado gaseoso, punto donde el proceso vuelve a comenzar. El ruido que genera una nevera durante su funcionamiento no es otro que el del compresor.</P>
<H4>El Kryotech Renegade</H4>
<P ALIGN="JUSTIFY">El Renegade se ofrece en dos versiones: Renegade ATX Standard Edition (SE) y Renegade ATX Premium Edition (PE). La &uacute;nica diferencia entre ambos, a parte de un incremento de unas 7.500 ptas para la versi&oacute;n Premium, es un LCD con la temperatura actual del microprocesador y un sistema inteligente de parada de la m&aacute;quina, en caso que el sistema de refrigeraci&oacute;n fallara.</P>
<P ALIGN="JUSTIFY">Asimismo, para ambas versiones existen dise&ntilde;os para Socket 7 y Slot 1, con solo una diferencia de 1.500 ptas entre ambos. As&iacute;, tenemos el Renegade ATX-SE para Slot 1 por unas 54.000 ptas, y el Renegade ATX-PE por unas 61.500 ptas.</P>
<P ALIGN="JUSTIFY">El pack viene con una semi-torre ATX y el sistema de refrigeraci&oacute;n en si mismo, consistiendo en un compresor, una sonda t&eacute;rmica y una placa de refrigeraci&oacute;n, para el contacto con el micro.</P>

<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgen.htm">
<FONT FACE="ARIAL"><B>[Hardware gen&eacute;rico]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>