<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>celeraci&oacute;n gr&aacute;fica</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@ctv.es">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
TNT, el fin de la supremac&iacute;a
</H3>

<P ALIGN="JUSTIFY">AMD vendiendo m&aacute;s que Intel, Linux haciendo peligrar a NT como servidor y ahora nVidia va a barrer a 3Dfx de la supremac&iacute;a que ostentaba desde hac&iacute;a 3 a&ntilde;os. Realmente, empezaremos el siglo XXI con un mercado muy competitivo. Y eso siempre es bueno.</P>
<P ALIGN="JUSTIFY">TNT2 no es simplemente una TNT fabricada a 0.25 micras, como muchos se esperaban. Es un nuevo dise&ntilde;o... que por supuesto tambi&eacute;n aprovecha las 0.25 micras para volar a m&aacute;s de 180 MHz. Soporte completo de AGPx4, incluyendo AGP-Texturing, 32 MB de memoria, RAMDAC de 300 MHz, soporte para pantallas digitales planas, memoria SDRAM de hasta 5 ns en la m&aacute;s potente configuraci&oacute;n beta actual...</P>
<P ALIGN="JUSTIFY">En el apartado de drivers, siempre muy cuidado por nVidia, nos encontramos unos drivers muy estables, pese a ser una versi&oacute;n beta. Adem&aacute;s, y continuando con la tradici&oacute;n, vienes ya acompa&ntilde;ados de un ICD completo para OpenGL, o sea, una implementaci&oacute;n completa de un intermediario para ejecutar aplicaciones OpenGL sobre la tarjeta. Con esto podemos aprovechar la tarjeta con cualquier cosa que est&eacute; programa en OpenGL, sea la &uacute;ltima versi&oacute;n del Quake o la del AutoCAD.</P>
<P ALIGN="JUSTIFY">La calidad de imagen al renderizar en 3D es id&eacute;ntica a la que ya nos tiene acostumbrados nVidia con la TNT original. Hablando en plata, superior a la Voodoo2. Este punto est&aacute; cobrando importancia dia a dia, puesto que las tarjetas estan llegando a unos niveles de potencia donde el usuario ya no pide mas frames por segundo (que importa ir a mas de 50 o 60, si no se nota) y esta pidiendo cada vez mayor calidad de imagen. Para eso es necesario que el chipset haga bien su trabajo, sin artefactos visuales. Que el RAMDAC sea de calidad y que los algoritmos utilizados esten correctamente implementados es tambi&eacute;n fundamental.</P>
<P ALIGN="JUSTIFY">Evidentemente, como su antecesora la TNT2 es capaz de renderizar a 32 bits. Por lo visto, todas las tarjetas de este a&ntilde;o van a poder renderizar a 32 bits (Rage128, Savage4, TNT2...) excepto la Voodoo3 de 3Dfx, que siguen empe&ntilde;ados en que renderizar a 32 bits es un penalizador demasiado grande para ser factible en una tarjeta pensada para juegos. Con la Rage 128 y la Savage4 ya les dieron dos lecciones, y ahora llega la tercera. El impacto en el rendimiento, al probar Quake2, entre color de 16 bits y de 32 bits se sit&uacute;a entre 1% y 17%, por lo que es a&uacute;n perfectamente jugable. Adem&aacute;s estos resultados son con unos drivers a&uacute;n en desarrollo.</P>
<P ALIGN="JUSTIFY">Pongamos ahora frente a frente a la TNT2 y la Voodoo3. Estos son los resultados de ejecutar el benchmark mas exigente tanto para tarjetas como para CPUs, el Quake2 Crusher. Las pruebas se han ejecutado sobre un Pentium III a 500 MHz y una placa ASUS P2B, con los ultimos drivers disponibles de las tarjetas. El resultado son los frames por segundo obtenidos.</P>
</FONT>
<PRE>
Resoluci&oacute;n   TNT2    TNT2    Voodoo3
             183MHz  150MHz  183MHz
640x480      53      52.6    52.5
800x600      52.4    51.5    51.9
1024x768     51.2    49.5    46.4
1152x864     45.7    43.4    40.6
1600x1200    29.7    26.5    25.1
</PRE>
<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Si analizamos los resultados podemos fijarnos que la TNT2 no empieza a perder gas hasta 1152x864, lo cual es debido a que en esas resoluciones est&aacute; limitada por la CPU. Con una CPU m&aacute;s r&aacute;pida se obtendrian valores a&uacute;n mayores. Cabe destacar tambi&eacute;n que incluso la TNT2 funcionando a 150MHz supera a la Voodoo3 a 183 MHz, lo cual es claro indicativo del buen dise&ntilde;o del pipeline de la TNT2 por parte de los ingenieros de nVidia.</P>
<P ALIGN="JUSTIFY">Para una prueba m&aacute;s real de la mayor&iacute;a de juegos necesitamos poner a prueba Direct3D, ya que recordemos que Quake utiliza un subset de OpenGL, y tiene incluso una versi&oacute;n del engine optimizada para Glide, la librer&iacute;a de 3Dfx. Hechas las pruebas sobre Direct3D con el engine Shogo, se obtienen resultados ligeramente m&aacute;s favorables para la TNT2, que realmente se desenvuelve bien sobre 3D.</P>
<P ALIGN="JUSTIFY">Todas las anteriores pruebas se han realizado sobre un micro Intel Pentium III a 500 MHz. Si ejecutamos las mismas pruebas sobre un AMD K6-3 (o K6-2) obtenemos unos resultados inversos. La Voodoo3 se alza ganadora en pr&aacute;cticamente todas las pruebas. La raz&oacute;n es bien simple, sin embargo. Los drivers para la TNT2 a&uacute;n no disponen de un soporte completo y optimizado para 3DNow! como s&iacute; disponen las librerias Glide para Voodoo3. Lo l&oacute;gico a esperar ser&iacute;a que al tambi&eacute;n en este caso se alzara vencedora la TNT2, pero deberemos esperar a que esten los drivers terminados para confirmarlo.</P>
<P ALIGN="JUSTIFY">Entrando un poco m&aacute;s en el interior de la tarjeta, nos encontramos gratas sorpresas. Por ejemplo, una de las cosas que mas se han criticado de la Voodoo3 es su limitaci&oacute;n de las texturas a un tama&ntilde;o de 256x256. Pues bien, la TNT2, al igual que la TNT, soportan texturas de hasta 2048x2048. Esto, unido a el soporte para AGP-texturing puede hacer sobresalir realmente a la tarjeta en futuros productos como Quake III Arena o Unreal Tournament, que utilizaran internamente 24 bits de color y texturas de 512x512.</P>


<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwgra.htm">
<FONT FACE="ARIAL"><B>[Aceleraci&oacute;n gr&aacute;fica]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>