<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font>
<FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>A</B></FONT>
<FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>celeraci&oacute;n gr&aacute;fica</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@email.com">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
	TNT3, el golpe de gracia de nVidia
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="justify">Cuando a&uacute;n estamos recuper&aacute;ndonos de la fiera lucha entre la TNT2 y la Voodoo3, nVidia ya ha presentado su roadmap para este a&ntilde;o, que incluye la TNT3 para finales de a&ntilde;o. Para que nVidia no quiere dormirse en los laureles, y ha decidido dar un duro golpe a 3Dfx ahora que estan muy igualados.</P>
<P ALIGN="justify">Decididamente, nVidia ha planeado bien sus acciones. La TNT3 no ser&aacute; simplemente una nueva versi&oacute;n de la TNT2 con m&aacute;s frecuencia de reloj y m&aacute;s memoria, sino que plantea un salto como no se ha visto en el mundo de la aceleraci&oacute;n gr&aacute;fica desde que 3Dfx presentara su Voodoo ya hace unos a&ntilde;os. Por fin, la transformaci&oacute;n de imagenes y la generaci&oacute;n de iluminaci&oacute;n se llevar&aacute;n a cabo por hardware, posibilitando que tengamos escenas literalmente fotorealistas en nuestros juegos.</P>
<P ALIGN="justify">Para darnos cuenta de lo importante que es la iluminaci&oacute;n s&oacute;lo hay que fijarse en cualquier imagen fija generada por programas de dise&ntilde;o 3D, como 3D Studio o LightWave. El realismo de las im&aacute;genes es mucho mayor que cualquier fotograma de un juego, por mucho que sea el Quake3 corriendo en una TNT2 Ultra o Voodoo3 3500. Obviamente, todas las aplicaciones (incluyendo juegos) que estan utilizando 3D s&iacute; disponen de iluminaci&oacute;n, pero est&aacute; calculada totalmente por software, lo que impide a los desarrolladores utilizar algoritmos muy complejos ya que el procesador ha de hacer muchas otras cosas aparte de la iluminaci&oacute;n, adem&aacute;s de no estar expresamente preparado para esa tarea.</P>
<P ALIGN="justify">Para no faltar a la verdad, hemos de decir que ya hace a&ntilde;os que existen tarjetas que incluyen la geometr&iacute;a e iluminaci&oacute;n por hardware, y son capaces de renderizar animaciones de 3D Studio con miles de pol&iacute;gonos en tiempo real. Pero su precio tiene, normalmente, del orden de 6 d&iacute;gitos. Son tarjetas exclusivamente profesionales, totalmente inalcanzables para usuarios dom&eacute;sticos.</P>
<P ALIGN="justify">Esta nueva generaci&oacute;n de tarjetas, de la cual la TNT3 es la primera, liberaran a los procesadores de la geometr&iacute;a e iluminaci&oacute;n, con lo que los desarrolladores podr&aacute;n centrarse en otros aspectos. Adem&aacute;s, hemos de tener en cuenta que esta es la primera, y luego estas t&eacute;cnicas se ir&aacute;n mejorando, por lo que podemos esperar, en los pr&oacute;ximos a&ntilde;os, im&aacute;genes con la calidad del estilo de Toy Story corriendo en un &quot;vulgar&quot; PC.</P>
<H4>Rumores</H4>
<P ALIGN="justify">Hasta aqu&iacute; no hemos dicho nada concreto de la TNT3, excepto que ser&aacute; un punto de referencia futuro para la aceleraci&oacute;n gr&aacute;fica. Evidentemente, en estos casos circulan much&iacute;simos rumores por la red, de una cierta credibilidad. Vamos a ver que pinta tiene el mercado en los pr&oacute;ximos meses.</P>
<P ALIGN="justify">Las tarjetas profesionales que incluyen geometr&iacute;a e iluminaci&oacute;n suelen ir acompa&ntilde;adas de cantidades de memoria que se situan sobre los 256MB, por lo que la TNT3 podr&iacute;a venir en versiones desde 64MB hasta 256MB para una versi&oacute;n profesional. Hay que tener en cuenta que, seg&uacute;n los rumores, la 3Dfx Voodoo4 vendr&aacute; con 128MB.</P>
<P ALIGN="justify">El siguiente dato es oficial (de los pocos que hay): 15 millones de transistores. Esa cifra es la que corresponde, seg&uacute;n el roadmap de nVidia, a la TNT3. Hay que tener en cuenta que ni siquiera los procesadores actuales llevan tantos transistores... se espera que el Merced a 800 MHz de Intel, el primero de 64 bits, dispondr&aacute; de ese n&uacute;mero. La tecnolog&iacute;a que se utilizar&aacute; ser&aacute;, como m&iacute;nimo, de 0.18 micras, o incluso (aqu&iacute; nVidia podr&iacute;a sorprender) de 0.15 micras. Estas cifras permitiran unas frecuencias mayores que las actuales, pero en ning&uacute;n caso del orden de los 800 MHz del Merced, simplemente por cuestiones de arquitectura que no vienen al caso. Lo que parece una cifra m&aacute;s razonable se situa entre los 250MHz y 300 MHz, lo cual es bastante impresionante para una tarjeta gr&aacute;fica.</P>
<P ALIGN="justify">&iquest;Donde han quedado las Trident de 256Kb que equipaban nuestros primeros 286? Asusta, pero es emocionante.</P>

<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>JULIO</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>Zona Hardware</B></FONT>
</A>
<HR>
<A HREF="zhwgra.htm">
<FONT FACE="ARIAL"><B>Aceleraci&oacute;n gr&aacute;fica</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
Zona Hardware
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>