<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>M</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>icroprocesadores</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@ctv.es">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
Sobre microprocesadores, relojes y multiplicadores
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Todo el mundo, de una forma u otra, tiene que enfrentarse en alg&uacute;n momento durante la vida de su equipo inform&aacute;tico contra velocidades de bus, de microprocesador, multiplicadores, overclocking y toda una serie de cosas que, en realidad, son diferentes aspectos de lo mismo. Esa idea subyacente a todas esas cuestiones es la que vamos a intentar desvelar hoy aqu&iacute;.</P>
<H4>Un poco de historia: velocidades y multiplicadores</H4>
<P ALIGN="JUSTIFY">Hace mucho, mucho tiempo, en una industria ya lejana, los procesadores de las primeras generaciones no distinguian ninguna de los conceptos anteriormente mencionados. Simplemente, todo funcionaba a una &uacute;nica velocidad. Eran los tiempos de los 286 a 16 MHz, los 386 a 20 MHz y cosas similares.</P>
<P ALIGN="JUSTIFY">Y entonces lleg&oacute; el 486. El i486 fue un chip fabricado con una nueva tecnolog&iacute;a, con unas pistas m&aacute;s finas. Las famosas micras. Por aquella epoca se estaba rondando las 0.5 micras, mientras que ahora la mayor&iacute;a de procesadores son de 0.35 y 0.25 micras. Este dato puede parecer simplemente informativo, pero es muy importante. Las micras de fabricaci&oacute;n de un circuito de muy alta integraci&oacute;n, como puede ser un microprocesador, influye directamente en su velocidad, temperatura disipada y potencia. Cuanto menores son las micras, m&aacute;s r&aacute;pidamente puede funcionar ya que las distancias son m&aacute;s cortas, as&iacute; mismo, el consumo energ&eacute;tico es menor y es posible disminuir el voltaje requerido por el circuito, disminuyendo el calor generado y por tanto, pudiendo acelerar m&aacute;s el procesador sin correr el riesgo de fundirlo. Adem&aacute;s, tama&ntilde;os m&aacute;s reducidos en las pistas del circuito permite, en la misma area &uacute;til del semiconductor, poner m&aacute;s transistores, y por tanto darle m&aacute;s funcionalidades al microprocesador, o incluir peque&ntilde;as memorias que actuen como caches.</P>
<P ALIGN="JUSTIFY">Volviendo al tema del 486, Intel se encontr&oacute; con que podia ir aumentando f&aacute;cilmente la velocidad de trabajo de sus microprocesadores, y as&iacute; empez&oacute; a saltar desde el 486 a 25 MHz, a 33 MHz. En este punto empezaron los problemas. Hacer trabajar el microprocesador a 33 MHz era f&aacute;cil, pero que el resto del sistema estuviera a la altura, no lo era tanto. Aqu&iacute; se empez&oacute; a escindir las velocidades de bus con las velocidades del microprocesador. El 486 DX2 a 50 MHz funcionaba, como su nombre indica, a 50 MHz cuando se trataba del interior del microprocesador, pero a 25 MHz cuando se comunicaba con el resto del sistema, o lo que es lo mismo, esa era la velocidad del bus. El bus no es otra cosa que un cable donde todo el mundo se conecta para poderse comunicar. Os lo pod&eacute;is imaginar como una calle a donde se conectan las casas. Para ir de una casa a otra, hay que pasar por la calle. Pues bien, las casas son los componentes del ordenador, y la calle es el bus. En el caso del 486 DX2 a 50 MHz, la calle funcionaba a 25 MHz, pero por el interior del microprocesador todo funcionaba a 50 MHz. Intel a&uacute;n consigui&oacute; mejorar la velocidad del bus hasta 50 MHz, pero cost&oacute; lo suyo. Sin embargo, el multiplicar por 2 la velocidad interna de trabajo permit&iacute;a funcionar con un bus de 25 MHz, de probada fiabilidad. As&iacute;, empezo a trabajar sobre esta idea y vimos aparecer el DX2 a 66 MHz (bus a 33 MHz) y el DX4 a 100 MHz. Este &uacute;ltimo no era, aunque pueda parecer, un multiplicador por 4 sobre un bus de 25 MHz, sino que era un multiplicador por 3 sobre un bus de 33 MHz. El porque no se llam&oacute; DX3 a 100 MHz no se sabe con certeza, pero hay rumores sobre alguien que registr&oacute; el nombre antes que Intel e impidi&oacute; utilizarlo.</P>
<P ALIGN="JUSTIFY">En aquella epoca, la cache de segundo nivel se encontraba en la placa base, y funcionaba por tanto, a la misma velocidad que el bus. Eso hac&iacute;a que el procesador s&oacute;lo pudiera comunicarse con la cache, y por ende con la memoria, uno de cada dos ciclos.</P>
<P ALIGN="JUSTIFY">Tras alg&uacute;n tiempo con el 486, apareci&oacute; el Pentium en sus dos versiones iniciales, a 60 y a 66 MHz. Ir&oacute;nicamente, los dos primeros funcionaban a la misma velocidad que el bus, ya que Intel hab&iacute;a conseguido lanzar, mediante otro truco que ahora explicaremos, la velocidad del bus hasta 66 MHz. Estos dos primeros Pentium seguian fabric&aacute;ndose con tecnolog&iacute;a de 0.5 micras, y tuvieron numerosos problemas de calentamiento, pues se estaba llegando al l&iacute;mite f&iacute;sico de esa tecnolog&iacute;a. El truco que mencionabamos anteriormente era lo mismo que hab&iacute;a hecho Intel con los 486, pero aplicado de nuevo a otra escala. El principal problema para aumentar la velocidad del bus no era la cache de segundo nivel, ni la memoria, ni el chipset, que son al fin y al cabo circuitos integrados que normalmente se compran nuevos con un nuevo procesador y pueden ser suficientemente r&aacute;pidos. El problema estaba en las comunicaciones con las tarjetas de expansi&oacute;n del bus PCI. Este bus funcionaba a 33 MHz seg&uacute;n su especificaci&oacute;n, y de esa manera lo tenian en cuenta los fabricantes cuando dise&ntilde;aba cualquier tarjeta. Lo que no pod&iacute;a hacer Intel era acelerar el bus hasta 66 MHz porque simplemente no funcionar&iacute;a ninguna tarjeta. La soluci&oacute;n era clara, hacer lo mismo que con los procesador, y de esta forma el bus PCI pas&oacute; a funcionar a la mitad de la velocidad del bus interno de comunicaciones, o como se sol&iacute;a denominar entonces, a la velocidad del chipset.</P>
<P ALIGN="JUSTIFY">Intel volvi&oacute; a cambiar su tecnolog&iacute;a de fabricaci&oacute;n pas&aacute;ndose a las 0.35 micras. Eso permiti&oacute; solucionar los problemas de calentamiento que tuvieron los Pentium a 60 y 66 MHz. Llegaron los Pentium 75, 90 y 100 MHz, los tres con multiplicador de 1.5 y por tanto con velocidades de bus de 50, 60 y 66 MHz respectivamente. Inmediatamente aparecieron los Pentium 120 y 133 MHz, con multiplicador por 2 y por tanto con buses de 60 y 66 MHz. Esto declam&oacute; el abandono total de Intel del bus de 50 MHz. De hecho, el Pentium 120 fue el &uacute;ltimo con bus a 60 MHz, porque se vio que no sal&iacute;a a cuenta ya que incluso un Pentium 100 era a veces m&aacute;s r&aacute;pido gracias a su bus ligeramente superior. As&iacute;, el resto de la gama Pentium se qued&oacute; con el bus de 66 MHz fueron subiendo imparablemente la velocidad pasando por 166 MHz (x2.5), 200 MHz (x3.0) y 233 MHz (x3.5).</P>
<P ALIGN="JUSTIFY">En esta &eacute;poca, al montar los microprocesadores sobre las placas, se deb&iacute;a indicar casi todo lo necesario para hacerlos funcionar, desde el voltaje interno, hasta la velocidad del bus y el multiplicador. Nada imped&iacute;a coger un Pentium 100 MHz y cambiar su multiplicador de 1.5 a 2.0 para tener un 133 MHz. El que funcionara o no era cuesti&oacute;n de la calidad de la fabricaci&oacute;n de aquella remesa en concreto. Por supuesto, la gente no tard&oacute; en empezar a hacer pruebas con las configuraciones, que eran totalmente libres, y pronto se descubri&oacute; que la mayor&iacute;a de micros pod&iacute;an funcionar un poco m&aacute;s r&aacute;pido, e incluso algunos bastante m&aacute;s all&aacute; de su velocidad de f&aacute;brica.</P>
<P ALIGN="JUSTIFY">Los procesadores son otro producto m&aacute;s fabricado en serie, y como tales no son siempre iguales, su calidad depende de muchos factores, alguno tan importante en este caso como la calidad de las planchas de semiconductor. Cuando un procesador se termina de fabricar, es sometido a diversas pruebas de velocidad para comprobar cuales soporta, dependiendo de la calidad obtenida y de la finura del proceso de fabricaci&oacute;n. Una vez se averigua su velocidad m&aacute;xima, normalmente se vende con una velocidad algo inferior para tener un margen de prueba. Los laboratorios pueden ser duros probando sus microprocesadores, pero no hay campo de batalla m&aacute;s duro que el interior de un PC de un usuario cualquiera.</P>
<P ALIGN="JUSTIFY">Evidentemente, la calidad de la fabricaci&oacute;n y de las materias primas influye directamente en la velocidad alcanzable de un microprocesador, pero no se puede ir aumentando indefinidamente, sino que existe un l&iacute;mite f&iacute;sico conocido. Ese l&iacute;mite viene impuesto por la propia tecnolog&iacute;a de fabricaci&oacute;n. Ya hemos dicho que la tecnolog&iacute;a de los Pentium cl&aacute;sicos, excepto los dos primeros, era de 0.35 micras, igual que los Pentium II a 233, 266 y 300 MHz. El l&iacute;mite de esta tecnolog&iacute;a parece que est&aacute; un poco por encima de los 300 MHz. Esta claro que un Pentium II a 300 MHz es lo mejor que Intel (o nadie) puede crear con esta tecnolog&iacute;a. Cuidado porque esta velocidad es para los dise&ntilde;os del Pentium de Intel. Otros fabricantes con otros dise&ntilde;os pueden conseguir mayores velocidades con la misma tecnolog&iacute;a, aunque el procesador no necesariamente ser&aacute; m&aacute;s r&aacute;pido por tener m&aacute;s MHz. Aunque eso es tema para otro extenso art&iacute;culo futuro.</P>
<P ALIGN="JUSTIFY">Afortunadamente (para Intel), por aquel tiempo la tecnolog&iacute;a de 0.25 micras estaba lista para empezar a trabajar sobre ella. As&iacute; que Intel prepar&oacute; su nueva factor&iacute;a de 0.25 micras y lanz&oacute; su Pentium II a 333 MHz, velocidad que fue aumentando progresivamente.</P>
<P ALIGN="JUSTIFY">Hemos dado el salto al Pentium II sin volver a mencionar nada sobre multiplicadores y velocidades de bus. Y la raz&oacute;n es que no hay nada que comentar, puesto que se segu&iacute;a utilizando el bus de 66 MHz y multiplicadores cada vez mayores, hasta de un x5.0 para el 333 MHz. La cosa empezaba a ser un poco excesiva, e Intel decidi&oacute; aumentar ligeramente la velocidad del bus. Ya hemos comentado que aumentar la velocidad del bus no es tan f&aacute;cil como hacerlo de la velocidad interna del micro. As&iacute;, Intel consigui&oacute; aumentar el bus hasta los 100 MHz, lo que logr&oacute; reducir en algunos puntos los multiplicadores y por tanto, la latencia de comunicaci&oacute;n con el resto del sistema, especialmente la memoria. Con el bus a 100 MHz los slots PCI, por el mismo tema de compatibilidad que comentabamos antes, no abandonaron sus 33 MHz y simplemente pasaron de trabajar cada dos ciclos de bus a hacerlo cada tres.</P>
<P ALIGN="JUSTIFY">Cuando se lleg&oacute; a estas alturas, Intel estaba ya bastante harta de tener que luchar contra los remarcadores de procesadores. Estas personas utilizaban el overclocking y el margen de error de Intel anteriormente comentados para vender procesadores como si fueran de velocidades superiores, simplemente metiendo una pegatina encima (donde Intel indica la velocidad a la que deben ser utilizados) o llegando incluso a extremos de sofisticaci&oacute;n increible con rebajados del serigrafiado y reimpresiones propias.</P>
<P ALIGN="JUSTIFY">La soluci&oacute;n adoptada por Intel a este problema fue bloquear el multiplicador del micro. C&oacute;mo lo hizo y otras cuestiones, vamos a intentar desvelarlas ahora.</P>
<H4>Relojes y multiplicadores: una descripci&oacute;n interna</H4>
<P ALIGN="JUSTIFY">C&oacute;mo todo, o casi todo el mundo sabe, para conseguir un reloj muy preciso a un precio aceptable se utiliza un cristal de cuarzo. Efectivo y barato. Ahora bien, ning&uacute;n dise&ntilde;ador de un microprocesador pondr&aacute; un enorme (comparativamente hablando) cristal de cuarzo en medio del nucleo de una CPU. Sin embargo, podemos crear un buen reloj con algo de lo que disponemos en abundancia en el microprocesador: transistores. Sin embargo, un reloj de transistores tiene algunos problemas, dos de ellos los hacen totalmente inviables para un micro. El primero es que son frecuentemente sensibles al calor, y como bastante gente debe saber, los procesadores se calientan bastante. La segunda raz&oacute;n, quiz&aacute;s m&aacute;s importante incluso, es que un oscilador de transistores tiene una frecuencia fija, no se puede variar sin variar el dise&ntilde;o y disposici&oacute;n de los transistores. Pero habiamos dicho que hasta que no fabricamos los micros no podemos saber a que velocidad lograran funcionar, por lo que definitivamente, no podemos poner un reloj de transistores.</P>
<P ALIGN="JUSTIFY">Vistos estos problemas la mejor soluci&oacute;n pasa por colocar el reloj fuera de la CPU, en la placa base. Eso permite poder incluir un buen reloj de cuarzo, muy fiables, precisos y no dependientes de la temperatura. Pero claro, tambi&eacute;n esta soluci&oacute;n tiene un problema, aunque en este caso con soluci&oacute;n. Con el reloj en la placa base dandonos la velocidad del bus, necesitamos que el procesador pueda funcionar m&aacute;s r&aacute;pido. Aqu&iacute; es donde aparecieron los multiplicadores. Aparece otro problema, esta vez ya m&aacute;s t&eacute;cnico, relacionado con la temperatura y la circuiteria interna del micro que recibe el reloj del bus. Para evitar estos problemas, la implementaci&oacute;n real de un multiplicador utiliza un circuito llamado 'phase-locked loop' (PLL), que consiste en un oscilador controlado por voltaje y un comparador de frecuencias.</P>
<P ALIGN="JUSTIFY">Bien, con la ayuda del PLL ya tenemos nuestro multiplicador funcionando con precisi&oacute;n matem&aacute;tica, y el reloj de cuarzo dando la se&ntilde;al del bus. Ahora bien, el multiplicador que se incluye puede funcionar con cualquier valor, no s&oacute;lo con el que quiera Intel. Entonces, &iquest;c&oacute;mo sabe el procesador que factor de multiplicaci&oacute;n ha de utilizar? Se le programa durante la inicializaci&oacute;n, y se lo ha de decir la placa. De ah&iacute; los jumpers y dem&aacute;s. Entonces, &iquest;c&oacute;mo controla que usemos s&oacute;lo una determinada configuraci&oacute;n? Pues poniendo un circuito que est&aacute; observando las entradas del micro durante la inicializaci&oacute;n, y si detecta un factor erroneo, no deja arrancar al microprocesador. De esta forma, s&oacute;lo hemos de a&ntilde;adir un peque&ntilde;o circuito muy simple al micro para bloquearle el multiplicador.</P>
<H4>Bloquear la velocidad de bus: &iquest;el siguiente paso?</H4>
<P ALIGN="JUSTIFY">A estas alturas del art&iacute;culo, deber&iacute;ais poder contestar a esta pregunta vosotros mismos. No parece ser f&aacute;ctible actualmente. La &uacute;nica manera de bloquer una sola velocidad de bus ser&iacute;a poner algo que genere esa velocidad (o un m&uacute;ltiplo conocido) en el micro, pero estamos otra vez al principio de la historia. Desde el punto de vista del microprocesador, no puedes controlar la velocidad a la que estas funcinando sin tener una frecuencia conocida de referencia; y no puedes tener esa frecuencia de referencia en el micro sin entrar en los problemas que hemos comentado anteriormente.</P>
<P ALIGN="JUSTIFY">Por supuesto, siempre se puede pedir la colaboraci&oacute;n a la placa base, que s&iacute; conoce la velocidad a la que est&aacute; ejecutando. En el caso de Intel, s&oacute;lo har&iacute;a falta un pin con dos se&ntilde;ales, para 66 o 100 MHz. Y resulta que eso mismo ya se ha probado, el pin es el SEL100/66#, y al principio las placas lo implementaban, pero ahora las placas de gama alta no hacen caso de la se&ntilde;al y por tanto no sirve para mucho. Como se puede ver, Intel lo ha intentado y ha fracasado. No debe ser tan f&aacute;cil.</P>
<H4>La soluci&oacute;n para los remarcados</H4>
<P ALIGN="JUSTIFY">Tras este inciso sobre multiplicadores y buses, retomamos nuestro repaso sobre los micros. Estabamos en el momento que Intel hab&iacute;a introducido el bus de 100 MHz y hab&iacute;a decidido bloquer los multiplicadores en sus chips para luchar contra el remarcado de procesadores. Como hemos dicho, actualmente no se bloquea la velocidad de bus, pero si el multiplicador. Entonces, &iquest;cual es el problema? &iquest;porque los remarcadores no cogen un Pentium II a 333 MHz con bus de 66 MHz y multiplicador de x5.0 y le ponen el bus a 100 MHz? Pues en ese caso pasar&iacute;a que el multiplicador x5, que est&aacute; bloqueado, har&iacute;a funcionar el micro a 500 MHz. Ya dijimos que Intel trabaja con un buen margen... &iexcl;pero no tanto!</P>
<H4>Y lleg&oacute; el Celeron</H4>
<P ALIGN="JUSTIFY">A estas alturas AMD estaba metiendo mucha presi&oacute;n contra Intel con su excelente K6, y la aparici&oacute;n del K6-2 fue realmente impactante para Intel. Semana a semana estaba perdiendo cuota del mercado de gama baja, dados los bajos precios y excelentes prestaciones de la familia K6. Para contraatacar, Intel lanz&oacute; el Celeron, un Pentium II sin cache de segundo nivel. Y claro, empez&oacute; sacando velocidades moderadas, como 300 MHz por ejemplo. Sin embargo, Intel ya estaba fabricando procesadores mucho m&aacute;s r&aacute;pidos, y hab&iacute;an conseguido un sistema de producci&oacute;n muy refinado. Vamos, que eran demasiado buenos, y los Celeron 300 MHz tenian un margen enorme. Su bus funcionaba a 66 MHz, y aunque se pusiera a 100 MHz, pasando a funcionar a 450 MHz, seguian corriendo perfectamente (con un buen refrigerador).</P>
<P ALIGN="JUSTIFY">&iquest;C&oacute;mo es posible que el Celeron a 300 MHz pueda hacerse funcionar a 450 MHz, y en cambio el Pentium II a 300 MHz no? La raz&oacute;n estriba precisamente en la falta de cache de segundo nivel del Celeron. La excelente calidad conseguida por Intel se limita a lo que fabriquen con tecnolog&iacute;a de 0.25 micras. Las caches que acompa&ntilde;an a los Pentium II se introducen a posteriori, y... &iquest;porque utilizar caches caras de 450 MHz si puedes poner una de 300 MHz y funciona perfectamente? As&iacute;, los Celeron 300 corren perfectamente a 450 MHz, pero no los PII a 300 MHz.</P>
<P ALIGN="JUSTIFY">Mientras tanto, el mercado hab&iacute;a recibido los primeros Celeron con humillaci&oacute;n para Intel, ya que eliminar completamente la cache de segundo nivel de un micro que se utiliza b&aacute;sicamente para aplicaciones ofim&aacute;ticas le resta un rendimiento considerable. Intel no esper&oacute; m&aacute;s, y incluy&oacute; una cache a su Celeron, pero lo hizo internamente en el microprocesador, con lo que es mucho m&aacute;s barato de fabricar y puede funcionar a la velocidad del micro. Aunque esto implica que se reduzca a la cuarta parte la cache, este dato no es tan importante, ya que s&oacute;lo 128 KB de cache hacen mucho papel.</P>
<P ALIGN="JUSTIFY">Pero por si alguien a&uacute;n no se ha fijado, repetimos: la cache del Celeron se fabrica internamente en el micro. O sea... con su pastilla de 0.25 y excelenta calidad conseguida por Intel. As&iacute; que el famoso Mendocino 300A (un Celeron 300 con cache interna) tambi&eacute;n pod&iacute;a correr a 450 MHz sin problemas y con cache. Con la ayuda de la cache, un Celeron 300 corriendo a 450 MHz pod&iacute;a equipararse perfectamente a un Pentium II a 450 MHz costando much&iacute;simo menos!</P>
<H4>Y llegamos al momento actual...</H4>
<P ALIGN="JUSTIFY">Ahora mismo Intel dispone de la familia Celeron con cache de 366, 400 y 433 MHz, con 66 MHz de bus. Genial, &iquest;no? Podemos pasar al bus a 100 MHz y tenemos 550, 600 y 650 MHz. Bueno, pues no. La velocidad f&iacute;sica m&aacute;xima para la tecnolog&iacute;a de 0.25 micras ronda los 500 MHz, o sea que no hay mucho m&aacute;s que hacer hasta que Intel no cambie a las 0.18 micras. De hecho, la historia se repite y la siguiente familia ya ha llegado a este l&iacute;mite: el Pentium III a 500 MHz. La raz&oacute;n por la que no salen a&uacute;n m&aacute;s Pentium III es esta. Hasta que Intel no ponga a punto su m&eacute;todo de fabricaci&oacute;n de 0.18 micras no se podr&aacute; continuar la fabricaci&oacute;n de Pentium III de mayores velocidades que 500 MHz.</P>
<P ALIGN="JUSTIFY">Con las 0.18 micras podremos empezar a pensar en subir el bus hasta los 133 MHz del chipset Camino, el pr&oacute;ximo de Intel. O los 200 MHz del bus EV6, propiedad de Alpha, del AMD K7. Con eso, los micros rondar&aacute;n r&aacute;pidamente los 700 MHz y para el pr&oacute;ximo a&ntilde;o llegaremos al tope probablemente de las 0.18 micras, que es algo superior al Gigahertz (GHz).</P>
<P ALIGN="JUSTIFY">&iquest;No es divertida la tecnolog&iacute;a?</P>

<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwmic.htm">
<FONT FACE="ARIAL"><B>[Microprocesadores]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>