<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font><FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>M</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>icroprocesadores</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@ctv.es">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
K6-3 y Pentium III, cara a cara
</H3>

<FONT FACE="Arial" SIZE=2>
<P ALIGN="JUSTIFY">Quien eche un vistazo atr&aacute;s en el tiempo, mirando a la competici&oacute;n entre AMD e Intel, ver&aacute; que AMD ha ido ganando terreno, sin prisa pero sin pausa, a Intel poco a poco. Es un poco extra&ntilde;o que una empresa con pocos recursos, comparativamente hablando, haya logrado lo que ha logrado. Toda la competencia que daba AMD a Intel antes del K5 se basaba en simplemente ofrecer lo mismo pero a menor precio, pero con un retraso considerable de tiempo. Para Intel, eso no eran m&aacute;s que picadas de mosquitos. Pero lleg&oacute; el K5, y el mosquito se convirti&oacute; en un abejorro bastante grande y ruidoso. El chip, aunque algo tarde, empez&oacute; a plantar cara directamente al Pentium, aunque sin excesivo exito. Sin embargo, ya estaba ah&iacute;.</P>
<P ALIGN="JUSTIFY">Cuando el K6 hizo su aparici&oacute;n, Intel no tuvo m&aacute;s remedio que bajar de su pedestal de infinita omnipotencia, la realidad estaba ah&iacute;, dandole golpes con un bate de beisbol. Una vez m&aacute;s se demuestra que las cosas bien hechas funcionan tarde o temprano. El K6 empez&oacute; a introducirse en pr&aacute;cticamente todas y cada una de las tiendas como opci&oacute;n econ&oacute;mica en las lineas de ordenadores de gama baja, e incluso media-baja.</P>
<P ALIGN="JUSTIFY">Entonces, mientras Intel a&uacute;n estaba aturdida, AMD contratac&oacute; contundentemente con un redise&ntilde;o completo de su linea de procesadores, el K6-2 con n&uacute;cleo CTX. El micro contaba con unas instrucciones espec&iacute;ficamente dise&ntilde;adas para acelerar aplicaciones multimedia, pero en este caso no eran como las MMX, que de poco servian, sino que eran realmente unas instrucciones muy potentes, basadas en arquitecturas vectoriales. Estas instrucciones, llamadas 3DNow! pusieron por primera vez en la historia a AMD por delante de Intel en el mercado, y tambi&eacute;n por primera vez los fabricantes de software dieron su apoyo pr&aacute;cticamente masivo a este nuevo set de instrucciones, que se ha convertido pr&aacute;cticamente en un est&aacute;ndar actualmente.</P>
<P ALIGN="JUSTIFY">Mientras tanto, Intel sacaba su Celeron original sin cache, provocando incluso verguenza ajena por tan p&eacute;sima elecci&oacute;n. M&aacute;s tarde tuvo que corregir el error incorporando cache al Celeron, con lo que se convirti&oacute; en un digno (pero no totalmente superior) competidor al K6-2.</P>
<P ALIGN="JUSTIFY">Y esto nos deja en la actualidad, AMD tiene ahora su K6-3 al que ha a&ntilde;adido una cache de segundo nivel en el propio chip de 256 KB corriendo a la velocidad del n&uacute;cleo, mientras que el Celeron tiene s&oacute;lo 128 KB, y el Pentium II tiene 512 KB pero corriendo s&oacute;lo a la mitad de la frecuencia del n&uacute;cleo. Adem&aacute;s, la cache de segundo nivel que acompa&ntilde;a a las placas Super7, sobre las que se montan los K6, pasa de esta manera a ser una cache de tercer nivel, a&ntilde;adiendo algunos puntos extra de rendimiento.</P>
<P ALIGN="JUSTIFY">Por su parte, Intel ha presentado recientemente el Pentium III, que dispone del mismo n&uacute;cleo b&aacute;sico y arquitectura de cache que el Pentium II. La novedad, y por primera vez es Intel quien imita a AMD, son unas instrucciones similares a 3DNow! con el mismo rendimiento, al menos sobre el papel. Y del papel de momento no ha pasado, puesto que al igual que AMD, Intel se encuentra con el problema que los programas han de soportar espec&iacute;ficamente SSE para aprovecharlo, con lo que ning&uacute;n software actualmente puede beneficiarse de un Pentium III, hasta que no empiecen a sacarse parches y dem&aacute;s. Las instrucciones reciben el nombre de SSE (de Streaming SIMD Extensions), y se trata, al igual que el 3DNow!, en unas instrucciones espec&iacute;ficas para operar sobre datos en coma flotante de manera expl&iacute;citamente paralela.</P>
<P ALIGN="JUSTIFY">Pongamos ahora cara a cara el K6-3 y el Pentium III. Empecemos por la tarea m&aacute;s simple, la ofim&aacute;tica.</P>
<P ALIGN="JUSTIFY">En aplicaciones ofim&aacute;ticas, como procesadores de texto, hojas de c&aacute;lculo y dem&aacute;s, todos los &quot;milagros&quot; tecnol&oacute;gicos de instrucciones paralelas, SSE, 3DNow! y dem&aacute;s de poco sirven. Aqu&iacute; se trata m&aacute;s que nada de simple arquitectura. Quitando extensiones especiales, y operaciones en coma flotante, hay algo que hace mejor un K6-3 frente a un Pentium III, el tener la cache de segundo nivel a la misma frecuencia que el micro. El K6-3, por tanto, sale vencedor en las pruebas Winstone99 para Windows 98, aunque por un escaso margen. Durante unas pruebas realizadas por Tom's Hardware (www.tomshardware.com), el K6-3 a 450 MHz venci&oacute; con 24.3 puntos frente a un Pentium III a 500 MHz, un Pentium II a 500 MHz o un Celeron acelerado a 500 MHz, ambos obteniendo 24 puntos. Aqu&iacute; se ve que realmente el Pentium III y el Pentium II son lo mismo con el a&ntilde;adido de las SSE, obtienen exactamente el mismo rendimiento.</P>
<P ALIGN="JUSTIFY">Pero pong&aacute;mosles una prueba realmente dif&iacute;cil. Renderizaci&oacute;n de escenas 3D, con el 3D Studio MAX. Este proceso requiere simplemente potencia bruta en coma flotante. Hay que tener en cuenta que 3D Studio MAX, por el momento, no soporta ni 3DNow! ni SSE, por lo que aqu&iacute; estamos midiendo simplemente la potencia de la unidad de coma flotante est&aacute;ndar. El resultado es el que cabr&iacute;a esperar si conocemos un poco la historia de AMD vs Intel. La asignatura pendiente de AMD siempre ha sido la coma flotante, y de hecho, lo sigue siendo. El K6-3 a 450 MHz, el m&aacute;s potente de los actuales procesadores de AMD, renderiza tan s&oacute;lo 30.5 im&aacute;genes por segundo, mientras que un Celeron a 400 MHz sin siquiera ning&uacute;n tipo de overclock, consigue 38.3 img/s, un rendimiento superior en un 25%. Un Pentium III (o II) a 450 MHz obtiene 42.9 img/s (un 40% m&aacute;s). Y el Pentium III m&aacute;s r&aacute;pido actualmente, la versi&oacute;n a 500 MHz, obtiene 48 img/s, casi un 60% por encima.</P>
<P ALIGN="JUSTIFY">Las conclusiones son claras, las expondr&eacute; s&oacute;lo a efectos de resumen. Dados los precios actuales, comprar un Pentium III es casi tirar el dinero. Un Pentium II es una opci&oacute;n no muy recomendable, puesto que el rendimiento de un Celeron a la misma velocidad es equivalente, y en cualquier caso el precio es much&iacute;simo menor, por lo que por el precio de un Pentium II a 450 MHz tenemos un Celeron a 466 MHz y a&uacute;n nos sobra dinero para a&ntilde;adir a otro componente del ordenador. La cuesti&oacute;n reside pues, en elegir un K6-3, un K6-2 o un Celeron. El K6-3 es la elecci&oacute;n id&oacute;nea si se quiere un procesador potente en las aplicaciones del d&iacute;a a d&iacute;a, o sea, software ofim&aacute;tico. M&aacute;s a&uacute;n si se dispone de una placa Super7 que soporte el K6-3, que lo son casi todas. El Celeron, en cambio, es la alternativa para aquellos usuarios que disfruten de juegos 3D y aplicaciones multimedia, ya que su mayor potencia en coma flotante permite mejor descompresi&oacute;n/compresi&oacute;n de audio y video, as&iacute; como de generaci&oacute;n de escenas 3D. Adem&aacute;s, no se queda en absoluto corto en aplicaciones ofim&aacute;ticas.</P>

<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwmic.htm">
<FONT FACE="ARIAL"><B>[Microprocesadores]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>