<HTML>
<BASE TARGET="TEXTO">
<BODY BGCOLOR="#FFFFFF">


<!-- INICIO DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->
<CENTER>
<TABLE BORDER=0 ALIGN="CENTER" WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="*" ALIGN="CENTER" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT COLOR="#009933" SIZE=7 FACE="ARIAL"><B>Z</B></font>
<FONT COLOR="#000000" SIZE=7 FACE="ARIAL"><B>ona Hardware</B></FONT>
</CENTER>
</TD>
</TR>
</TABLE></TD>
</TABLE>
</CENTER>

<BR>
<HR>		  
<!-- FINAL DE LAS SECCIONES 1 Y 2 DEL DOCUMENTO -->

<!-- INICIO DE LAS SECCION 3 DEL DOCUMENTO -->
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#009933" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE ALIGN="LEFT" BORDER=0 WIDTH="*" HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<FONT COLOR="#009933" SIZE=3 FACE="ARIAL"><B>Ú</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>ltimas noticias</B></FONT></A>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
<!-- FINAL DE LAS SECCION 3 DEL DOCUMENTO -->

<BR><BR>

<!-- SECCION PARA PONER EL CORREO ELECTRONICO -->
<IMG SRC="g_misc/69.gif" ALIGN=RIGHT>
<P ALIGN=RIGHT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL">
<B>A</B></FONT><FONT COLOR="#000000" SIZE=2 FACE="ARIAL"><B>rtículo realizado por<BR>
<A HREF="mailto:sargue@ctv.es">Sergio Baila "Sargue"</A>
</b></FONT>
<!-- FIN DE SECCION PARA PONER EL CORREO ELECTRONICO -->

<BR><BR>

<FONT size=2 color="#000000" face="Arial"><br><br><br>
<H3>
Marzo / Abril 1999
</H3>

<H4>Playstation 2</H4>
<P ALIGN="JUSTIFY">Pese a que no solemos hacernos eco del mundo de las consolas de videojuegos, Sony acaba de presentar unas especificaciones t&eacute;cnicas para su futura PlayStation 2 que mas de uno querr&iacute;amos para nuestras maquinas domesticas, al menos en ciertos aspectos. Esta maquina, aunque no lo pueda parecer, afectara much&iacute;simo al mundo del PC, ya que obligara a replantearse a algunas empresas como hacer las cosas bien.</P>
<P ALIGN="JUSTIFY">Bien, el primer dato que se nos pasa por la cabeza preguntar es el t&iacute;pico numero de pol&iacute;gonos por segundo que puede renderizar la criatura. Bien, la PSX2 parece que va a conseguir 75 millones de pol&iacute;gonos por segundo. No es un error, no son siete y medio. Son setenta y cinco. Para que os hag&aacute;is idea de lo que significa el numero pensad que la Voodoo2 supera por poco el mill&oacute;n.</P>
<P ALIGN="JUSTIFY">Entremos en materia. La PSX2 dispondr&aacute; de m&uacute;ltiples procesadores para sus tareas (principal, calculo num&eacute;rico, geometr&iacute;a, rasterizaci&oacute;n, sonido...) siendo el mas impresionante la CPU principal, que corre a 300 MHz con 64 KB de cache de primer nivel y un ancho de banda de memoria de 3.2 GB/seg.</P>
<P ALIGN="JUSTIFY">El coprocesador de coma flotante integrado dispone de dos partes principales: la unidad de coma flotante convencional y una unidad de vectores. Esta ultima es la responsable de obtener la incre&iacute;ble cifra de 6.2</P>
<P ALIGN="JUSTIFY">GFLOPS (miles de millones de operaciones en coma flotante por segundo), utilizando t&eacute;cnicas de supercomputaci&oacute;n vectorial, un tipo de supercomputaci&oacute;n que esta cayendo en desuso por sus elevados costes de implantaci&oacute;n y poca flexibilidad. Aunque claro, es la configuraci&oacute;n ideal para una maquina que se ha de programar de igual manera expresamente. Como dato comparativo, el Pentium III solo alcanza 2 GFLOPS en su versi&oacute;n equivalente.</P>
<P ALIGN="JUSTIFY">El chipset gr&aacute;fico funciona a 150 MHz, con un ancho de banda sobre la memoria de 32 MB de 48GB por segundo. El bus es de 2560 bits (no es un error, las cuatro cifras son correctas). Color de 24 bits, Alpha por hardware de 8 bits y 32 bits de Z-Buffer. El fill-rate es de nada mas y nada menos que 2400 MTexels por segundo. Recordemos que la Voodoo3 mas poderosa solo promete 366 MTexels/s</P>
<P ALIGN="JUSTIFY">Tambi&eacute;n se incorporara descompresi&oacute;n de video MPEG2, hasta 48 canales de audio de 48 KHz por hardware, sub-bus de comunicaciones de 32 bit, con soporte para IEEE1394 (FireWire), USB y PC-CARD.</P>
<P ALIGN="JUSTIFY">El dispositivo de entrada sera un DVD-ROM, compatible con CD-ROM l&oacute;gicamente.</P>
<P ALIGN="JUSTIFY">La tendremos el pr&oacute;ximo a&ntilde;o.</P>
<H4>Permedia3</H4>
<P ALIGN="JUSTIFY">3DLabs, tras un largo silencio, ha hecho publicas las especificaciones del esperado chipset Permedia3. La criatura de 128 bits, incorpora color de 32 bits y Z-buffer completo de 32 bits. Recordemos que la Voodoo3 ha sido fuertemente criticada por no soportar 32 bits de color, a lo que los ingenieros de 3Dfx respondieron con la inviabilidad tecnol&oacute;gica de implementar ese modo de color manteniendo unos ratios de jugabilidad &oacute;ptimos. Desde entonces hasta ahora tres han sido las casas que han anunciado, o sacado yo, tarjetas con soporte de 32 bits manteniendo una velocidad considerable: ATi con su Rage 128, S3 con su Savage4 y ahora 3DLabs con el Permedia3.</P>
<P ALIGN="JUSTIFY">La memoria, ampliable hasta 32 MB localmente, se beneficiara de una tecnolog&iacute;a desarrollada por 3DLabs, las texturas virtuales (Virtual Texture). Este sistema se basa en las mismas ideas sobre las que funciona la gesti&oacute;n de memoria de los sistemas operativos modernos, por paginaci&oacute;n. El Permedia3 pagina las texturas en paginas de 4 KB.</P>
<P ALIGN="JUSTIFY">3DLabs apuesta fuerte por el soporte software de su chipset con drivers tanto para NT4 como para Win95/98/2000 soportando hasta DirectX 6.1 y OpenGL ICD completo. Adem&aacute;s, est&aacute;n especialmente optimizados para la tecnolog&iacute;a 3DNow! de los microprocesadores de AMD.</P>
<H4>Seagate bate récord de densidad en disco duro</H4>
<P ALIGN="JUSTIFY">El r&eacute;cord de densidad de grabaci&oacute;n sobre una superficie magn&eacute;tica, en manos de IBM desde Diciembre de 1997 con 17 millones de bits por cm2, ha sido superado por Seagate con 25 millones de bits por cm2.</P>
<P ALIGN="JUSTIFY">Seagate ha conseguido el r&eacute;cord utilizando lo ultimo en tecnolog&iacute;a GMR (Giant Magneto-Resistive), combinado con una pel&iacute;cula magn&eacute;tica ultra fina, de bajo ruido, ultra lisa de una aleaci&oacute;n de cobalto, todo dise&ntilde;ado y construido por Seagate. El cabezal volaba, literalmente, a tan solo 15 nm (1 nm = 0.000001 mm).</P>
<P ALIGN="JUSTIFY">Esta tecnolog&iacute;a, aunque ya podr&iacute;a fabricarse, aun tardara dos a&ntilde;os en lanzarse al mercado. La raz&oacute;n alegada por Seagate es sencilla: las alt&iacute;simas velocidad de transferencia que se obtienen con este disco hacen que los chips controladores del disco aun no est&eacute;n disponibles. De hecho, en las pruebas realizadas los ingeniero de Seagate han tenido que reducir la velocidad de rotaci&oacute;n de los platos para poder mantenerse a la altura de las controladoras. Aun as&iacute;, han conseguido sacar 26.75 MB/s del disco.</P>
<P ALIGN="JUSTIFY">Con estas densidades se podr&iacute;an colocar nada mas y nada menos que 22.8 GB por cada plato (ambas caras) de un disco de 3.5&quot;. Con un t&iacute;pico disco de cinco platos, se conseguir&iacute;an mas de 110 GB en un solo disco.</P>
<P ALIGN="JUSTIFY">El efecto GMR se basa en la magnetoelectr&oacute;nica (o electr&oacute;nica de spin), que utiliza los spins (una propiedad cu&aacute;ntica de las part&iacute;culas) para guardar informaci&oacute;n.</P>

<BR><BR>


<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->
<P ALIGN="RIGHT"><FONT COLOR="#0080C0" SIZE=2 FACE="ARIAL">
<B>Ú</B></font><FONT COLOR="#000000" SIZE=1 FACE="ARIAL">LTIMA REVISIÓN EN</FONT> 
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>ABRIL</B></FONT>
<FONT COLOR="#000000" SIZE=1 FACE="ARIAL"> DE </FONT>
<FONT COLOR="#CC0000" SIZE=2 FACE="ARIAL"><B>1999</B></FONT>
<!-- SECCION PARA PONER LA FECHA DE ULTIMA REVISION -->

<BR><HR>


<!-- INICIO DEL RECUADRO DE ENLACES -->
<CENTER>
<TABLE CELLPADDING=2 WIDTH="100%">
<TD  WIDTH="50%" VALIGN="TOP" align="LEFT">
<TABLE BORDER=1 WIDTH="100%" HEIGHT="*" BGCOLOR="#CC0000" CELLSPACING=0 CELLPADDING=2>
<TD>
<TABLE BORDER=0 WIDTH="100%"  HEIGHT="*" BGCOLOR="#FDEDBD" CELLSPACING=0 CELLPADDING=2>
<TR>
<TD>
<CENTER>
<FONT SIZE=2>
<A HREF="zhw.htm">
<FONT FACE="ARIAL"><B>[Zona Hardware]</B></FONT>
</A>
<HR>
<A HREF="zhwnws.htm">
<FONT FACE="ARIAL"><B>[&Uacute;ltimas noticias]</B></FONT>
</A> 
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TABLE>
</TD>
</TABLE>
</CENTER>
<!-- FIN DEL RECUADRO DE ENLACES -->

<BR>
<HR>

<!-- COMIENZO DEL CIERRE DEL ARTICULO -->
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" >
<TR>
<TD>
<TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>
ZONA HARDWARE
</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="100%" BGCOLOR="#0080C0" >
<TR>
<TD BGCOLOR="#0080C0"><FONT COLOR="#0080C0">X</FONT></TD>
</TR>
</TABLE></CENTER>
<DIV ALIGN=right><TABLE BORDER=0 COLS=1 WIDTH="50%" BGCOLOR="#F1E08D" >
<TR>
<TD>
<CENTER>
<FONT FACE="Arial,Helvetica" COLOR="#000000">
<B>MACEDO<FONT COLOR="#CC0000">N</FONT>IA Magazine</B>
</FONT>
</CENTER>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</CENTER>
<!-- FINAL DEL CIERRE DEL ARTICULO -->

</BODY>
</HTML>