<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Capitulo1</title>
<meta name="Microsoft Border" content="none">
</head>

<body style="word-spacing: 0; margin: 0">

<div align="center">
  <center>

    <table border="0" cellpadding="0" cellspacing="0" width="100%">
      <tr>
        <td> 
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><b style="mso-bidi-font-weight:
normal">Autor: </b><a href="mailto:i1633850@petra.euitio.uniovi.es"><span style="mso-bidi-font-weight: normal"><b>Felipe 
            Olcina</b></span></a><b style="mso-bidi-font-weight:
normal"><a href="mailto:Frodrig99@yahoo.com"><o:p> </a> </o:p> </b> </font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="1"><b>Fecha: 
            18-10-2001</b></font></p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-size: 12.0pt; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><o:p></font></span></p>
          <p class="MsoNormal" align="center" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font size="4"><b><font face="Verdana">CAPÍTULO 
            1<br>
            NACIMIENTO DE LA VIDEOCONSOLA</font></b></font></p>
          <p class="MsoNormal" align="center" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p align="center"></p>
          <p align="center"></p>
          <p align="center"></p>
          <p><font size="2"><b><font face="Verdana">1.1 &iexcl;Un osciloscopio 
            que sirve para jugar!</font></b></font></p>
          <p><font face="Verdana" size="1">No sé si alguna vez hab&eacute;is estado 
            delante de uno de ellos en el laboratorio de electr&oacute;nica de 
            vuestro instituto o facultad, pero quién nos iba a decir en aquellos 
            momentos que ese aparato lleno de botones y roscas era el tatarabuelo 
            de nuestras flamantes videoconsolas de hoy en d&iacute;a. </font></p>
          <p><font face="Verdana" size="1">Vamos a hacer un poco de historia, 
            porque en 1975 un tal Nolam Bushnell estudiante de Utah (americano 
            tenia que ser...) tuvo una bendita visi&oacute;n, porque supo ver 
            en aquel instrumentajo llamado osciloscopio muchas más cosas de las 
            que nosotros vimos en las practicas de electr&oacute;nica de nuestro 
            instituto.<br>
            Donde el resto de los mortales sólo pudimos ver en el osciloscopio 
            aburridas longitudes de onda, nuestro querido amigo Bushnell descubri&oacute; 
            que aquellas longitudes de onda con un poco de imaginaci&oacute;n 
            (bueno, un mucho...) se convert&iacute;an en un par de palas de tenis 
            y en una pelota, y de esa manera surgi&oacute; al que conocemos como 
            el primer videojuego de la historia independiente de una computadora, 
            el PONG.</font></p>
          <p><font face="Verdana" size="1">Bueno, como lo prometido es deuda vamos 
            a comenzar a contar las verdades y los cotilleos que han rodeado al 
            mundo de las videoconsolas. Muchos de vosotros sabr&eacute;is que 
            el nacimiento del mundo de los ordenadores fue muy controvertido ya 
            que hubo m&uacute;ltiples demandas en juzgados para saber quién fue 
            realmente el inventor del primer ordenador con la estructura que conocemos 
            todos hoy en d&iacute;a. <br>
            Pues el mundo de las videoconsolas y por tanto de los videojuegos 
            no quiso ser menos y tambi&eacute;n hubo un montón de demandas y gran 
            controversia en este sentido. Aqu&iacute; vamos a comentar los hechos 
            y os dejo a vosotros sacar las conclusiones.</font></p>
          <p><font face="Verdana" size="1"><br>
            El motivo de la controversia surgi&oacute; de esta simple pregunta, 
            &iquest;Qui&eacute;n fue la primera persona que desarrollo el primer 
            videojuego de la historia?. El primer problema que se plantea es claro...&iquest;alguno 
            de vosotros se atreve a dar una definici&oacute;n de videojuego?....La 
            verdad es que yo no...y bueno, como mucho me atrever&iacute;a a decir 
            que un videojuego es software cuya principal finalidad es la de divertir 
            al usuario... Pues bueno, esta definici&oacute;n m&iacute;a que 
            reconozco que es un poco cutresalchichera meter&iacute;a en el saco 
            de los videojuegos por ejemplo, para los primeros cient&iacute;ficos 
            matem&aacute;ticos, a un mont&oacute;n de programas que se desarrollaron 
            para resolver enigmas l&oacute;gicos, crucigramas y dem&aacute;s &quot;divertimentos&quot; 
            basados en las matem&aacute;ticas. <br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen1.gif" width="202" height="175"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Pantalla del 
                  Videojuego Pong</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">El problema que surgi&oacute; fue el 
            siguiente: unos cuantos a&ntilde;os antes de que nuestro amigo Bushnell 
            hiciese de su osciloscopio una gameboy un tanto rudimentaria, hubo 
            un personaje llamado Rusell (sí, un cient&iacute;fico de los que les 
            gustan los enigmas l&oacute;gicos) que quiso demostrar a sus colegas 
            las m&uacute;ltiples capacidades de aquellos primeros ordenadores.</font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Rusell dise&ntilde;&oacute; un peque&ntilde;o 
            programa parecido al ya m&iacute;tico Space Invaders , y se lo ense&ntilde;o 
            a sus colegas entusiasmado, aunque obtuvo muy poco &eacute;xito entre 
            sus compa&ntilde;eros porque estos cient&iacute;ficos pensaron que 
            se dejase de tonter&iacute;as, porque aquellos ordenadores deb&iacute;an 
            de servir para otras cosas mas importantes que sólo jugar (ay lo 
            que se perdieron aquellos cient&iacute;ficos.).</font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Bueno pues todo esto ocurr&iacute;a 
            a finales de la d&eacute;cada de los 60 y la aparici&oacute;n del 
            PONG se produjo en los inicios de la d&eacute;cada de los 70, por 
            ello aunque en la mayor&iacute;a de los reportajes le&aacute;is que 
            Bushnell fue la primera persona que desarrollo un videojuego, sólo 
            ahora vosotros sabr&eacute;is que esto es una verdad a medias. </font></p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="196" align="right" height="140">
            <tr> 
              <td height="140"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen2.jpg" width="168" height="171"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2">
                <p align="right"><font face="Arial" size="1"><i>Videojuego Pong Arcade</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Lo que si esta claro, es que podemos 
            considerar a Bushnell como el primer fabricante de una videoconsola. 
            Aunque la videoconsola se basara en un osciloscopio y en circuiter&iacute;a 
            muy simple , es claro que fue el primer sistema electr&oacute;nico 
            independiente de un ordenador que servia exclusivamente para jugar 
            y adem&aacute;s realiz&oacute; para su videoconsola-osciloscopio el 
            juego mas adictivo de la historia jamás creado, el PONG.</font></p>
          <p><font face="Verdana" size="1"><br>
            Para aquéllos que todav&iacute;a no sepan de qué trataba el juego 
            PONG deciros que consist&iacute;a en un par de l&iacute;neas que hac&iacute;an 
            de palas de tenis y un cuadradito que hacia de pelota. La finalidad 
            del juego consist&iacute;a en colarle la bola al contrario, ¡as&iacute; 
            de simple! pero incre&iacute;blemente divertido. Uff cuántos juegos 
            de hoy en d&iacute;a quisieran ser la mitad de divertidos de lo que 
            fue éste en su &eacute;poca. </font></p>
          <p>&nbsp;</p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><span style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD">&nbsp;</span></font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><b><font face="Verdana" size="2">1.2 
            Atari aqu&iacute; empezó todo.....</font></b></p>
          <p><font face="Verdana" size="1">Nolan Bushnell nunca imagin&oacute; 
            el &eacute;xito que tendr&iacute;a su primer videojuego llamado PONG, 
            todo el mundo quer&iacute;a echarse una partida a este genial juego 
            que en sus or&iacute;genes solo existió en bares y salas recreativas. 
            Por ello Bushnell arropado por el enorme &eacute;xito decidi&oacute; 
            fundar su propia empresa a la que llamo Atari. </font></p>
          <p><font face="Verdana" size="1">De esta manera todo el mundo que tuviera 
            un televisor pod&iacute;a permitirse el lujazo de jugar en casa a 
            lo que estaba jugado en las salas recreativas con sus amigos. <br>
            </font></p>
          <p><font face="Verdana" size="1">Ni qué decir tiene que en aquellas 
            &eacute;pocas tener la videoconsola de Atari supon&iacute;a ser el 
            t&iacute;o mas envidiado de toda la clase y tener todo el d&iacute;a 
            ocupado el sal&oacute;n de tu casa por un enorme número de personas 
            que de pronto se convert&iacute;an en tus amigos, es decir, los por 
            todos conocidos gorrones.... (sí sí lo reconozco, yo fui uno de ellos).<br>
            </font></p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="91" align="left" height="171">
            <tr> 
              <td height="162"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen3.gif" width="158" height="146"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Logo de la compa&ntilde;ia 
                  Atari</i></font> 
              </td>
            </tr>
          </table>
          <p align="left"><font face="Verdana" size="1">Fue Atari la primera empresa 
            y la precursora del mundo de las videoconsolas tal y como las conocemos 
            hoy en d&iacute;a. El &eacute;xito de Atari fue tal que supuso la 
            creaci&oacute;n de un nuevo mercado desconocido hasta el momento, 
            comienza el mercado del ocio electr&oacute;nico que tantos miles de 
            millones mueve hoy en d&iacute;a.<br>
            </font></p>
          <p align="left"><font face="Verdana" size="1">Atari revolucionó el concepto 
            de ocio de la &eacute;poca, empezaron a salir los primeros videoconsoleros 
            de la historia de los cuales muchos siguen hoy en d&iacute;a enganchados 
            a este apasionante mundo de los videojuegos.</font></p>
          <p align="left"><font face="Verdana" size="1"> Cabe destacar que la 
            arquitectura b&aacute;sica que creó Atari de una videoconsola con 
            un par de mandos, con juegos en soportes independientes de la maquina 
            no ha cambiado en excesivo respecto a nuestras flamantes y nuevas 
            consolas de 128 bits.</font></p>
          <p align="left">&nbsp;</p>
          <p align="left"><font face="Verdana" size="1"> As&iacute; que la pr&oacute;xima 
            vez que ve&aacute;is en una foto el juego PONG o la ya vetusta Atari2600, 
            que sep&aacute;is que fue y ser&aacute; siempre la m&aacute;quina 
            mas revolucionaria de la historia de los videojuegos. El resto de 
            consolas hasta nuestros d&iacute;as no han hecho mas que aumentar 
            la potencia y capacidad de la primera máquina de Atari.<br>
            </font> </p>
          <p><font face="Verdana" size="1"><br>
            <b><font size="2">1.3 La Atari2600 vaya juegazos....</font></b></font></p>
          <p><font face="Verdana" size="1">La conocida Atari2600 naci&oacute; 
            en 1977, su nombre oficial era Video Computer System 2600 y tuvo una 
            larga y duradera vida. Adem&aacute;s deb&eacute;is saber que ésta 
            ha sido la videoconsola más plagiada del universo por culpa del enorme 
            &eacute;xito que tuvo la máquina original de Atari. </font></p>
          <p><font face="Verdana" size="1">Debido a esto, un mont&oacute;n de 
            compa&ntilde;&iacute;as japonesas de nombres impronunciables empezaron 
            a inundar el mercado con &quot;clones&quot; de la Atari2600. Tal fue 
            as&iacute; que existieron en el mercado muchas más ventas de videoconsolas 
            plagiadas que de máquinas originales de Atari.</font></p>
          <p><font face="Verdana" size="1">Como ya habr&eacute;is notado le tengo 
            un enorme cari&ntilde;o a esta videoconsola, no sólo por ser la primera 
            que sali&oacute; al gran mercado sino porque en ella se hicieron 
            los primeros juegos que sentaron las bases de la mayor&iacute;a de 
            los juegos a los que jugamos hoy en d&iacute;a. Quiz&aacute;s esto 
            os parezca un poco exagerado pero cuando empecemos a dar nombres de 
            videojuegos para esta consola, más de uno se sorprender&aacute; de 
            lo que esta m&aacute;quina fue capaz de hacer a pesar de sus enormes 
            limitaciones.</font></p>
          <p><font face="Verdana" size="1">Aunque no quiero llenar este reportaje 
            de las capacidades t&eacute;cnicas de cada videoconsola, creo que 
            la Atari sí merece que la especifiquemos de una manera detallada para 
            que ve&aacute;is de con qué poco fueron capaces los primeros programadores 
            de videojuegos de hacer autenticas maravillas jugables. <br>
            </font></p>
          <p><font face="Verdana" size="1">Ahí van los datos y no os asust&eacute;is 
            de estas &quot;enormes&quot; capacidades t&eacute;cnicas y recordar 
            que todav&iacute;a estábamos en el a&ntilde;o 1977. Adem&aacute;s tambi&eacute;n 
            veremos una foto con su modernista dise&ntilde;o y un acabado en madera 
            que sería la &quot;envidia&quot; de los mejores dise&ntilde;adores 
            del mundo....</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="362" align="center" height="111">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen4.jpg" width="396" height="242"><o:p></o:p> 
                  </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"><i></i> 
                <p align="right"><font face="Arial" size="1"><i>VideoConsola Atari 
                  2600</i></font> 
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Mirad qué pedazo de dise&ntilde;o, 
            si os fij&aacute;is bien en la foto pod&eacute;is ver en la parte 
            superior central d&oacute;nde iban insertados los cartuchos de la
          Atari2600. Adem&aacute;s si os fij&aacute;is tambi&eacute;n pod&eacute;is 
            ver que en la parte inferior derecha esta el logotipo de Atari que 
            ha permanecido intacto hasta nuestros d&iacute;as. </font></p>
          <p><font face="Verdana" size="1">Bueno, como pod&eacute;is </font> <font face="Verdana" size="1">observar 
            era toda una joya, adem&aacute;s era bastante grande y con un dise&ntilde;o 
            un tanto setentero digamos....bueno sí sí re&iacute;ros de ella todo 
            lo que quer&aacute;is, pero en aquellas &eacute;pocas más de uno matar&iacute;a 
            por tener una de ellas en su sal&oacute;n y ser la envidia del vecindario.<br>
            </font></p>
          <p><font face="Verdana" size="1">Aqu&iacute; van las &quot;enormes&quot; 
            capacidades t&eacute;cnicas de la videoconsola, agarraos a la silla: 
            </font> </p>
          <p><font face="Verdana" size="1"><u>Ficha t&eacute;cnica de la Atari 
            2600</u>:</font></p>
          <p><font face="Verdana" size="1">- Procesador 6507 a poco más de 1MHz.<br>
            - Memoria de 128 Bytes.<br>
            - Cartuchos de juegos con capacidad de 4 Kb.</font></p>
          <p></p>
          <p><font face="Verdana" size="1">Simplemente espectacular, para que 
            os hag&aacute;is una simple idea de lo que es esto, pod&eacute;is 
            hacer una comparaci&oacute;n de lo que son 4 Kb viendo la foto de 
            arriba de la propia Atari2600, que ocupa 8 veces más lo que pod&iacute;a 
            ocupar un juego entero para esta videoconsola. <br>
            </font></p>
          <p><font face="Verdana" size="1">Por eso los juegos para esta videoconsola 
            eran simplemente un prodigio de la programaci&oacute;n. Adem&aacute;s 
            las enormes restricciones de trabajo que impon&iacute;a el &quot;potente&quot; 
            hardware en cuanto a procesador y memoria solo hac&iacute;an que la 
            programaci&oacute;n fuera mas dif&iacute;cil todav&iacute;a.....usease 
            que aquellos programadores eran unos h&eacute;roes, porque en nuestro 
            mundo inform&aacute;tico actual 4 Kb son una autentica minucia......<br>
            </font></p>
          <p><font face="Verdana" size="1">Por todo esto espero que ve&aacute;is 
            a la Atari2600 como la mejor consola jamás creada porque nunca algo 
            tan limitado dio tanto juego y tan buenas horas a sus usuarios. &iexcl;&iexcl;Adem&aacute;s 
            esta consola tuvo una vida efectiva de casi 10 a&ntilde;os de presencia 
            en el mercado, a ver qué consola puede presumir de esto!!.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="227" align="left" height="111">
            <tr> 
              <td height="258"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen5.jpg" width="210" height="240"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Stand Atari 2600</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Bueno como an&eacute;cdota de la Atari2600, 
            deciros que durante el proceso de su dise&ntilde;o se le tuvo en gran 
            secreto para que nadie plagiara la idea a Atari antes de su lanzamiento. 
            Tal fue así que el proyecto antes de su salida al mercado tuvo como 
            nombre en clave secreto STELLA. <br>
            Dicho nombre se correspond&iacute;a con el prototipo del circuito 
            de Audio y Video dise&ntilde;ado en exclusiva para el montaje de esta 
            Videoconsola.</font></p>
          <p><font face="Verdana" size="1">El mundo del espionaje y de los tr&aacute;nsfugas 
            de una compa&ntilde;&iacute;a a otra tambi&eacute;n estar&aacute;n 
            muy presentes en la historia de las Videoconsolas como veremos a lo 
            largo de este reportaje.<br>
            </font></p>
          <p><font face="Verdana" size="1">Los primeros tr&aacute;nsfugas fueron 
            algunos componentes del personal de Atari, que fundaron una compa&ntilde;&iacute;a 
            independiente llamada ActiVision la cual obtuvo notable &eacute;xito 
            en posteriores a&ntilde;os y que tantos buenos juegos han desarrollado 
            para multitud de sistemas.</font></p>
          <p><font face="Verdana" size="1">Aqu&iacute; pod&eacute;is ver el kit 
            completo de la Atari2600 rodeada de un montonazo de buenos juegos, 
            un autentico tesoro.</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><b><font face="Verdana" size="2">1.4 El inicio de sagas m&iacute;ticas 
            de juegos. </font></b> </p>
          <p><font face="Verdana" size="1">Los jugadores de la Atari2600 pudieron 
            disfrutar de grandes juegos. Quién nos iba a decir a muchos de nosotros 
            que estábamos jugando a juegos que serían versionados 10 e incluso 
            20 a&ntilde;os despu&eacute;s para las principales videoconsolas y 
            ordenadores del mundo. Tal es as&iacute; que juegos como el m&iacute;tico 
            Space Invaders ha servido de inspiraci&oacute;n a cientos de juegos 
            de naves o tambi&eacute;n sagas como la de Pitfall ha sido versionada 
            en 3D hace pocos a&ntilde;os para los ordenadores y videoconsolas 
            actuales.</font></p>
          <p><font face="Verdana" size="1">Han sido muchos y muy buenos, pero 
            aqu&iacute; resumo los que mas famosos se han hecho y que muchas gentes 
            recordar&aacute;n o bien por haber jugado al original o por haber 
            jugado a alguna de sus versiones más recientes. </font></p>
          <p><font face="Verdana" size="1">En cualquier caso creo que es justo 
            saber de dónde provienen estos juegos y darles el reconocimiento que 
            se merecen. Así podremos entender mejor lo que ha supuesto la Atari2600 
            para la industria de los Videojuegos. </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="314" height="185" align="right">
            <tr> 
              <td height="294"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left">&nbsp;
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen6.gif" width="148" height="121"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen10.gif" width="148" height="121" align="bottom"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen8.gif" width="148" height="123"> 
                  <img border="0" src="Imagenes/Imagen7.gif" width="145" height="121"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> </o:p> 
                  </font></span> 
                </td>
            </tr>
            <tr> 
              <td height="26"> 
                <p align="right"><font face="Arial" size="1"><i> Pitfall, California
                Games, Pacman y Donkey Kong</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Éstos son sólo algunos del mont&oacute;n 
            de t&iacute;tulos que se vendieron como churros para este sistema 
            de entretenimiento: Pitfall, Space Invaders, Asteroids, Galaxian, Beam
          Raider,PacMan, Qbert, Frogger, Breackout, DonkeyKong, California Games, 
            Double Dragon... . </font></p>
          <p><font face="Verdana" size="1">Un </font><font face="Verdana" size="1">mont&oacute;n 
            de t&iacute;tulos que despu&eacute;s dar&iacute;an el salto a los 8,
          16 y 32 Bits, y nadie duda que pronto alguno de estos cl&aacute;sicos 
            saldr&aacute; remodelado en los 128 Bits.</font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Como ver</font><font face="Verdana" size="1">&eacute;is 
            son todos unos cl&aacute;sicos de cada genero, los gr&aacute;ficos 
            no eran grandiosos, es verdad, pero la jugabilidad era muy buena....que 
            conste que hab&iacute;a muchos, much&iacute;simos juegos, aunque la 
            verdad era que un 50 % de los juegos eran versiones de sí mismos cambiando 
            el nombre y alg&uacute;n que otro gr&aacute;fico.....como veis una 
            vez más el panorama de los videojuegos </font><font face="Verdana" size="1">no 
            ha cambiado mucho desde sus primeros d&iacute;as.....</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Como pod&eacute;is observar los jugadores 
            de aquella consola no se privaron de nada de nada, desde el f&uacute;tbol 
            al baloncesto pasando por el hockey o el tenis, de las primeras conversiones 
            de las pel&iacute;culas de cine mas taquilleras de la &eacute;poca 
            o de los ya cl&aacute;sicos PacMan o Space Invaders, osease la envidia 
            de cualquier videoconsolero.. </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="344" height="185" align="left">
            <tr> 
              <td height="310"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen13.gif" width="160" height="125"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen12.gif" width="143" height="127"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen14.gif" width="163" height="112"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen15.gif" width="148" height="112"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
                </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Bowling, Basketball, 
                  Football y Tennis</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Como pod&eacute;is observar los afortunados 
            poseedores de una Atari 2600 se divirtieron de lo lindo con los juegos 
            de deportes, el genero deportivo siempre estuvo muy buen surtido y 
            esto es sólo una peque&ntilde;a muestra de las decenas y decenas de 
            juegos de este género.<br>
            </font></p>
          <p><font face="Verdana" size="1">Los nombres que tienen como veis son 
            muy directos, todav&iacute;a no hacia falta sacar grandes estrellas 
            de cada deporte para anunciar los juegos....<br>
            Aqu&iacute; tenéis algunas muestras de lo que eran aquellos juegazos 
            deportivos.<br>
            </font></p>
          <p><font face="Verdana" size="1">La verdad es que hab&iacute;a que echarle 
            imaginaci&oacute;n para meterse de lleno dentro del juego y imaginarse 
            que esos palotes son Michel Jordan o la Kournikova....pero bueno que 
            sep&aacute;is que los piques que se formaban entre amigos jugando 
            a estos juegos eran antol&oacute;gicos...... </font></p>
          <p>&nbsp;</p>
          <p>&nbsp; </p>
          <p>&nbsp; </p>
          <p>&nbsp; </p>
          <p>&nbsp; </p>
          <p></p>
          <p><font face="Verdana" size="1">Tambi&eacute;n las conversiones de 
            las pel&iacute;culas que pegaban en el momento no ten&iacute;an desperdicio, 
            aqu&iacute; ten&eacute;is algunas muestras:</font></p>
          <p></p>
          <div align="left">
            <table border="1" cellpadding="3" cellspacing="0" width="344" height="185" align="right">
              <tr> 
                <td height="268"> 
                  <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen16.gif" width="164" height="117"><o:p> 
                    </o:p><img border="0" src="Imagenes/Imagen18.gif" width="160" height="117"><o:p> 
                    </o:p></font></span>
                  <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span>
                  <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                    </o:p><img border="0" src="Imagenes/Imagen19.gif" width="167" height="108"><o:p> 
                    </o:p><img border="0" src="Imagenes/Imagen20.gif" width="159" height="108"><o:p> 
                    </o:p><o:p> </o:p></font></span> 
                  <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                  <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                    <span lang="ES-TRAD"></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                    </o:p> </font></span> 
                </td>
              </tr>
              <tr> 
                <td height="2"> 
                  <p align="right"><font face="Arial" size="1"><i> E.T.,
                  Ghostbuster, 
                    Starwars y James Bond</i></font>
                </td>
              </tr>
            </table>
            <p>&nbsp;</p>
            <p> <font face="Verdana" size="1">&iquest;¿Os hab&eacute;is fijado 
              en el careto de ET?, pedazo de intro!!...y la estrella de la muerte 
              de Starwars qué gozada...por no hablar de James Bond...igualito 
              que la peli.......<br>
              Estos eran los comentarios que se o&iacute;an en el patio de mi 
              colegio y razones no nos faltaba si tenemos en cuenta que estos 
              juegos tienen casi 20 a&ntilde;os!!..... </font> </p>
          </div>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            </font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p><font face="Verdana" size="1">Por último vamos a ver algunas rarezas 
            que salieron para esta videoconsola.....preparaos porque no tienen 
            desperdicio:<br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="91" align="left" height="111">
            <tr> 
              <td height="222"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen22.gif" width="320" height="195"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Chuk Norris SuperKick</i></font>
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Mirad mirad atentamente esta
          pantalla....¿A quién se os parece el personaje??...Venga echadle un poco de imaginaci&oacute;n, 
            bueno vale un mucho......ese t&iacute;o de ahí es el mism&iacute;simo.....Chuck
          Norris!!....en pleno campo de combate. El juego como curiosidad se 
            llamaba Chuck Norris Supekicks...en fin con este titulo sobran
          comentarios.....Como 
            veis una vez más hay cosas que no cambian con el paso del tiempo..... 
            </font> </p>
          <p></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="91" align="right" height="111">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen23.gif" width="320" height="200"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Master of the 
                  Universe</i></font>
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Cómo no .....ni Heman pudo resistirse 
            a los encantos de la Atari2600....era la primera vez que nuestro superh&eacute;roe 
            ya era mucho mas que un mu&ntilde;eco de pl&aacute;stico, ahora pod&iacute;amos 
            manejarlo en la tele!!....rindamos un homenaje desde aqu&iacute; al 
            Master of the Universe....aunque se ti&ntilde;era el pelo de rubio.......!!! 
            </font> </p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="91" align="left" height="111">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen24.gif" width="320" height="210"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Rubick</i></font>
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Y esto con tantos colorines no es otra 
            cosa que el cubo de Rubick que supongo que todos conocer&eacute;is, 
            para los mas j&oacute;venes recordaros que era un cubo que tenia 6 
            caras de colores y que se le pod&iacute;a girar y girar sus caras 
            hasta quedarse mareado para poder resolverlo. Era realmente complicado 
            y en su versi&oacute;n consola todav&iacute;a m&aacute;s, lo cual 
            ya es un decir........como veis la Atari 2600 tambi&eacute;n tuvo 
            sus rarezas..... </font> </p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            </font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">La Atari 2600 fue un pozo sin fondo 
            de diversi&oacute;n, lo de arriba es solo una peque&ntilde;a muestra 
            de los cientos y cientos de juegos que salieron para este sistema....y 
            de los que deber&iacute;an de aprender muchos de los videojuegos de 
            hoy en d&iacute;a en el apartado referente a la jugabilidad.....Ahí 
            queda eso....... </font></p>
          <p><font face="Verdana" size="1">Pues hasta aqu&iacute; los primeros 
            pasos de las videoconsolas. Como veis hay que tener un gran cari&ntilde;o 
            y respeto a la Atari 2600 a la que tanto le debemos y que adem&aacute;s 
            es un directo descendiente de nuestras consolas actuales. <br>
            Espero que os haya gustado este cap&iacute;tulo ya que en la pr&oacute;xima 
            entrega veremos la llegada de las videoconsolas de 8 bits al mercado 
            y todo lo que ello supuso en la industria del videojuego. </font></p>
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->
                &lt;&lt; <a href="Capitulo0.htm">Anterior: Introducción</a><!-- #EndEditable -->
                </font></b></td>
              <td align="right" valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Siguiente" --><a href="Capitulo2.htm">Siguiente: <span class="ingles">Llega
                Nintendo</span></a> &gt;&gt;<!-- #EndEditable -->
                </font></b></td>
            </tr>
            <tr>
              <td valign="top" colspan="2" height="4"></td>
            </tr>
          </table>
          <p>&nbsp;</p>
          </td>
  </tr>
</table>

  </center>
</div>

</body>

</html>