<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Capitulo1</title>
<meta name="Microsoft Border" content="none">
</head>

<body style="word-spacing: 0; margin: 0">

<div align="center">
  <center>

    <table border="0" cellpadding="0" cellspacing="0" width="100%">
      <tr>
        <td> 
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><b style="mso-bidi-font-weight:
normal">Autor: </b><a href="mailto:i1633850@petra.euitio.uniovi.es"><span style="mso-bidi-font-weight: normal"><b>Felipe 
            Olcina</b></span></a><b style="mso-bidi-font-weight:
normal"><a href="mailto:Frodrig99@yahoo.com"><o:p> </a> </o:p> </b> </font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="1"><b>Fecha: 
            18-10-2001</b></font></p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p align="center"><font face="Verdana" size="4"><b>CAPITULO 5</b><br>
            32 BITS LA REVOLUCION</font></p>
          <p></p>
          <p><font face="Verdana" size="1"><b>5.1 Llega Sony y Playstation...s&aacute;lvese 
            quien pueda!!!</b></font></p>
          <p><font face="Verdana" size="1">De repente una de las empresas mas 
            importantes en el mundo de la electr&oacute;nica decide sacar al mercado 
            la videoconsola mas famosa de la historia y de la cual se han vendido 
            mas de 70 millones de unidades en todo el mundo, por supuesto estamos 
            hablando de Sony y de su inmortal playstation. <br>
            </font></p>
          <p><font face="Verdana" size="1">Antes de la llegada de la 32 bits de 
            Sony el mercado estaba copado por tres consolas: la Megadrive y la 
            SuperNintendo dando sus &uacute;ltimos coletazos y por otro lado ya 
            dentro de las consolas de nueva generaci&oacute;n, la Sega Saturn 
            que estaba empezando a dar sus primeros t&iacute;midos pasos en el 
            mercado.</font></p>
          <p><font face="Verdana" size="1">Como algunos ya sabr&eacute;is el origen 
            de la playstation fue muy curioso, puesto que es un proyecto nacido 
            de un fracaso. Un par de a&ntilde;os antes de la aparici&oacute;n 
            de la Playstation, Sony se hab&iacute;a comprometido con Nintendo 
            a desarrollar una unidad de CD para la consola SuperNintendo (algo 
            asi como el MegaCd de Megadrive), tras el rotundo fracaso de la unidad 
            de CD de la consola de Sega y por diversos motivos comerciales y econ&oacute;micos 
            Nintendo decide abandonar el proyecto y Sony se queda de un palmo 
            de narices con la unidad de CD ya plenamente desarrollada. <br>
            </font></p>
          <p><font face="Verdana" size="1">Tras la enorme inversi&oacute;n que 
            hab&iacute;a realizado Sony en la unidad de CD, la compa&ntilde;&iacute;a 
            decide dar un paso mas y dise&ntilde;ar su propio sistema de juego, 
            la leyenda dice que el &uacute;nico objetivo de Sony era hacer la 
            pu&ntilde;eta a Nintendo, pero fue un minucioso estudio de mercado 
            el que hizo a Sony introducirse de lleno en el mundo de las videoconsolas.</font></p>
          <p><font face="Verdana" size="1">Nunca Nintendo ni Sega se imaginaron 
            que una tercera compa&ntilde;&iacute;a pod&iacute;a hacerles la competencia 
            y mucho menos tener el &eacute;xito que tuvo la maquina de Sony. <br>
            Antiguos intentos de otras compa&ntilde;&iacute;as por enfrentarse 
            a los dos grandes hab&iacute;an acabado en rotundos fracasos con grandes 
            perdidas despu&eacute;s de hacer grandes gastos a la hora de crear 
            sus propios sistemas, algunos ejemplos los tenemos con compa&ntilde;&iacute;as 
            como la prestigiosa Atari (Atari jaguar), Nec (Turbo Grafx) o diversas 
            compa&ntilde;&iacute;as que apoyaron al sistema 3DO como Goldstar 
            o Panasonic, fueron testigos de lo duro que era introducirse en el 
            cerrado mercado de las videoconsolas.</font></p>
          <p></p>
          <p></p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            La playstation aterriza en Espa&ntilde;a a un precio no apto para 
            todos los bolsillos , su precio inicial rondaba las 80000 pesetas, 
            pero venia acompa&ntilde;ada de grandes juegos que marcaban la diferencia 
            con su competidora Saturn. </font></p>
          <p><font face="Verdana" size="1"><br>
            Algunas muestras de estos juegos son entre otros el estupendo Ridge 
            Racer, el juego de lucha Toshiden, WipeOut o el innovador Destruction 
            Derby. La evoluci&oacute;n que suponia el paso de los juegos del 2D 
            al 3D era incre&iacute;ble, eran unos juegos con los que los usuarios 
            de las 16 bits nunca hab&iacute;an ni llegado a so&ntilde;ar , nunca 
            nada parecido se hab&iacute;a visto antes en una videoconsola, por 
            ello se les paso a denominar videoconsolas de nueva generaci&oacute;n, 
            porque rompieron todos los conceptos de juego que se estaban desarrollando 
            para los ya vetustos 16 bits. <br>
            </font></p>
          <p><font face="Verdana" size="1">Hay que tener en cuenta que hasta esa 
            &eacute;poca, los juegos de plataformas en 2D supon&iacute;an un 70% 
            de las producciones de los 16 bits, ahora nuestros personajes cobraban 
            relieve y permit&iacute;an adentrarse en fantasticos mundos 3D y en 
            nuevos conceptos de diversi&oacute;n.</font></p>
          <p><font face="Verdana" size="1">Antes de la 32 Bits de Sony, estaba 
            en solitario en el mercado de las 32 bits la Saturn, la primera consola 
            de 32 Bits, pero la maquina de SEGA no le duro ni un par de asaltos 
            a la maquina de Sony por varios motivos. Entre ellos destacan algunos 
            como la desconfianza generada por la propia Sega a sus usuarios tras 
            los fracasos dell MegaCD y del Mega32X, por otra parte la Saturn fue 
            una consola a la que siempre se le achaco una dificultosa programaci&oacute;n, 
            las comparativas entre los mismos juegos para la maquina de Sega y 
            de Sony siempre resultaban a favor de la Playstation y por &uacute;ltimo 
            la llegada a la Play de una avalancha de innovadores y buenos juegos 
            supusieron la r&aacute;pida y silenciosa muerte de la maquina de SEGA, 
            simplemente la m&aacute;quina de Sony era mejor.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="412" height="185" align="center">
            <tr> 
              <td height="171"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen83.jpg" width="200" height="160"><img border="0" src="Imagenes/Imagen82.jpg" width="200" height="160"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Virtual On, y 
                  Dungeons &amp; Dragons</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Puff tras la muerte de la Saturn, la 
            Play se quedo en un lugar de privilegio, el mercado de las videoconsolas 
            estaba en pleno auge y las buenas ventas que tuvo, provocaron una 
            bajada espectacular de precio de la consola de Sony hasta situarse 
            en torno a las 30000 pesetas, lo que provoco de nuevo otro espectacular 
            tir&oacute;n de ventas. Las plays se vendian como rosquillas y la 
            llegada de juegos como Resident Evil o Gran Turismo vendian consolas 
            por si solos. </font></p>
          <p><font face="Verdana" size="1">Nintendo tenia que cambiar de estrategia 
            para combatir a Sony, para ello introdujo a su consola de nueva generaci&oacute;n 
            una tecnolog&iacute;a superior a todo lo existente. A pesar de que 
            ha mantenido el tipo en algunos aspectos respecto a la maquina de 
            Sony, ha estado por debajo a a&ntilde;os luz respecto de las ventas, 
            numero y variedad de juegos para su videoconsola. <br>
            </font></p>
          <p><font face="Verdana" size="1">Nintendo, sac&oacute; en su nuevo sistema 
            juegos tan revolucionarios como Mario 64 o Zelda, de una calidad indiscutible, 
            pero la Nintendo 64 aunque halla contado con una capacidad t&eacute;cnica 
            superior, nunca la ha podido desplegar debido al sistema de almacenamiento 
            que usaba.</font></p>
          <p><font face="Verdana" size="1">El cartucho ha sido el gran lastre 
            que ha tenido que soportar la maquina de Nintendo y ello ha provocado 
            que muchas compa&ntilde;&iacute;as desarrolladoras no hayan apostado 
            por este sistema desde su origen. Incluso la propia Nintendo en los 
            ultimos a&ntilde;os ha llegado a reconocer su error a la hora de escoger 
            el cartucho como formato de almacenamiento de sus juegos.</font></p>
          <p><font face="Verdana" size="1">Adem&aacute;s la compa&ntilde;&iacute;a 
            Nintendo siempre se ha orientado en excesivo hacia el publico infantil 
            y no ha sabido tener en cuenta que la edad de los videoconsoleros 
            ha aumentado considerablemente, por ello tambi&eacute;n es un motivo 
            por lo que muchos usuarios se hayan decantado por la maquina de Sony.<br>
            </font></p>
          <p><font face="Verdana" size="1">La Playstation ha sido la consola mejor 
            explotada del mercado , buena muestra de ello ha sido la evoluci&oacute;n 
            que han sufrido sus juegos, puesto que nada tienen que ver las primeras 
            producciones con los &uacute;ltimos juegos desarrollados para esta 
            videoconsola.</font></p>
          <p><font face="Verdana" size="1"><br>
            Sony se arriesgo mucho y triunf&oacute; como nunca se lo hubiera imaginado, 
            una gran consola que se acompa&ntilde;o de un mont&oacute;n de buenos 
            juegos, tal es asi que todav&iacute;a muchos usuarios de este sistema 
            est&aacute;n contentos con su videoconsola y se resisten a cambiarla 
            por otra, adem&aacute;s un alto porcentaje de los 20 millones de playstation 
            2 vendidas en el mundo son el resultado de muchos usuarios contentos 
            con su playstation original.</font></p>
          <p></p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            </font><font face="Verdana" size="1"><br>
            <b>5.2 Explosi&oacute;n del mundo de los videojuegos....</b></font></p>
          <p><font face="Verdana" size="1">La 32 Bits de Sony ha supuesto muchas 
            cosas dentro del mundo de los videojuegos, ha roto muchos t&oacute;picos 
            de las videoconsolas y ha supuesto una explosi&oacute;n de ventas.<br>
            El parque actual de consolas en Espa&ntilde;a es de mas de 2 millones 
            de videoconsolas y esto supone que en la mayoria de los hogares de 
            los espa&ntilde;oles, hay una videoconsola. </font></p>
          <p><font face="Verdana" size="1"><br>
            Esto significa que la videoconsola ha pasado a ser un electrodom&eacute;stico 
            m&aacute;s dentro de una casa, algo casi tan f&aacute;cil de encontrar 
            como un video o una cadena de musica. </font></p>
          <p><font face="Verdana" size="1">Tras el &eacute;xito de esta maquina, 
            el futuro no puede ser mas prometedor tal es as&iacute; que Microsoft 
            ha visto en las videoconsolas el futuro de parte de su negocio y aunque 
            Bill Gates puede que no sepa mucho de inform&aacute;tica, supongo 
            que nadie discutir&aacute; que de negocios sabe un rato grande.<br>
            </font></p>
          <p><font face="Verdana" size="1">El futuro de los videojuegos se centra 
            en estos aparatejos y tanto Sony, como Nintendo como Microsoft est&aacute;n 
            desarrollando unas consolas con una tecnolog&iacute;a espectacular, 
            acompa&ntilde;ada de grandes inversiones tanto en dise&ntilde;o como 
            en campa&ntilde;as publicitarias. (preparaos a ver anuncios de X-box 
            hasta que os salgan por las orejas....).<br>
            <br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="318" height="185" align="left">
            <tr> 
              <td height="130"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen84.gif" width="152" height="130"> 
                  <img border="0" src="Imagenes/Imagen85.jpg" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen86.gif" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><img border="0" src="Imagenes/Imagen87.gif" width="152" height="130"><o:p> 
                  </o:p><o:p> </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Cool Boarders, 
                  Gran Turismo, Ridge Racer Tyoe 4 y Tomb Raider</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Sony ha sabido estar en el momento 
            adecuado y en el lugar adecuado, ha hecho tambalearse a las dos grandes 
            compa&ntilde;&iacute;as mas importantes dentro del mundo de las videoconsolas, 
            como han sido </font><font face="Verdana" size="1">Nintendo y Sega</font></p>
          <p><font face="Verdana" size="1">Esta ultima no ha podido resistir el 
            tir&oacute;n y se ha retirado muy dignamente de la competici&oacute;n 
            pasando a ser una third party, en cambio Nintendo ha aguantado muy 
            dignamente a la PlayStation gracias en parte a la saga Pokemon y la 
            gameboy que les han reportado cuantiosos beneficios.</font></p>
          <p><font face="Verdana" size="1">El mundo de las videoconsolas ha evolucionado 
            mucho en estos &uacute;ltimos a&ntilde;os gracias en parte a las enormes 
            ventas de la gris de Sony, unos juegos mas adultos y unos usuarios 
            directos que llegan ya hasta los 30 a&ntilde;os (sin contar los usuarios 
            indirectos, si esos padres que le compran la consola al hijo para 
            despu&eacute;s jugar ellos......) hacen que sea un mercado en creciente 
            expansi&oacute;n y con un futuro muy prometedor.</font></p>
          <p><font face="Verdana" size="1">Tambi&eacute;n cabe resaltar que debido 
            al gran &eacute;xito que ha tenido el mundo de las videoconsolas y 
            de los videojuegos en general, han provocado como consecuencia directa 
            tratar a las videoconsolas y videojuegos como productos sat&aacute;nicos 
            que entontecen y alocan a la inocente juventud.<br>
            </font></p>
          <p><font face="Verdana" size="1">Los medios de comunicaci&oacute;n han 
            hecho un continuo acoso y derribo al mundo de los videojuegos en general 
            y de las videoconsolas en particular. <br>
            Hechos tan tristes como el asesino de Final Fantasy, o el incitamiento 
            del consumo de Drogas por Metal Gear son solo peque&ntilde;as muestras 
            de este ataque que se acrecenta en &eacute;pocas navide&ntilde;as, 
            tampoco hay que olvidarse la noticia que sali&oacute; en telediarios 
            y revistas cuando sali&oacute; en todos los telediarios del mundo 
            la supuesta compra de Irak de Playstation 2 para hacer sistemas de 
            guiado de misiles. </font></p>
          <p><font face="Verdana" size="1">En fin un monton de tristes tonter&iacute;as 
            que no hay que tener en cuenta aunque son dif&iacute;ciles de entender, 
            quiz&aacute;s es porque sea un mercado todav&iacute;a demasiado joven, 
            aunque creo que no se merece este trato por parte de la prensa, en 
            fin cuando llegue la &eacute;poca navide&ntilde;a o veraniega no nos 
            faltaran las im&aacute;genes en los telediarios de los juegos Mortal 
            Kombat o de Armagedom, unos cl&aacute;sicos de los telediarios sensacionalistas.</font></p>
          <p><font face="Verdana" size="1"><br>
            <b>5.3 La nueva generaci&oacute;n ha llegado....y la pirater&iacute;a 
            tambi&eacute;n.....</b></font></p>
          <p><font face="Verdana" size="1">Si bien nadie pone en duda que la Playstation 
            ha sido una de las consolas mejor dise&ntilde;adas de la historia 
            y que ha contado con grandes juegos que le han producido unas enormes 
            ventas, no es menos verdad que gran parte de estas ventas han sido 
            gracias a la intensiva pirater&iacute;a que asedia a esta consola. 
            <br>
            </font></p>
          <p><font face="Verdana" size="1">A pesar de que la consola de Sony cuenta 
            con un sistema antiproteccion de pirater&iacute;a , la llegada de 
            las grabadoras de CD y de la picaresca de muchos usuarios provocaron 
            el pirateo masivo de esta videoconsola.</font></p>
          <p><font face="Verdana" size="1">Muchos usuarios todav&iacute;a afirman 
            a d&iacute;a de hoy que la pirater&iacute;a favorece a Sony debido 
            a la gran cantidad de videoconsolas que vende, esto es una falsedad 
            enorme porque el gran negocio de las videoconsolas esta en los juegos 
            y los enormes royalties que tienen que pagar las compa&ntilde;&iacute;as 
            a Sony por cada juego que haya vendido para su consola.</font></p>
          <p><font face="Verdana" size="1">La maquina de Sony ha sido pirateada 
            hasta la saciedad, y a pesar de realizar una protecci&oacute;n primero 
            del hardware y despu&eacute;s del software, chips internos y externos 
            y parches aplicados a los juegos han sido suficientes para salt&aacute;rselos.<br>
            La pirater&iacute;a ha llevado a una bajada general de los juegos 
            de playstation pasando de las casi 10000 pesetas que val&iacute;an, 
            a las 6000 pesetas que cuestan hoy los estrenos.</font></p>
          <p><font face="Verdana" size="1">Este hecho pone tambi&eacute;n de manifiesto 
            que las compa&ntilde;&iacute;as desarrolladoras tambi&eacute;n pueden 
            y deben hacer un esfuerzo para evitar este mal y no abusar del monedero 
            del usuario.<br>
            Para que os hag&aacute;is una idea de la pirater&iacute;a que sufre 
            esta consola, en Barcelona han existido periodos de tiempo donde se 
            han vendido mas unidades de videoconsolas que de juegos y esto es 
            algo alucinante que parece dif&iacute;cil de creer, pero es cierto!!!. 
            </font></p>
          <p><font face="Verdana" size="1">La pirater&iacute;a es un mal mundial 
            que hace un enorme da&ntilde;o a las compa&ntilde;&iacute;as desarrolladoras 
            de videojuegos. Pero es que adem&aacute;s Espa&ntilde;a esta en las 
            posiciones de cabeza de rankings de grabadoras , siendo de los primeros 
            que encabezamos grabadoras de CD's por numero de habitantes.</font></p>
          <p><font face="Verdana" size="1">Ni quiero ni puedo dar moralinas respecto 
            al tema de la pirater&iacute;a, pero si debemos por lo menos tener 
            en cuenta que el da&ntilde;o que se le hace a la industria del videojuego 
            es enorme y que no estamos haciendo ning&uacute;n favor a Sony ni 
            a Sega y mucho menos a las compa&ntilde;&iacute;as desarrolladoras 
            al piratear un juego, por ello desde aqu&iacute; os animo a no piratear 
            y a las compa&ntilde;ias desarrolladoras a tener precios mas asequibles 
            al bolsillo delo usuario. <br>
            </font></p>
          <p><font face="Verdana" size="1">Sabemos que las compa&ntilde;&iacute;as 
            desarrolladoras pueden bajar sus precios, osease que si nosotros y 
            ellos aportamos nuestro granito de arena seguro que podemos resolver 
            el problema.</font></p>
          <p><font face="Verdana" size="1">En el proximo capitulo veremos los 
            lanzamientos mas recientes de las ultimas consolas aparecidas, adem&aacute;s 
            sacaremos la bola de cristal y predeciremos el futuro de lo que va 
            a pasar &iquest;Play2,GameCube o Xbox?, despues de haber analizado 
            a lo largo de todos estos capitulos el nacimiento y evolucion de las 
            videoconsolas estamos en disposicion de poder predecir lo que puede 
            pasar......pero todo esto sera en el capitulo que viene......<br>
            </font></p>
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->
                &lt;&lt; <a href="Capitulo4.htm">Anterior: La videoconsola, uno
                más en la familia</a><!-- #EndEditable -->
                </font></b></td>
              <td align="right" valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Siguiente" --><a href="Capitulo6.htm">Siguiente:
                128Bits, la incógnita</a> &gt;&gt;<!-- #EndEditable -->
                </font></b></td>
            </tr>
            <tr>
              <td valign="top" colspan="2" height="4"></td>
            </tr>
          </table>
          <p>&nbsp;</p>
          </td>
  </tr>
</table>

  </center>
</div>

</body>

</html>
