<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Capitulo1</title>
<meta name="Microsoft Border" content="none">
</head>

<body style="word-spacing: 0; margin: 0">

<div align="center">
  <center>

    <table border="0" cellpadding="0" cellspacing="0" width="100%">
      <tr>
        <td> 
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><b style="mso-bidi-font-weight:
normal">Autor: </b><a href="mailto:i1633850@petra.euitio.uniovi.es"><span style="mso-bidi-font-weight: normal"><b>Felipe 
            Olcina</b></span></a><b style="mso-bidi-font-weight:
normal"><a href="mailto:Frodrig99@yahoo.com"><o:p> </a> </o:p> </b> </font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="1"><b>Fecha: 
            18-10-2001</b></font></p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p align="center"><font face="Verdana" size="4"><b>CAPITULO 4</b><br>
            LA VIDEOCONSOLA. UNO MÁS EN LA FAMILIA</font></p>
          <p></p>
          <p><b><font face="Verdana" size="1">4.1 16 bits esto es una bomba!!</font></b></p>
          <p><font face="Verdana" size="1">Si bien no es comparable la evoluci&oacute;n 
            que supusieron las consolas de 8 bits respecto a sus antecesoras (Atari2600, 
            Colecovisi&oacute;n), no es menos cierto que las reci&eacute;n llegadas 
            consolas de 16 bits supusieron un gran salto cualitativo y cuantitativo. 
            </font></p>
          <p><font face="Verdana" size="1"><br>
            Cualitativo respecto a la evoluci&oacute;n de la calidad grafica y 
            sonora respecto a los 8 bits y cuantitativo respecto a la gran cantidad 
            de consolas que se vendieron en la &eacute;poca de los 16 bits que 
            llevaron a las videoconsolas a asentarse definitivamente en el mercado 
            del ocio electronico. Los juegos se o&iacute;an mejor, se ve&iacute;an 
            mejor y sobre todo eran infinitamente mas largos y divertidos que 
            sus antecesores de 8 bits.</font></p>
          <p><font face="Verdana" size="1">Los inicios de los 16 bits se remontan 
            a 1989, corr&iacute;an buenos tiempos para SEGA puesto que despu&eacute;s 
            de haberse arriesgado a lanzar su consola de 8 bits y de haber triunfado 
            en el mercado, se hab&iacute;a hecho un nombre muy respetado dentro 
            del ocio electr&oacute;nico. Tanto la NES como la Master System tuvieron 
            su trozo de pastel en el mercado y las dos dieron enormes beneficios 
            a sus respectivas compa&ntilde;&iacute;as.</font></p>
          <p><font face="Verdana" size="1">Pero Sega quer&iacute;a mas y se propuso 
            asestar un golpe mortal a Nintendo convirti&eacute;ndose en el primer 
            fabricante de una videoconsola de 16 Bits. Y as&iacute; fue, puesto 
            que en 1989 saca al mercado la archiconocida Megadrive que fue llamada 
            Genesis por tierras Niponas y Americanas. </font></p>
          <p><font face="Verdana" size="1">La Megadrive era un sistema de 16 Bits 
            que proporcionaban unos gr&aacute;ficos muy superiores a los 8 bits, 
            las sagas que se iniciaron en los 8 bits se reforzaron en su aparici&oacute;n 
            en los 16 bits con mas fases, mejores graficos y sobre todo una mejor 
            jugabilidad.<br>
            </font></p>
          <p><font face="Verdana" size="1">Nintendo no quiso ser menos y un a&ntilde;o 
            despu&eacute;s saca al mercado la Super Nintendo o Super FamiCom como 
            fue llamada en Jap&oacute;n, fueron ambos unos sistemas muy parejos 
            que compartieron un mont&oacute;n de juegos, las conversiones entre 
            ambas plataformas estuvieron siempre a la hora del d&iacute;a, pero 
            eran los juegos exclusivos de cada plataforma los que hac&iacute;an 
            decantarse a los usuarios por una videoconsola o por la otra. <br>
            </font></p>
          <p><font face="Verdana" size="1">En cuanto a ventas tambien estuvieron 
            muy parejas, puesto que aunque en Europa y en Japon triunf&oacute; 
            algo m&aacute;s la consola de SEGA, en America la SuperNintendo tuvo 
            un monton de ventas, lo cual provoco un empate t&eacute;cnico en cuanto 
            a ventas mundiales entre la plataforma de 16 bits de Sega y de Nintendo.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="center" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen58.gif" width="509" height="193"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Personajes Carismaticos 
                  de la factoria Nintendo: PIKACHU &amp; MARIO &amp; LINX &amp; 
                  DONKEY KONG</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Adem&aacute;s las 16 bits fueron las 
            primeras consolas donde se comenz&oacute; a experimentar con los primeros 
            juegos en 3D dentro del mundo de las videoconsolas, fueron muy pocos 
            los juegos que salieron en tres dimensiones y en algunos casos se 
            requirieron cartuchos especiales acompa&ntilde;ados de chips de proceso 
            especifico, ya que las videoconsolas no estaban preparadas para tal 
            prop&oacute;sito y no contaban con la suficiente potencia que requeria 
            la programacion en 3D. <br>
            </font></p>
          <p><font face="Verdana" size="1">Pero aunque no fueron muchos ni muy 
            buenos, sentaron las bases de muchosde los juegos 3D mas importantes 
            que conocemos hoy en d&iacute;a, en cualquier caso es justo reconocer 
            que la evoluci&oacute;n de los 3D se debieron a los juegos de ordenador, 
            a los cuales no dudarian apuntarse las videoconsolas de 32 bits que 
            llegarian unos a&ntilde;os despues.</font></p>
          <p><font face="Verdana" size="1">La lucha entre Nintendo y Sega estaba 
            mas encarnizada que nunca, la Megadrive contaba con una a&ntilde;o 
            de experiencia mas que su competidora (y eso es mucho en el mundo 
            de las videoconsolas) y la SuperNintendo ten&iacute;a a su favor una 
            ligera superioridad t&eacute;cnica que le permit&iacute;a hacer cosas 
            que la Megadrive nunca pudo (como el famoso efecto Modo 7 de la SuperNes 
            que consist&iacute;a en una simulaci&oacute;n de 3D mediante giros 
            y rotaciones en 2D que resultaba muy vistoso). </font></p>
          <p><font face="Verdana" size="1"><br>
            Pero la Megadrive aun siendo t&eacute;cnicamente inferior supo responder 
            con unos juegos mas adultos y con unas conversiones maravillosas de 
            las recreativas mas de moda que siempre han gustado tanto a los videoconsoleros.</font></p>
          <p><font face="Verdana" size="1">Cada vez eran mas los hogares que contaban 
            con una videoconsola, adem&aacute;s los bajos precios de las consolas 
            supusieron un boom de ventas que nunca antes se hab&iacute;a producido, 
            sin embargo los precios de los cartuchos segu&iacute;an siendo demasiado 
            elevados, para que os hagais una idea, un par de juegos val&iacute;an 
            lo mismo que la videoconsola. </font></p>
          <p><font face="Verdana" size="1"><br>
            El cartucho supon&iacute;a muchas ventajas como una carga inmediata 
            y la imposibilidad de pirateria, pero tambi&eacute;n supon&iacute;an 
            unos elevados costes de producci&oacute;n que repercutian en algunos 
            casos de manera abusiva en el bolsillo de los sufridos usuarios.</font></p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            <br>
            </font></p>
          <p><font face="Verdana" size="1"><b>4.2 SuperNintendo vs Megadrive....duelo 
            de titanes!!</b></font></p>
          <p><font face="Verdana" size="1">Si la lucha en los 8 bits entre usuario 
            de NES y de Master System ya era fuerte, la llegada de los 16 Bits 
            y con ello la venta masiva de consolas provoc&oacute; que la lucha 
            se elevase a la en&eacute;sima potencia. </font></p>
          <p><font face="Verdana" size="1">Comenzaron a salir las primeras revistas 
            dedicadas en exclusiva a las videoconsolas, entre ellas las conocidas 
            Hobbyconsolas y Superjuegos, las dos revistas mas veteranas del mercado 
            nacional en videoconsolas. </font></p>
          <p><font face="Verdana" size="1"><br>
            Salieron cientos y cientos de juegos para ambas consolas, podemos 
            decir que un 75 % de juegos eran comunes para ambas plataformas y 
            que casi siempre las versiones de SuperNintendo eran algo superiores 
            debido a la mayor paleta de colores con la que contaba la maquina 
            de Nintendo.</font></p>
          <p><font face="Verdana" size="1">Quiz&aacute;s sea esta la &eacute;poca 
            en la que el software estuvo mas diversificado, pero pronto las dos 
            compa&ntilde;&iacute;as desarrolladoras de Hardware se dieron cuenta 
            de que eran los juegos en exclusiva los que marcaban la diferencia 
            entre una y otra videoconsola. A partir de este momento los contratos 
            en exclusiva de los juegos para cada videoconsola ha sido una marca 
            de distinci&oacute;n que da una muestra de calidad a una videoconsola.</font></p>
          <p><font face="Verdana" size="1"><br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="344" height="185" align="left">
            <tr> 
              <td height="251"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen61.gif" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen62.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen63.gif" width="152" height="130"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen64.gif" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> After Burner, 
                  Beavis &amp; Butthead, California Games y</i></font><i><font face="Arial" size="1"> 
                  GoldenAxe</font></i>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">La plataforma de 16 Bits de Sega, tuvo 
            unos inicios mas frios que los de su competidora, pero con el paso 
            de los a&ntilde;os y como si se tratase de un buen vino, los juegos 
            de Megadrive fueron evolucionando hasta limites inh&oacute;spitos, 
            podemos decir sin temor a equivocarnos que su chip el Motorola 68000 
            ha sido uno de los chips gr&aacute;ficos m&aacute;s y mejor explotados 
            por las compa&ntilde;ias desarrolladoras de Software, tal fue as&iacute; 
            que los &uacute;ltimos juegos de la MegaDrive estaban a&ntilde;os 
            luz de las primeras producciones para la maquina de Sega. <br>
            </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">En cambio Nintendo gracias a su poder 
            tecnol&oacute;gico siempre estuvo a buena altura, aunque no se not&oacute; 
            tanto las diferencia entre las primeras y las &uacute;ltimas producciones 
            de la manera que lo hizo la MegaDrive, a pesar de ello alguno de los 
            &uacute;ltimos juegos de Nintendo como el Donkey Kong Country ten&iacute;an 
            una calidad asombrosa que hacian temblar la barrera de los 16 bits.</font></p>
          <p><font face="Verdana" size="1">La cosa estaba muy calentita, la Megadrive 
            quiso dar una vuelta de tuerca mas y comenz&oacute; a sacar perif&eacute;ricos 
            para su videoconsola que le permit&iacute;an ponerse por encima de 
            su competidora, el MegaCD introdujo por primera vez en el mundo de 
            las videoconsolas el disco compacto, con el consecuente aumento de 
            capacidad de memoria, que siempre tuvo tan limitado el cartucho debido 
            a su elevado coste. <br>
            </font></p>
          <p><font face="Verdana" size="1">En los tiempos de los cartuchos, las 
            presentaciones de los juegos eran bastante sosas puesto que introducir 
            una foto o voces digitalizadas supon&iacute;an agotar en un pis-pas 
            la capacidad de la memoria de los cartuchos. <br>
            </font></p>
          <p><font face="Verdana" size="1">Aun as&iacute; los cartuchos que en 
            su mayor&iacute;a comenzaron siendo de 4 Megas, despu&eacute;s pasaron 
            a ser de 8, 16 y hasta 32 Megas lo cual provoc&oacute; unos costes 
            desorbitados con juegos por encima de las 10000 pesetas!! .<br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="206" height="185" align="right">
            <tr> 
              <td height="273"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen59.gif" width="200" height="142"> 
                  <img border="0" src="Imagenes/Imagen60.gif" width="200" height="121"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Mega CD &amp; 
                  Mega 32X</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">El MegaCd (aparato que se acoplaba 
            a la megadrive) acabo con todo esto y se pas&oacute; de tener 8 o 
            16 Megas a tener 650!! era una evoluci&oacute;n incre&iacute;ble , 
            pero esta evoluci&oacute;n no se tradujo en buenos juegos, sino que 
            se tradujo en enormes bodrios de juegos basado en formato video que 
            llamaban mucho la atenci&oacute;n en un primer momento pero de una 
            incre&iacute;ble soseria jugable, un 75% de los juegos que salieron 
            en formato MegaCD eran juegos basados en im&aacute;genes reales de 
            video......se vendieron unas cuantas unidades del hardware de Mega 
            CD pero su elevado precio y sus pocas prestaciones no dejaron ni por 
            asomo contentos a sus usuarios. </font></p>
          <p><font face="Verdana" size="1"><br>
            Aqu&iacute; en la foto teneis la version americana del MegaCD, en 
            Europa fue bastante mas peque&ntilde;o y con un dise&ntilde;o algo 
            mas estilizado (se acoplaba perfectamentea la MegaDriveII, que era 
            de un tama&ntilde;o mucho menor a la Megadrive original aunque de 
            id&eacute;nticas capacidades t&eacute;cnicas):<br>
            </font></p>
          <p><font face="Verdana" size="1">Pero Sega no se quiso quedar hay, la 
            ya vieja megadrive se resist&iacute;a a morir y quiso pasar a multiplicar 
            su potencia con un aparato llamado Mega32X que se le pon&iacute;a 
            encima y que supuestamente multiplicaba la potencia de la consola 
            por dos... .</font></p>
          <p><font face="Verdana" size="1">En fin eso era lo que pon&iacute;a 
            la caja porque su desorbitado precio y la decenita de juegos que solo 
            salieron para este formato supusieron el cabreo definitivo de los 
            usuarios de SEGA, en fin, podemos considerar la MegaDrive como el 
            &quot;Maradona del f&uacute;tbol&quot;, con unos grandes comienzos, 
            con un exitazo tremendo pero que cuando tuvo que retirarse empez&oacute; 
            a doparse con extra&ntilde;os aparatejos que le llevaron a una triste 
            despedida. <br>
            </font></p>
          <p><font face="Verdana" size="1">En fin aun as&iacute; que se sepa que 
            la Megadrive ha vendido mucho y que los usuarios de Sega han disfrutado 
            de lo lindo con esta consola. </font><font face="Verdana" size="1">&iexcl;Arghhhh 
            que miedo! la foto del Mega32X.....el mayor fiasco de SEGA.<br>
            </font></p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="344" height="185" align="left">
            <tr> 
              <td height="310"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen65.jpg" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen66.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen67.jpg" width="152" height="130"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen68.jpg" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Super Contra, 
                  Cool World, Final Fantasy II y Indiana Jones</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">La SuperNintendo y la Megadrive supusieron 
            la implantaci&oacute;n definitiva de las videoconsolas, despu&eacute;s 
            llegaron las 32 Bits pero quien realmente abrieron el camino de la 
            masificaci&oacute;n en cuanto a ventas y realizaci&oacute;n de juegos 
            para el mundo de las videoconsolas fueron este par de excelentes maquinas 
            de 16 Bits. </font></p>
          <p>&nbsp; </p>
          <p></p>
          <p><font face="Verdana" size="1">SuperNintendo comenz&oacute; su andadura 
            con aut&eacute;nticos bombazos como Super Mario, Super Tennis, Super 
            Contra, la saga Castelvania......vamos que Nintendo siempre apost&oacute; 
            muy fuerte por su plataforma desde el principio y los usuarios lo 
            tuvieron muy en cuenta. Adem&aacute;s esta consola debido a su superioridad 
            t&eacute;cnica pod&iacute;a realizar efectos de escalado y rotaci&oacute;n 
            basados en el famoso Modo 7 que simulaban unos falsos efectos 3D sobre 
            gr&aacute;ficos 2D , y con muy buenos resultados como lo demuestran 
            los magnificos juegos Super Mario Kart o el aclamado F-Zero.<br>
            <br>
            </font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="296" height="185" align="right">
            <tr> 
              <td height="292"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen69.jpg" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen70.jpg" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen71.gif" width="310" height="152"></font></span> 
                  <span lang="ES-TRAD"></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Stunt FX, Starfox 
                  y Virtua Racing</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Estos son algunos de los Juegos que 
            usaron Chips Especiales para poder realizar 3-D.</font></p>
          <p><font face="Verdana" size="1">El chip que desarrollo Nintendo para 
            incluir en sus cartuchos 3D, se llamaba Chip FX, su aparicion fue 
            toda una revoluci&oacute;n puesto que origin&oacute; la aparici&oacute;n 
            de los primeros juegos 3D en una videoconsola.</font></p>
          <p><font face="Verdana" size="1">El juego Virtua Racing ven&iacute;a 
            en un aparatoso cartucho dos veces mas grande que uno normal, e inclu&iacute;a 
            dentro del propio cartucho un chip llamado SVP de una velocidad de 
            23 Mhz y una capacidad para mover aproximadamente unos 400 poligonos 
            por segundo!!...con 400 poligonos poca cosa se podia hacer, pero aun 
            asi quedo un juego bastante resulton para la epoca no creeis?.......</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Algunos de los juegos de Mega 32X (Arghh 
            eran bastante mediocres y muy caros!!):<br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="325" height="185" align="center">
            <tr> 
              <td height="141"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen72.gif" width="151" height="123"> 
                  </font></span> <font face="Verdana" size="1"> </font><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen73.gif" width="151" height="123"><o:p> 
                  </o:p><o:p> </o:p><o:p> </o:p> </font></span> 
                </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Virtua Fighter 
                  y Doom 32X</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1"><b>4.3 Aparecen las videoconsolas port&aacute;tiles.... 
            </b></font> </p>
          <p><font face="Verdana" size="1">Al mismo tiempo que aparec&iacute;a 
            la Megadrive, la compa&ntilde;&iacute;a Nintendo estaba en pleno desarrollo 
            de su 16 Bits, para no quedarse atr&aacute;s en la carrera de las 
            videoconsolas decidi&oacute; sacar al mercado una de las consolas 
            mas revolucionarias de la &eacute;poca. <br>
            </font></p>
          <p><font face="Verdana" size="1">Por supuesto estamos hablando de la 
            GameBoy la consola mas veterana jam&aacute;s creada, desde sus inicios 
            hasta d&iacute;a de hoy con la inminente aparici&oacute;n de la GameBoy 
            Advanced, ha sido la consola mas vendida del mundo y esto no ha ocurrido 
            por casualidad.<br>
            </font></p>
          <p><font face="Verdana" size="1">Han sido varios los motivos que la 
            han distanciado con mucho de las dem&aacute;s, entre ellas destacamos: 
            la enorme cantidad de juegos, su excelente portabilidad, la duraci&oacute;n 
            de su bater&iacute;a, su reducido precio y la enorme calidad de muchos 
            de sus juegos.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="323" height="185" align="left">
            <tr> 
              <td height="291"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen74.gif" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen76.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen77.gif" width="152" height="130"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen78.gif" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Axtreis,Megaman, 
                  Super Mario Land y WF supestars</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Nintendo se las arregl&oacute; para 
            meter en una peque&ntilde;a carcasa un Z80 a 4,19 Mhz, con 8 Kb de 
            memoria Ram y otros 8 de Vram, algo impresionante teniendo en cuenta 
            que la aparatosa NES era una consola de similares prestaciones. <br>
            </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Los grandes &eacute;xitos de la NES 
            pasaron r&aacute;pidamente a la GameBoy, todo el mundo quer&iacute;a 
            una. </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">La port&aacute;til de </font><font face="Verdana" size="1">8 
            bits tenia una resoluci&oacute;n de 160x144 pixels en una pantalla 
            que permit&iacute;a mostrar hasta 4 distintas tonalidades de grises 
            y a pesar de todo esto, los gr&aacute;ficos se ve&iacute;an muy bien 
            teniendo en cuenta el reducido tama&ntilde;o de la pantalla.</font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">A la port&aacute;til de Nintendo le 
            salieron rivales de una calidad netamente superior, como la recordada 
            con cari&ntilde;o Lynx que cont&oacute; con pocos juegos pero de una 
            calidad espectacular y adem&aacute;s con pantalla en color!!, aunque 
            su gran precio, su aparatoso tama&ntilde;o y el poco apoyo que le 
            dio Atari a su port&aacute;til, produjeron que la Lynx fuera una videoconsola 
            de lujo solo para los monederos mas pudientes, su paso por el mercado 
            fue muy fugaz pero aun asi nadie duda que la Lynx ha sido una de las 
            videoconsolas port&aacute;tiles mejor dise&ntilde;adas de la historia.</font></p>
          <p><font face="Verdana" size="1">La lucha entre Nintendo y Sega estaba 
            en el punto mas &aacute;lgido , con la SuperNintendo a punto de salir, 
            y la Mega Drive dando sus primeros pasos SEGA no se pod&iacute;a quedar 
            atr&aacute;s y tambi&eacute;n sac&oacute; al mercado su videoconsola 
            port&aacute;til, de una calidad muy superior a la GameBoy y a un precio 
            algo mayor aunque aceptable, su nombre era GameGear.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="323" height="185" align="right">
            <tr> 
              <td height="308"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen75.gif" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen79.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen80.png" width="152" height="130"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen81.png" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Axtreis, Pokemon 
                  y F-Zero Advanced</i></font> 
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Sus principales bazas eran una pantalla 
            a color, un sintonizador opcional de Televisi&oacute;n y todos los 
            juegos de Master System a su disposici&oacute;n, sus bazas en contra 
            eran muy claras, su grandioso tama&ntilde;o y la incre&iacute;ble 
            escasez de duraci&oacute;n de bater&iacute;as. <br>
            Yo tuve esta consola y os puedo decir que las 6 pilas que llevaba, 
            no llegaban ni a durar 3 horas en el mejor de los casos, lo cual te 
            obligaba a estar siempre pegado a un enchufe con el adaptador de turno, 
            lo cual hacia que el principal atractivo de una consola port&aacute;til 
            que era la portabilidad fuese bastante nulo. </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">La GameGear nunca llego a triunfar 
            en el mercado y a SEGA se le quitaron las ganas de hacer otra videoconsola 
            port&aacute;til. Adem&aacute;s las enormes ventas que estaba teniendo 
            la Gameboy hac&iacute;an suponer que el mercado de las port&aacute;tiles 
            era para Nintendo y as&iacute; ha sido hasta el d&iacute;a de hoy, 
            ha habido alg&uacute;n que otro t&iacute;mido intento otra vez por 
            parte de SNK con su Neo Geo Pocket, pero nunca ha llegado a asustar 
            ni de lejos al consolidado imperio de la GameBoy. </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1"><br>
            Por otro lado Sony en los &uacute;ltimos tiempos tambi&eacute;n est&aacute; 
            pensando en la realizaci&oacute;n de una port&aacute;til basada en 
            la ya m&iacute;tica playstation, (el primer paso hacia la realizaci&oacute;n 
            de una port&aacute;til ha sido la Psone con una pantalla opcional 
            LCD acoplable, aunque no entrar&iacute;a dentro del concepto de port&aacute;til 
            que todos tenemos de una videoconsola, mas que port&aacute;til podr&iacute;amos 
            decir que es portable....). Aunque viendo como le ha ido a las competidoras 
            de la Gameboy, quiz&aacute;s Sony tendr&aacute; que pens&aacute;rselo 
            muy mucho antes de sacar una port&aacute;til al mercado.</font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1"><b>4.4 PC o Videoconsola.......&iquest;y 
            tu de quien eres?.....</b></font></p>
          <p><font face="Verdana" size="1">La llegada de las videoconsolas al 
            mercado ha provocado muchas discusiones entre jugones del PC y videoconsoleros. 
            Debemos diferenciar varias &eacute;pocas muy distintas a lo largo 
            de la historia; en un principio videoconsola y PC han ido por caminos 
            muy diferentes, en los &uacute;ltimos tiempos y con la llegada de 
            la Xbox parece que ambos soportes est&aacute;n condenados a entenderse.</font></p>
          <p><font face="Verdana" size="1">En la &eacute;poca de finales de la 
            Atari 2600 y con la llegada de las nuevas consola de 8 bits como la 
            NES y la Master System, los ordenadores que compet&iacute;an con estas 
            consolas fueron nuestros a&ntilde;orados Amstrand, Spectrum, MSX,Comodore...estos 
            ordenadores ten&iacute;an una mayor variedad y cantidad de juegos 
            y adem&aacute;s a un precio muy inferior respecto a los cartuchos 
            de las videoconsolas. </font></p>
          <p><font face="Verdana" size="1">Con la llegada de la NES y de la Master 
            System se pod&iacute;a apreciar unos mejores gr&aacute;ficos que los 
            de los ordenadores de 8 Bits, adem&aacute;s los juegos en videoconsola 
            en su globalidad estaban mucho mas cuidados y mejor dise&ntilde;ados 
            que los de los ordenadores de la &eacute;poca (lo cual no quita que 
            hubiera juegos increiblemente bien dise&ntilde;ados y programados 
            para los ordenadores como el impresionante &quot;La abadia del crimen&quot; 
            el mejor juego absoluto de los 8 bits en mi humilde opinion), aunque 
            en aquellos inicios ordenadores y videoconsolas iban a lo suyo y eran 
            dos mercados muy diferentes.</font></p>
          <p><font face="Verdana" size="1">Con la llegada de la MegaDrive y del 
            Amiga 500 las cosas empezaron a cambiar. <br>
            En 1.985 apareci&oacute; en los Estados Unidos el c&eacute;lebre ordenador 
            Amiga 500 que tantos buenos juegos ha dado, empezaban a surgir las 
            primeras conversiones de ordenador a las videoconsolas, los jugones 
            de PC empezaban a ver con recelo algunos buenos juegos en las videoconsolas 
            que para si los quisieran y por otro lado los videoconsoleros tambi&eacute;n 
            ve&iacute;an en los ordenadores grandes juegos que so&ntilde;aban 
            ver alg&uacute;n d&iacute;a en su consola. </font></p>
          <p><font face="Verdana" size="1">Esto fue debido a que los juegos en 
            ambas plataformas eran muy diferentes, la mayor&iacute;a de los videojuegos 
            de consolas se dise&ntilde;aban en exclusiva para este sistema y ten&iacute;an 
            un concepto mas arcade que los de ordenador, por contra en PC reinaba 
            el mundo de la simulaci&oacute;n , juegos de estrategia, aventuras 
            graficas y un incipiente mundo en 3D con los que los videoconsoleros 
            no pod&iacute;an ni llegara a so&ntilde;ar. <br>
            </font></p>
          <p><font face="Verdana" size="1">Por ello comenzaron a surgir algunos 
            juegos de simulaci&oacute;n y de estrategia para videoconsola pero 
            fueron pocos y de muy baja calidad, en contra los juegos arcade de 
            acci&oacute;n de los ordenadores no le llegaban ni a la punta del 
            zapato en cuanto a jugabilidad, de los grandes juegos de este genero 
            que estaban saliendo en las videoconsolas. <br>
            Como consecuencia de todo esto comenzaron a surgir resquemores entre 
            usuarios de Videoconsolas y PC, cada uno defendiendo a capa y espada 
            sus maquinas y renegando hasta el infinito las capacidades del otro 
            sistema.</font></p>
          <p></p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            La llegada de las consolas de 32 Bits y la disminuci&oacute;n de precios 
            de los PC comenz&oacute; a acercar los dos mundos, la implantaci&oacute;n 
            multitudinaria de la Playstation en todo el mundo provoco que muchos 
            usuarios de PC se introdujesen en el mundo delas consolas y la bajada 
            de precios del PC provocaron que los videoconsoleros pudieran disfrutar 
            del PC haciendo que las disputas entre PC adictos y videoconsoleros 
            bajasen de tono, aun as&iacute; a d&iacute;a de hoy todav&iacute;a 
            hay arduos defensores de sus sistemas lo cual por otro lado le da 
            un poco de vidilla al panorama videojuegil, que esta muy bien.</font></p>
          <p><font face="Verdana" size="1">Tambi&eacute;n he notado que muchas 
            veces los enfrentamientos se basan en comparar los requerimientos 
            t&eacute;cnicos de las videoconsolas con las de un PC, y esto es un 
            error enorme porque es comparar arquitecturas diferentes con distintos 
            fines y por lo tanto no son comparables. </font></p>
          <p><font face="Verdana" size="1">Por poner un ejemplo comparar los 100Mhz 
            de un ordenador con los 100Mhz de una videoconsola , es un error porque 
            los procesadores de cada sistema trabajan en tareas muy distintas, 
            hago especial hincapi&eacute; en este punto, porque estoy harto de 
            discutir con compa&ntilde;eros PCadictos que ponen sus 1000 Mhz como 
            paradigma de la potencia y se empe&ntilde;an en comparar los datos 
            de su ordenador con los de una videoconsola y esto seria como comparar 
            el PC, que seria un cami&oacute;n con una enorme potencia pero que 
            lleva una enorme carga que tiene que arrastrar (llamada windows), 
            con una videoconsola que seria un formula-1 de menor potencia que 
            la del cami&oacute;n pero que la dedica exclusivamente a correr libre 
            de toda carga, espero haberme explicado mas o menos bien y que la 
            gente deje de comparar datos t&eacute;cnicos entre PC y consola e 
            incluso entre las propias consolas, ya que la calidad se tiene que 
            demostrar en los juegos y no en cifras a ver quien mueve mas poligonos 
            por segundo.</font></p>
          <p><font face="Verdana" size="1">Como &uacute;ltima reflexi&oacute;n 
            y como usuario de ambos sistemas, yo me decanto particularmente para 
            jugar, a favor de las videoconsolas. Creo que la mayor&iacute;a de 
            los juegos est&aacute;n mejor dise&ntilde;ados y con una jugabilidad 
            mas ajustada que los de PC. Las caracter&iacute;sticas intr&iacute;nsecas 
            de una consola de ser un sistema cerrado que mantiene un hardware 
            &uacute;nico y exclusivamente dise&ntilde;ado para funcionar juegos, 
            provoca que durante el desarrollo de videojuegos se le dedique mas 
            tiempo a trabajar en el dise&ntilde;o del propio juego que en probarlo 
            para que funcione bien en todos los diferentes PC's del mundo.</font></p>
          <p><font face="Verdana" size="1">Aun as&iacute; es de justicia decir 
            que en el PC, se juega tambi&eacute;n mucho y muy bien, los maravillososo 
            juegos de estrategia y de aventuras gr&aacute;ficas hay que jugarlos 
            con un rat&oacute;n y tranquilamente sentado delante de un monitor 
            y as&iacute; lo demuestran las injugables conversiones en consola, 
            los juegos con contenidos mas adultos, tambi&eacute;n son todo un 
            punto a favor del mundo del PC. </font></p>
          <p><font face="Verdana" size="1">As&iacute; que como videoconsolero 
            que me declaro , tambi&eacute;n declaro mi envidia a un mont&oacute;n 
            de grandes y buenos juegos de PC, pero si hay que jugar a un buen 
            arcade o echarme un buen partido de f&uacute;tbol o jugar a un buen 
            juego de coches, la videoconsola me aporta mucha mas diversi&oacute;n.</font></p>
          <p><font face="Verdana" size="1"> Con todo esto nos despedimos hasta 
            el capitulo que viene, donde analizaremos la llegada de la Playstation 
            y todo lo que ello supuso de revolucion en el mundo de las consolas, 
            ya se llevan vendidas mas de 70 millones de unidades de esta videoconsola.....veremos 
            y analizaremos como naci&oacute; el fenomeno playstation....hasta 
            el capitulo que viene........<br>
            </font></p>
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->
                &lt;&lt; <a href="Capitulo3.htm">Anterior: Y después llegó SEGA</a><!-- #EndEditable -->
                </font></b></td>
              <td align="right" valign="top"><b>
              <font face="Verdana, Arial, Helvetica, sans-serif" size="1" color="#808080"><!-- #BeginEditable "Siguiente" --><!--a href="Capitulo5.htm"-->Siguiente: <span class="ingles">32Bits,
                la revolución</span></a> &gt;&gt;<!-- #EndEditable -->
                </font></b></td>
            </tr>
            <tr>
              <td valign="top" colspan="2" height="4"></td>
            </tr>
          </table>
          <p>&nbsp;</p>
          </td>
  </tr>
</table>

  </center>
</div>

</body>

</html>