<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Capitulo1</title>
<meta name="Microsoft Border" content="none">
</head>

<body style="word-spacing: 0; margin: 0">

<div align="center">
  <center>

    <table border="0" cellpadding="0" cellspacing="0" width="100%">
      <tr>
        <td> 
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><b style="mso-bidi-font-weight:
normal">Autor: </b><a href="mailto:i1633850@petra.euitio.uniovi.es"><span style="mso-bidi-font-weight: normal"><b>Felipe 
            Olcina</b></span></a><b style="mso-bidi-font-weight:
normal"><a href="mailto:Frodrig99@yahoo.com"><o:p> </a> </o:p> </b> </font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="1"><b>Fecha: 
            18-10-2001</b></font></p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p align="center"><font size="4" face="Verdana"><b>CAPITULO 6</b><br>
            128 BITS LA INCOGNITA</font></p>
          <p><font size="1" face="Verdana"><br>
            <b>6.1 Sega hace su mejor videoconsola y no triunfa.....&iquest;que 
            paso?....</b></font></p>
          <p><font size="1" face="Verdana">La Dreamcast, es con diferencia la 
            mejor videoconsola de Sega jamas creada, sobre todo despu&eacute;s 
            de los &uacute;ltimos grandes fiascos que hab&iacute;a protagonizado 
            Sega con su MegaCD, el Mega32X y la Saturn.<br>
            La Dreamcast a d&iacute;a de hoy y a pesar de ser casi un par de a&ntilde;os 
            mas vieja que su competidora la Playstation2, ha demostrado que esta 
            a su nivel en todos los aspectos. </font></p>
          <p><font size="1" face="Verdana">Si adem&aacute;s unimos a esto que 
            ha sido la primera videoconsola que de una manera activa ha desarrollado 
            el juego en Red, la facilidad de programaci&oacute;n que ha caracterizado 
            a este sistema y que ha sido la &uacute;nica videoconsola de ultima 
            generaci&oacute;n que ha sabido innovar en sus juegos, todav&iacute;a 
            es mas dif&iacute;cil entender porque esta consola no fragu&oacute; 
            en el mercado y obligo a Sega a dejar de fabricar hardware domestico 
            para pasar a convertirse en una third party.</font></p>
          <p><font size="1" face="Verdana">Analizando fr&iacute;amente los hechos 
            podemos encontrar que han sido varios los motivos que pudieron provocar 
            que la Dreamcast no tuviera el &eacute;xito que siempre se mereci&oacute;.</font></p>
          <p><font size="1" face="Verdana">Algunos de los factores determinantes 
            fueron los siguientes: </font></p>
          <p><font size="1" face="Verdana">- El primero y claro es la todopoderosa 
            Playstation1, que en el momento de la salida de Dreamcast estaba sacando 
            sus juegos mas punteros y evolucionados (Resident Evil 2 y 3, Final 
            Fantasy, Gran Turismo 2....) lo que provocaba que los usuarios de 
            la 32 Bits de Sony estuvieran demasiado a gusto con su consola y todav&iacute;a 
            no estaban dispuestos a meterla en su caja y olvidarse de ella para 
            siempre, sobre todo teniendo en cuenta que un 80 % de los usuarios 
            de Playstation se van de compras mucho mas por los mercadillos que 
            por los grandes almacenes.... supongo que entender&eacute;is de lo 
            que estoy hablando. </font></p>
          <p><font size="1" face="Verdana">- Sega viene de un intento fallido 
            en la generaci&oacute;n de los 32 Bits, la Saturn nunca acabo de despegar 
            debido a las enormes dificultades que supon&iacute;a programar para 
            ella.</font></p>
          <p><font size="1" face="Verdana">- Adem&aacute;s unido a lo anterior 
            estaba en proyecto la Playstation2, los usuarios de Playstation1 estaban 
            dispuestos a esperar y seguir fieles a la marca con la que tanto estaban 
            disfrutando, sobre todo teniendo en cuenta que todav&iacute;a pod&iacute;an 
            jugar mucho, bien y barato en su videoconsola actual.</font></p>
          <p><font size="1" face="Verdana">- Pero el factor mas determinante ha 
            sido la gran desconfianza que SEGA produjo a sus antiguos usuarios. 
            Y lo digo claramente, porque yo me encuentro entre uno de ellos. Yo 
            siempre desde mis inicios fui un&quot;Segoso&quot; como se empe&ntilde;a 
            en llamarme un amigo fiel de Nintendo. Tuve la Master System, la Game 
            Gear y la MegaDrive, como veis y pens&aacute;ndolo bien quizas mi 
            amigo tuviera raz&oacute;n y fuera todo un Segoso, en aquellas &eacute;pocas 
            la competencia era feroz y las espadas estaban en lo mas alto, el 
            duelo a muerte entre la MegaDrive y la SuperNintendo era patente, 
            para desequilibrar la balanza SEGA tuvo la &quot;feliz&quot; idea 
            de hacer unos complementos a la megadrive que costaban una pasta y 
            cuyos resultados fueron desastrosos.<br>
            </font></p>
          <p><font size="1" face="Verdana">Estoy hablando del MegaCD que Sega 
            saco con toda la ilusi&oacute;n del mundo y en el que solo se pod&iacute;an 
            jugar a tediosos y aburridos juegos basados en video y en los que 
            el mayor aliciente eran indicarle al personaje a donde tenia que ir 
            &quot;derecha o izquierda&quot; cada 10 minutos de interminable video, 
            usease que visto uno vistos todos y adem&aacute;s eran bastante cortos. 
            <br>
            </font></p>
          <p><font size="1" face="Verdana">En fin, este fue el primer fracaso 
            de Sega puesto que aunque se vendieron unas cuantas unidades, Sega 
            decidi&oacute; retirarle su apoyo con el consecuente cabreo de los 
            usuarios de este sistema. </font></p>
          <p><font size="1" face="Verdana">Pero el colmo de los colmos y que los 
            habituales de Sega como yo no hemos podido olvidar fue el perif&eacute;rico 
            Mega32X , que era como una especie de boina que se le pon&iacute;a 
            a la MegaDrive y que por arte de birli birloque te convert&iacute;a 
            tu vieja consola de 16 Bits en una consola de nueva generaci&oacute;n 
            de 32 Bits...ja ja ja 32 bits mas quisiera... .</font></p>
          <p><font size="1" face="Verdana">Pero lo peor no era que la m&iacute;nima 
            evoluci&oacute;n que daba la consola por su elevado precio (casi 30000 
            pelas) sino que despu&eacute;s de anunciarlo a bombo y platillo en 
            todas las revistas del sector, tras un par de meses despues de su 
            lanzamiento y con apenas una docena de juegos en el mercado (muy malos 
            todos por cierto), Sega decide de pronto anular el proyecto y dejar 
            de programar para ese perif&eacute;rico quedandose todos los compradores 
            de ese periferico de un palmo de narices y con un cabreo que a d&iacute;a 
            de hoy creo que todav&iacute;a les dura. </font></p>
          <p><font size="1" face="Verdana">Adem&aacute;s si anteriormente eras 
            de los que te hab&iacute;as comprado un Mega Cd, supongo que mas de 
            uno se habr&aacute; subido por las paredes y a d&iacute;a de hoy todav&iacute;a 
            no haya bajado del enfado. <br>
            </font></p>
          <p><font size="1" face="Verdana">Bueno la verdad es que yo gracias a 
            dios no me compre ni el MegaCD ni el Mega32X (aunque poco me falto...), 
            pero los habituales de Sega como yo sentimos que la compa&ntilde;&iacute;a 
            de nuestros amores nos hab&iacute;a pegado una pu&ntilde;alada por 
            la espalda el d&iacute;a que o&iacute;mos de boca del propio exdirector 
            de Sega (un personaje llamado Paco Pastor) en una entrevista que sali&oacute; 
            publicada, que SEGA Europa a la hora de promocionar el Mega32X sabia 
            de antemano que el proyecto estaba abandonado y que no iban a salir 
            mas de 15 juegos para ese sistema en estas tierras.</font></p>
          <p><font size="1" face="Verdana"> Uff esto es muy fuerte, por ello creo 
            que esta perdida de la confianza que ten&iacute;amos los Segosos con 
            nuestra compa&ntilde;&iacute;a provoc&oacute; que muchos mir&aacute;semos 
            con un gran mosqueo a la Saturn y despu&eacute;s del fiasco que supuso, 
            ya ni nos preocupamos de mirar la Dreamcast, aunque en este ultimo 
            caso la consola fuera una de las mejores dise&ntilde;adas en los &uacute;ltimos 
            tiempos. </font></p>
          <p><font size="1" face="Verdana"><br>
            Por ello podr&iacute;amos aplicar aquella frase de que estan pagando 
            &quot;Justos por pecadores&quot; , ya se sabe que todo lo que se hace 
            tarde o temprano se paga y a Dreamcast le ha tocado pagar el error 
            del pasado a un precio muy caro. En cualquier caso y a pesar de que 
            Sega haya abandonado a Dreamcast , todos sabemos que como compa&ntilde;&iacute;a 
            desarrolladora de arcades y de Software es una de las mejores. Sobre 
            todo por su enorme capacidad de innovaci&oacute;n, algo que en estos 
            &uacute;ltimos tiempos de los videojuegos donde todo son terceras 
            y cuartas partes de juegos con &eacute;xito, es todo un puntazo.</font></p>
          <p><font size="1" face="Verdana">Como cotilleo os dir&eacute; que en 
            el momento del gran fiasco del MegaCD y de la Mega32X, en Espa&ntilde;a 
            era director de Sega un personaje llamado Paco Pastor. Quiz&aacute;s 
            a los muy pero que muy antiguos jugadores os suene este nombre de 
            algo....porque hace unas cuantas decadas era uno de los componentes 
            de un grupo de m&uacute;sica espa&ntilde;ol de gran fama en los 70 
            que se llamaba &quot;Formula V&quot; , en fin la conclusi&oacute;n 
            de todo esto es clara &quot;Zapatero a tus zapatos.....&quot; y &quot;Videoconsoleros 
            a nuestras consolas&quot;.....</font></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <font size="1" face="Verdana"><br>
          <b>6.2 Playstation2 la consola con mas pol&eacute;mica.....&iquest;por 
          qu&eacute;?..... </b></font> 
          <p><font size="1" face="Verdana">Pues s&iacute;, m&aacute;s pol&eacute;mica 
            y controvertida que un penalti en el tiempo de descuento en la final 
            de la copa de Europa entre el Madrid y el Barcelona.<br>
            Vamos a analizar en este apartado todos los misterios que han rodeado 
            a esta videoconsola con una aparici&oacute;n en el mercado que destaco 
            por dos cosas; primero por la falta de unidades en el mercado para 
            su venta y segundo por que sus primeros t&iacute;tulos fueron de muy 
            dudosa calidad. <br>
            </font></p>
          <p><font size="1" face="Verdana">Antes de que se me vea el plumero os 
            voy a avisar de que soy uno de los poseedores de esta videoconsola, 
            que me ha costado una pasta y que voy a decir las cosas malas que 
            he observado y las buenas, que de las dos tiene.</font></p>
          <p><font size="1" face="Verdana">Lo primero es analizar los factores 
            de su nacimiento, como es claro todos conocemos ya quien es Sony y 
            que su Playstation original ha supuesto el mayor &eacute;xito jam&aacute;s 
            creado en el mundo de los videojuegos. Es una consola que lleva ya 
            6 a&ntilde;os en el mercado y que a d&iacute;a de hoy todavia esta 
            sacando juegos de una enorme calidad, que hacen temblar los cimientos 
            de los 32 Bits. </font></p>
          <p><font size="1" face="Verdana"><br>
            Playstation ha hecho historia y por ello a Playstation2 se le esta 
            mirando con lupa cada paso que da en el mercado, no en vano un 90% 
            de sus ventas se las debe a su hermana menor, ya que recordemos que 
            muchos usuarios provienen de la Playstation1 y adquirieron esta consola 
            por el simple echo de ser la evoluci&oacute;n de la videoconsola con 
            mas &eacute;xito de la historia, que por otro lado es una raz&oacute;n 
            de peso.</font></p>
          <p><font size="1" face="Verdana">Despu&eacute;s de los miles de millones 
            de reportajes que salieron en revistas e incluso algun reportajes 
            de televisi&oacute;n, la salida de la Playstation2 supuso casi un 
            evento social mas que la salida de una simple plataforma de entretenimiento. 
            </font></p>
          <p><font size="1" face="Verdana">Despu&eacute;s de todo este revuelo 
            los inicios de la Play2 no pudieron ser peores, los primeros problemas 
            surgieron en Jap&oacute;n donde la mitad de los usuarios despu&eacute;s 
            de esperar grandes colas en las tiendas niponas tuvieron que volver 
            a ellas porque su videoconsola tenia problemas y no funcionaba correctamente 
            , los problemas que surgieron fueron que hab&iacute;a muchos problemas 
            a la hora de reproducir DVD's y que exist&iacute;an unos cuantos juegos 
            de Play1 que no funcionaban!!, caramba esto si que es empezar con 
            mal pie. </font></p>
          <p><font size="1" face="Verdana">Adem&aacute;s los primeros videojuegos 
            que salieron no supusieron ninguna revoluci&oacute;n , los gr&aacute;ficos 
            estaban muy bien, pero no ya no sorprend&iacute;an demasiado despu&eacute;s 
            de ver una Dreamcast....adem&aacute;s la mayor&iacute;a de los juegos 
            eran secuelas id&eacute;nticas a los de su hermana menor...a pesar 
            de todo esto los &iacute;ndices de ventas en Jap&oacute;n fueron enormes...aunque 
            se empezaron a sembrar algunas dudas entre muchos usuarios de Europa... 
            .<br>
            </font></p>
          <p><font size="1" face="Verdana">Por ello Sony se puso r&aacute;pidamente 
            manos a la obra y tras ver los errores que hab&iacute;a cometido en 
            su precipitado lanzamiento en Jap&oacute;n decidi&oacute; que si de 
            verdad quer&iacute;a ser un crack de ventas deber&iacute;a resolver 
            todos estos problemas. <br>
            </font></p>
          <p><font size="1" face="Verdana">Y as&iacute; fue , aunque mucha gente 
            no lo sepa, existen grandes diferencias entre la Playstation2 Japonesa 
            y la Playstation2 Europea que a continuaci&oacute;n os voy a relatar: 
            Para empezar el problema que surgi&oacute; en el nacimiento de Play2 
            en Jap&oacute;n respecto a la reproducci&oacute;n de DVD'se debi&oacute; 
            a un error en la realizaci&oacute;n del &quot;driver&quot; que manejaba 
            este sistema. </font></p>
          <p><font size="1" face="Verdana"><br>
            En Jap&oacute;n para poder reproducir un DVD en su playstation2, previamente 
            deb&iacute;an de cargar en la tarjeta de memoria un &quot;driver&quot; 
            de reproducci&oacute;n de DVD y como algunas tarjetas de memoria salieron 
            defectuosas no hab&iacute;a manera de ver un DVD en algunas Play2 
            japonesas, con el cabreo consecuente que ello conlleva (os imagin&aacute;is 
            10.000 japoneses cabreados protestando todos a la vez &iexcl;....). 
            </font></p>
          <p><font size="1" face="Verdana">Por ello Sony tomo una medida dr&aacute;stica 
            evitando que esto sucediese en Am&eacute;rica y Europa, para ello 
            cambio el dise&ntilde;o interno de la consola e introdujo el &quot;driver&quot; 
            en la propia placa de la Play2 llevando esto a solucionar varios problemas, 
            tales como la no necesidad de una tarjeta de memoria para poder reproducir 
            un DVD y sobre todo ya no era necesario realizar ninguna operaci&oacute;n 
            de carga de &quot;driver&quot; con la comodidad y ahorro de tiempo 
            que ello conlleva. </font></p>
          <p><font size="1" face="Verdana">Para reproducir un DVD de video en 
            la Play2 Europea es tan f&aacute;cil como meterlo y no hacer nada 
            mas, el propio sistema se encarga de hacerlo todo, sin embargo para 
            los japoneses poner un DVD de video requer&iacute;a toda una serie 
            de pasos un tanto tediosos (vamos que cuando pod&iacute;as ver por 
            fin el DVD ya se te hab&iacute;an enfriado las palomitas), bueno pues 
            como veis esta es una de las grandes diferencias entre la consola 
            Japonesa y la consola Europea-Americana.</font></p>
          <p><font size="1" face="Verdana">Otra de las diferencias es que la consola 
            Europea-Americana dispone de un hueco para meterle y conectarlo un 
            futuro disco duro. <br>
            </font></p>
          <p><font size="1" face="Verdana">Adem&aacute;s en el viaje de Jap&oacute;n 
            al resto del mundo tambi&eacute;n se ha cambiado digamos el Pack b&aacute;sico 
            de la consola que all&iacute; venia con la propia videoconsola, un 
            mando, tarjeta de memoria (obligatoria en su caso para ver DVD video) 
            y tambi&eacute;n venia con un mando a distancia, en cambio aqu&iacute; 
            en Europa lleg&oacute; un poco seca (Consola y mando) adem&aacute;s 
            se rumorea que han existido cambios mas internos en la estructura 
            de la placa base que compone la Play2. </font></p>
          <p><font size="1" face="Verdana">Tal es as&iacute; que desde el mes 
            de Abril del 2001 ha salido en Jap&oacute;n de manera definitiva a 
            la venta el modelo de consola Europea (con el &quot;driver&quot; de 
            reproducci&oacute;n de DVD montado en la consola y con el hueco para 
            disco duro), lo que pone de manifiesto que el primer modelo de Play2 
            fue un lanzamiento precipitado y que tenia unos cuantos errores que 
            Sony ha sabido remodelar a tiempo. <br>
            </font></p>
          <p><font size="1" face="Verdana">Por fin algo bueno tenia que pasarnos 
            a los sufridos usuarios Europeos que en el mundo de las videoconsolas 
            estamos ya acostumbrados a que aqu&iacute; todo llege con casi un 
            a&ntilde;o de retraso....<br>
            </font></p>
          <font size="1" face="Verdana"><b>6.3 Indrema.....que conste que la idea 
          era buena.... </b></font> 
          <p><font size="1" face="Verdana">Uno de los proyectos mas interesantes 
            dentro de los &uacute;ltimos a&ntilde;os dentro del mundo de las videoconsolas, 
            puesto que quiso introducir en el cerrado mundo de las videoconsolas 
            el sistema operativo Linux que habr&iacute;a tra&iacute;do nuevos 
            aires al mundo consolero.<br>
            </font></p>
          <p><font size="1" face="Verdana">Quiz&aacute;s alguno de vosotros no 
            sepa que Linux es un sistema operativo de car&aacute;cter gratuito 
            y de gran funcionalidad que compite contra el todopoderoso Windows. 
            <br>
            Pero en los &uacute;ltimos a&ntilde;os Linux significa mucho mas que 
            eso , significa luchar contra los monopolios, significa participaci&oacute;n 
            conjunta de los usuarios de todo el mundo,... podr&iacute;amos resumir 
            todo su significado como &quot;libertad inform&aacute;tica&quot;, 
            donde son los propios usuarios los que forman parte del proyecto Linux.</font></p>
          <p><font size="1" face="Verdana">La consola destinada a este fin se 
            llamaba Indrema L600 y estaba destinada a convertirse en la hero&iacute;na 
            de las consolas, pero la escasa experiencia en el desarrollo de videojuegos 
            bajo este sistema operativo y la dificultad de luchar contra las grandes 
            compa&ntilde;&iacute;as del mundo de las videoconsolas, supusieron 
            el abandono del proyecto del cual hay que decir que este se encontraba 
            ya en un avanzado estado de relaizacion.</font></p>
          <p><font size="1" face="Verdana">Podr&iacute;amos considerar a Linux 
            como un ant&oacute;nimo de Microsoft con todo lo que ello conlleva. 
            Quiz&aacute;s la Indrema haya sido una respuesta reaccionaria a la 
            maquina de Microsoft, como hemos visto una vez m&aacute;s, el grande 
            ha machacado al peque&ntilde;o pero en cualquier caso el proyecto 
            Indrema ha abierto la idea de un mercado que en futuros a&ntilde;os 
            no hay que descartar sobre todo teniendo en cuenta la gran aceptaci&oacute;n 
            que en los &uacute;ltimos a&ntilde;os esta teniendo Linux, por parte 
            de los propios usuarios de ordenadores.</font></p>
          <p><font size="1" face="Verdana">Ha sido una pena porque aunque quiz&aacute; 
            en caso de salir al mercado hubiera sido una consola minoritaria de 
            culto, hubiera dado un poco de aire fresco a un mercado tan cerrado 
            como lo es el de las videoconsolas y de sus car&iacute;simos kits 
            de desarrollo para las compa&ntilde;&iacute;as, que hacen muy dif&iacute;cil 
            la entrada de nuevas compa&ntilde;&iacute;as independientes en el 
            sector.</font></p>
          <p><font size="1" face="Verdana"><br>
            En cualquier caso hay que tener muy en cuenta a este tipo de desarrollo 
            de proyectos, de una consola abierta y programable por cualquier usuario, 
            quiz&aacute;s el mercado todav&iacute;a no este preparado para un 
            proyecto de este tipo, pero a buen seguro que en un pr&oacute;ximo 
            futuro las videoconsolas serviran adem&aacute;s de para jugar para 
            desarrollar. </font> </p>
          <p><font size="1" face="Verdana">Tal es as&iacute; que en la actualidad 
            se esta desarrollando un kit para la Playstation2 bajo Linux que esta 
            teniendo una gran aceptaci&oacute;n entre los usuarios, de la misma 
            manera la Playstation1 hace unos a&ntilde;os cont&oacute; con una 
            versi&oacute;n llamada Yaroze que era programable, por lo que se ve 
            los jugones tambi&eacute;n tienen ganas de llevar sus ideas a la realidad, 
            lo cual indica el camino que pueden seguir el mundo de las consolas. 
            <br>
            </font></p>
          <p><font size="1" face="Verdana">Un futuro con sistemas mas abiertos 
            y que permitan al usuario introducirse en el mundo del desarrollo 
            para este tipo de sistemas, algo dif&iacute;cilmente realizable hasta 
            ahora debido a los desorbitados precios que tienen los kits de desarrollo.</font></p>
          <p><font size="1" face="Verdana">Esta era la buena pinta que tenia la 
            consola, buen dise&ntilde;o, buen concepto,todo bueno... pero buen 
            negocio??...parece ser que no, puesto que se ha cancelado el proyecto....aun 
            asi el sue&ntilde;o continua en la mente de todos................</font></p>
          <p></p>
          <table border="1" cellpadding="3" cellspacing="0" width="226" align="center" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen88.jpg" width="575" height="301"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Videoconsola 
                  Indrema</i></font> 
              </td>
            </tr>
          </table>
          <p><font size="1" face="Verdana"><b>6.4 X-Box: El PC y la Videoconsola 
            se dan la mano.... </b></font> </p>
          <p><font size="1" face="Verdana">Aunque como ya hemos visto en este 
            reportaje las videoconsolas y los ordenadores nunca se han llevado 
            demasiado bien, en los &uacute;ltimos tiempos una consola llamada 
            X-Box de la omnipotente compa&ntilde;&iacute;a Microsoft puede cambiar 
            radicalmente este aspecto.</font></p>
          <p><font size="1" face="Verdana"><br>
            Dicha consola con alma de ordenador y cuerpo de consola, va a suponer 
            toda una revoluci&oacute;n puesto que las compa&ntilde;&iacute;as 
            desarrolladoras que hayan dise&ntilde;ado y realizado un juego para 
            los compatibles tendr&aacute;n ya hecho un 90% del trabajo para la 
            conversi&oacute;n a la consola de Microsoft. Ademas la compa&ntilde;&iacute;a 
            de Bill Gates esta proporcionando sus Kits de desarrollo a un monton 
            de compa&ntilde;ias independientes que nunca antes se habian atrevido 
            a introducirse en la programacion de juegos para videoconsolas.</font></p>
          <p><font size="1" face="Verdana">Todo esto, lleva consigo un futuro 
            distinto al que nos tenia acostumbrados las videoconsolas, por un 
            lado Microsoft acerca a todos los desarrolladores la posibilidad de 
            programar para esta maquina, puesto que los conocimientos que se requieren 
            para desarrollar un juego son los mismos que para desarrollar un juego 
            en PC y por ello un mont&oacute;n de compa&ntilde;&iacute;as que antes 
            nunca hab&iacute;an podido desarrollar para una consola ya pueden 
            hacerlo de una manera f&aacute;cil y sencilla.</font></p>
          <p><font size="1" face="Verdana">A pesar de ello Microsoft tiene que 
            convencer a los consoleros de que su maquina no es un ordenador y 
            que tendr&aacute; las capacidades y comodidades de una consola, cosa 
            que los usuarios de todo el mundo no acaban de creerse y mucho menos 
            el mercado nip&oacute;n (todo el mundo se pregunta si la consola vendr&aacute; 
            acompa&ntilde;ada de los tres botones Control+Alt+Supr...).</font></p>
          <p><font size="1" face="Verdana">A su favor la maquina de Microsoft 
            va a tener un extenso catalogo de juegos, un mont&oacute;n de grandes 
            producciones en exclusiva (a base de talonario como nos tiene acostumbrados 
            Billy) y la campa&ntilde;a mas agresiva que Microsoft nunca haya desarrollado.<br>
            En su contra tiene por un lado la Game Cube y a la Playstation 2 , 
            y por otro lado la dif&iacute;cil tarea de introducirse en el mercado 
            japon&eacute;s, que es un mercado fundamental para una vida duradera 
            de una videoconsola.<br>
            </font></p>
          <p><font size="1" face="Verdana">En fin un mont&oacute;n de inc&oacute;gnitas 
            rodean a esta consola, pero lo que esta claro es que en caso de que 
            la consola de Microsoft triunfe, el mundo del PC y de las videoconsolas 
            estar&aacute; mas unido que nunca.</font></p>
          <p><font size="1" face="Verdana">Im&aacute;genes de la Xbox y del mando 
            de control:</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="418" height="185" align="center">
            <tr> 
              <td height="152"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen89.jpg" width="200" height="135"> 
                  <img border="0" src="Imagenes/Imagen90.jpg" width="200" height="135"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Videoconsola 
                  y mando de X-BOX</i></font> 
              </td>
            </tr>
          </table>
          <p><font size="1" face="Verdana"><b>6.5 Que va a pasar en el futuro?.....la 
            bola de cristal responde..... </b> </font> </p>
          <p><font size="1" face="Verdana"><br>
            Pues el futuro se presenta bastante incierto, quiz&aacute;s sea esta 
            una de las &eacute;pocas de mas incertidumbre en el mundo de las videoconsolas. 
            <br>
            Por un lado tenemos en el mercado actual en solitario a la Playstation 
            2, una consola que no ha acabado de convencer a los usuarios en algunos 
            aspectos y que le falta todav&iacute;a esos juegos estrella en el 
            mercado que la identifique y que venda consolas por si solo (aunque 
            el Metal Gear2 esten a la vuelta de la esquina) .</font></p>
          <p><font size="1" face="Verdana">A su favor ya tiene 20 millones de 
            unidades vendidas en todo el mundo y adem&aacute;s le queda mas de 
            media a&ntilde;o siendo la &uacute;nica consola de 128 bits en el 
            mercado, lo cual le garantiza un presente y un futuro muy prometedor, 
            por otro lado en su contra tiene unas competidoras con una tecnolog&iacute;a 
            sobre el papel netamente superior a la maquina de Sony.</font></p>
          <p><font size="1" face="Verdana">Lo que esta claro es que quien decide 
            el futuro de una consola son la calidad de sus juegos y Sony tiene 
            todav&iacute;a 6 meses para sacar juegos que realmente valgan la pena 
            y que decidan al usuario a comprar su videoconsola, &iquest;ser&aacute; 
            capaza de sacar esos juegos?.</font></p>
          <p><font size="1" face="Verdana">Es dif&iacute;cil hablar de GameCube 
            y X-Box, la maquina de Nintendo viene de un pasado inmediato algo 
            mediocre con la Nintendo 64 pero sus fieles a buen seguro que la esperar&aacute;n 
            y se comprar&aacute;n la maquina de Nintendo sin pens&aacute;rselo 
            dos veces.</font></p>
          <p><font size="1" face="Verdana">GameCube esta contando con el apoyo 
            de todos los desarrolladores del mundo y todo son elogios hacia las 
            capacidades de esta consola, a pesar de ello sus comienzos en Japon 
            estan siendo mas dificiles de lo que se esperaba y no esta teniendo 
            un gran ritmo de ventas, pero es demasiado pronto para sacar conclusiones.</font></p>
          <p><font size="1" face="Verdana">Por otra parte la X-Box es una consola 
            totalmente nueva y que no cuenta con la experiencia de sus competidoras, 
            adem&aacute;s introduce el mundo PC en el mundo de las videoconsolas 
            y todav&iacute;a Microsoft debe de convencer a muchos usarios de que 
            su consola es una gran maquina y de que se la compren, lo que todo 
            el mundo tiene claro es que la Xbox solo tiene dos posibilidades en 
            el mercado, o un fracaso absoluto o un &eacute;xito total.....el tiempo 
            lo dira......</font></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p><font size="1" face="Verdana"><br>
            Muestras de tres pantallazos de los mejores juegos de cada una de 
            las plataformas de nueva generacion, &iquest;cu&aacute;l te gusta 
            mas?....y no vale decir todas.......<br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen91.jpg" width="450" height="355"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Metal Gear Sons 
                  of Liberty (PS2)</i></font>
              </td>
            </tr>
          </table>
          <p><br>
          </p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen92.jpg" width="450" height="355"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Dead or Alive 
                  (XBOX)</i></font> 
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="460" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen93.jpg" width="450" height="355"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="19"> 
                <p align="right"><font face="Arial" size="1"><i> Luigi Mansion 
                  (GameCube)</i></font> 
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">En definitiva lo que esta claro es 
            que quien decide cual es la mejor consola no son sus capacidades t&eacute;cnicas, 
            sino sus buenos juegos junto con la diversi&oacute;n que puedan proporcionarnos, 
            tal y como hemos visto a lo largo del desarrollo de este reportaje.<br>
            </font></p>
          <p><font face="Verdana" size="1">Todos esperamos mucho de estas consolas 
            de nueva generaci&oacute;n, quiz&aacute;s demasiado, pero hay que 
            ser exigentes &iquest;cumplir&aacute;n nuestras expectativas?, seguro 
            que si, mientras tanto la historia de las videoconsolas sigue evolucionando 
            d&iacute;a a d&iacute;a, os recuerdo que solo han pasado 20 a&ntilde;os 
            desde la aparici&oacute;n del m&iacute;tico Pong hasta los juegazos 
            que estamos viendo en este nuevo siglo, &iquest;&iquest;que nos deparara 
            el futuro dentro de 20 a&ntilde;os??....si lo quer&eacute;is saber, 
            seguir atentos al universo Macedonia porque seguro que aqu&iacute; 
            lo descubrir&eacute;is antes que nadie.<br>
            </font> </p>
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->
                &lt;&lt; <a href="Capitulo5.htm">Anterior: 32Bits, la revolución</a><!-- #EndEditable -->
                </font></b></td>
              <td align="right" valign="top"></td>
            </tr>
            <tr>
              <td valign="top" colspan="2" height="4"></td>
            </tr>
          </table>
          <p>&nbsp; </p>
          </td>
  </tr>
</table>

  </center>
</div>

</body>

</html>
