<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Capitulo1</title>
<meta name="Microsoft Border" content="none">
</head>

<body style="word-spacing: 0; margin: 0">

<div align="center">
  <center>

    <table border="0" cellpadding="0" cellspacing="0" width="100%">
      <tr>
        <td> 
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><b style="mso-bidi-font-weight:
normal">Autor: </b><a href="mailto:i1633850@petra.euitio.uniovi.es"><span style="mso-bidi-font-weight: normal"><b>Felipe 
            Olcina</b></span></a><b style="mso-bidi-font-weight:
normal"><a href="mailto:Frodrig99@yahoo.com"><o:p> </a> </o:p> </b> </font></span></p>
          <p class="MsoNormal" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="1"><b>Fecha: 
            18-10-2001</b></font></p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p class="MsoNormal" align="left" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><span lang="ES-TRAD" style="mso-bidi-font-size: 12.0pt; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES-TRAD"><font size="1" face="Verdana"><o:p></font></span></p>
          <p class="MsoNormal" align="center" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0">&nbsp;</p>
          <p class="MsoNormal" align="center" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font size="4"><b><font face="Verdana">CAPITULO 
            2 <br>
            </font></b></font></p>
          <p class="MsoNormal" align="center" style="word-spacing: 0; line-height: 100%; margin-top: 0; margin-bottom: 0"><font face="Verdana" size="4">LLEGA 
            NINTENDO </font></p>
          <p><font face="Verdana" size="2"><b>2.1 &iexcl;Caramba, qué evolución! 
            </b></font></p>
          <p><font face="Verdana" size="1">Despu&eacute;s de la Atari 2600 vinieron 
            otros sistemas de tecnología similar a la vetusta Atari 2600, entre 
            los mas importantes podemos destacar sistemas como Coleco Vision. 
            Aunque , en honor a la verdad hay que decir que estas consolas m&aacute;s 
            que evolucionar en la tecnolog&iacute;a de la original de Atari , 
            cambiaron su aspecto exterior haci&eacute;ndolas un poco más modernas 
            y más peque&ntilde;as que la aparatosa original Atari 2600 con su 
            &quot;precioso&quot; acabado en madera que pudimos disfrutar en el 
            capítulo anterior.</font></p>
          <p><font face="Verdana" size="1">En el periodo de tiempo existente entre 
            la salida de la Atari2600 y la llegada de Nintendo sólo hubo alguna 
            peque&ntilde;a evoluci&oacute;n que permiti&oacute; hacer los cartuchos 
            con una capacidad de memoria algo superior a los rid&iacute;culos 
            4 Kb que permit&iacute;a la Atari 2600. </font><font face="Verdana" size="1">Sin 
            embargo los videojuegos dom&eacute;sticos no hab&iacute;an evolucionado 
            a la misma velocidad que lo estaban haciendo las m&aacute;quinas recreativas 
            y la gente ya estaba empezando a cansarse de jugar siempre al mismo 
            tipo de juegos en su casa. </font></p>
          <p><font face="Verdana" size="1">Un 50% de los videojuegos nuevos que 
            sal&iacute;an para las videoconsolas eran simples reconversiones de 
            los m&iacute;ticos Space Invaders y de los miles de comecocos que 
            hab&iacute;an nacido para la Atari 2600. Adem&aacute;s de todo esto 
            empez&oacute; a surgir de una manera creciente el concepto de las 
            salas recreativas, donde ya empezaban a verse juegos que no ten&iacute;an 
            nada que ver con nuestra ya vetusta Atari, gr&aacute;ficos en m&uacute;ltiples 
            colores, personajes con forma (recordar que hasta este momento el 
            universo grafico de las videoconsolas estaba formada por un mont&oacute;n 
            de palitroques de colores), adem&aacute;s en las recreativas de principios 
            de los 80 ya empezaban a escucharse melod&iacute;as e incluso alguna 
            voz digitalizada!!. </font></p>
          <p><font face="Verdana" size="1">En resumen, hab&iacute;a dos mundos 
            muy diferentes dentro de los videojuegos, el de la sala recreativa 
            con unos gr&aacute;ficos excelentes para la &eacute;poca y nuestra 
            ya vieja Atari con unos juegos ya demasiado quemados y con unos gr&aacute;ficos 
            que empezaban a resultar demasiado toscos, la gente quer&iacute;a 
            algo mas y all&iacute; estaba Nintendo para d&aacute;rselo.</font></p>
          <p><font face="Verdana" size="1">Nintendo introduce el maravilloso mundo 
            de los microprocesadores gr&aacute;ficos en las videoconsolas, ofreci&eacute;ndonos 
            una nueva consola que representa un salto de un 500% en todos los 
            sentidos respecto a las antiguas videoconsolas existentes en el mercado 
            de la &eacute;poca. Gr&aacute;ficos en colores, sonidos que son mucho 
            mas que un mont&oacute;n de pitidos y juegos que se parecen mucho 
            a los que jugamos en las recreativas de nuestro barrio. </font></p>
          <p><font face="Verdana" size="1">Todo esto supone que la gente se vaya 
            corriendo a la tienda y no dude en comprarse una, adem&aacute;s los 
            precios eran bastante competitivos y no hacia falta ser un Bill Gates 
            para poder comprarse la consola, aunque tambi&eacute;n es verdad que 
            los juegos en formato cartucho costaban una pasta y hab&iacute;a que 
            ahorrar mucho para poder disfrutarlos. </font></p>
          <p><font face="Verdana" size="1">Los reyes magos desde 1984 se debieron 
            cansar de cargar con un mont&oacute;n de cajas de NES para las casas 
            de todo el mundo. No en vano ha sido la consola que más a&ntilde;os 
            ha estado presente y activa en el mercado, quiz&aacute;s todav&iacute;a 
            quede alguna NES en alguna estanter&iacute;a de alg&uacute;n bazar 
            del mundo.<br>
            </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="2"><b>2.2 NES, mucho más que tres simples 
            letras</b></font></p>
          <p><font face="Verdana" size="1">N.E.S. fue la abreviatura de la videoconsola 
            más famosa del mundo y con más &eacute;xito del mercado. Las tres 
            letras en cuesti&oacute;n son la abreviatura de Nintendo Entertainment 
            System, debemos de saber que éste fue el nombre que conocimos los 
            europeos porque su verdadero nombre de nacimiento y tal y como se 
            le conoci&oacute; en Jap&oacute;n y Am&eacute;rica fue FamiCom que 
            a su vez era la abreviatura de Family Computer, veremos a lo largo 
            de este reportaje que el cambio de nombres entre las videoconsolas 
            japonesas, americanas y europeas ha sido una constante en el mundillo 
            de las videoconsolas.</font></p>
          <p><font face="Verdana" size="1">Fue en 1984 cuando comenz&oacute; a 
            distribuirse en todos los supermercados del mundo, adem&aacute;s supuso 
            toda una sorpresa para los jugones del momento ya que la evoluci&oacute;n 
            respecto a las videoconsolas que exist&iacute;an en el mercado (todas 
            hermanas gemelas de la Atari 2600) fue enorme como podremos observar 
            al comparar sus juegos. </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen38.jpg" width="200" height="219"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Kit completo 
                  de NES</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Aunque los gr&aacute;ficos de esta 
            videoconsola estaban todav&iacute;a bastante por debajo de las recreativas 
            de la &eacute;poca , tambi&eacute;n es verdad que los gr&aacute;ficos 
            eran muy superiores a todo lo visto en una consola doméstica. </font></p>
          <p><font face="Verdana" size="1">Empezaron a aparecer las primeras conversiones 
            (algunas mejores que otras) de las recreativas del momento y eso era 
            un sue&ntilde;o para todos los videojuegoadictos que iban a echarse 
            sus cinco duros los s&aacute;bados en las salas recreativas (sí amigos, 
            en aquellos tiempos una partidita a las recreativas costaban cinco 
            duritos....la fortuna que me habr&eacute; gastado yo cinco duritos 
            a cinco duritos....).</font></p>
          <p><font face="Verdana" size="1">La NES fue la primera consola que us&oacute; 
            chips independientes dedicados en exclusiva al apartado grafico lo 
            cual supuso toda una revoluci&oacute;n en el concepto de videoconsola. 
            Como curiosidad debemos decir que Nintendo siempre ha sido una compa&ntilde;&iacute;a 
            muy secretista. Tal es as&iacute; que nunca llegó a revelar la documentaci&oacute;n 
            relevante a la fabricaci&oacute;n y dise&ntilde;o de este chip por 
            lo que a d&iacute;a de hoy todavía existe algún juego que nadie ha 
            sido capaz de emular debido al uso especifico que hac&iacute;an estos 
            juegos de este chip.</font></p>
          <p><font face="Verdana" size="1">El &eacute;xito de ventas de esta consola 
            fue total, adem&aacute;s los juegos estaban muy bien dise&ntilde;ados 
            permitiendo al usuario disfrutar de diferentes niveles, m&uacute;ltiples 
            enemigos y mucha acci&oacute;n (recordaros que antes sólo estaban 
            los clones de la Atari 2600). Adem&aacute;s, aparte de unos mandos 
            bastante bien dise&ntilde;ados para la &eacute;poca, a la NES le acompa&ntilde;aron 
            accesorios nunca antes vistos tales como &iexcl;una pistola de luz!, 
            lo cual acercaba nuestra consola a las impactantes máquinas recreativas 
            de la &eacute;poca.</font></p>
          <p><font face="Verdana" size="1">Es de justicia apreciar lo que Nintendo 
            aportó al mundo de los videojuegos, sabiendo evolucionar el mundo 
            de las videoconsolas en todos los aspectos tanto en dise&ntilde;o 
            del hardware , como en dise&ntilde;o y programación del software. 
            </font></p>
          <p><font face="Verdana" size="1"><br>
            Tal fue la importancia de esta videoconsola en su nivel de ventas, 
            que durante muchos a&ntilde;os a todas las videoconsolas se le conoc&iacute;a 
            como el nombre de &quot; la nintendo&quot;...aunque tuvieras una Master 
            System o una Megadrive muchas madres se pasaban el día diciendo &quot;....es 
            que estos ni&ntilde;os de hoy se pasan todo el d&iacute;a jugando 
            a la Nintendo....&quot;. </font></p>
          <p><font face="Verdana" size="1">La NES tuvo una vida larga y placentera, 
            adem&aacute;s los videojuegos evolucionaron con los a&ntilde;os a 
            medida que se conoc&iacute;a mejor la máquina y podemos decir a ciencia 
            cierta que esta máquina dio un 125% de su capacidad, explot&aacute;ndola 
            hasta limites que sus creadores nunca hab&iacute;an llegado a so&ntilde;ar.<br>
            </font></p>
          <p><font face="Verdana" size="1">Por todo ello podemos situar a la NES 
            como una videoconsola de las grandes, de las que sentaron bases y 
            que se merece estar en el podium de honor junto a la Atari 2600 y 
            a la Playstation por la revoluci&oacute;n que todas ellas han provocado 
            en el concepto de ocio electr&oacute;nico dom&eacute;stico.</font></p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="344" height="185" align="right">
            <tr> 
              <td height="296"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen25.jpg" width="152" height="130"> 
                  <o:p> </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen26.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen27.jpg" width="152" height="130"></font></span> 
                  <span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen28.gif" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Castlevania, 
                  Bomberman, Contra Force y GhostbusterS</i></font> 
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Éstas son unas cuantas pantallas de 
            videojuegos que son sólo una peque&ntilde;a muestra significativa 
            de los cientos y cientos de juegos que se desarrollaron para este 
            sistema. </font></p>
          <p><font face="Verdana" size="1">Adem&aacute;s muchos juegos de NES 
            supusieron el inicio de grandes sagas que tambi&eacute;n sentaron 
            muchas de las bases de los videojuegos de hoy en d&iacute;a. </font></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Grandes sagas como Castlevania o el 
            magnifico Contra Force permanecen hoy en d&iacute;a tan vivas como 
            en aquellos tiempos, magn&iacute;ficos juegos que permit&iacute;an 
            disfrutar al usuario y divertirse tanto como lo pod&iacute;a hacer 
            en las salas recreativas.</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">A continuación vamos a ver algunos 
            de los juegos más curiosos de la NES:<br>
            </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="226" align="left" height="183">
            <tr> 
              <td height="73"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen29.gif" width="217" height="164"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Barbie Superstar</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Pues si, las ni&ntilde;as tambi&eacute;n 
            ten&iacute;an derecho a jugar y fue este el primer producto destinado 
            exclusivamente para ellas en el mundo de las videoconsolas. </font></p>
          <p><font face="Verdana" size="1">Un hurra por este video juego porque 
            supuso la aparición de las primeras videoconsoleras a las que tanto 
            queremos y que tan poco abundan....aunque parece que &uacute;ltimamente 
            las chicas tambi&eacute;n quieren apuntarse al carro de los videojuegos 
            ya que hoy en d&iacute;a hay muchas usuarias de videoconsolas....desde 
            aqu&iacute; otro hurra para las jugonas del mundo y ya sab&eacute;is: 
            animar a vuestras amigas........</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="228" align="right" height="183">
            <tr> 
              <td height="185"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1"><img border="0" src="Imagenes/Imagen30.gif" width="217" height="164"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> California Games</i></font>
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Las grandes sagas que comenz&oacute; 
            la Atari 2600 no se perdieron en el olvido y aqu&iacute; esta el ya 
            cl&aacute;sico California Games, uno de los juegos mas vendidos de 
            la NES, como podr&eacute;is observar si hab&eacute;is le&iacute;do 
            el articulo anterior la evoluci&oacute;n gráfica fue enorme respecto 
            a su versi&oacute;n anterior en la máquina de Atari. Si no os lo creéis 
            comparad esta imagen con la de su versión de la Atari 2600 que se 
            encuentra en el capitulo anterior....</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <table border="1" cellpadding="3" cellspacing="0" width="318" height="185" align="left">
            <tr> 
              <td height="304"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen31.gif" width="152" height="130"> 
                  <img border="0" src="Imagenes/Imagen32.gif" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><img border="0" src="Imagenes/Imagen33.gif" width="306" height="130" align="middle"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Metal Gear y 
                  Snake Revenge</i></font>
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Pues si amigos el juego mas de moda 
            de los &uacute;ltimos tiempos tuvo sus inicios durante estos a&ntilde;os. 
            </font></p>
          <p><font face="Verdana" size="1">Aqu&iacute; pod&eacute;is observar 
            algunas instant&aacute;neas de ese gran juego. Sí, lo sé, no son los 
            gr&aacute;ficos de la Play2 pero aún as&iacute; fue un gran juego 
            que no tuvo todo el &eacute;xito que se mereci&oacute; en sus inicios 
            fuera de tierras japonesas. </font></p>
          <p><font face="Verdana" size="1">Se demuestra una vez mas que la historia 
            de los Videojuegos es muy importante para poder comprender los grandes 
            juegos que se est&aacute;n realizando a d&iacute;a de hoy. Seguro 
            que a más de uno le gustar&iacute;a echarse una partidita a este Metal Gear, la verdad es que a d&iacute;a de hoy todav&iacute;a tiene muy 
            buena pinta......pues imaginaros la buena pinta que tenia hace 15 
            a&ntilde;os!!!....</font></p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Y éste es el accesorio más increíble 
            jamás creado para la NES. Era un mando con forma de guante con un 
            par de sensores que funcionaba con el movimiento de la mano. Se parece 
            a un guante de realidad virtual y la verdad es que era bastante más 
            bonito que práctico.</font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="183" align="center" height="131">
            <tr> 
              <td height="112"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0"><span lang="ES-TRAD"><font face="Verdana" size="1">
                <img border="0" src="Imagenes/Imagen39.gif" width="221" height="87"><o:p> 
                  </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Power Globe</i></font> 
              </td>
            </tr>
          </table>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="2"><b>2.3 &iquest;Un fontanero que se 
            come setas y crece?...Estos japoneses est&aacute;n locos</b></font></p>
          <p><font face="Verdana" size="1">Pues sí, Mario Bros es el Videojuego 
            más famoso de la historia con gran diferencia respecto de cualquier 
            otro personaje del mundo de las videoconsolas. Mario provino de las 
            recreativas y se convirti&oacute; r&aacute;pidamente a las videoconsolas, 
            estando a d&iacute;a de hoy tan presente como el primer d&iacute;a.<br>
            </font></p>
          <p><font face="Verdana" size="1">Mario Bros es sin duda alguna la identidad 
            de Nintendo. Todas las videoconsolas (a excepción de la GameCube) 
            creadas por Nintendo han contado a la hora de su salida al mercado 
            con un juego de Mario y en todas las consolas de Nintendo ha sido 
            un juego estrella para cada uno de sus sistemas. </font></p>
          <p><font face="Verdana" size="1">Para que os hagáis una idea de la importancia 
            que tiene Mario para la compa&ntilde;&iacute;a Nintendo, hemos de 
            recordar que el hardware original de Nintendo 64 fue dise&ntilde;ado 
            en base al videojuego de Mario 64 que se estaba desarrollando para 
            esa consola. De esta manera se entiende que los mejores juegos de 
            la Nintendo 64 sean clones directos con gr&aacute;ficos mejorados 
            del original Mario 64.</font></p>
          <p><font face="Verdana" size="1">El fen&oacute;meno del personaje de 
            Mario en el mundo ha sido espectacular, tal es as&iacute; que se han 
            llegado a crear series de dibujos animados e incluso una pel&iacute;cula 
            en cine!. Es sin duda alguna el personaje más carism&aacute;tico y 
            famoso del mundo de los videojuegos a todos los niveles.<br>
            </font></p>
          <p><font face="Verdana" size="1">Mario ha protagonizado cientos de aventuras 
            desde sus inicios contra Donkey Kong, pasando por las decenas de Hand-Helds 
            (maquinitas de finales de los 80 que iban con una pila bot&oacute;n 
            y que eran como una gameboy pero de videojuego &uacute;nico) y despu&eacute;s 
            pasando por NES, Gameboy, Super Nes, Nintendo 64 y en futuro a GameCube.</font></p>
          <p><font face="Verdana" size="1">Está claro que se ha hecho carism&aacute;tico 
            a base de videojuegos de gran calidad. <br>
            Mario Bros supone una revoluci&oacute;n tanto en la jugabilidad como 
            en dise&ntilde;o de un videojuego, que provoca la envidia de todas 
            sus competidoras. </font></p>
          <table border="1" cellpadding="3" cellspacing="0" width="318" height="185" align="left">
            <tr> 
              <td height="220"> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><o:p> </o:p><img border="0" src="Imagenes/Imagen34.jpg" width="152" height="130"> 
                  <img border="0" src="Imagenes/Imagen35.jpg" width="152" height="130"></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span> 
                <p class="MsoBodyText" style="word-spacing: 0; line-height: 100%; margin: 0" align="left"><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p> 
                  </font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p></o:p><img border="0" src="Imagenes/Imagen36.gif" width="152" height="130"></font></span><span lang="ES-TRAD"><font face="Verdana" size="1"><o:p> 
                  </o:p><img border="0" src="Imagenes/Imagen37.jpg" width="152" height="130"><o:p> 
                  </o:p><o:p> </o:p> </font></span> 
              </td>
            </tr>
            <tr> 
              <td height="2"> 
                <p align="right"><font face="Arial" size="1"><i> Mario Bros, Mario 
                  Lottery y Donkey Kong</i></font>
              </td>
            </tr>
          </table>
          <p><font face="Verdana" size="1">Aqu&iacute; ten&eacute;is unas cuantas 
            capturas de algunos de los much&iacute;simos juegos que protagonizo 
            Mario en la ya m&iacute;tica NES.<br>
            </font></p>
          <p><font face="Verdana" size="1">El primero de todos es Mario Bros. Aqu&iacute; empez&oacute; todo, un juego muy bien dise&ntilde;ado 
            y que enganch&oacute; a millones de jugadores de todo el mundo. Ésta 
            fue la primera aventura que protagoniz&oacute; Mario en la NES, jugabilidad 
            en estado puro....otro punto de inflexi&oacute;n en el mundo de los 
            videojuegos....una autentica maravilla.</font></p>
          <p><font face="Verdana" size="1">Despu&eacute;s del &eacute;xito que 
            cosechó Mario en sus primeras incursiones , empezaron a salir juegos 
            donde aparec&iacute;a Mario como rosquillas, cualquier pretexto era 
            bueno , Mario ya era un Estandarte de Nintendo y un s&iacute;mbolo 
            de calidad. Y si no os lo cre&eacute;is aqu&iacute; lo ten&eacute;is 
            ech&aacute;ndose unas partidillas a las maquinas tragaperras de frutas.......</font></p>
          <p></p>
          <p>&nbsp;</p>
          <p><font face="Verdana" size="1">Y por supuesto Donkey Kong la aventura 
            más conocida de Mario, proveniente de una conversi&oacute;n directa 
            de la recreativa del momento que también tuvo su versión para Atari 
            2600, un juegazo como la copa de un pino, divertido a más no poder 
            y que supone todo un s&iacute;mbolo en el mundo de los videojuegos....Cualquier 
            buen videoconsolero que se precie ha de echarse unas cuantas partiditas 
            a este videojuego....(una vez mas os remito a que comparéis la enorme 
            evolución gráfica del videojuego Donkey Kong de la NES respecto de 
            la de Atari 2600 que se encuentra en el capitulo anterior)</font></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p></p>
          <p>&nbsp;</p>
          <p><b><font face="Verdana" size="2">2.4 Nintendo, el inicio de un imperio. 
          Pero.... ¿cómo empez&oacute; Nintendo?</font></b></p>
          <p><font face="Verdana" size="1">La historia de Nintendo ha sido muy 
            curiosa, porque han sido muchos los cambios que se originaron dentro 
            de la empresa hasta llegar a ser una de las compa&ntilde;&iacute;as 
            más punteras en el mundo de las videoconsolas. <br>
            </font></p>
          <p><font face="Verdana" size="1">A continuaci&oacute;n os presento una 
            peque&ntilde;a biograf&iacute;a de lo que fue Nintendo en su nacimiento 
            y las fechas más significativas para la compa&ntilde;&iacute;a:</font></p>
          <p><font face="Verdana" size="1">Los inicios de Nintendo se remontan 
            a 1889 y desde aquellos tiempos hasta el d&iacute;a de hoy siempre 
            ha sido una empresa que se ha transmitido de generaci&oacute;n en 
            generaci&oacute;n. Tal es as&iacute; que el fundador de Nintendo fue 
            un tal Fusajiro Yamauchi que a su vez es el tatarabuelo del actual 
            presidente de Nintendo.</font></p>
          <p><font face="Verdana" size="1">Pues bien. Nintendo como os pod&eacute;is 
            suponer, en 1889 no comenz&oacute; a fabricar consolas, sino que creo 
            un juego llamado &quot;Hanafuda&quot; el cual consist&iacute;a en 
            un juego de cartas que se hizo muy famoso por las tierras Niponas.....vamos 
            que Nintendo en sus inicios fue algo as&iacute; como el Heraclio Fournier 
            Espa&ntilde;ol.....</font></p>
          <p><font face="Verdana" size="1">En 1933 la compa&ntilde;&iacute;a toma 
            una relevancia importante en el mercado y se adopta el nombre que 
            todos conocemos hoy en d&iacute;a de Nintendo &amp; Co.</font></p>
          <p><font face="Verdana" size="1">En 1953 la compa&ntilde;&iacute;a sigue 
            creciendo y se convierte en el primer productor de cartas de pl&aacute;stico 
            en Jap&oacute;n, comenzando a exportarse al resto del mundo.</font></p>
          <p><font face="Verdana" size="1">En 1963 la compa&ntilde;&iacute;a expande 
            sus negocios complementando los juegos de cartas con otros diversos 
            materiales de juegos de mesa.</font></p>
          <p><font face="Verdana" size="1">En 1970 y tras la diversificaci&oacute;n 
            de su producci&oacute;n en el mercado de los juegos, Nintendo se introduce 
            en el mundo de la electr&oacute;nica comenzando a distribuir la serie 
            Beam Gun, un juego de pistolas electr&oacute;nicas. De esta manera 
            Nintendo introduce por primera vez en Jap&oacute;n un juego basado 
            en componentes electr&oacute;nicos, algo decisivo para la aparición 
            del mundo de las videoconsolas.</font></p>
          <p><font face="Verdana" size="1">En 1974 se introduce en el mundo de 
            las recreativas, con un videojuego de pistola sobre una pantalla con 
            un proyector de 16mm, un juego de disparar a luces que aparec&iacute;a 
            en la pantalla.</font></p>
          <p><font face="Verdana" size="1">En 1976 introduce el microprocesador 
            en el mundo de las m&aacute;quinas recreativas con todas las posibilidades 
            que ello conlleva.</font></p>
          <p><font face="Verdana" size="1">En 1981 crea una de las maquinas recreativas 
            más famosas de la historia: el &quot;Donkey Kong&quot;. Este videojuego 
            se convierte en la m&aacute;quina recreativa más vendida de la historia, 
            todas las salas recreativas tienen una y todo el mundo juega y disfruta 
            de ellas.</font></p>
          <p><font face="Verdana" size="1">En 1982 se crea Nintendo Am&eacute;rica 
            y se introduce de una manera masiva en el mercado Americano y como 
            consecuencia en el resto del mercado occidental.</font></p>
          <p><font face="Verdana" size="1">En 1983 se construye una enorme planta 
            en Jap&oacute;n y comienza la construcci&oacute;n de la consola estrella 
            de Nintendo, la NES.</font></p>
          <p><font face="Verdana" size="1">El resto de la historia ya la conoc&eacute;is, 
            aunque la iremos repasando con detalle a lo largo de este reportaje 
            sobre la historia del mundo de los videojuegos con la llegada de la 
            Gameboy, la SuperNintendo y de la hermana mayor la Nintendo 64 hasta 
            la inminente llegada de la Gamecube.</font></p>
          <p><font face="Verdana" size="1">Otras caracter&iacute;sticas que debemos 
            tener en cuenta es que Nintendo tiene una gran cantidad de fieles 
            usuarios en Jap&oacute;n más forofos que los ultrasur del Real Madrid...y 
            que han seguido fieles a la compa&ntilde;&iacute;a desde sus inicios. 
            </font></p>
          <p><font face="Verdana" size="1">Como veis por la larga historia que 
            tiene podemos considerar a Nintendo como mucho mas que una simple 
            compa&ntilde;&iacute;a desarrolladora de consolas y videojuegos. En 
            Jap&oacute;n es uno de sus grandes estandartes con un gran volumen 
            de negocio.<br>
            <br>
            Tambi&eacute;n Nintendo siempre ha cosechado grandes &eacute;xitos 
            en Am&eacute;rica con toda la importancia que ello conlleva, y en 
            Europa aunque no ha acabado de copar el primer puesto siempre ha tenido 
            unos altos &iacute;ndices de ventas. Por todo ello ha sido la &uacute;nica 
            compa&ntilde;&iacute;a que se ha conservado tan fresca como el primer 
            d&iacute;a debido al gran numero de NintendoAdictos que existen a 
            lo largo del mundo.</font></p>
          <p><font face="Verdana" size="1">Siempre se le ha achacado a Nintendo 
            su excesiva orientaci&oacute;n hacia el publico infantil y es esto 
            lo que en gran parte a hecho fracasar a su ultima producci&oacute;n 
            la Nintendo 64, ya que la edad de los videoconsoleros ha sufrido un 
            notable incremento en los últimos a&ntilde;os. </font></p>
          <p><font face="Verdana" size="1">A pesar de que las ventas de Nintendo 
            64 no fueron todo lo buenas que se supon&iacute;an, la llegada de 
            la incombustible Gameboy con su edici&oacute;n Pocket, Color y la 
            ultima Game Boy Advanced han deparado enormes beneficios a Nintendo 
            llegando incluso a saturar las fábricas de cartuchos para esta consola.</font></p>
          <p><font face="Verdana" size="1">Una an&eacute;cdota curiosa es que 
            tal fue la demanda de cartuchos de Gameboy para los juegos de Pokemon, 
            que las f&aacute;bricas tuvieron una semana que dedicarse en exclusiva 
            a la fabricaci&oacute;n de estos cartuchos de la saga Pokemon para 
            abastecer a todo el mundo dejando de fabricar cartuchos para Nintendo 
            64.</font></p>
          <p></p>
          <p><font face="Verdana" size="1"><br>
            En resumen Nintendo fue, ha sido y ser&aacute; siempre una de las 
            grandes compa&ntilde;&iacute;as en el mundo de los videojuegos. La 
            &uacute;nica que ha superado todos los obst&aacute;culos a base de 
            grandes y originales juegos. Ha tenido dos grandes competidores Sega 
            y Sony, y nunca ha tenido grandes fracasos y eso se debe a videoconsolas 
            y videojuegos muy bien dise&ntilde;ados y con un gran control de calidad. 
            </font></p>
          <p><font face="Verdana" size="1">En el capitulo siguiente veremos la 
            aparici&oacute;n de Sega, la gran competidora durante muchos a&ntilde;os 
            de Nintendo. Si Nintendo siempre se destacó por su calidad, veremos 
            que Sega se ha destacado por su capacidad de innovaci&oacute;n en 
            todo momento. Espero que os haya gustado este cap&iacute;tulo y que 
            le&aacute;is el que viene, en el que vamos a contar un mont&oacute;n 
            de curiosidades sobre la compa&ntilde;ía Sega y sus videoconsolas.</font></p>
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->
                &lt;&lt; <a href="Capitulo1.htm">Anterior: Nacimiento de la Videoconsola</a><!-- #EndEditable -->
                </font></b></td>
              <td align="right" valign="top"><b>
              <font face="Verdana, Arial, Helvetica, sans-serif" size="1" color="#808080"><!-- #BeginEditable "Siguiente" --><a href="Capitulo3.htm">Siguiente:
                Y después llegó SEGA</a> &gt;&gt;<!-- #EndEditable -->
                </font></b></td>
            </tr>
            <tr>
              <td valign="top" colspan="2" height="4"></td>
            </tr>
          </table>
          <p>&nbsp;</p>
          </td>
  </tr>
</table>

  </center>
</div>

</body>

</html>