<HTML>
    <HEAD>
        <meta charset="utf-8">
<TITLE>
            SQ: Comentario de AmnesiaRol
        </TITLE>
        <META NAME="AUTHOR" CONTENT="Daniel Cardenas">
        <META NAME="DESCRIPTION" CONTENT="Spanish Quest: Comentario de AmnesiaRol">
    </HEAD>
<BODY BGCOLOR="#F4F4FF">
<CENTER>
<H1>AmnesiaRol</H1>
<B>Casa:</B> Calendonyumt Software Corporation<P>
<B>Tipo:</B> Aventura conversacional<P>
<B>Sistema:</B> PC<P>
<B>Precio:</B> 0.00 ptas (<I>freeware</I>), pill&aacute;tela <A HREF="ftp://ftp.gmd.de/if-archive/games/pc/non-english/amnesia.zip">aqu&iacute;</A>

<TABLE WIDTH=97%><TR><TD>
<HR>
<P>
<FONT SIZE="-1" COLOR="#459043" FACE="Times New Roman">
<BLOCKQUOTE>
Te encuentras en una peque&ntilde;a, oscura y sucia habitaci&oacute;n.
No recuerdas qui&eacute;n eres, ni como has llegado hasta aqu&iacute;.
Acabas de despertar de un gran sopor, y a&uacute;n te encuentras
como aletargado... Tus ojos se acostumbran poco a poco a
las tinieblas y ves un fino rayo de luz que proviene de un
ventanuco en una de las paredes. Un silencio sobrecogedor
invade la estancia.<BR>
</BLOCKQUOTE>
</FONT>
<P>
As&iacute; es como empieza AmnesiaRol, una aventura de esas en las
que poco a poco hay que ir desvelando los misterios que
envuelven al protagonista... <I>qui&eacute;n soy</I> o <I>qu&eacute; hago yo en un
lugar como &eacute;ste</I>. Y aunque suene extra&ntilde;o es este halo de misterio,
esta indeterminaci&oacute;n casi absoluta del personaje, lo que hace
m&aacute;s interesante al juego.
<P>
Como suele ser habitual en estos casos, no se trata de un
juego que te vaya a dejar indiferente. Estoy seguro que a la gran
mayor&iacute;a les disgustar&aacute;, otros ni siquiera le dar&aacute;n una
oportunidad, y s&oacute;lo a unos pocos les acabar&aacute; gustando.
<P>
Y es que el juego en s&iacute; puede parecer vac&iacute;o, casi insulso, pero
ah&iacute; es donde est&aacute; toda la gracia. Es una aventura en algunos
aspectos algo at&iacute;pica y donde el jugador deber&aacute;
adaptarse a esas particularidades en caso de que
desee sacarle todo el jugo.
<P>
Al argumento es extremadamente simple, debes escapar de una fortaleza
donde est&aacute;s preso, y conseguir la libertad. El planteamiento
es algo curioso, ya que se divide en 13 partes, cada una con una
&uacute;nica y detallada descripci&oacute;n que permanece fija
y en la mitad superior de la pantalla. La mayor&iacute;a
de estos cap&iacute;tulos acontecen en una misma localidad, pero
otras lo hacen en varias. Para cambiar de una localidad
a otra simplemente hace falta teclear un IR a tal sitio o un
IR direcci&oacute;n, y entonces en la mitad inferior aparece otra
descripci&oacute;n o en el <I>peor</I> de los casos algo como 'Vas a la
cocina', para cuya descripci&oacute;n tendremos que introducir un
<SAMP>MIRAR COCINA</SAMP>.
<P>
Superar los cap&iacute;tulos suele implicar bien la resoluci&oacute;n l&oacute;gica
de alg&uacute;n problema, bien la recogida de algunos objetos que ser&aacute;n
necesarios en un cap&iacute;tulo posterior o bien (los menos) la elecci&oacute;n
de una opci&oacute;n de entre tres o cuatro posibles al m&aacute;s puro estilo
libro-juego. Es importante decir que no se puede retroceder de
una parte a otra anterior, y esto representa la linealidad elevada
a sus m&aacute;s altas cotas. Por eso, cuando se te olvida coger
alg&uacute;n objeto que necesitar&aacute;s m&aacute;s adelante, y quieres abandonar
esa parte, se te avisa de que te falta algo por exigencias del
gui&oacute;n...
<P>
En cuanto a escoger una opci&oacute;n entre varias posibles, s&oacute;lo hay
una v&aacute;lida y las dem&aacute;s te llevan a la muerte. Se pueden
superar por el m&eacute;todo de prueba y error, pero son elecciones
tan evidentes que no tienen la mayor importancia.
<P>
Si alguien se pregunta qu&eacute; tiene de especial esta conversacional
le dir&eacute; que es ese planteamiento y esa indeterminaci&oacute;n del
personaje y ese 'est&aacute;s en la cocina'. Son un c&uacute;mulo de
propiedades que se prestan enormemente para jugar no al estilo
<I>destripa-puzzles</I>, sino m&aacute;s bien al estilo <I>rol en solitario</I>. O sea,
es el jugador el que con su imaginaci&oacute;n ha de superar esos vac&iacute;os y esas
indeterminaciones, superar la limitaci&oacute;n del parser, e
integrarse totalmente en el mundo que nos brinda el autor.
<P>
Es una forma que incluso puede ir m&aacute;s all&aacute; de la lectura
de un libro en primera persona (&#191;alguna vez hab&eacute;is probado
a leer uno como si t&uacute; fueras el protagonista?), porque aqu&iacute; el verdadero
protagonista eres T&Uacute;,
sobretodo cuando con esa indeterminaci&oacute;n te dan tanta libertad
para moldearte personaje, localidades, sucesos, etc como t&uacute;
quieras. Desde luego es una forma
mucho m&aacute;s costosa de jugar a una aventura, pero mucho m&aacute;s
gratificante por la atm&oacute;sfera lograda y por el
ejercicio de escape de la realidad que representa.
<P>
Sin duda est&aacute; forma de juego es un campo bastante inexplorado.
Ignoro si los autores de AmnesiaRol la ten&iacute;an en
mente cuando realizaban este juego. Si fue as&iacute;, tal como
en principio da a entender ese sufijo &quot;<FONT SIZE="-1">...Rol&quot;</FONT> en el t&iacute;tulo, enhorabuena
a todo el grupo creativo por su trabajo.
<P>
A destacar tambi&eacute;n el gran esfuerzo realizado por los
creadores para incluir multitud de finales cuando cometes
alg&uacute;n error imprudente. Una vez superado el juego, resulta
interesante la b&uacute;squeda de estos finales, pues en alguno de
los cap&iacute;tulos hay hasta diez (y quiz&aacute; m&aacute;s) formas diferentes de
morir. Y todos estos finales suelen tener su gracia, y algunos
hasta moraleja y todo.
<P>
<HR>
<P>
<B>La pista es:</B> al entrar en ciertos sitios, recuerda
<FONT COLOR="FF0000"><SAMP>MIRAR 'SITIO'</SAMP></FONT>.
Tambi&eacute;n es aconsejable mirar suelo, paredes y techo para
localizar objetos no citados en la descripci&oacute;n.
<P>
<B>Cuidado con:</B> la peste negra galopante.
<P>
<B>Abstenerse:</B> fans de los v&iacute;deos en los juegos. Aqu&iacute; los v&iacute;deos, el
sonido, el olor y los gr&aacute;ficos los pones t&uacute;. Tampoco necesitas
tarjeta 3D, ni aceleradoras, pues puedes tomarte cuanto tiempo quieras
para poner la escena en tu mente.
<P>
<B>Principal defecto:</B> el parser, que se pod&iacute;a haber trabajado un poco
m&aacute;s. S&oacute;lo podemos utilizar infinitivos y deber&iacute;a haber
alguna abreviatura para mirar/examinar. Adem&aacute;s hubiera estado bien
que al meter la pata se nos diera la posibilidad de volver atr&aacute;s o
<SAMP><I>UNDO</I></SAMP>.
<P>
<CENTER>
<I>Comentado por Daniel C&aacute;rdenas</I><P>
<HR><BR>
[<A HREF="coment.htm">M&aacute;s Comentarios</A>]
<BR>
</CENTER>
</TR></TD></TABLE>
</CENTER>
</BODY>
</HTML>
