<HTML>
<HEAD>
<TITLE>SQ Comentario: Ark of Time</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#003366" TEXT="#ffff00" LINK="#ffffff" VLINK="#ffffff">
<P>
<CENTER><FONT SIZE=7>Ark of Time</FONT></CENTER>
<P>
<CENTER><B>Casa: </B>Koei / International Computer Entertainment
Ltd</CENTER>
<P>
<CENTER><B>Tipo:</B> Aventura gr&aacute;fica <B>Idioma:</B> Castellano</CENTER>
<P>
<CENTER><B>Sistema:</B> 486DX66 o superior (Pentium recomendado),
MS DOS 5.0 o ventana MS DOS en Windows 95, 8MB RAM, 51MB de espacio
de disco duro, SVGA VESA, lector CDROM de doble velocidad (cuadruple
velocidad recomendada), rat&oacute;n. </CENTER>
<HR>
<P>
El primer juego que recuerdo cuya historia estubiera basada en
la ciudad perdida de la Atl&aacute;ntida, fue &quot;Indiana Jones
and the Fate of Atlantis&quot; (hace ya unos cuantos a&ntilde;os).
Ahora parece que se avecina una lluvia de t&iacute;tulos que se
centran en este tema, como &quot;Timelapse&quot;, &quot;Atlantis:
The Lost Tales&quot; y el que ahora nos ocupa, &quot;Ark of Time&quot;.
Ark of time se parece mucho m&aacute;s en su dise&ntilde;o a &quot;Indiana
Jones&quot; que los otros dos, en el sentido de que es un juego
que cuenta con inventario de objetos y perspectiva en tercera
persona, mientras que los otros t&iacute;tulos son en primera
persona, tienen un inventario limitado y m&aacute;s puzzles abstractos.
Como &quot;Timelapse&quot;, &quot;Ark of Time&quot; asocia fuertemente
la Atl&aacute;ntida con otras antiguas y misteriosas culturas
de nuestro mundo. Nos pone en contacto con una teor&iacute;a o
una histroria de lo que podr&iacute;a ser un mundo mejor, considerando
los origenes de Stonehenge, las grandes estatuas de la Isla de
Pascua y las Pir&aacute;mides Mayas.
<P>
<CENTER><IMG SRC="c-ark-1.jpg"></CENTER>
<P>
<B>No pierdas la esperanza</B>
<P>
El inocente lejos de casa y el h&eacute;roe que no quer&iacute;a
serlo son clich&eacute;s tipicos en los protagonistas de aventuras
y Richard Kendal, el 'h&eacute;roe' de este juego, encaja en ellos.
La palabra inocente no se acaba de ajustar, porque Richard es
un completo ignorante y un rollo de tio. Es un periodista deportivo
a quien se le ofrece viajar a lugares ex&oacute;ticos de todo
el planeta, pero el prefiere quedarse en casita viendo el f&uacute;tbol.
<P>
Debo admitirlo, Richard no me dio una buena impresi&oacute;n en
lo m&aacute;s m&iacute;nimo. Se comporta como un adolescente con
una falta total de madurez, tratando a las culturas ex&oacute;ticas
con indiferencia y sin conseguir aprender nada, ni siquiera educaci&oacute;n.
Presumiblemente la caracterizaci&oacute;n del personaje pretende
ser humor&iacute;stica, pero no siempre consigue serlo. Los di&aacute;logos
de Richard son muy sosos. Dese&eacute; que los dise&ntilde;adores
no se hubieran conformado de su amplitud de conocimientos y hubiesen
puesto un narrador en su lugar. Es bastante aburrido a veces oir
como Richard inspecciona los objetos y, generalmente, tanto el
gui&oacute;n como la interpretaci&oacute;n de los dobladores deja
mucho que desear. Algo bueno es que hay subt&iacute;tulos para
todas las voces excepto unas pocas secuencias. L&aacute;stima
que esas secuencias fueran importantes. &#161;No est&aacute; todo
perdido! A pesar del protagonista, qued&eacute; sorprendida de
ver que el juego era bastante divertido.
<P>
<B>Contemplando el entorno</B>
<P>
El juego empieza en Londres, cuando al poco dispuesto Richard
se le asigna investigar la desaparici&oacute;n del Profesor Caldwell,
un eminente Atlanti&oacute;logo (&#191;es correcta esta palabra?
No s&eacute;, pero suena bien). No tarda en partir hacia el Caribe
a la caza de pistas. De ah&iacute; parte a otros fascinantes lugares.
Hay un mapa del mundo donde est&aacute;n se&ntilde;alados los
lugares m&aacute;s importantes para hacer m&aacute;s r&aacute;pidos
los viajes.
<P>
Cada zona en &quot;Ark of Time&quot; puede tener hasta diez pantallas
que explorar, pero no creas que dichas zonas son independientes
en el aspecto en que pueden ser 'resueltas' como si fueran entidades
separadas, como sucede en juegos como &quot;Zork Nemesis&quot;.
Esta aventura te har&aacute; volver atr&aacute;s a medida que
vayas aprendiendo y adentr&aacute;ndote en el juego. Por ejemplo,
tendr&aacute;s que volver a casa para poder descifrar escritos,
y muchos objetos que encuentres en una localidad pueden tener
una relevancia decisiva en otra. Estos aspectos a&ntilde;aden
complejidad a los problemas. Tenlo en cuenta.
<P>
Encuentro el movimiento del personaje un tanto estresante, aunque
otros jugadores no han experimentado frustraci&oacute;n en este
punto. Me imagino que depende de la targeta gr&aacute;fica que
tenga cada uno. Menos mal que est&aacute; el mapa que evita el
rollazo de tener que andar, pero s&oacute;lo est&aacute; disponible
para las zonas principales. Para las pantallas dentro de un &aacute;rea
habremos de desplazarnos 'manualmente'. Existe la posibilidad
de apretar el bot&oacute;n derecho del rat&oacute;n sobre una
salida. El resultado ser&aacute; un desplazamiento casi instant&aacute;neo
a ella.
<P>
<CENTER><IMG SRC="c-ark-2.jpg"></CENTER>
<P>
<B>La aventura</B>
<P>
Hay mucho que hacer en este juego, y muchas pantallas para explorar
llenas de detalles. Al principio el juego puede decepcionar un
poco por su simplicidad, pero m&aacute;s adelante los puzzles
aumentan su complejidad de modo que incluso los m&aacute;s experimentados
aventureros puede ser que encuentren dificultades. Entre otras
cosas, hay que encontrar extra&ntilde;os objetos y usarlos en
lugares igualmente extra&ntilde;os, un condenado por asesinato
al que exculpar, muchos personajes con los que interactuar, un
proceso l&oacute;gico de eliminaci&oacute;n de problemas y puzzles
al final para abrir puertas y escapar de situaciones comprometidas.
Mantendr&aacute; a los jugadores realmente ocupados.
<P>
Todo lo que hay en &quot;Ark of Time&quot; es del tipo 'apuntar
con el rat&oacute;n y clicar'. No hay iconos para diferentes acciones.
Clicar con el bot&oacute;n izquierdo har&aacute; que Richard describa
un objeto, hacerlo con el derecho har&aacute; que lo use. Demasiado
simple para mi gusto (yo prefiero una mayor inmersi&oacute;n en
el juego), pero tampoco est&aacute; mal. Al poco rato de viajar,
tendr&aacute;s el inventario a tope, de modo que habr&aacute;
que usar un scroll para elegir un objeto. Adem&aacute;s cada objeto
tiene asociado un texto descriptivo para que sepamos qu&eacute;
es. Hay la posibilidad de salvar / restaurar hasta doce partidas
presionando F5 &oacute; F6. Cada partida salvada tendr&aacute;
una peque&ntilde;a imagen de la situaci&oacute;n y un texto asociado.
<P>
El juego me ha sorprendido. No cre&iacute;a que fuera a pas&aacute;rmelo
bien con &eacute;l pero result&oacute; que s&iacute;. Tiene algunos
fallos, pero tambi&eacute;n puzzles que los redimen. Los gr&aacute;ficos
son incre&iacute;bles. En definitiva, es un juego muy jugable.
Recomendado a aventureros a los que les gusten las aventuras basadas
en el inventario.
<P>
<I><B>Copyright</B></I><B> &copy; Rosemary Young 1997. Todos los
derechos reservados.</B>
<HR>
<P>
<CENTER></P><FONT SIZE=2>La versi&oacute;n original de este art&iacute;culo
fue escrita por <B>Rosemary Young</B> y publicada en</FONT> </P></CENTER>
<P>
<CENTER><FONT SIZE=2>&quot;<A HREF="http://www.iinet.net.au/~quandary/">Quandary, The magazine for Adventure, Puzzle and RPG players</A>&quot;</P></FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>y ha sido adaptada por <B>David Torrens </B>con
la colaboraci&oacute;n de Ra&uacute;l &Aacute;lvarez.</FONT> </CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
