<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Broken Sword</TITLE>
</HEAD>
<BODY>
<H1 ALIGN=CENTER><CENTER>Broken Sword: La Leyenda de Los Templarios</CENTER>
</H1>
<P>
<CENTER><IMG SRC="c-broken.jpg" ALT="IMAGEN" HEIGHT=148 WIDTH=208></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Revolution
/ Virgin Interactive <B>Idioma</B>: Castellano <B>Precio</B>:
7990 <B>Tipo</B>: Aventura gr&aacute;fica</FONT> </CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: DOS /
Windows 95, 486/66 (Pentium recomendado), 2xCD-ROM (cuadruple
velocidad recomendada), SVGA compatible Vesa 2.0, tarjeta de sonido
Soundblaster o 100% compatible, rat&oacute;n</FONT> </CENTER>
<P>
<CENTER><B><FONT SIZE=2>Comentario por</FONT></B><FONT SIZE=2>:
Gordon Aplin</FONT></CENTER>
<HR>
<P>
&quot;Broken Sword&quot; es el nuevo juego de los creadores de
&quot;Lure of The Temptress&quot; y &quot;Beneath Steel Sky&quot;.
Se trata de una aventura que cuenta con una presentaci&oacute;n
estilo pel&iacute;cula de dibujos animados y que me ha gustado
mucho m&aacute;s que sus predecesoras.
<P>
La secuencia inicial introduce la historia r&aacute;pidamente.
George Stobbart, un joven americano, se encuentra visitando Par&iacute;s,
sentado en la terraza de un bar, relaj&aacute;ndose con su caf&eacute;,
cuando &#161;BUUM! -- una pallaso hace explotar el lugar, matando
al enigm&aacute;tico Monsieur Plantard. A partir de ese momento
el futuro de George queda marcado, y decide perseguir al delincuente
sin imaginarse que est&aacute; a punto de embarcarse en una aventura
que le llevar&aacute; desde las alcantarillas de Par&iacute;s
a Irlanda, Espa&ntilde;a, S&iacute;ria y Escocia antes de que
pueda resolver el misterio. En el camino conocer&aacute; la historia
de los Caballeros del Templario y su fabuloso tesoro, y conocer&aacute;
varios personajes que le ayudar&aacute;n, le fastidiar&aacute;n,
y le intentar&aacute;n matar. Puede que incluso encuentre el amor,
si es que alguna vez consigue deshacerse del payaso.
<P>
<B>Un inocente turista</B> 
<P>
George es un inocente turista, no inepto, pero s&iacute; algo
ingenuo. Un personaje ideal para un juego donde el humor es bastante
importante. Cuando jugaba, preguntaba a todos los personajes sobre
todos y cada uno de los objetos del inventario simplemente vara
ver qu&eacute; dec&iacute;an, y en m&aacute;s de una ocasi&oacute;n
mis risas se tornaban carcajadas. Incluso el p&eacute;simo acento
franc&eacute;s del doblaje recuerda a la pel&iacute;cula &quot;Monthy
Python and the Holy Grail&quot;. Esta es una alegre aventura que
no se toma a s&iacute; misma muy en serio y que no se esfuerza
demasiado en ser divertida, pero que me ha proporcionado muchas
horas de diversi&oacute;n.
<P>
&quot;Broken Sword&quot; es f&aacute;cil de jugar y supone un
regreso al estilo aventurero tradicional. Los puzzles son del
tipo encuentra-el-objeto-y-&uacute;salo-en-el-lugar-adecuado (que
siempre han sido de mi agrado) algunos de ellos bastante sutiles.
No demasiado retorcidos, pero tendr&aacute;s que estar alerta
a pistas en descripciones y conversaciones.
<P>
Tambi&eacute;n hay un amplio rango de obst&aacute;culos &quot;tradicionales&quot;.
Algunos debes superarlos por ti mismo (por ejemplo manipulando
varios objetos), mientras que otros dependen m&aacute;s de la
conversaci&oacute;n, o de la ayuda de otro personaje. Con esta
aventura me divert&iacute; tanto que ni siquiera me molestaron
el par de secuencias donde el tiempo es la esencia y s&oacute;lo
tienes uno o dos segundos para reaccionar. 
<P>
<B>Mira antes de actuar</B> 
<P>
La interacci&oacute;n con el entorno ha sido simplificada a trav&eacute;s
de un cursor que cambia de forma para representar la acci&oacute;n
que puedes realizar cuando pasa sobre un &quot;punto caliente&quot;
- una &quot;boca&quot; para hablar con otros personajes, una &quot;mano&quot;
para coger un objeto y unos &quot;engranajes&quot; para mostrar
que algo puede ser usado. Adem&aacute;s, independientemente de
la forma del cursor, un click con el bot&oacute;n derecho del
rat&oacute;n permite mirar primero antes de llevar a cabo la acci&oacute;n
indicada. Esta caracter&iacute;stica ha solucionado uno de los
problemas que m&aacute;s odio en las aventuras, los interfaces
que activan un objeto antes de que uno est&eacute; ni siquiera
seguro de qu&eacute; es o qu&eacute; deber&iacute;a hacer. 
<P>
Las conversaciones son animadas, suelen ir al grano, y realmente
permiten <I>brillar</I> al protagonista, George. Los di&aacute;logos
hacen a los personajes, y, el juego que nos ocupa cuenta con un
buen gui&oacute;n. Aunque hay algunas secuencias en las que no
tienes ning&uacute;n control sobre lo que se dice (usualmente
las escenas que hacen avanzar la historia) una vez que inicias
la conversaci&oacute;n el modo cambia y tu inventario aparece
en la parte superior de la pantalla y las personas o cosas sobre
las que has descubierto algo aparecen representados por iconos
en la parte inferior. Pulsa sobre un t&oacute;pico de conversaci&oacute;n
y George preguntar&aacute; sobre ello a su manera (no hay preguntas
predeterminadas). Una vez has descubierto todo lo que puedes,
puedes abandonar el modo de conversaci&oacute;n para continuar
la aventura. No es tan inc&oacute;modo como suena y todo el proceso
se ajusta suavemente en el juego.
<P>
El resto del tiempo el inventario est&aacute; oculto pero puede
accederse moviendo el cursor a la parte superior del &aacute;rea
del juego que no es a pantalla completa. Mientras el inventario
es visible puedes examinar m&aacute;s detalladamente varios objetos
y modificarlos si es necesario.
<P>
<B>Impresionantes gr&aacute;ficos</B> 
<P>
Los gr&aacute;ficos son alegres, claros y est&aacute;n bien realizados;
adem&aacute;s el juego ofrece un mont&oacute;n de lugares interesantes
para explorar. La &uacute;nica queja que podr&iacute;a tener al
respecto es que despu&eacute;s de haber conseguido entrar en un
par de yacimientos templarios, especialmente en Irlanda y Espa&ntilde;a,
fu&iacute; r&aacute;pidamente devuelto a Par&iacute;s sin la oportunidad
de explorar un poco por m&iacute; mismo - parece que George ya
hab&iacute;a tenido suficiente. 
<P>
Broken Sword funciona en DOS o Win 95 y posee un amistoso programa
de instalaci&oacute;n que incluye, adem&aacute;s, un peque&ntilde;o
machacaladrillos para que te distraigas durante la copia de archivos.
Puedes instalar un m&iacute;nimo de 18 MB en tu HD pero, si tienes
espacio, una instalaci&oacute;n media de 155 MB o completa de
200 MB es preferible. El juego viene en dos CDs que expulsa autom&aacute;ticamente
sin ning&uacute;n tipo de aviso cuando hay que cambiarlos - una
opci&oacute;n que casi me mata del susto. Incluido en el paquete
hay un libreto, 'Luchadores Salvajes', una breve historia de los
Caballeros del Templario que proporciona informaci&oacute;n sobre
el tema de la historia. No es necesario leerlo para jugar el juego,
es mejor leer el manual, pero all&iacute; las letras son tan peque&ntilde;as
que posiblemente tendr&aacute;s que embarcarte en tu propia aventura
en busca de aquella vieja lupa que no has visto en a&ntilde;os.
<P>
<B>&Uacute;tiles opciones</B> 
<P>
Es posible cometer un error con horribles consecuencias en este
juego (y te recomendar&iacute;a hacerlo simplemente para ver lo
que pasa), a&uacute;n as&iacute;, hay muchas posiciones para salvar
la partida que permiten experimentar. Otra opci&oacute;n del juego
es la de sacar por pantalla texto para todas las conversaciones
y descripciones. Es divertido y no muy molesto, resultando &uacute;til
para todos: para novatos y para jugadores experimentados que tambi&eacute;n
saben disfrutar aventuras gr&aacute;ficas de este tipo. 
<P>
Por alguna raz&oacute;n inexplicable Broken Sword est&aacute;
siendo vendido en algunos pa&iacute;ses como &quot;C&iacute;rculo
de Sangre&quot;, posiblemente con la esperanza que la simple menci&oacute;n
de la sangre har&aacute; subir el nivel de adrenalina de aquellos
que buscan un juego violento. Esas persosas van a llevarse una
decepci&oacute;n, mientras que aquellos que realmente disfrutar&iacute;an
el juego probablemente ni lo mirar&aacute;n. Iron&iacute;as aparte,
&quot;Broken Sword&quot; me gust&oacute; y enganch&oacute; de
principio a fin; lo acab&eacute; muy r&aacute;pido y me qued&eacute;
con ganas de m&aacute;s. Afortunadamente, y tras mirar los cr&eacute;ditos
hasta el final, descubr&iacute; que habr&aacute; una secuela.
&#161;Por favor! 
<P>
<I><B>Copyright</B></I><B> &copy; Gordon Aplin 1996. Todos los
derechos reservados.</B>
<HR>
<P>
<CENTER><FONT SIZE=2>La versi&oacute;n original de este art&iacute;culo
fue escrita por <B>Gordin Aplin</B> y publicada en</FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>&quot;<A HREF="http://www.iinet.net.au/~quandary/">Quandary, The magazine for Adventure, Puzzle and RPG players</A>&quot;</FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>y ha sido adaptada por <B>Ra&uacute;l &Aacute;lvarez</B>.</FONT></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Comentarios</A>]</CENTER>
</BODY>
</HTML>
