<HTML>
<HEAD>
<TITLE>SQ Comentario: Broken Sword II</TITLE>

<META NAME="DESCRIPTION" CONTENT="Review de Broken Sword II">
<META NAME="AUTHOR" CONTENT="Raul Alvarez">
<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#ffffff" TEXT="#000000" LINK="#808080" VLINK="#808080">
<P>
<CENTER><FONT SIZE=7>B</FONT><FONT SIZE=6>ROKEN </FONT><FONT SIZE=7>S</FONT><FONT SIZE=6>WORD
</FONT><FONT SIZE=7>II</FONT></CENTER>
<P>
<CENTER><FONT SIZE=5>LAS FUERZAS DEL MAL</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-bs2-1.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo: </FONT></B><FONT SIZE=2>Aventura
gr&aacute;fica <B>Casa:</B> Revolution Software <B>Autores:</B>
Dave Cummins, Jonathan Howard</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma:</FONT></B><FONT SIZE=2> Voces
y textos en castellano <B>Distribuidor:</B> Virgin <B>Precio:</B>
6990 pesetas</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Versiones:</FONT></B><FONT SIZE=2> PC
Windows 95 / NT CDROM y Playstation</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Requerimientos versi&oacute;n PC:</FONT></B><FONT SIZE=2>
Windows 95 / NT con DirectX, procesador Pentium, 8 MB RAM, 60
MB HD, tarjeta de v&iacute;deo compatible con DirectDraw capaz
de mostrar 256 colores en una resoluci&oacute;n de 640x480 puntos,
tarjeta de sonido compatible con DirectSound, rat&oacute;n, lector
CDROM 4x</FONT></CENTER>
<HR>
<P>
<FONT SIZE=5>H</FONT>a transcurrido poco m&aacute;s de un a&ntilde;o
desde la publicaci&oacute;n de <I>Broken Sword: La Leyenda de
Los Templarios</I> y ya nos ha llegado su secuela, <I>Las Fuerzas
del Mal</I>, adaptada &iacute;ntegramente al castellano.
<P>
<TABLE>
<TR><TD><B><IMG SRC="c-bs2-2.jpg" ALIGN="RIGHT"></B> <FONT SIZE=5>E</FONT>s de dominio p&uacute;blico que el g&eacute;nero de las aventuras gr&aacute;ficas ha perdido popularidad en los &uacute;ltimos meses, en parte por culpa de demasiados t&iacute;tulos que no cumplieron las espectativas que se hab&iacute;a puesto en ellos o que no tuvieron la calidad suficiente. Por otro lado, no todo el mundo tiene cientos de horas libres para dedicarse a jugar dif&iacute;ciles e interminables aventuras s&oacute;lo aptas para mentes privilegiadas o aventureros experimentados. Con todo esto en mente el objetivo de los escritores de Revolution ha sido crear una aventura en la que prime calidad sobre cantidad, diversi&oacute;n sobre frustraci&oacute;n.
<P>
<FONT SIZE=5>E</FONT>s por eso que <I>Broken Sword II</I> es bastante lineal, f&aacute;cil y sobre todo corta, pero tambi&eacute;n entretenida, agradable y audiovisualmente impresionante. Incluye adem&aacute;s un mont&oacute;n de sorpresas, <I>cameos</I> y reencuentros que seguramente agradar&aacute;n a todos los que jugaron al episodio anterior.
</TD></TR>
<TR><TD><B><IMG SRC="c-bs2-3.jpg" ALIGN="RIGHT"></B><FONT SIZE=5>E</FONT>l juego comienza con George y Nico (que se acaban de reunir despu&eacute;s de varios meses sin verse) visitando la casa de un experto en artefactos mayas que ha contactado con Nico por un asunto relacionado con unas antiguas piedras. Al llegar a la casa, en lugar de encontrar al arque&oacute;logo, se encuentran con dos indios que les tienden una emboscada, secuestrando a Nico y dejando a George atado a una silla dentro de una habitaci&oacute;n en llamas y con una enorme ara&ntilde;a con pinta de venenosa acerc&aacute;ndose. Es el comienzo de una aventura que llevar&aacute; a la pareja por M&eacute;xico, el Caribe, Londres y Par&iacute;s.
<P>
<FONT SIZE=5>L</FONT>a puesta en escena cuenta con secuencias de dibujos animados de alta calidad y fondos dibujados a mano muy bien acabados sobre los que se mueven los distintos personajes. Las animaciones son suaves y est&aacute;n muy bien hechas, e incluyen en esta ocasi&oacute;n efectos especiales como sombras, brillos y difuminado de los p&iacute;xels. Las localidades son grandes y mientras caminas por ellas la pantalla se va moviendo mediante el deslazamiento de varios planos, con lo que se consigue un gran efecto de profundidad. La m&uacute;sica acompa&ntilde;a la mayor&iacute;a del tiempo y resulta muy agradable de escuchar, y adem&aacute;s ayuda a potenciar en cada momento la emoci&oacute;n adecuada: misterio, humor, tristeza, ...
</TD></TR>
<TR><TD><B><IMG SRC="c-bs2-4.jpg" ALIGN="RIGHT"></B><FONT SIZE=5>L</FONT>a interfaz es una versi&oacute;n ligeramente simplificada de la que se us&oacute; en <I>La Leyenda de Los Templarios</I>, y consiste b&aacute;sicamente en un cursor inteligente que al ser movido mediante el rat&oacute;n por la pantalla resalta los elementos con los que podemos actuar. Una pulsaci&oacute;n con el bot&oacute;n derecho ofrece una descripci&oacute;n del objeto en cuesti&oacute;n, y una pulsaci&oacute;n del izquierdo activa la acci&oacute;n necesaria: hablar, coger, usar, ... Dado que los personajes protagonistas caminan con bastante lentitud, para este juego se ha implementado al fin una opci&oacute;n para acceder autom&aacute;ticamente a las localidades contiguas mediante el doble click en las salidas (esta opci&oacute;n aparec&iacute;a documentada en las instrucciones de <I>Broken Sword I</I> pero no se lleg&oacute; a incluir en el juego real). Es posible coger objetos y ponerlos en un inventario situado en la parte inferior de pantalla para poder usarlos m&aacute;s tarde o preguntar a otros personajes por ellos. El sistema de conversaciones permite dirigir el di&aacute;logo seg&uacute;n temas que vienen representados por iconos o objetos del inventario.
<P>
<FONT SIZE=5>L</FONT>a historia se narra mediante peque&ntilde;os episodios en los que manejamos a George o a Nico en zonas de unas tres o cuatro localidades, en las que deben resolver algunos puzles y hablar con distintos personajes para conseguir avanzar. El desarrollo es lineal y como en todo momento el margen de acci&oacute;n se limita a unas pocas pantallas y objetos, no es dif&iacute;cil dar con la soluci&oacute;n de la mayor&iacute;a de problemas en poco tiempo. Dependiendo de la experiencia del jugador, llegar hasta el final de la aventura puede llevar de diez (expertos) a veinte (novatos) horas, lo cual est&aacute; bastante lejos de las sesenta horas prometidas en la publicidad del juego.
<P>
<FONT SIZE=5>B</FONT><B>roken Sword II: Las Fuerzas del Mal </B>es una buena aventura, aunque a mi entender no todo lo buena que cab&iacute;a esperar, y que me ha decepcionado especialmente en la parte argumental, al desaprovechar gran parte del potencial que la tradici&oacute;n maya / azteca tiene. Lo bueno si es breve dos veces bueno, pero <I>Broken Sword II</I> no es TAN bueno - y s&iacute; MUY breve. Esperemos que el tercer episodio ya previsto de la serie avance en este aspecto.
</TD></TR>
</TABLE>
<HR>
<P>
<B>Lo Mejor:<BR>
</B>Gr&aacute;ficos y m&uacute;sica.
<P>
<B>Lo Peor:<BR>
</B>Los problemas que tanta gente tiene con DirectX.
<P>
<B>Recomendado especialmente a:<BR>
</B>Entusiastas del primer episodio.
<P>
<B>Abst&eacute;nganse:<BR>
</B>Amantes de las aventuras largas y complicadas.
<P>
<B>La Pista:<BR>
</B>Si con un poco de absentina no consigues tu objetivo, prueba
aumentando la dosis.
<P>
Comentario por <B>Ra&uacute;l &Aacute;lvarez</B>.<BR>
Pulsa <A HREF="http://www.meristation.dirac.es/reviews/brokenii.htm" >aqu&iacute;</A>
para leer el review de <B>El B&aacute;rbaro</B> disponible en
<A HREF="http://www.meristation.dirac.es/"><B>Meristation Magazine</B></A>.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
</BODY>
</HTML>
