<HTML>
<HEAD>
<TITLE>SQ Comentario: Wearing The Claw</TITLE>
</HEAD>
<BODY>
<P>
<CENTER><B><FONT SIZE=6>WEARING THE CLAW</FONT></B></CENTER>
<P>
<CENTER><B>(Release 2)</B></CENTER>
<P>
<CENTER><B>Autor</B>: Paul O'Brian</CENTER>
<P>
<CENTER><B>Idioma</B>: Ingl&eacute;s</CENTER>
<P>
<CENTER><B>Precio</B>: Freeware</CENTER>
<P>
<CENTER><B>Tipo</B>: Aventura de texto</CENTER>
<P>
<CENTER><B>Sistema</B>: Cualquiera que posea un int&eacute;rprete
de Infocom, o sea casi todos</CENTER>
<P>
<CENTER><B>Requisitos m&iacute;nimos</B>: 125 Kb de espacio en
disco</CENTER>
<HR>
<P>
He aqu&iacute; uno de los participantes del IF Contest de este
a&ntilde;o. Wearing the Claw recuerda mucho a Enchanter, uno de
los cl&aacute;sicos de Infocom, ya que a parte de que el objetivo
es similar, la atm&oacute;sfera que crea es muy pareja.
<P>
Marnian, el mago (y tambi&eacute;n malo) de turno, tiene desde
hace tiempo a nuestra provincia sumida totalmente en la pobreza.
No satisfecho con esto, maldijo a todos lo que viv&iacute;an en
ella a desarrollar miembros no humanos. As&iacute; el protagonista
posee una garra de lobo, en el lugar donde deber&iacute;a tener
su mano izquierda.
<P>
Como no, nuestro personaje - un chico, hijo de humildes campesinos
- acepta la misi&oacute;n que nos encomienda Lord Midel. Tenemos
que librar la regi&oacute;n de Marnian, y para ello deberemos
encontrar un objeto m&aacute;gico, el colgante de Elinor. Midel
recita un encantamiento, roc&iacute;andonos con unos brillantes
polvos m&aacute;gicos, y nos teletransporta lejos de all&iacute;.
En un camino de tierra, solos y con el fr&iacute;o viento azot&aacute;ndote
la cara dar&aacute; comienzo la aventura&#133;
<P>
Wearing the Claw no resulta excesivamente complicado, y m&aacute;s
cuando incorpora un sencillo pero efectivo sistema de pistas estilo
invisiclues. Para quien no lo sepa, este sistema facilita pistas
(hints), pero de un modo muy caracter&iacute;stico: se clasifican
seg&uacute;n el area a la que pertenezcan, y no son m&aacute;s
que preguntas, de las que podemos ver respuestas que ser&aacute;n
tan expl&iacute;citas como deseemos. As&iacute;, en un principio
la respuesta original parecer&aacute; que no dice nada, para que
gradualmente d&eacute; m&aacute;s informaci&oacute;n, hasta llegar
a decir exactamente lo que tenemos que teclear (por si no tenemos
un d&iacute;a demasiado inspirado).
<P>
La aventura se deja jugar bastante bien, siendo la mayor&iacute;a
de problemas l&oacute;gicos, y la ambientaci&oacute;n y el estilo
notables, que a&ntilde;adido a un parser realmente eficaz (no
se pod&iacute;a esperar menos, pues se utiliz&oacute; el lenguaje
Inform en su creaci&oacute;n) hacen del juego de Paul O'Brian
entretenido, aunque hay que reconocer que tampoco es nada del
otro mundo.
<HR>
<P>
<B>Recomendado especialmente a:</B>
<P>
Aventureros que busquen relajarse un rato.
<P>
<B>Abst&eacute;nganse:</B> 
<P>
Personas que no puedan soportar el no tener su mano sobre el rat&oacute;n.
Lo siento, aqu&iacute; no hay point&amp;click.
<P>
<B>Principales defectos:</B> 
<P>
Resulta evidente que le falta un poco de trabajo. Obtenemos demasiadas
respuestas por defecto tipo: 'Eso es algo a lo que no necesitas
referirte en la aventura' o 'No puedes ver eso'. Esto lo podemos
hacer extensible a los PSI's, que responden a muy pocas cosas.
Estoy seguro de que muy pronto tendremos una nueva 'release' (versi&oacute;n
mejorada). 
<P>
<B>La pista:</B> 
<P>
M&iacute;rate la garra que tienes como mano, &#191;no crees que
podr&iacute;a asustar a la gente?
<P>
<I>Este comentario ha sido posible gracias a la bondad infinita
de <B>Daniel C&aacute;rdenas</B>.<BR>
</I>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
