<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: CLANDESTINY</TITLE>
<META NAME="AUTHOR" CONTENT="El Hijo del Demonio...Jaaaaarl!!!">
<META NAME="GENERATOR" CONTENT="Yo mismo con el bloc de notas ;)">
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#ffff00" VLINK="#ffff00">
<P>
<CENTER><TT><FONT SIZE=7>CLANDESTINY</FONT></TT></CENTER>
<P>
<CENTER><TT>COMENTARIO POR <B><FONT SIZE=2 FACE="Courier New">LINCE</FONT></B></TT></CENTER>
<P>
<CENTER><TT>(sobre la versi&oacute;n en ingl&eacute;s) </TT></CENTER>
<P>
<CENTER><TT><B><FONT SIZE=2 FACE="Courier New">TIPO</FONT></B>:
Aventura gr&aacute;fica en primera persona<BR>
<B><FONT SIZE=2 FACE="Courier New">PRODUCTORA</FONT></B>: TRILOBYTE
<BR>
<B><FONT SIZE=2 FACE="Courier New">DISTRIBUIDORA EN ESPA&Ntilde;A</FONT></B>:
ELECTRONIC ARTS<BR>
<B><FONT SIZE=2 FACE="Courier New">REQUERIMIENTOS DE SISTEMA</FONT></B>:
Windows 95, Pentium 60Mz, 8MB RAM, CD2X, Tarjeta v&iacute;deo
capaz de mostrar miles de colores y tarjeta de sonido Sound Blaster
o 100% compatible, ambos con soporte para DirectX, rat&oacute;n
compatible con Windows 95 y 8 MB de disco duro libre.<BR>
<B><FONT SIZE=2 FACE="Courier New">N&Uacute;MERO DE CDs</FONT></B>:
2<BR>
<B><FONT SIZE=2 FACE="Courier New">NOTA</FONT></B>: En la web
de trilobyte hay disponibles FAQ's de audio / v&iacute;deo y drivers
para algunas tarjetas de v&iacute;deo (<A HREF="http://www.tbyte.com/support/clansupp.htm" >http://www.tbyte.com/support/clansupp.htm</A>)</TT></CENTER>
<HR>
<P>
<TT>Andrew MacPhiles (el protagonista de esta historia) es el
heredero y &uacute;ltimo descendiente de un clan escoc&eacute;s
muy especial, el clan de los MacPhiles. Haciendo honor a su estirpe,
es un individuo cobarde y paranoico con una caracter&iacute;stica
muy especial: tiene seis dedos en cada mano. A su apartamento
de Nueva York llega una carta comunic&aacute;ndole que tras la
muerte del 12&#186; Conde MacPhiles, &eacute;l es el &uacute;nico
y leg&iacute;timo heredero del castillo de los MacPhiles, sus
tierras y todo lo que ello conlleva. Convencido por su novia Paula,
ambos marchan a Escocia para tomar posesi&oacute;n del castillo
y, sin saberlo, enfrentarse a la maldici&oacute;n que ha mantenido
atormentada a su familia durante siglos, cumpliendo as&iacute;
una antigua profec&iacute;a. As&iacute;, el juego comienza con
una secuencia de v&iacute;deo en la que Andrew y Paula se dirigen
en coche hacia el castillo...</TT>
<P>
<TT>El juego transcurre durante la noche de la llegada al castillo.
Paula, obsesionada por encontrar alg&uacute;n tipo de tesoro y
Andrew, horrorizado por lo t&eacute;trico de lugar, acompa&ntilde;ados
por Fergus, el gu&iacute;a del castillo, recorren todas las habitaciones,
resolviendo adivinanzas y puzzles. Durante este recorrido, Andrew
tiene la oportunidad de conocer a los fantasmas de todos los miembros
del clan, sus antepasados, quienes le ayudar&aacute;n a librarse
de la bestia.</TT>
<HR>
<P>
<TT><B><FONT SIZE=2 FACE="Courier New">Lo peor</FONT></B>: Los
requerimientos de sistema. El idioma. Algunos de los enigmas,
r&eacute;plicas de los de The 7th Guest. Las adivinanzas, la mayor&iacute;a
son iguales.</TT>
<P>
<TT><B><FONT SIZE=2 FACE="Courier New">Lo mejor</FONT></B>:La
caracterizaci&oacute;n de los personajes del juego. El sonido.
La duraci&oacute;n.</TT>
<P>
<TT><B><FONT SIZE=2 FACE="Courier New">Imprescindible</FONT></B>
para incondicionales de The 7th Guest &amp; The 11th Hour. </TT>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</CENTER>
<BR>
</BODY>
</HTML>
