<HTML>
<HEAD>
<TITLE>SQ Comentario: The Dig</TITLE>
</HEAD>
<BODY>
<P>
<CENTER><B><FONT SIZE=7>The Dig</FONT></B></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo: </FONT></B><FONT SIZE=2>Aventura
gr&aacute;fica <B>Casa</B>: LucasArts <B>Autor</B>: Sean Clark
<B>Con la participaci&oacute;n de</B>: Brian Moriarty (historia),
Orson Scott Card (di&aacute;logos), Steven Spielberg <B>Versi&oacute;n
en castellano</B>: ERBE Software <B>Precio</B>: 8000 pts.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: MSDOS
6.0, 486 DX2, 8 Mb RAM, disco duro, CD 2x, VGA</FONT></CENTER>
<HR>
<P>
Todo comienza cuando en una estaci&oacute;n de seguimiento de
Borneo se detecta un asteroide que va a colisionar con la tierra.
En seguida se forma una expedici&oacute;n con el objetivo aparente
de destruirlo. Los integrantes del grupo son el comandante Boston
Low, miembro del ej&eacute;rcito, Ludwig Brink, un conocido y
famoso ge&oacute;logo y arque&oacute;logo y Maggie Robins, una
popular periodista experta en idiomas. El objetivo de la misi&oacute;n
es llegar al asteroide mediante un transbordador y colocar all&iacute;
unas cargas explosivas para desviar su trayectoria e impedir as&iacute;
que colisione con la Tierra.<BR>
Tras liberar a la tierra de la cat&aacute;strofe la expedici&oacute;n
aprovecha para explorar el asteroide. En su interior se detectan
formas y estructuras que claramente no son obra de la naturaleza.
Una serie de manipulaciones provocan que el asteroide se transforme
en una astronave y realice un viaje c&oacute;smico. Tras &eacute;ste,
Low, Brink y Maggie se encuentran en la superfice de un planeta
que les es totalmente desconocido. Alguien les ha llevado hasta
all&iacute;. Nadie les recibe.
<P>
<TABLE >
<TR><TD WIDTH=292><B><IMG SRC="c-dig-a.jpg" ALT="IMAGEN"></B>
</TD><TD WIDTH=291><B><IMG SRC="c-dig-b.jpg" ALT="IMAGEN"></B>
</TD></TR>
<TR><TD WIDTH=292><CENTER><FONT SIZE=2>Los tres protagonistas de la historia</FONT></CENTER>
</TD><TD WIDTH=291><CENTER><FONT SIZE=2>Superfice del nuevo planeta</FONT></CENTER>
</TD></TR>
</TABLE>
<P>
La sensaci&oacute;n de soledad y la necesidad y el ansia de conocer
y explorar eclipsan el miedo. Somos exploradores, arque&oacute;logos
tratando de aprender algo del entorno. Nos encontramos en otro
mundo, en otra civilizaci&oacute;n en la que las cosas pueden
haber sido concebidas de un modo distinto. A lo largo del juego
vamos descubriendo la civilizaci&oacute;n extraterrestre, y hemos
de aprender a movernos en un &aacute;mbito que nos es hostil y
desconocido, un entorno engendrado por una inteligencia distinta
a la nuestra.<BR>
La ambientaci&oacute;n del juego es muy buena: los gr&aacute;ficos
muestran perfectamente todos los rasgos del nuevo mundo y la m&uacute;sica
continua da la trascendencia oportuna en cada momento. Los videos
nos introducen todav&iacute;a m&aacute;s en el juego. 
<P>
El gui&oacute;n es de una calidad que pocas aventuras gr&aacute;ficas
tienen aunque cuenta con alg&uacute;n ligero abujerillo. Tambi&eacute;n
hay que decir que los personajes resultan bastante t&oacute;picos.
<P>
Los textos y las voces se encuentran traducidos al castellano
y pese a que a&uacute;n queda un trecho para llegar a ser una
traducci&oacute;n perfecta es de lo mejor que se ha hecho hasta
la fecha.
<P>
El juego se maneja con una interfaz que va bastante bien. Los
personajes caminan, como viene siendo &uacute;ltimamente, a la
velocidad real, lo cual, dado lo extenso del mapeado del juego
se hace bastante pesado. Viene bien recordar que haciendo doble
clic en las salidas se accede directamente.
<P>
Los puzzles no son demasiado abundantes y son en gran parte del
tipo inventario (recojo este objeto aqu&iacute; y lo aplico all&aacute;).
Tambi&eacute;n aparecen en el juego varios puzzles de l&oacute;gica
que se pueden resolver bien pensando o utilizando la fuerza bruta
(es decir - a base de pruebas).
<P>
El juego no es demasiado dif&iacute;cil si se est&aacute; acostumbrado
a las aventuras de Lucasarts, pero hay algunos puzzles de utilizar
el objeto exacto (cuando otros son perfectos candidatos) en el
momento exacto que no hacen nada m&aacute;s que frustrar al jugador
y que carecen de inter&eacute;s.<BR>
En definitiva, nos encontramos ante una aventura de excepcional
calidad, con un excelente gui&oacute;n, realizaci&oacute;n y ambientaci&oacute;n
que nos hace especialmente part&iacute;cipes de la historia. Pese
a que hay algunos defectillos, el resultado final es un mont&oacute;n
de horas de intensa diversi&oacute;n que pocos juegos proporcionan.
<BR>
<P>
<B>David Torrens </B>(&#161;ya era hora de que aparecieran caras
nuevas por aqu&iacute;!)
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
