<HTML>
<HEAD>
   <TITLE>SQ Comentario: Mundodisco II</TITLE>
</HEAD>
<BODY BGCOLOR="#FF9900">

<CENTER><P><FONT SIZE=+4>MUNDODISCO II</FONT> </P></CENTER>

<CENTER><P><FONT SIZE=-1><B>Casa</B>: Perfect Entertainment / Psygnosis
<B>Tipo</B>: Aventura Gr&aacute;fica <B>Idioma</B>: Castellano <B>Comentario
por</B>: Gordon Aplin</FONT> </P></CENTER>

<CENTER><P><IMG SRC="c-discw2.jpg" HEIGHT=157 WIDTH=208> </P></CENTER>

<CENTER><P><FONT SIZE=-1><B>Requerimientos de Sistema</B>: 486DX4 100 o
superior (Pentium 90 o superior recomendado) 16 MB RAM para Win 95 o 8
MB para DOS (versi&oacute;n 6.0 o posterior) 640x480 256-colores SVGA,
2xCD ROM, tarjeta de sonido y rat&oacute;n. Cerebro mono-hemisferio electro-coloidal
con funcionalidad cognitiva (doble-hemisferio recomendado).</FONT> 
<HR></P></CENTER>

<P><B>MUNDODISCO II</B> trata de La Muerte. No del hecho de fenecer en
s&iacute; (algo que no pasa mucho en el juego) sin&oacute; del curioso
(y familiar) fantasma de la Muerte que anuncia a los desafortunados habitantes
del Mundodisco que su tiempo se ha agotado. He tomado prestado este melodram&aacute;tico
comienzo del manual del juego, y pese a que los autores del &uacute;til
escrito admiten claramente que el juego trata realmente de Rincewind, empezar&eacute;
por el principio... </P>

<P><B><FONT SIZE=+1>La Muerte se va de vacaciones</FONT></B> </P>

<P>Parece que La Muerte (o al menos la personificaci&oacute;n antropom&oacute;rfica
que s&oacute;lo suele ser visible para los magos de Mundodisco) ha abandonado
su trabajo y ha emprendido una vida m&aacute;s relajada en climas m&aacute;s
c&aacute;lidos. Como consecuencia, las personas que han de <I>dejar</I>
este mundo quedan a la espera de que alguien les lleve a <I>un lugar mejor</I>.
La inesperada defunci&oacute;n del mago Windle Poons llama la atenci&oacute;n
del Archicanciller de la Universidad Invisible sobre el desafortunado problema.
Alguien de quien se pueda prescincir es requerido para reunir los improbables
objetos necesarios para celebrar la ceremonia que devolver&aacute; a La
Muerte a su lugar original en El Orden de Todas Las Cosas. </P>

<P>Aqu&iacute; es cuando entra Rincewind. Como sabr&eacute;is los que hab&eacute;is
jugado el primer Mundodisco, Rincewind es un simp&aacute;tico (pero no
muy competente) aprendiz de mago. Nada le gustar&iacute;a m&aacute;s que
dedicar su vida a descansar, pero parece estar destinado a correr aventuras
en las que ha de conseguir objetos de la forma m&aacute;s rebuscada posible;
para colmo tiene una cierta tendencia a que le confundan por mujer debido
a su vestido, ejem, traje de mago. </P>

<P>Como el primer juego, Mundodisco II est&aacute; dividido en cuatro actos,
los tres primeros muy largos y bastante complejos. Localizar a La Muerte
y llevarla de nuevo por el &quot;buen camino&quot; no es una tarea sencilla
que muchos aventureros que conozco no conseguir&iacute;an. El cuarto acto
(incluyendo el ep&iacute;logo) es mucho m&aacute;s corto, acab&aacute;ndose
el juego bastante r&aacute;pidamente despu&eacute;s de todo el trabajo
que hay que poner para llegar a ese punto. Esto no es necesariamente una
cr&iacute;tica, s&oacute;lo una observaci&oacute;n, supongo que me lo estaba
pasando bien y no ten&iacute;a ganas de que el juego acabara. La conclusi&oacute;n
del juego nos permite regresar a nuestra mundana vida dejando que Rincewind
se eche una siestecilla al fin. </P>

<P><B><FONT SIZE=+1>Mira y escucha</FONT></B> </P>

<P>Este juego no es tan complejo como su predecesor, o, al menos, no incluye
viajes en el tiempo, Teor&iacute;a del Caos o mariposas. A&uacute;n as&iacute;,
tendr&aacute;s que usar tu imaginaci&oacute;n y tu inventiva para lograr
superar muchos de los obst&aacute;culos que hallar&aacute;s. Algunas personas
seguramente encontrar&aacute;n algunos de los puzzles demasiado retorcidos,
pero las pistas est&aacute;n all&iacute; si est&aacute;s preparado para
observar cuidadosamente (especialmente objetos del inventario) y hablar
con todo el mundo. </P>

<P>La conversaci&oacute;n incluye algunas secuencias autom&aacute;ticas
en las que no tienes ning&uacute;n control y otras en las que una ventana
de di&aacute;logo te permite elegir iconos que representan preguntas, sarcasmo,
comentarios y temas que hayas descubierto en el transcurso del juego. Pese
que la mayor&iacute;a del di&aacute;logo (incluyendo muchas de las observaciones
de Rincewind) es simplemente humor&iacute;stico, en algunos momentos orienta.
Hay mucha conversaci&oacute;n en Mundodisco II, cosa que a m&iacute; no
me molesta si el juego es suficiente entretenido pero que puede resultar
aburrido a muchas personas. Afortunadamente puedes pasar r&aacute;pido
las conversaciones, o incluso esquivar las conversaciones que ya has tenido;
una opci&oacute;n de texto puede usarse para acelerar las cosas en caso
de que tus ojos sean m&aacute;s r&aacute;pidos que tus o&iacute;dos. Lamentablemente
perdar&aacute;s parte de la diversi&oacute;n porque el di&aacute;logo es
muy importante en el juego. </P>

<P><B><FONT SIZE=+1>M&aacute;s Monty Python</FONT></B> </P>

<P>Aunque basado en el loco mundo de Terry Pratchett, el humor de este
juego (y como ocurriera con Mundodisco I) debe mucho a los Monty Python,
especialmente a su pel&iacute;cula &quot;La Vida de Brian&quot;. Tambi&eacute;n
son muy divertidos los chistes de Rincewind sobre el g&eacute;nero de las
aventuras y la escena donde La Muerte imita varios famosos personajes del
mundo del cine. M&aacute;s importante a&uacute;n, Eric Idle ha vuelto a
poner la voz a Rincewind; de hecho tras los dos juegos cuesta imaginarse
a otra persona haci&eacute;ndolo. Adecuadamente le acompa&ntilde;an Nigel
Planer, Kate Robbins y Rob Brydon, aunque he de admitir que he echado en
falta a Tony Roberson y a Jon Pertwee del primer juego. Y por alguna extra&ntilde;a
raz&oacute;n la voz de La Muerte me recuerda a Marvin, el androide paranoico
de &quot;The Hitchiker's Guide to the Galaxy&quot;. </P>

<P>Como persona que disfrut&oacute; el primer Mundodisco me alegro de poder
decir que no se ha estropeado su excelente f&oacute;rmula en esta secuela.
Los gr&aacute;ficos, aunque son muy buenos, son algo diferentes, menos
detallados, y adem&aacute;s la apariencia de Rincewind ha sido modificada
ligeramente. Parece una caricatura algo envejecida del original. Recuerdo
haber tenido una sensaci&oacute;n de incomodidad con los gr&aacute;ficos
al principio del juego, cosa que no dur&oacute; m&aacute;s que los pocos
segundos que tard&eacute; en acostumbrarme. Las escenas intermedias y muchas
de las peque&ntilde;as animaciones son encantadoras. A&uacute;n as&iacute;
algunas pantallas tienen tantas cosas que algunos jugadores con ordenadores
poco potentes experimentar&aacute;n problemas de velocidad. </P>

<P><B><FONT SIZE=+1>Controlando tu personaje y el juego<BR>
</FONT></B>Esta es una aventura en perspectiva de tercera persona, lo que
significa que el jugador controla a Rincewind en la pantalla. Cuando digo
&quot;controla&quot; me refiero a &quot;aquello que se le permite&quot;,
porque Rincewind parece tener una mente propia y no se corta un pelo a
la hora de criticarte si le ordenas hacer algo que le parezca est&uacute;pido.
El problemas es que cosas aparentemente est&uacute;pidas suelen funcionar
as&iacute; que tendr&eacute;is que poneros de acuerdo para atravesar todo
el juego. El interfaz se puede controlar via teclado o rat&oacute;n y el
cursor es la conocida <I>vengala de estrellas</I> del primer juego (he
de admitir que en algunos momentos la perd&iacute;a de vista entre los
fondos). Los <I>puntos calientes</I> - personajes y objetos con los que
se puede interactuar son resaltados y nombrados en pantalla. Una <I>mano
se&ntilde;alando</I> te saca, generalmente, a la esquina de la pantalla,
pero (atenci&oacute;n: pista) no conf&iacute;es totalmente en esto. Examina
todas las esquinas porque algunas pantallas hacen scroll y revelan lugares
extra. Claro que no hace falta que os avise de esto a vosotros, aventureros
expertos que nunca caer&iacute;ais en esa trampa, &iquest;no? &iexcl;vaya,
yo ca&iacute;! El ba&uacute;l con patas vuelve a ser el inventario principal
del juego, pudi&eacute;ndose modificar el tama&ntilde;o de su ventana arrastrando
las esquinas. Y no olvides que Rincewind tambi&eacute;n puede llevar uno
o dos objetos raros -- a veces muy raros -- en sus bolsillos. Eso son dos
pistas en un p&aacute;rrafo, lo pr&oacute;ximo ya ser&aacute; la soluci&oacute;n
completa del juego. </P>

<P>Mundodisco II viene en dos CDs y se puede instalar tanto en Windows
95 (recomendado en el manual) como en DOS. En resumidas cuentas es un entretenido
juego, con muchas cosas que hacer y alocados lugares para visitar. Como
ya mencion&eacute; antes es algo m&aacute;s f&aacute;cil que su predecesor
y, trat&aacute;ndo de La Muerte, posee un humor es algo m&aacute;s negro
- dudo haber visto tantas escenas de Muerte en otro juego, pese a que la
propia Muerte no marca demasiadas muescas en su guada&ntilde;a. Si jugaste
y disfrutaste el primer Mundodisco seguramente esta aventura te gustar&aacute;;
si no has jugado el primer juego &eacute;ste te dar&aacute; ganas de hacerlo.
</P>

<H4><I>Copyright</I> &copy; Gordon Aplin 1997. Todos los derechos reservados.</H4>

<P>
<HR></P>

<CENTER><P><FONT SIZE=-1>La versi&oacute;n original de este art&iacute;culo
fue escrita por <B>Gordin Aplin</B> y publicada en</FONT> </P></CENTER>

<CENTER><P><FONT SIZE=-1>&quot;<A HREF="http://www.iinet.net.au/~quandary/">Quandary,
The magazine for Adventure, Puzzle and RPG players</A>&quot;</FONT> </P></CENTER>

<CENTER><P><FONT SIZE=-1>y ha sido adaptada por <B>Ra&uacute;l &Aacute;lvarez</B>.</FONT>

<HR></P></CENTER>

<CENTER><P>[<A HREF="coment.htm">Volver</A>] </P></CENTER>

</BODY>
</HTML>
