<HTML>
<HEAD>
<TITLE>SQ Comentario: Dark Seed II</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#c0c0c0" VLINK="#c0c0c0">
<P>
<CENTER><B><FONT SIZE=7>DARK SEED II</FONT></B></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica</FONT> <B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>:
Cyberdreams</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores</FONT></B><FONT SIZE=2>: Raymond
Benson, Peter Delgado, Jeff Hilbers; basado en la obra fant&aacute;stica
de H.R. Giger</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma</FONT></B><FONT SIZE=2>: Castellano</FONT>
<B><FONT SIZE=2>Precio</FONT></B><FONT SIZE=2>: 7.990 pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Requisitos m&iacute;nimos</FONT></B><FONT SIZE=2>:
Windows 3.1, 486 DX, 8 Mb RAM, CD 2X, 20 Mb HD, 640x480x256 colores</FONT></CENTER>
<P>
<CENTER><B>Comentario por</B>: Carlos S&aacute;nchez</CENTER>
<HR>
<P>
Nos encontramos ante la continuaci&oacute;n de una antigua aventura
gr&aacute;fica: Darkseed.
<P>
Aquella aventura sorprendi&oacute; en su &eacute;poca por ser
la primera (al menos que yo recuerde) que se dio a conocer a gran
escala realizada en alta resoluci&oacute;n, con gr&aacute;ficos
a 16 colores (cuando la costumbre eran 256 colores a 320x200).
Sin embargo la calidad de las im&aacute;genes de 16 colores era
tal que casi daba la impresi&oacute;n de estar jugando en SVGA.
Darkseed nos pon&iacute;a en el papel de Mike Dawson, un escritor
que alquilaba una casa en la que acabar&iacute;a por tener contacto
con un mundo paralelo y monstruoso del otro lado del espejo.
<P>
En esta segunda parte Mike a&uacute;n no se ha recuperado ps&iacute;quicamente
del trance de la primera, cuando ya viviendo en casa de sus madre,
una amiga suya es asesinada de modo misterioso, durante un ataque
de amnesia de nuestro protagonista. La polic&iacute;a le tiene
por sospechoso y, mientras &eacute;l busca la soluci&oacute;n
al crimen se da cuenta de que los Antiguos est&aacute;n de nuevo
rondando, ahora en su pueblo natal (que mala suerte tiene el t&iacute;o
;-) )
<P>
Los adelantos en el mundo del PC han llevado a hacer de Darkseed
II una aventura en 256 colores con resoluci&oacute;n de 640x480,
funcionando bajo Windows (bien Windows 95, bien Windows 3.1 con
Video for Windows y la librer&iacute;a WinG, ambas cosas incluidas
en el CD-ROM de Darkseed II). Parte de los gr&aacute;ficos siguen
estando, al igual que en la primera parte, creados por H. R. Giger,
recordemos, el autor de los decorados de &quot;Alien, el octavo
pasajero&quot; y su saga, lo cual da una idea de su estilo, y
de su calidad, aunque han sido realizados los del mundo real a
base de render, pero con detalles de Giger.
<P>
Sin embargo los adelantos no han llevado a mejorar Darkseed m&aacute;s
que en el n&uacute;mero de colores, pues el entorno viene a ser
pr&aacute;cticamente el mismo que en la primera parte, el sistema
de control es el mismo e incluso los estirados movimientos del
protagonista son los mismos (y no se ha cambiado de ropa X-D).
<P>
S&iacute; incluye como novedad las voces digitalizadas, aunque
recordemos que Darkseed ya inclu&iacute;a algunas digitalizaciones,
que en este caso ocurren en todo momento. Por desgracia el doblaje
es mediocre.
<P>
En definitiva, si te gust&oacute; Darkseed encontrar&aacute;s
en Darkseed II la continuaci&oacute;n de aquella historia de pesadilla.
<P>
<CENTER><B>Carlos S&aacute;nchez</B></CENTER>
<P>
<CENTER><FONT SIZE=2>Pulsa <A HREF="c-ds2.htm">aqu&iacute;</A>
para ver el comentario del mismo juego escrito por Ra&uacute;l
&Aacute;lvarez.</FONT></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</P></CENTER>
</BODY>
</HTML>
