<HTML>
<HEAD>
<TITLE>SQ Comentario: Dark Seed II</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#c0c0c0" VLINK="#ffffff">
<P>
<CENTER><B><FONT SIZE=7>DARK SEED II</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="c-ds2.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Cyberdreams</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores</FONT></B><FONT SIZE=2>: Raymond
Benson, Peter Delgado, Jeff Hilbers; basado en la obra fant&aacute;stica
de H.R. Giger</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma</FONT></B><FONT SIZE=2>: Castellano</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Precio</FONT></B><FONT SIZE=2>: 7.990
pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Requisitos m&iacute;nimos</FONT></B><FONT SIZE=2>:
Windows 3.1, 486 DX, 8 Mb RAM, CD 2X, 20 Mb HD, 640x480x256 colores</FONT></CENTER>
<HR>
<P>
<B>Antecedente: &quot;Dark Seed&quot;.</B>
<P>
Suele suceder cuando una aventura introduce muchas novedades que
genera entre los usuarios reacciones muy diversas - positivas
y negativas. &quot;Dark Seed&quot; no fue una excepci&oacute;n,
all&aacute; cuando fue lanzado hace unos cinco a&ntilde;os. Mientras
que sus seguidores alababan los impresionantes gr&aacute;ficos
en alta resoluci&oacute;n, la sombr&iacute;a ambientaci&oacute;n
y el t&eacute;trico argumento, otras personas criticaban lo lineal
que era el juego, lo f&aacute;cil que era quedarse atascado, las
graves lagunas argumentales y lo impreciso del manejo y de las
animaciones. Posiblemente todos ten&iacute;an algo de raz&oacute;n.
<P>
<B>Llega la secuela.</B>
<P>
&#191;Han conseguido los creadores de &quot;Dark Seed II&quot;
solucionar todos los problemas de la precuela, conservando las
virtudes? Pues&#133; en parte. La verdad es que cuando empec&eacute;
a jugar la primera impresi&oacute;n que me provoc&oacute; el juego
no fue muy buena: un argumento con bastantes t&oacute;picos, el
control del rat&oacute;n altamente impreciso, la animaci&oacute;n
de los personajes muy brusca, obligatorio jugar bajo Windows&#133;
Sin embargo, he de reconocer que a medida que fui adentr&aacute;ndome
en la historia y me olvid&eacute; de todos esos detalles, empec&eacute;
a pasarmelo bien. &quot;Dark Seed II&quot; no es original ni demasiado
coherente, pero funciona bien como una aventura de terror &quot;serie
B&quot;. Tiene asesinatos, escenas sangrientas, malvados seres
de otra dimensi&oacute;n, un protagonista algo &quot;chalado&quot;,
personajes con oscuros secretos, un final inesperado, &#133; Adem&aacute;s,
en cuanto jugabilidad, tambi&eacute;n hay una mejora: aunque el
juego sigue siendo muy lineal ya no hay &quot;callejones sin salida&quot;.
El nivel de dificultad es bastante bajo, pero a veces cuesta dar
con la acci&oacute;n exacta para poder seguir avanzando.
<P>
<B>La Historia.</B>
<P>
En &quot;Dark Seed II&quot; volvemos a encarnarnos en Mike Dawson.
Aunque ya ha pasado un a&ntilde;o desde su aterradora aventura
en el &quot;Mundo Oscuro&quot;, Mike no ha conseguido reacerse.
Una antigua amiga del instituto ha sido asesinada en extra&ntilde;as
circunstanicas y &eacute;l es uno de los principales sospechosos.
Mike cree que el crimen ha sido obra de los malvados habitantes
del Mundo Oscuro, los &quot;Antiguos&quot;, como parte de su nuevo
plan para destruir a la humanidad.
<P>
<B>El veredicto:</B>
<P>
&quot;Dark Seed II&quot; viene en un CD y cuenta con textos y
voces totalmente traducidos al castellano. Es un juego apropiado
para aventureros no exigentes que deseen pasar el rato sin romperse
el coco demasiado.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Los impresionantes fondos basados en dise&ntilde;os de H.R. Giger.
<P>
<B>Principal defecto:</B>
<P>
En cuanto a manejo no est&aacute; precisamente logrado.
<P>
<B>Especialmente recomendado para:</B>
<P>
Fans de Giger, fans del Dark Seed 1, fans del terror de serie
B.
<P>
<B>Abst&eacute;nganse:</B>
<P>
Todos aquellos que odien Windows.
<P>
<B>La Pista:</B>
<P>
Mike no coger&aacute; la llave que lleva el muerto del dep&oacute;sito
de cad&aacute;veres hasta que a) Pandora le revele un acertijo
y b) encuentre la soluci&oacute;n a dicho acertijo en los ficheros
del forense.
<P>
<B>Sitio Relacionado:</B>
<P>
<A HREF="http://www.hrgiger.com/">http://www.hrgiger.com/</A>
Web de H.R. Giger.
<P>
<B>Comentado por</B>: Ra&uacute;l (no seud&oacute;nimo) Alvarez.
<P>
Pulsa <A HREF="c-ds2b.htm" >aqu&iacute;</A> para ver otro comentario
del mismo juego escrito por Carlos S&aacute;nchez.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</P></CENTER>
</BODY>
</HTML>
