<HTML>
    <HEAD>
        <meta charset="utf-8">
<TITLE>
            SQ Comentario: Dungeons of Dunjin
        </TITLE>
        <META NAME="AUTHOR" CONTENT="Francisco Javier Moreno">
        <META NAME="DESCRIPTION" CONTENT="Spanish Quest. Comentario de Dungeons of Dunjin">
    </HEAD>
<BODY BGCOLOR="#ffffff" TEXT="#000000">

<CENTER>
        <H1>Dungeons of Dunjin</H1>
        <TABLE>
        <TR><TH>Autor:<TD><A HREF="mailto:mol@df.lth.se">Magnus Olsson</A>
            <TH>Idioma:<TD>Ingl&eacute;s</TR>
        <TR><TH>Precio:<TD>Freeware
            <TH>Sistema:<TD><A HREF="ftp://ftp.gmd.de/if-archive/games/pc/dunjin43.zip">PC</A>/
                            <A HREF="ftp://ftp.gmd.de/if-archive/games/mac/Dunjin44.cpt.hqx">MAC</A></TR>
        </TABLE>
</CENTER>

<HR>

<P>

Bueno... &#191;por qu&eacute; env&iacute;o un comentario de un juego antes de llegar a
finalizarlo? &#161;Porque pienso que tendr&iacute;as que mirar este <I>Dungeons of Dunjin</I>,
uno de los conversacionales m&aacute;s entretenidos que he jugado en a&ntilde;os.

<P>

El argumento est&aacute;, lo reconozco, sobad&iacute;simo: las legendarias mazmorras del
Djinn (famosa atracci&oacute;n tur&iacute;stica en todo el Reino) han sido cerradas a
causa de una plaga de enormes ratas. Pero cuando llega a tus o&iacute;dos la
existencia de enormes tesoros en una zona inexplorada de las cuevas no vas
a detenerte por la presencia de unos maldito' roedore'.

<P>

Comienzas (sorpresa, sorpresa) en el bosque cercano a las mazmorras. Por
supuesto hay una entrada a los dungeons... y por supuesto es totalmente
in&uacute;til. De todas formas no te costar&aacute; m&aacute;s de una hora meterte en los
corredores, y una vez all&iacute; comienza lo bueno. Encontrar&aacute;s detalles sobre
la plaga, sobre el secuestro del gerente de la atracci&oacute;n tur&iacute;stica, sobre
el fabuloso submundo de Dunjin.

<P>

El juego se desarrolla a lo largo de m&aacute;s de 160 localidades correctamente
descritas: el estilo es directo y normalmente la importancia de la
habitaci&oacute;n es proporcional al n&uacute;mero de l&iacute;neas que al describe:

<P>

<BLOCKQUOTE>
<TABLE WIDTH=80%>
<TR><TD ALIGN=LEFT>2<TD>Localidad de paso</TR>
<TR><TD ALIGN=LEFT>2, 4 <TD>Posiblemente alg&uacute;n objeto &uacute;til</TR>
<TR><TD ALIGN=LEFT>5.. <TD>&#161;Ey! Aqu&iacute; hay un puzzle</TR>
</TABLE>
</BLOCKQUOTE>

<P>

&#191;Objetos? Demasiados. Casi todos ellos de usar-y-tirar (notablemente el
rod no es de este tipo) y por otro lado algunos red-herrings que al
programador le har&aacute;n mucha gracia pero que a mi me ponen nervioso. Por
suerte no hay l&iacute;mite de peso, y en ocasiones te encuentras con algo
<I>diferente</I> a lo habitual... como el sujetador negro del gerente.

<P>

Los puzzles son, como decirlo, sencillos. La situaci&oacute;n en muchas ocasiones
te invita a actuar de determinada manera, lo que unido a un muy buen parser
(sensacional el tratamiento del <I>it</I>) convierte muchas zonas del juego en un
entretenido paseo. &#161;Buena jugabilidad!

<P>

No me alargo m&aacute;s... pero me gustar&iacute;a comentarte que si alguna vez est&aacute;s en
una habitaci&oacute;n con un fuse (fusible) en la pared intenta un <I>replace fuse on
the wall</I>. Ya lo entender&aacute;s.

<P>

Puedes encontrar parte del mapa en <A HREF="http://www.geocities.com/TimesSquare/3567">The Dwarf and the Axe</A>
Utiliza el formulario para enviarme correo o si te da
pereza pulsa <A HREF="mailto:e7610661@est.fib.upc.es">aqu&iacute;</A>. 

<P>
<HR>
<P>
<CENTER>

<TABLE WIDTH=90% BORDER=9 CELLPADDING=4>
<TR><TH ALIGN=LEFT>Parser<TD>Escrita con Turbo Pascal 3.0</TR>
<TR><TH ALIGN=LEFT>Disponible<TD>Como siempre, en <A HREF="ftp://ftp.gmd.de">ftp://ftp.gmd.de</A></TR>
<TR><TH ALIGN=LEFT>Puzzles<TD>Cl&aacute;sicos, l&oacute;gicos, sencillos</TR>
<TR><TH ALIGN=LEFT>PSIs<TD>Alguno hay... pero todav&iacute;a no los he encontrado!</TR>
<TR><TH ALIGN=LEFT>Pistas<TD>Casi siempre... a costa de perder 10 puntos</TR>
<TR><TH ALIGN=LEFT>Argumento<TD>El de siempre, pero llevado con dignidad</TR>
<TR><TH ALIGN=LEFT>Atm&oacute;sfera<TD>&#161;Buena!</TR>
<TR><TH ALIGN=LEFT>Estilo<TD>Bien escrita</TR>
<TR><TH ALIGN=LEFT>Dificultad<TD>Baja</TR>

</TABLE>
</CENTER>

<P>
<CENTER><I>Comentado por Javi</I></CENTER><P>
<HR>

<P>

<CENTER><A HREF="coment.htm">[Volver]</A><P>
</CENTER>

</BODY>
</HTML>
