<HTML>
<HEAD>
<TITLE>SQ Comentario: El Poder de la Kínbreton</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">
<P>
<CENTER><FONT SIZE=5>Las Aventuras de Eudoxio (primera parte)</FONT></CENTER>
<P>
<CENTER><FONT SIZE=7>El Poder de La K&iacute;nbreton</FONT></CENTER>
<P>
<CENTER><B>Autor</B>: Daniel C&aacute;rdenas; <B>Idioma</B>: Castellano;</CENTER>
<P>
<CENTER><B>Versi&oacute;n comentada</B>: 1.6; <B>Tipo</B>: Aventura
de texto;</CENTER>
<P>
<CENTER><B>Precio:</B> gratuita;</CENTER>
<P>
<CENTER><B>Sistema</B>: i8086, DOS</CENTER>
<HR>
<P>
Se trata de una aventura de texto ambientada en un mundo fant&aacute;stico
poblado por seres tales como orcos, &aacute;rboles guerreros,
magos y brujos. Manejamos a Eudoxio, un debilucho muchacho que
sale de su pueblo en busca de la hija del alcalde, Dina, secuestrada
por un ogro mientras la acompa&ntilde;abas a casa. 
<P>
&quot;El Poder de La K&iacute;nbreton&quot; est&aacute; planteada
de una forma algo distinta a las aventuras tradicionales, ya que
adem&aacute;s de contar con los objetos, puzzles y personajes
habituales, incluye algunas caracter&iacute;sticas t&iacute;picas
de los juegos de rol. As&iacute;, aparecen los puntos de experiencia
y de salud, y es posible luchar contra varios enemigos (incluso
contra los amigos), pudiendo usar para ello varias armas, escudos,
armaduras, &#133; Por otro lado, se ha intentado flexibilizar
el juego permitiendo solucionar varios obst&aacute;culos de diversas
formas (por la fuerza bruta o usando la inteligencia), y se han
introducido algunas partes opcionales. El resultado es una aventura
notable que lamentablemente falla en algunos aspectos bastante
importantes.
<P>
Lo primero que no me agrad&oacute; de Eudoxio es el sistema de
conversaciones que utiliza. Hay que usar la forma <I>decir a personaje
&quot;frase&quot; </I>pero lamentablemente los &quot;personajes&quot;
entienden tan pocas &quot;frases&quot; que resulta muy frustrante.
Adem&aacute;s en varios momenos en los que no controlas el juego
se utiliza el estilo directo para lo que dice el protagonista,
con lo que se hace dif&iacute;cil involucrarse en la historia
como tal.
<P>
En cuanto a las luchas, resultan bastante aburridas porque son
a vida o muerte (no es posible evitarlas o huir) y sin embargo
no hay pr&aacute;cticamente nadie con quien enfrentarnos cuando
no tenemos experiencia, as&iacute; que durante la mayor parte
del juego caer en un combate significa morir irremisiblemente.
<P>
Pero el mayor defecto del juego concierne al dise&ntilde;o. Y
es que si bien todo est&aacute; pensado para que sea una aventura
flexible, abierta y poco lineal, nada est&aacute; m&aacute;s lejos
de la realidad, ya que depende enormemente de la suerte, de que
llegues al lugar adecuado en el momento justo, y no de que utilices
la inteligencia.
<P>
La ambientaci&oacute;n es buena, porque el autor ha conseguido
crear un escenario cre&iacute;ble, en el que la mayor&iacute;a
de las cosas y las personas siguen una cierta l&oacute;gica. Se
trata de una aventura relativamente f&aacute;cil con la que seguramente
pasar&aacute;s unas horitas entretenido.
<P>
Pese a tener algunos defectillos &quot;El Poder de La K&iacute;nbreton&quot;
contiene varias buenas ideas, mucha ilusi&oacute;n y promete una
secuela que a buen seguro ser&aacute; mucho mejor.
<HR>
<P>
<B>La Pista:</B>
<P>
A veces el verbo m&aacute;s evidente no funciona, y hay que usar
&quot;USAR&quot; (!) para llevar a cabo la acci&oacute;n deseada.
<P>
<B>D&oacute;nde conseguirla:</B>
<P>
<A HREF="http://www.geocities.com/TimesSquare/5787">http://www.geocities.com/TimesSquare/5787</A>
Fundaci&oacute;n Pro-Imagyna.
<P>
<B>Comentario por</B> Ra&uacute;l (<I>no comments</I>) &Aacute;lvarez
Garc&iacute;a.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
<P>
</BODY>
</HTML>
