<HTML>
<HEAD>
<TITLE>SQ Comentario: Lost Eden</TITLE>
</HEAD>
<BODY BACKGROUND="c-eden-3.gif" BGCOLOR="#808080" TEXT="#ffffff" LINK="#ffffff" VLINK="#ffffff">
<P>
<CENTER><FONT SIZE=7>LOST EDEN</FONT></CENTER>
<P>
<CENTER><B>Casa</B>: Cryo <B>Autores</B>: Remi Herbulot, Philip
Ulrich, Johan Robson; con la colaboraci&oacute;n de Steve Jackson
<BR>
<B>Tipo</B>: Aventura gr&aacute;fica <B>Idioma</B>: Ingl&eacute;s
subtitulado en castellano <B>Precio</B>: 1995 pts</CENTER>
<P>
<CENTER><IMG SRC="c-eden-1.jpg"></CENTER>
<P>
<CENTER><B>Sistema m&iacute;nimo</B>: 486SX-33, CD, 470Kb RAM
<BR>
<B>Sistema recomendado</B>: 486SX-50, CD 2x, 520Kb RAM, rat&oacute;n,
tarjeta de sonido compatible SoundBlaster <B>Versi&oacute;n Comentada</B>:
PC-CD MS-DOS (tambi&eacute;n disponible para 3DO, CD32 y CD-I)</CENTER>
<HR>
<P>
El mundo de Eden est&aacute; habitado por dos especies, los humanos
y los dinosaurios. Dos especies que durante miles de a&ntilde;os
convivieron en paz, ayud&aacute;ndose mutuamente. Los humanos
cultivaban alimentos para los dinosaurios, y a cambio &eacute;stos
les ayudaban a construir ciudadelas donde pod&iacute;an vivir
seguros. La paz y la convivencia duraron hasta la llegada del
cruel Morkus Rex y sus hordas de tiranosaurios asesinos. La destrucci&oacute;n
por parte de los tiranos de la mayor&iacute;a de las ciudadelas
acab&oacute; con la confianza que hab&iacute;a entre las dos especies.
Si Rex no era detenido los humanos estar&iacute;an condenados
a desaparecer de Eden. Y tambi&eacute;n las dem&aacute;s razas
de dinosaurios. En Lost Eden adoptas el papel de Adam, el hombre
que deber&aacute; aliar a otras razas humanas y a los dinosaurios
contra el enemigo com&uacute;n: los tiranosaurios.
<P>
&quot;Lost Eden&quot; est&aacute; estructurado de una forma algo
curiosa. El narrador, el viejo Eloi, explica la historia simplificando
las partes m&aacute;s complejas y ay&uacute;dandonos a seguir
el hilo argumental sin entrar demasiado en los detalles. Por ejemplo,
durante el juego, y para conseguir la ayuda de una raza de dinosaurios,
basta con llevarles un regalo, aunque uno tiene la sensaci&oacute;n
de que eso es s&oacute;lo una manera de simbolizar un proceso
mucho m&aacute;s complejo.
<P>
Para interaccionar con el mundo de Eden disponemos de un cursor
&quot;inteligente&quot; que al ser movido por los escenarios nos
muestra las posibilidades que tenemos para interaccionar con ellos,
y que se limitan casi siempre a una o dos opciones por pantalla.
Cuando viajamos se nos ofrece vistosos clips que muestran la transici&oacute;n
de un lugar a otro.
<P>
Varios personajes acompa&ntilde;an a Adam, ay&uacute;dandole y
ofreci&eacute;ndole consejo. Este es uno de los aspectos m&aacute;s
logrados y contribuye enormemente a dar vida a la historia. El
di&aacute;logo es important&iacute;simo y en &eacute;l se basan
buena parte de juego y algunos de los puzzles.
<P>
Hablando de puzzles, hay que decir que no hay demasiados y que
en muchos momentos hay que repetir los mismos procedimientos que
ya se ha usado antes para avanzar, con lo que el juego se hace
algo repetitivo. Si lo que buscas son enigmas intrincados y montones
de objetos para usar, Lost Eden NO es tu juego.
<P>
<CENTER><IMG SRC="c-eden-2.jpg"></CENTER>
<P>
Lost Eden vale las dos mil pesetas que cuesta. Es una aventura
muy vistosa que cuenta de manera simplificada una historia de
dimensiones &eacute;picas. Recomendada si deseas ver v&iacute;deos
y escuchar m&uacute;sica a la vez que conoces un mundo misterioso
y ex&oacute;tico.
<HR>
<P>
<B>Lo Mejor:</B>
<P>
La m&uacute;sica. Lost Eden es como un enorme videoclip.
<P>
<B>Lo Peor:</B>
<P>
En varios momentos se hace demasiado repetitiv<A NAME="OLE_LINK1">o.</A>
<P>
<B>Comentario por: Ra&uacute;l &Aacute;lvarez</B>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
<P>
</BODY>
</HTML>
