<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Fable</TITLE>
</HEAD>
<BODY BGCOLOR="#800080" TEXT="#ffffff" LINK="#ffffff" VLINK="#ffff00">
<P>
<CENTER><TABLE ALIGN="CENTER">
<TR><TD ALIGN="CENTER" VALIGN="MIDDLE" WIDTH=292><CENTER><FONT SIZE=6>FABLE</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo:</FONT></B><FONT SIZE=2> Aventura gr&aacute;fica</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa:</FONT></B><FONT SIZE=2> Telstar Studios</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma:</FONT></B><FONT SIZE=2> Voces en ingl&eacute;s, subt&iacute;tulos en castellano</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema Operativo:</FONT></B><FONT SIZE=2> MS-DOS &oacute; Windows 95.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Hardware:</FONT></B><FONT SIZE=2> PC 486, 8 Mb RAM, rat&oacute;n, disco duro, CD-ROM 2x, VESA</FONT></CENTER>
</TD><TD ALIGN="CENTER" VALIGN="MIDDLE" WIDTH=291><CENTER><IMG SRC="c-fabl-1.jpg"></CENTER>
</TD></TR>
</TABLE>
</CENTER>
<HR>
<P>
<B>Fable: Preguntas con respuesta (o &quot;&#191;de qu&eacute;
va?&quot;).</B>
<P>
<I>&#191;D&oacute;nde transcurre?:</I> En Balkhane, planeta fant&aacute;stico
poblado por hadas, ogros, calamares parlantes y otros curiosos
seres, tales como humanos.
<P>
&#191;<I>Qu&eacute; cuenta?:</I> La b&uacute;squeda de cuatro
joyas robadas y custodiadas por cuatro bestias, cuya sustracci&oacute;n
ha llevado a Balkhane al caos.
<P>
<I>&#191;Qui&eacute;n lo protagoniza?:</I> Quickthorpe, joven
ejemplar de antropoide dispuesto a devolver la prosperidad a su
planeta.
<P>
<B>Fable: Eso es (o &quot;&#191;qu&eacute; tal est&aacute;?&quot;).</B>
<P>
<IMG SRC="c-fabl-2.jpg" HSPACE=5 VSPACE=5 ALIGN="LEFT">Lo primero
que llama la atenci&oacute;n tras cargar &quot;Fable&quot; son
los gr&aacute;ficos, preciosistas, detallados y muy agradables.
Las animaciones de los personajes est&aacute;n conseguidas y son
fluidas. La m&uacute;sica&#133; bueno, no hay m&uacute;sica en
&quot;Fable&quot;, as&iacute; que mientras juegas puedes escuchar
tu disco favorito.
<P>
Como aventura, no es ninguna maravilla. El desarrollo es lineal,
y consiste &uacute;nicamente en encontrar objetos e ir us&aacute;ndolos
en el lugar adecuado. Tambi&eacute;n hay algunos personajes con
los que conversar, aunque, lamentablemente, los di&aacute;logos
no son muy interesantes.
<P>
Se nota una desesperante indefinici&oacute;n en el estilo del
juego, vacilante entre aventura &eacute;pica y comedieta barata
con chistes que intentan imitar (sin suerte alguna) el estilo
Monkey Island. &quot;Fable&quot; viene en una bonita caja de cart&oacute;n
donde se destacan las buenas cr&iacute;ticas que el juego ha cosechado
entre la &quot;prensa especializada&quot;. Supongo que se trata
de otro chiste malo&#133;
<P>
El manejo es francamente inc&oacute;modo. Se caracteriza por un
descontrolado cursor pseudo inteligente que hace lo que quiere
y un intratable inventario lleno de objetos que no sirven para
nada (que no sea molestar, claro).
<P>
La adaptaci&oacute;n espa&ntilde;ola es muy floja, s&oacute;lo
incluye la traducci&oacute;n de los textos (no de las voces de
los personajes). Las secuencias de introducci&oacute;n y final
del juego no cuentan con subt&iacute;tulos y est&aacute;n en ingl&eacute;s.
<P>
Contemplando y jugando &quot;Fable&quot;, uno tiene la impresi&oacute;n
de que sus creadores se pulieron r&aacute;pidamente el dinero
del proyecto y tuvieron que acabarlo como pudieron, desaprovechando
la mayor parte del potencial que el juego parece tener.
<P>
<B>Fable: Preguntas sin respuesta (m&aacute;s una moraleja)</B>
<P>
&#191;<I>Por qu&eacute;</I> se han olvidado de traducir algunos
de los mensajes del juego?
<P>
&#191;<I>Por qu&eacute;</I> la mayor&iacute;a de veces que Quickthorpe
muere el juego no avisa ni dice nada, simplemente queda esperando?
<P>
&#191;<I>Por qu&eacute;</I> otras le devuelve al momento anterior
al movimiento fatal?
<P>
&#191;<I>Por qu&eacute;</I> no hay m&uacute;sica en &quot;Fable&quot;?
<P>
&#191;<I>Por qu&eacute;</I> el final es tan est&uacute;pido y
poco coherente?
<P>
Soy del parecer que todas las aventuras tienen algo (alg&uacute;n
peque&ntilde;o detalle, alguna idea, o simplemente las horas de
trabajo invertidas por sus creadores) que hace que valga la pena
jugarlas. Pero he de admitir que con &quot;Fable&quot; no he encontrado
nada m&aacute;s que una aventura anodina, ins&iacute;pida y poco
original. 
<HR>
<P>
<B>Lo Mejor:</B>
<P>
Las im&aacute;genes que ilustran la odisea de Quickthorpe.
<P>
<B>Lo Peor:</B>
<P>
Se trata de un juego muy flojo que, para postre, tiene un final
MAL&Iacute;SIMO.
<P>
<B>La Pista:</B>
<P>
Explora bien las posibilidades del interfaz.
<P>
<B>Por <I>Ra&uacute;l </I>&quot;aqu&eacute;l que escribe comentarios
constructivos&quot; <I>&Aacute;lvarez</I>.</B>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
<BR>
</BODY>
</HTML>
