<HTML>
<HEAD>
<TITLE>SQ Comentario: The Beast Within</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ff0000" LINK="#ff0000" VLINK="#ff0000">
<P>
<CENTER><FONT SIZE=6>GABRIEL KNIGHT 2</FONT></CENTER>
<P>
<CENTER><FONT SIZE=7>THE BEAST WITHIN<BR>
</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-gk2.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica<B> Casa</B>: Sierra On-Line <B>Autora</B>: Jane
Jensen <B>Precio (aproximado)</B>:<B> </B>7.900 pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>:</FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>DOS 5.0 o superior, Windows 3.1 o superior.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Requerimientos m&iacute;nimos</FONT></B><FONT SIZE=2>:</FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>486 DX/33, 8Mb RAM, 7Mb HD, Rat&oacute;n,
Tarjeta Audio, Tarjeta de video que soporte 256 colores en 640x480.</FONT></CENTER>
<HR>
<P>
La verdad es que cuando Sierra anunci&oacute; el desarrollo de
este segundo cap&iacute;tulo de las aventuras del detective sobrenatural
Gabriel Knight los usuarios se mostraron bastante recelosos. Ello
se deb&iacute;a a la gran cantidad de cambios que se iba a introducir:
una producci&oacute;n en video con actores profesionales, localizaciones
basadas en fotograf&iacute;as reales, y el nuevo interfaz con
un &uacute;nico icono para interactuar con el entorno. Argumentalmente
el primer juego hab&iacute;a dejado el list&oacute;n muy alto
y hab&iacute;a quien tem&iacute;a que se perdiera la originalidad
y la coherencia que caracterizaban a la primera parte. Afortunadamente
todos estos temores han resultado infundados, porque &quot;The
Beast Within&quot; ha resultado ser una de las mejores aventuras
publicadas este a&ntilde;o.
<P>
La historia arranca un a&ntilde;o desp&uacute;es de los hechos
acaecidos en Nueva Orleans que cambiaron el rumbo de la vida del
protagonista para siempre y est&aacute; ambientada en Munich y
Baviera. Gabriel es requerido para investigar la muerte de una
ni&ntilde;a a manos (&#191;deber&iacute;a decir fauces?) de un
lobo. La polic&iacute;a local cree que los hechos son obra de
dos lobos escapados del zoo de Munich, pero los padres piensan
algo mucho m&aacute;s terrible: que se trata de la obra de un
hombre lobo. Por otro lado Grace Nakimura (la ayudante de Gabriel
en el primer juego) llega a Alemania para asistir a Gabriel, pero
ante la indiferencia de &eacute;ste, se embarca por su cuenta
en una investigaci&oacute;n hist&oacute;rica, a partir de unas
cartas de antecesores de Gabriel que relacionan a un misterioso
individuo conocido como El Lobo Negro con el Rey Ludwig II de
Baviera y con el compositor Richard Wagner.
<P>
&quot;The Beast Within&quot; est&aacute; dividido en seis cap&iacute;tulos
en los que se maneja alternativamente a Gabriel y a Grace. Personalmente
he encontrado mucho m&aacute;s entetretenido y original el misterio
hist&oacute;rico que toca resolver a Grace, visitando museos,
bibliotecas y antiguos castillos, pero la investigaci&oacute;n
de Gabriel resulta tambi&eacute;n interesante. El nivel de dificultad
est&aacute; bastante bien ajustado, pero, debido a que el juego
es bastante lineal, no es dif&iacute;cil quedarse bloqueado de
vez en cuando&#133; eso s&iacute;, &quot;The Beast Within&quot;
no contiene &quot;callejones sin salida&quot;, y pese que en algunos
momentos es posible morir, se ha incluido una opci&oacute;n para
&quot;volverlo a intentar&quot; que nos devuelve a los instantes
precedentes al momento &quot;fatal&quot;.
<P>
El interfaz utilizado es realmente muy simple, y se caracteriza
por un &uacute;nico puntero &quot;inteligente&quot;, un extenso
inventario y un sistema de conversaci&oacute;n interactivo. Se
han a&ntilde;adido, adem&aacute;s, un cuaderno de notas y una
grabadora para registrar las conversaciones.
<P>
La realizaci&oacute;n es bastante buena. El juego usa digitalizaciones
de fotos tomadas en las localizaciones reales sobre las que se
han a&ntilde;adido las filmaciones de los actores. El resultado
es bastante bueno y aunque se ha perdido el estilo g&oacute;tico
que ten&iacute;a &quot;Sins of The Fathers&quot;, se ha ganado
en realismo. Adem&aacute;s las interptretaciones son de las mejores
que se ha visto nunca en un juego de ordenador. La m&uacute;sica
est&aacute; totalmente digitalizada y resulta muy adecuada, aunque
hay que decir que no es muy abundante. La calidad del v&iacute;deo
es bastante aceptable.
<P>
Con &quot;The Beast Within&quot; Jane Jensen ha conseguido lo
que pretend&iacute;a: crear una rica aventura que combina lo mejor
de las &uacute;ltimas tecnolog&iacute;as con la m&aacute;s cl&aacute;sica
narrativa fant&aacute;stica. Muy recomendable.
<HR>
<P>
<B>No Se la Pierdan:</B>
<P>
Todos aquellos que quieran una aventura con una intrigante historia,
cre&iacute;bles personajes e interesantes enigmas.
<P>
<B>Evitarla:</B>
<P>
Video-fobos.
<P>
<B>La Pista:</B>
<P>
Ese reloj de cuco suena como la aldaba de la puerta trasera del
Club de Caza&#133;
<P>
<B>&#191;Sab&iacute;as que&#133;</B>
<P>
En el dise&ntilde;o original escrito por Jane Jensen el jugador
tambi&eacute;n manejaba a Ludwig, y que el juego ten&iacute;a
nueve episodios en lugar de los seis que finalmente se filmaron?
<P>
<B>Sitios relacionados:</B>
<P>
<A HREF="http://www.sierra.com/"><I>http://www.sierra.com/</I> Web de Sierra-On-Line</A>
<P>
<A HREF="http://home.earthlink.net/~dandavid/">http://home.earthlink.net/~dandavid/ La p&aacute;gina no-oficial de Gk2</A>
<BR>
<P>
Raul Alvarez Garc&iacute;a: &quot;<B>Go to hell, Gk2 thief!</B>&quot;
<P>
Comentario actualizado en febrero de 1997.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
