<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Hoz Forever</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">
<P>
<CENTER><IMG SRC="c-hf-a.gif" WIDTH=584 HEIGHT=94 VSPACE=10 ALT="HOZ FOREVER"></CENTER>
<P>
<CENTER><B>Casa:</B> <A HREF="http://www.arrakis.es/~emimart">Isxem Games</A></CENTER>
<P>
<CENTER><B>Autores:</B> <A HREF="mailto:emimart@arrakis.es">Emilio Mart&iacute;nez</A>,
David Ortega, Txema Mu&ntilde;oz, Roberto Pe&ntilde;a, Oscar,
Elia Ruiz.</CENTER>
<P>
<CENTER><B>Idioma:</B> castellano <B>Precio: </B>freeware </CENTER>
<P>
<CENTER><B>Sistema:</B> PC</CENTER>
<HR>
<P>
<FONT SIZE=6>H</FONT>oz Forever es la tercera parte de la saga
de Hoz, saga que dar&iacute;a comienzo en 1995 con <I>Hoz Quest</I>.
Su segundo episodio <I>Hoz Quest II</I> alcanzar&iacute;a cierta
fama, gracias en parte a su aparici&oacute;n en varios CD's de
revistas como la Pc-Man&iacute;a o la Hot Shareware. Actualmente
los chicos de Isxem andan preparando lo que ser&aacute; la cuarta
parte <I>(Demolution Hoz)</I>, que tiene prevista su aparici&oacute;n
a mediados del presente a&ntilde;o.
<P>
<IMG SRC="c-hf-b.gif" ALIGN=RIGHT VSPACE=12 HSPACE=5 WIDTH=200 HEIGHT=105 ALT="Imagen del Juego (1)">
<FONT SIZE=6>N</FONT>os encontramos ante una conversacional humor&iacute;stica
donde al igual que en las dos primeras entregas encarnamos a Sergio
Hoz, que es un chaval que existe en la realidad y que no parece
estar demasiado bien considerado por los autores de este juego.
La mayor&iacute;a de la co&ntilde;a y de la gracia del juego se
basa en dejar cont&iacute;nuamente en rid&iacute;culo a Sergio.
Desde luego desconozco lo que tendr&aacute; el pobre chaval y
si realmente se merece algo as&iacute;, pero al menos ya cuenta
con tres juegos basados en su persona, y eso es algo que casi
nadie puede decir...
<P>
<FONT SIZE=6>E</FONT>l personaje parece que lo tenga todo: es
feo, bajito, debilucho, torp&oacute;n y sobre todo poco afortunado
en su vida sexual. Pero todo eso no impedir&aacute; que Hoz viva
una serie de peripecias (algunas de ellas desternillantes) que
lo ir&aacute;n catapultando de situaci&oacute;n en situaci&oacute;n
hasta llegar a un final realmente imprevisible. As&iacute; a lo
largo de la aventura, podremos contemplar desde como Hoz sale
por televisi&oacute;n y gana una serie de premios, hasta verse
implicado (sin quererlo) en un importante partido de f&uacute;tbol.
Desde luego si a algo no le falta este juego es originalidad.
<P>
<IMG SRC="c-hf-c.gif" ALIGN=RIGHT VSPACE=0 HSPACE=5 WIDTH=200 HEIGHT=105 ALT="Imagen del Juego (2)">
<FONT SIZE=6>H</FONT>oz Forever cuenta con gr&aacute;ficos, algunos
correctos y otros bastante cutres, pero que siempre cumplen con
su cometido. Adem&aacute;s contamos con alguna que otra secuencia
animada y una m&uacute;sica que amenizar&aacute; el juego, y que
no resulta machacona siempre y cuando no la mantengamos a demasiado
volumen.
<P>
<FONT SIZE=6>E</FONT>n cuanto al juego en s&iacute; hay que decir
que es lineal hasta sus m&aacute;ximas consecuencias, abundando
especialmente los problemas de dar objetos a la persona adecuada.
Adem&aacute;s resulta realmente molesta la falta de sin&oacute;nimos
y el hecho de que ciertas acciones requieran adivinar el verbo
correcto. Por citar un ejemplo podremos 'llamar al timbre', pero
no usarlo o pulsarlo y esto es un problema a mi entender bastante
grave. En cuanto al trato de PSIs diremos que es pobre, la gran
mayor&iacute;a no son m&aacute;s que simples objetos que est&aacute;n
ah&iacute;, que no hablan y que en todo el juego abrir&aacute;n
la boca s&oacute;lo cuando le des el objeto adecuado.
<HR>
<P>
<B>Recomendada especialmente para:</B> 
<P>
Aquellos que quieran pasar un rato divertido, preferiblemente
con la <A HREF="http://www.arrakis.es/~emimart/forever.htm">soluci&oacute;n</A>
a mano.
<P>
<B>Lo peor del juego:</B>
<P>
Sus problemas padecen el s&iacute;ndrome de <I>adivina_el_&uacute;nico_verbo_que_vale</I>,
alg&uacute;n que otro fallito del parser (nada grave) y la linealidad.
<P>
<B>Lo mejor: </B>
<P>
El comprobar que en el equipo de Isxem hay bastante calidad y
muchas ganas. Con su nuevo trabajo 'Danger World' que estar&aacute;
ambientado en la Edad Media, seguro que nos sorprender&aacute;n
con una aventura de verdad, dejando atr&aacute;s la mera parodia
a un colega. &Aacute;nimo. 
<P>
<CENTER><I>Comentado por Daniel C&aacute;rdenas</I></CENTER>
<HR>
<P>
<CENTER> [<A HREF="coment.htm" >Volver</A>]</CENTER>
<P>
</BODY>
</HTML>
