<HTML>
<HEAD>
<TITLE>SQ Comentario: Harvest of Souls</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#440800" TEXT="#ffffff" LINK="#c0c0c0" VLINK="#c0c0c0">
<P>
<CENTER><FONT SIZE=2>SHIVERS II HARVEST OF SOULS</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-hos-1.jpg"></CENTER>
<P>
<CENTER><FONT SIZE=2>Autora: <B>Marcia Bales </B>Casa: <B>Sierra
On-Line</B></FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>Tipo: <B>Aventura gr&aacute;fica en primera
persona</B> Idioma: <B>Ingl&eacute;s </B>Precio: <B>5000 pts</B></FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>Sistema requerido: <B>PC 486 DX/2 66 o superior,
Windows 3.1 / Windows 95, 12 Mb RAM, CD-ROM doble velocidad, SVGA,
disco duro, rat&oacute;n, teclado, tarjeta de audio compatible
con Windows.</B></FONT></CENTER>
<HR>
<P>
Hace exactamente un a&ntilde;o que jugu&eacute; y coment&eacute;
el primer t&iacute;tulo de la serie <I>Shivers</I> de Sierra.
Por aquel entonces el juego era bastante desconocido y, pese a
haber sido promocionado b&aacute;sicamente para jugadores j&oacute;venes,
como jugadora adulta yo lo disfrut&eacute; enormemente. Desde
el principio tuve la sensaci&oacute;n de que se iba a convertir
en un favorito entre personas de todas las edades (o al menos
de adolescentes en adelante) y sospecho que no estaba demasiado
equivocada. 
<P>
<B><FONT SIZE=4>Un juego para todos</FONT></B>
<P>
<I>Shivers II: Harvest of Souls</I> contin&uacute;a en la misma
vena que su predecesor (terror ligero), y tambi&eacute;n consigue
capturar ese 'algo' con su especial receta de aventuras, problemas
de manipulaci&oacute;n y rompecabezas abstractos.
<P>
La historia parte de las adversidades y sufrimientos por las que
pasa una banda de m&uacute;sica moderna, tiene unos j&oacute;venes
protagonistas y una buena dosis de m&uacute;sica pop / rock. De
nuevo puede parecer que el juego est&aacute; dirigido al p&uacute;blico
m&aacute;s joven, as&iacute; que debo repetir lo que ya dije en
mi primer art&iacute;culo. Si eres un jugador adulto no dejes
que eso te moleste. Quiz&aacute; el CD con canciones incluido
en la caja original no se adecuar&aacute; a tu colecci&oacute;n
de m&uacute;sica, pero el juego en s&iacute; se juntar&aacute;
felizmente con tus otras aventuras. Aunque no puedo decir honestamente
que he disfrutado m&aacute;s &eacute;ste que el primer juego,
s&iacute; puedo decir que es igual de bueno. Y adem&aacute;s,
incluye varias mejoras de dise&ntilde;o como un mapa para viajar
f&aacute;cilmente y un nuevo sistema de puntuaci&oacute;n en el
que el n&uacute;mero de puntos no se incrementa cuando repites
un puzzle. Esta vez puedes llevar hasta doce objetos y no es necesario
que tengas que solucionar varias veces el puzzle asociado a una
puerta si resulta que pasas por all&iacute; en m&aacute;s de una
ocasi&oacute;n, lo cual es un alivio.
<P>
<CENTER><IMG SRC="c-hos-2.jpg"></CENTER>
<P>
<B><FONT SIZE=4>No olvides el manual</FONT></B>
<P>
Como pasaba con su predecesor, el manual de este juego incluye
una lista de los rompecabezas con los que te cruzar&aacute;s en
el curso de la aventura. As&iacute; que no olvides leerlo. Junto
con un mont&oacute;n de informaci&oacute;n crucial sobre c&oacute;mo
optimizar el tama&ntilde;o de la pantalla y c&oacute;mo usar el
interfaz, tambi&eacute;n hay una opci&oacute;n que autom&aacute;ticamente
resuelve por ti un puzle en el caso de que se te resista. Cuando
prob&eacute; esto, mi puntuaci&oacute;n baj&oacute; tan dr&aacute;sticamente
que en dos segundos volv&iacute; a mi fiel partida salvada con
renovada determinaci&oacute;n para completar todos y cada uno
de los puzles. Tambi&eacute;n hay un pr&oacute;logo que ayuda
a empezar el juego por el camino adecuado&#133;
<P>
Una joven pareja viaja por las agrestes tierras de Colorado en
direcci&oacute;n a la remota ciudad de <I>Cyclone</I> en el <I>Ca&ntilde;&oacute;n
de la Boca del Diablo</I>, para reunirse con sus amigos de la
banda <I>Trip Cyclone</I>. El Ca&ntilde;&oacute;n de la Boca del
Diablo es un terror&iacute;fico pero fascinante destino, antigua
morada de una comunidad de <I>Anastaszi </I>que desapareci&oacute;
misteriosamente y sobre la que abundan historias algo oscuras.
Extra&ntilde;amente, nadie puede ofrecer ayuda para llegar a Cyclone
hasta que finalmente los viajeros son conducidos hacia la direcci&oacute;n
correcta. 
<P>
<B><FONT SIZE=4>Nuevas sorpresas</FONT></B>
<P>
En esta aventura en primera persona controlas las acciones de
nuestra intr&eacute;pida pareja cuando llegan al motel de Cyclone.
Pronto descubrir&aacute;s que Cyclone no es simplemente un apacible
pueblecillo. Conocer&aacute;s brevemente a Charles Spencer, el
hotelero, pero no encontrar&aacute;s a ninguno m&aacute;s de los
ciudadanos de Cyclone. El pasado se est&aacute; repitiendo, todo
el mundo ha ido desapareciendo y vuestros amigos no est&aacute;n
por ninguna parte. Aparentemente, Charles es la &uacute;nica persona
que queda; no est&aacute; muy contento de veros y os advierte
que no sig&aacute;is por all&iacute; por la ma&ntilde;ana. Y ya
no os ver&aacute;, porque ser&aacute; &eacute;l el quien desaparecer&aacute;&#133;
quedando vosotros abandonados a vuestra suerte.
<P>
Bueno, eso no es estrictamente cierto; hay montomes de pistas
escondidas por ah&iacute; para que las encuentres y sigas. Tus
amigos de la banda sab&iacute;an que algo malo estaba pasando
y dejaron pistas en sus videoclips de rock. (&#161;Significado
en un video de rock! &#191;He o&iacute;do alguien exclamar por
la sorpresa?) Tambi&eacute;n hay pedazos de papel con mensajes
encriptados y extra&ntilde;os dibujos que no tendr&aacute;n mucho
sentido hasta que no descubras a qu&eacute; objeto en concreto
se refieren, y diarios, mensajes en contestadores autom&aacute;ticos
y una multitud de otros detalles y piezas. As&iacute; que tendr&aacute;s
que ser diligente en tu b&uacute;squeda. Cada pedazo importante
de informaci&oacute;n que descubras ser&aacute; grabado en tu
fichero de <I>Flashback</I>, as&iacute; que no tendr&aacute;s
que tomar muchas notas o copiar dibujos extra&ntilde;os.
<P>
<B><FONT SIZE=4>La Prueba</FONT></B>
<P>
Tu objetivo es descubrir qu&eacute; ha estado pasando en Cyclone
y rescatar a tus amigos. Para ello tienes que pasar una prueba
y convertirte en un <I>Guerrero</I> lo cual accarrea localizar
doce bastones sagrados o <I>Bahos</I> y colocarlos en su recept&aacute;culo
correspondiente del <I>Kiva</I> (altar). Exceptuando el primero,
cada Bahos est&aacute; encerrado tras un puzzle que est&aacute;
escondido en alg&uacute;n lugar del pueblo de Cyclone. Problemas
tradicionales, por ejemplo, encontrar llaves y seguir varias pistas
es generalmente la manera de avanzar por la ciudad, mientras que
los rompecabezas de los Bahos son generalmente de la variedad
abstracta. Algunos requieren que arrastres mostradores u otros
objetos por ah&iacute; sobre una tabla, para solucionar un laberinto
cambiante, manipular bolas numeradas en orden num&eacute;rico,
etc. Si ya has jugado el primer Shivers ya sabr&aacute;s lo que
te espera. Aunque en general he encontrado este juego m&aacute;s
complicado que el primero, curiosamente no tuve tantos problemas
con sus rompecabezas de manipulaci&oacute;n.
<P>
Conducir los Bahos hasta su altar tambi&eacute;n tiene su miga
pues en el juego tienes una barra de 'vida' que va decrement&aacute;ndose
cuando llevas un Bahos, haci&eacute;ndose esencial actuar r&aacute;pido
para librarse de ellos. La dificultad est&aacute; en que debes
llegar r&aacute;pidamente a la cueva y emparejar cada Bahos con
su glifo, y despu&eacute;s resolver otro rompecabezas antes de
aproximarte al Kiva. Durante la exploraci&oacute;n de la cueva
tu energ&iacute;a tambi&eacute;n ser&aacute; absorbida por los
glifos que decoran las paredes.
<P>
Harvest of Souls trae un mont&oacute;n de diversi&oacute;n, y
es especialmente adecuado para jugadores a los que les gusta resolver
rompecabezas. Yo estuve esperando impacientemente que saliera
y la espera vali&oacute; la pena. Adem&aacute;s incluye opciones
para conectarte por Internet y jugar junto a tus amigos o redise&ntilde;ar
algunos de los rompecabezas. El area de juego es casi a pantalla
completa e incluye un suave scroll y subt&iacute;tulos. Tambi&eacute;n
hay buenas noticias para aquellos que realmente disfrutan 'sufriendo'
y quieren las cosas tan dif&iacute;ciles como sea posible: se
puede desactivar el 'cursor inteligente' de manera que los objetos
significativos no sean desvelados autom&aacute;ticamente. Felicidades
a los dise&ntilde;adores por incluir esta opci&oacute;n, aunque
el interfaz no tiene iconos de acci&oacute;n que permitan elegir
entre 'mirar' los objetos o 'usarlos'.
<P>
Realmente est&aacute; muy bien. Tiene mi aprobaci&oacute;n. Y
no he hecho ninguna critica seria&#133; hasta ahora. Lamentablemente
tengo que hacerla, debido a algo que sucede al final del juego.
No s&oacute;lo hay un puzle con tiempo limitado, sin&oacute; que
adem&aacute;s aparece justo despu&eacute;s de un cambio de CD
y una escena intermedia que no puede saltarse&#133; y adem&aacute;s
sin la posibilidad de salvar la partida. Olvida resolver el puzle
y no alcanzar&aacute;s el 'final feliz'. Volverlo a intentar significa
dos cambios de disco y ver la escena intermedia otra vez, as&iacute;
que si tienes que hacerlo unas cuantas veces tu paciencia ser&aacute;
puesta a prueba.
<P>
No creo que esa experiencia final diera m&aacute;s emoci&oacute;n
al juego, tal y como sin duda se intent&oacute; que lo hiciera,
pero dejar&eacute; el vereditco final en tus manos. A m&iacute;
no me estrope&oacute; un juego que disfrut&eacute; de principio
a fin.
<H4><I>Copyright</I> &copy; Rosemary Young 1997. Todos los derechos
reservados. </H4>
<HR>
<P>
<CENTER></P><FONT SIZE=2>La versi&oacute;n original de este art&iacute;culo
fue escrita por <B>Rosemary Young</B> y publicada en</FONT> </P></CENTER>
<P>
<CENTER><FONT SIZE=2>&quot;<A HREF="http://www.iinet.net.au/~quandary/">Quandary, The magazine for Adventure, Puzzle and RPG players</A>&quot;</P></FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>y ha sido adaptada por <B>Ra&uacute;l &Aacute;lvarez</B>.</FONT></CENTER>
<HR>
<P>
<CENTER></P>[<A HREF="coment.htm">Volver atr&aacute;s</A>] </P>
<BR>
</CENTER>
</BODY>
</HTML>
