<HTML>
<HEAD>
<TITLE>SQ Comentario: Indiana Jones y sus Aventuras de Despacho
</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">
<P>
<CENTER><B><FONT SIZE=6>Indiana Jones y sus Aventuras de Despacho</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="c-idesk.gif" ALT="IMAGEN"></CENTER>
<P>
<CENTER><B>Casa: </B>LucasArts Entertainment Company <B>Tipo</B>:
Videoaventura</CENTER>
<P>
<CENTER><B>Autores:</B> Hal Barwood, Wayne Cline, Mark Crowley,
Reed Derleth, Paul LeFevre y Tom Payne</CENTER>
<P>
<CENTER><B>Idioma:</B> castellano <B>Precio: </B>1995 pts <B>Sistema:
</B>Windows 3.1, 386</CENTER>
<HR>
<P>
&quot;Que bueno que me haya podido librar de Jezabel durante un
buen rato, as&iacute; os puedo explicar algo sobre este juego.
S&iacute;, ella ahora mismo le est&aacute; dando a 'Indiana Jones
and his Desktop Adventures', le encanta. A m&iacute; no, yo lo
odio.Odio deambular por ah&iacute;, buscando objetos que sin ton
ni son yacen esparcarcidos por un mapeado hecho a 'cachos'. Odio
estar constantemente disparando o d&aacute;ndole latigazos a todo
el que se cruza por mi camino. Odio las conversaciones predeterminadas,
ya ni tan siquiera puedo decir algo a elegir entre varias opciones
(aunque fuesen paridas). Y sobretodo, odio los juegos que se basan
s&oacute;lo en d&aacute;le este objeto A a eso-que-ni-se-mueve,
y &eacute;l te dar&aacute; el objeto B. Y encima ella me despert&oacute;
especiamente para que lo viera. Sinceramente, habr&iacute;a preferido
que hubiera interrumpido mi sue&ntilde;o para jugar a cualquier
otra cosa, aunque hubiera sido para terminar 'El Viejo Archivero'
por cuadrag&eacute;sima segunda vez.
<P>
Pero a ella le gusta, cada partida le parece diferente, y se entretiene.
No se da cuenta que cada partida es m&aacute;s de lo mismo, que
s&oacute;lo cambian los objetos en s&iacute;, y la ubicaci&oacute;n
de &eacute;stos. Espero que a Jezabel no se le suba a la cabeza,
y le empiecen a atraer los arcades, ser&iacute;a algo peligroso,
porque esto no es una aventura&#133; &#191;verdad?
<P>
- CAPIT&Aacute;N, &#191;PUEDES VENIR?- Su met&aacute;lica voz
reson&oacute; por toda la nave. - ME ABURRO.&quot;
<HR>
<P>
<B>Principal virtud:</B> 
<P>
&#191;Ideal para jugar en port&aacute;tiles? Yo desde luego si
tuviera un port&aacute;til lo &uacute;ltimo que me pondr&iacute;a
a hacer ser&iacute;a gastar bater&iacute;a jugando a &eacute;sto&#133;
<P>
<B>Principal defecto:</B> 
<P>
El haber utilizado en el nombre 'Indiana Jones', no se lo merece.
Esperemos que lo pr&oacute;ximo de LucasArts sea mejor.
<P>
<B>La pista:</B> 
<P>
Al instalar pon atenci&oacute;n a los ficheros que instala en
tu directorio SYSTEM\ de Windows. Los de Lucas se ve que se olvidaron
de una opci&oacute;n de desinstalaci&oacute;n. {Lo siento, no
se me ocurri&oacute; otra pista mejor&#133;}
<P>
<CENTER><I><FONT SIZE=2>Mensaje de Pompeyo, desde la Nasartek
VII en misi&oacute;n de b&uacute;squeda de nuevas formas de vida.</FONT></I></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm" >Volver</A>]</CENTER>
<P>
</BODY>
</HTML>
