<HTML>
    <HEAD>
    <meta charset="utf-8">
<TITLE>
         SQ Comentario: I-0
    </TITLE>
    <META NAME="AUTHOR" CONTENT="Daniel Cardenas">
    <META NAME="DESCRIPTION" CONTENT="Comentario del excelente I-0: Jailbait on Interstate Zero">
    </HEAD>
    <BODY BACKGROUND="crystal1.gif" BGCOLOR="#CC70AA" TEXT="#FFFFFF" LINK="#0000B0" VLINK="#0000B0">

<CENTER>
<TABLE WIDTH=100% BORDER=0><TR><TD>

<CENTER>

<FONT SIZE=6>I-0: Jailbait on Interstate Zero</FONT><BR>
<FONT SIZE=3><B>Autor</B>: Adam Cadre</FONT><BR>
<FONT SIZE=3><B>Idioma</B>: Ingl&eacute;s</FONT>
<FONT SIZE=3><B>Precio</B>: <SAMP>&#161;GRATUITA!</SAMP></FONT><BR>
<FONT SIZE=3><B>Tipo</B>: Aventura conversacional</FONT>
<FONT SIZE=3><B>Sistema</B>: <SAMP>Inform</SAMP></FONT>
</CENTER>
<HR>
<P>
En esta aventura encarnamos a una jovencita (menor de edad, <I>jailbait</I>),
que vuelve a casa para celebrar con su familia el d&iacute;a de Acci&oacute;n
de Gracias y su decimoctavo cumplea&ntilde;os. Antes de nada es necesario
que te pongas en situaci&oacute;n: vas conduciendo tu coche por una de estas solitarias carreteras americanas (<I>interstate</I>), que 
atraviesan el desierto y donde los coches van a toda leche (recordad
aquellas carreteras sin un alma de 'El Coche Fant&aacute;stico'), hace un 
calor terrible y tu coche se aver&iacute;a... El lugar civilizado m&aacute;s
cercano se encuentra desesperadamente lejos, &#191;qu&eacute; piensas hacer ahora? 
&#191;Seguir a pie o quiz&aacute; hacer auto-stop?
<P>
El hecho de que manejemos a una chica (y adem&aacute;s joven y atractiva) es 
algo que debe ser tenido en consideraci&oacute;n en todo momento. En algunas 
ocasiones ello nos meter&aacute; en un l&iacute;o sin casi darnos cuenta, y en cambio
en otras podremos 'rebajarnos' y emplear un amplio surtido de 
<I>m&eacute;todos femeninos</I> para salir del aprieto.
<P>
I-0 es una aventura muy original por esta forma tan realista de tratar
la f&eacute;mina protagonista. Pr&aacute;cticamente podremos hacer todo
lo que se nos pase por la cabeza, s&iacute; has leido bien... 
<SAMP>TODO</SAMP>. Aqu&iacute; es donde Adam Cadre, el autor, basa buena
parte del humor que puedes encontrar en la aventura. Y es un humor sano,
alegre y muy divertido, sin caer en vulgaridades en ning&uacute;n momento.
<P>
En el juego pr&aacute;cticamente no hay puzzles, es un juego de examinar
cosas y de experimentar. De examinar porque los 'No puedes ver eso' o el
'No tiene nada de especial' brillan por su ausencia, y de experimentar, 
porque el juego tiene respuestas para todo y m&aacute;s. Por si fuera poco
I-0 no es lineal, 
lo cual no es nada habitual hoy d&iacute;a (ni siquiera en aventuras
comerciales). Y no lo es en el sentido de que los problemas se pueden 
afrontar y resolver de muy variadas formas, y esto hace que podamos jugar 
dos partidas total y absolutamente diferentes, con casi nada que ver. 
Un hecho que resulta muy significativo es que puedes acab&aacute;rtelo sin necesidad de ni tan siquiera 
pasar por la mitad de las localidades.
<P>
Sinceramente ha sido de lo mejorcito que un servidor ha tenido la oportunidad
de jugar en much&iacute;simo tiempo. Su secreto es que est&aacute; plagada
de peque&ntilde;os detalles, que es lo que verdaderamente hace grande
a este juego, y lo que lo convierte (para mi modesto entender) en toda
una peque&ntilde;a obra maestra. Esperemos que <I>Lost Anaheim Hills</I>,
la &uacute;ltima aventura de Adam sea tan buena como &eacute;sta.
<P>

<P>
<HR>
<B>Lo mejor</B>: I-0 tiene desde el principio toda la pinta de pel&iacute;cula de serie B, y
posiblemente &eacute;sa sea la sensaci&oacute;n que se pretenda dar. 
La ambientaci&oacute;n conseguida es muy buena, que unido a la
forma como se ha concebido la aventura hace que no cueste nada meterse
en la piel de la protagonista.
<P>
<B>Lo <I>m&aacute;s</I> mejor</B>: La no-linealidad, la originalidad y el precio, 0 ptas 
(baj&aacute;telo <A HREF="ftp://ftp.gmd.de/if-archive/games/infocom/I-0.z5">aqu&iacute;</A> y
recuerda que necesitar&aacute;s un <A HREF="ftp://ftp.gmd.de/if-archive/infocom/interpreters">int&eacute;rprete</A> para tu ordenador).
<P>
<B>Consejo</B>: Cuando te la acabes, vu&eacute;lvela a jugar intentando
utilizar otras estrategias. Tambi&eacute;n resulta divertido probar
cosas para ver como resultan (si son locuras, los finales te ser&aacute;n
igualmente interesantes).
<P>
<B>Especialmente recomendado para</B>... gente que se quiera reir un rato.
<P>

<P>
<CENTER><I>Comentado por Daniel C&aacute;rdenas</I></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</CENTER>

</TD></TR></TABLE>
</CENTER>
</BODY>
</HTML>
