<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Larry 7: Love for Sail</TITLE>
</HEAD>
<BODY BGCOLOR="#00ffff" TEXT="#000000" LINK="#000000" VLINK="#808080">
<P>
<CENTER><FONT SIZE=5>LEISURE SUIT LARRY 7</FONT></CENTER>
<P>
<CENTER><FONT SIZE=5>LOVE FOR SAIL</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-l7-c.jpg" ALT="Larry estrecha la mano a la Capitana Quemuslos"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo:</FONT></B><FONT SIZE=2> Aventura
gr&aacute;fica <B>Idioma:</B> &Iacute;ntegramente subtitulado
en castellano</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores:</FONT></B><FONT SIZE=2> Al Lowe,
Don Munsil <B>Casa:</B> Sierra On-Line <B>Precio:</B> 4975 pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistemas Operativos:</FONT></B><FONT SIZE=2>
MS-DOS 5.0 o superior, Windows 3.1, Windows 95</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Hardware:</FONT></B><FONT SIZE=2> PC 486
/ 66 (Pentium recomendado), 8 Mb RAM (16 Mb recomendados), 28
Mb HD, CD-ROM 2x, rat&oacute;n, VESA</FONT></CENTER>
<HR>
<P>
Como todo buen Larry que se precie, &quot;<B>Love for Sail</B>&quot;
comienza con el abandono a que el lig&oacute;n es sometido por
su &uacute;ltima conquista en el juego anterior. En este caso
es Shamara, aquella hermosa chica a la que Larry rescat&oacute;
de una crisis existencial en La Costa Lotta, quien deja a nuestro
amigo en una situaci&oacute;n comprometida (concretamente, encadenado
a una cama en llamas). Pese a salir escaldado del asunto, Larry
no se deja amedrentar y se embarca en un crucero - el lugar ideal
para continuar dedic&aacute;ndose a su tarea favorita.
<P>
Como ya ocurriera en Larry 6, este nuevo episodio de la saga se
centra en las conquistas y ligoteos de Larry. &#191;Para qu&eacute;
hace falta argumento en un juego as&iacute;? Lo que la gente quiere
es un mont&oacute;n de t&iacute;as con las que Larry protagonice
las absurdas y humillantes escenas que le caracterizan. Lejos
quedaron los tiempos de las complicadas tramas de Larry 5 - fracasos
estrepitosos a juzgar por la respuesta que el juego obtuvo del
p&uacute;blico.
<P>
La estructura del juego es muy simple, todo se reduce a satisfacer
los caprichos y deseos de las diveras f&eacute;minas con las que
Larry se encuentra con el &uacute;nico objetivo de llevarlas al
huerto. A todo esto hay que a&ntilde;adir un concurso en el que
Larry participa realizando varias pruebas, con un sabroso premio
para el ganador: poder pasar una semana en la intimidad junto
a la sensual capitana del barco. &#161;Ah! Y tambi&eacute;n est&aacute;
la b&uacute;squeda de los &quot;consolators&quot;, unos peque&ntilde;os
consoladores disfrazados de &quot;&#191;D&oacute;nde est&aacute;
Wally?&quot; que est&aacute;n escondidos por todo el escenario
del juego.
<P>
<CENTER><IMG SRC="c-l7-b.jpg" ALT="Los &uacute;ltimos momentos en La Costa Lotta"></CENTER>
<P>
El juego se maneja mediante un cursor con forma de cond&oacute;n
que se desenrosca cuando pasa sobre un &quot;punto caliente&quot;
de la pantalla. Cuando pulsamos el bot&oacute;n del rat&oacute;n
con el cursor situado sobre alg&uacute;n elemento interactivo,
aparece un men&uacute; de verbos 'sensible al contexto' que ofrece
las acciones v&aacute;lidas para ese elemento. Adem&aacute;s hay
una opci&oacute;n que nos permite teclear otros verbos si los
que el men&uacute; nos ofrece nos resultan insuficientes.
<P>
El sistema de conversaciones se basa en un men&uacute; de t&oacute;picos
sobre los que hablar e incluye tambi&eacute;n una opci&oacute;n
para introducir v&iacute;a teclado t&oacute;picos adicionales.
<P>
Tambi&eacute;n se pone al alcance del jugador una ventana de inventario,
un plano del barco para desplazarse por &eacute;l r&aacute;pidamente,
un control de la velocidad de caminar de Larry, un mezclador que
permite controlar los vol&uacute;menes de la m&uacute;sica, las
voces y los efectos de sonido, y otras curiosas opciones tales
como el &quot;nivel de asquerosidad&quot; y un &quot;estabilizador
del barco&quot;.
<P>
La realizaci&oacute;n es muy buena. De todos los juegos de Sierra
que se han hecho mediante dibujos animados &eacute;ste es, con
diferencia, el que cuenta con mejores animaciones. Los fondos
son simples pero est&aacute;n bien dibujados y tienen un colorido
perfectamente conseguido. La m&uacute;sica es de buena calidad,
y est&aacute; digitalizada (nada de MIDI), as&iacute; que suena
todo lo bien que puede en tarjetas de 16 bits st&eacute;reo tipo
Sound Blaster 16.
<P>
Como conjunto, Larry 7 funciona perfectamente: est&aacute; bien
realizado, es muy maniobrable y c&oacute;modo de manejar, ofrece
una flexibilidad adecuada y, sobre todo, es divertido. No es un
juego muy largo y no dar&aacute; ning&uacute;n problema a aventureros
expertos, pero sin duda vale las cinco mil pelas que cuesta.
<HR>
<P>
<TABLE >
<TR><TD WIDTH=292><B><FONT SIZE=2>La pista:</FONT></B>
<P>
<FONT SIZE=2>Un buen explosivo puede ayudarte a ganar una partida de bolos.</FONT>
<P>
<B><FONT SIZE=2>Jugando con el teclado:</FONT></B>
<P>
<FONT SIZE=2>Ctrl-P te servir&aacute; para entrar en el modo <I>psicod&eacute;lico</I> y Ctrl-C para hacer trampas en el juego de los dados.</FONT>
<P>
<B><FONT SIZE=2>Cybercrap:</FONT></B>
<P>
<FONT SIZE=2>Entre las diversas tonter&iacute;as que el juego ofrece est&aacute;n el <I>Cybersniff 2000</I> (permite experimentar los olores del juego), el <I>CyberStar 2000</I> (permite insertar tu cara en el juego) y otras <I>cyber-paridas</I> similares.</FONT>
<P>
<B><FONT SIZE=2>Los huevos de Larry:</FONT></B>
<P>
<FONT SIZE=2>Si encuentras todos los huevos de pascua, los 32 consolators y los 1000 puntos del juego podr&aacute;s ver una escena adicional al final de &eacute;ste.</FONT>
</TD><TD WIDTH=291><B><IMG SRC="c-l7-a.gif" ALT="Una dulce se&ntilde;orita"></B></TD></TR>
</TABLE>
<P>
<I>Juego comentado de manera pol&iacute;ticamente correcta por
<B>Ra&uacute;l &Aacute;lvarez</B>.</I>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</CENTER>
<BR>
</BODY>
</HTML>
