<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: The Metor, the Stone and a Long Glass of Sherbet
</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">
<P>
<CENTER><B><FONT SIZE=6>The Meteor, the Stone and a Long Glass
of Sherbet<BR>
</FONT></B></CENTER>
<P>
<CENTER><B>Autor: </B>Graham Nelson</CENTER>
<P>
<CENTER><B>Tipo</B>: Aventura de texto</CENTER>
<P>
<CENTER><B>Idioma:</B> ingl&eacute;s <B>Precio: </B>freeware (b&aacute;jatelo
<A HREF="ftp://ftp.gmd.de/if-archive/games/infocom/sherbet.z5">aqu&iacute;</A>)</CENTER>
<P>
<CENTER><B>Sistema: </B>Cualquiera que posea un int&eacute;rprete
de Infocom, o sea casi todos</CENTER>
<HR>
<P>
El se&ntilde;or Graham nos ha vuelto a sorprender con una aventura
excelente, un trabajo que recientemente se ha impuesto en el IF
Contest. Adem&aacute;s de la que nos ocupa, este profesor de Matem&aacute;ticas
de la Universidad de Oxford cuenta en su curr&iacute;culum con
'Curses' (1993) y 'Jigsaw' (1995). Sus creaciones destacan por
un alto contenido en puzzles, y 'The Meteor, the Stone and a Long
Glass of Sherbet' tambi&eacute;n hace gala de ello, aunque todos
los problemas que encontraremos son l&oacute;gicos y est&aacute;n
excelentemente planteados. A destacar tambi&eacute;n que la mayor&iacute;a
de ellos se pueden solucionar no de una, sino de varias formas,
algo que sin duda se agradece.<BR>
<P>
El comienzo del juego es harto curioso, con nuestro personaje
-un embajador de 'The Duchy'- subido a un elefante y a cabeza
de una procesi&oacute;n de estos animales. Como compa&ntilde;era
y d&aacute;ndole al pico tanto que aburre hasta a las ovejas,
est&aacute; nuestra anfitriona, Lady Amilia. Nosotros estamos
bastante hartos de todo esto, tanto viaje oficial, y tan poca
aventura. Y como lo que queremos son emociones, lo primero que
deberemos hacer ser&aacute; detener la procesi&oacute;n y escapar&#133;
<BR>
<P>
Esta primera parte no ser&aacute; m&aacute;s que pura introducci&oacute;n,
ya ver&eacute;is que el resto del juego guardar&aacute; un tono
totalmente diferente y, de verdad, que al empezar a jugar uno
no se esperas que lo que va a venir despu&eacute;s vaya a ser
una aventura tipo treasure-hunting (como la Aventura Original).
Esto le resta originalidad, pero&#133; &#191;qu&eacute; m&aacute;s
da la originalidad si el juego resulta divertido? Y la diversi&oacute;n
la encontraremos en los puzzles, en la cuidada ambientaci&oacute;n,
en las muchas curiosidades que hay repartidas por el juego, y
en el estilo, descripciones y dem&aacute;s. <BR>
<P>
Encontraremos muchas cosas que quiz&aacute; recuerden al cl&aacute;sico
Zork, sobre todo en la ambientaci&oacute;n y el estilo de las
localidades. Y el estilo de lanzamiento de hechizos es id&eacute;ntico
al de Enchanter: los encantamientos (que hay que aprenderlos previamente)
se lanzan escribiendo su nombre y el objeto destino. Por cierto,
que en el mundo que se nos plantea, se pensaba que la magia hab&iacute;a
desaparecido, as&iacute; que una de nuestras misiones en el juego
ser&aacute; el investigar todo esto.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Los puzzles, que est&aacute;n magn&iacute;ficamente planteados,
y que adem&aacute;s se puedan resolver de varias formas diferentes.
<P>
<B>Principal defecto:</B> 
<P>
Para muchos la originalidad, aunque de todas formas, aquellos
que piensen que los treasure-hunting est&aacute;n pasados ya de
moda, no deber&iacute;an dejar de echarle un vistazo a este interesante
juego. Para otros, quiz&aacute; la falta de m&aacute;s aventura
en s&iacute; (de m&aacute;s historia), o la escasez de PNJ's (PSI's)
o la sobrecarga de puzzles. Como siempre, cuesti&oacute;n de gustos.
<P>
<B>Recomendado especialmente para:</B>
<P>
Aventureros con suficiente paciencia para resolver los problemas
que se le puedan presentar. Hay que decir que en la aventura se
incluyen hints (pistas) para los que gusten de 'desatascos' r&aacute;pidos
y efectivos.
<P>
<CENTER><I>Comentado por Daniel &quot;varios neses sin point&amp;click&quot;
C&aacute;rdenas</I></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm" >Volver</A>]<BR>
</CENTER>
<P>
</BODY>
</HTML>
