<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: The Curse of Monkey Island</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#CC0066" TEXT="#FFFFFF" LINK="#FFFF00" VLINK="#FFFF00" ALINK="#FFFF00">
<P>
<CENTER><FONT SIZE=5>The Curse of </FONT></CENTER>
<P>
<CENTER><FONT SIZE=7>Monkey Island</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-mi3-1.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo:</FONT></B><FONT SIZE=2> Aventura
gr&aacute;fica <B>Idioma:</B> Voces y textos en castellano <B>Precio:</B>
6990 pesetas</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores:</FONT></B><FONT SIZE=2> Jonathon
Ackley y Larry Ahern <B>Casa:</B> LucasArts (<A HREF="http://www.lucasarts.com">http://www.lucasarts.com</A>)</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema:</FONT></B><FONT SIZE=2> PC con
Windows 95, lector CDROM de cuadr&uacute;ple velocidad o superior,
procesador Pentium o superior, 16 MB de memoria RAM (32 MB recomendados),
5 MB disco duro (0.5 MB adicionales por cada partida que se desee
salvar), rat&oacute;n, tarjeta de sonido compatible con DirectSound,
tarjeta gr&aacute;fica compatible con DirectDraw. Requiere DirectX
5.0 o superior (el juego incluye DirectX 5.0). Si deseas jugar
bajo Windows NT, pulsa <A HREF="#nt">aqu&iacute;</A>.</FONT></CENTER>
<HR>
<P>
<TABLE CELLSPACING="11">
<TR><TD>&#191;Pero no has jugado <I>The Curse of Monkey Island</I> a&uacute;n? Ya sabes... el tercer episodio de la famos&iacute;sima serie de aventuras iniciada por LucasArts hace ocho a&ntilde;os... &#161;ocho a&ntilde;os, y la gente a&uacute;n se acordaba del aprendiz de pirata Gybrush, del fantasma Le Chuck y del resto de pintorescos personajes que habitaban la pintoresca visi&oacute;n del Caribe pirata imaginada por el no menos pintoresco Ron Gilbert...! Y es que tanto <I>The Secret of Monkey Island</I> como su continuaci&oacute;n <I>Le Chuck's Revenge</I> son juegos m&iacute;ticos que elevaron a LucasArts y al propio Gilbert hasta la categor&iacute;a de dioses de la aventura gr&aacute;fica. Desde jugadores arcadianos hasta aventureros puristas que pensaban que aventura gr&aacute;fica era sin&oacute;nimo de hez, todos ca&iacute;mos en las redes. Y en una &eacute;poca, la actual, donde las buenas aventuras gr&aacute;ficas brillan por su ausencia (sin contar el malogrado <I>The Last Express</I>, cuya originalidad y calidad nunca dejar&eacute; de reivindicar) ha sido todo un placer contemplar las encontradas reacciones que el &uacute;ltimo y esperad&iacute;simo engendro de la serie, <I>The Curse of Monkey Island</I> (en dos palabras <I>Monkey 3</I>), ha causado entre el p&uacute;blico.
</TD></TR>
<TR><TD><B><IMG SRC="c-mi3-2.jpg" HSPACE=10 ALIGN="LEFT"></B>Para algunos <I>Monkey 3</I> es la gloria, la mejor aventura de los &uacute;ltimos a&ntilde;os, un juego ingenioso y divertido, impresionante t&eacute;cnicamente y que sabe estar a la altura en todo momento. Para otros no es m&aacute;s que un paso atr&aacute;s en la casi impecable producci&oacute;n aventurera de LucasArts. Sea como sea, y para todos aquellos que me honr&aacute;is leyendo estas l&iacute;neas (&#161;hola pap&aacute;!, &#161;hola mam&aacute;!), pasar&eacute; a comentar mis impresiones sobre todo este asunto.
<P>
Como parece ser menester en este tipo de comentarios, explicar&eacute; brevemente el argumento del juego. Al comienzo, Guybrush se encuentra a la deriva en el mar, flotando en un coche de feria y matando las horas, la sed y el hambre intentando poner orden a sus recuerdos sobre los hechos acontecidos durante sus desventuras anteriores. Todo parece perdido, pero al final Guy llega a una isla donde casualmente se encuentra Elaine. Gubrush le pide que se case con &eacute;l, entreg&aacute;ndole un anillo de compromiso de procedencia dudosa... y que resulta llevar incrustada una maldici&oacute;n que transforma a Elaine en una estatua de oro. Revertir la maldici&oacute;n de Elaine es la excusa utilizada por el juego para llevar a los jugadores por un largo y en alg&uacute;n momento tortuoso camino de problemas, puzles y obst&aacute;culos, tras el cual el juego da un giro y se centra en el enfrentamiento entre Le Chuck y Guy y la explicaci&oacute;n a algunos interrogantes que dej&oacute; abiertos <I>Monkey Island 2</I>. Hablo de un giro, porque, realmente, todo el tema de la maldici&oacute;n del anillo, una vez concluido, no tiene ninguna trascencencia en la parte final del juego y hace que la trama quede algo sesgada.
</TD></TR>
<TR><TD><B><IMG SRC="c-mi3-3.jpg" HSPACE=10 ALIGN="LEFT"></B>
<P>
Los autores Larry Ahern y Jonathon Ackley manifestaron durante la producci&oacute;n del juego su intenci&oacute;n de retener la no linealidad en el desarrollo que ofrec&iacute;an <I>Monkey 1</I> y <I>2</I>, para permitir que el jugador bloqueado en una situaci&oacute;n concreta pudiera seguir jugando por otro camino y volver a ella m&aacute;s tarde. Lamentablemente he de decir que esto no es posible en <I>Curse</I> (cuyo dise&ntilde;o me recuerda m&aacute;s al de, pongamos, <I>Sam &amp; Max Hit The Road</I>) y que para avanzar hay que ir resolviendo los rompecabezas siguiendo un orden bastante poco flexible. Eso s&iacute;, tampoco estamos ante un juego tan lineal como el reciente <I>Broken Sword II</I>, donde en todo momento la acci&oacute;n se reduc&iacute;a a tres o cuatro localidades y otros tantos objetos. Durante las secciones m&aacute;s largas de <I>Monkey 3</I> podemos explorar con bastante libertad varias islas, pero el orden de resoluci&oacute;n de los problemas est&aacute; bastante marcado.
<P>
Como se estila en los &uacute;ltimos lanzamientos de LucasArts, la presentaci&oacute;n del juego pretende emular una pel&iacute;cula de dibujos, y la verdad es que lo consigue. La animaci&oacute;n de los personajes est&aacute; muy conseguida y se integra a la perfecci&oacute;n en los fondos, que est&aacute;n muy bien acabados y tienen un luminoso colorido pleno de contrastes. Un m&aacute;s que aceptable doblaje al castellano de todas las voces y la agradable m&uacute;sica, que incluye nuevas versiones de algunos temas cl&aacute;sicos de la serie, son la guinda que completan un pastel con el que saciar nuestra vista y o&iacute;dos. Lamentablemente nos han llegado noticias de que en la versi&oacute;n espa&ntilde;ola del juego se ha eliminado una divertida secuencia durante la transici&oacute;n entre los cap&iacute;tulos tres y cuatro. &#161;Vaya chasco!
</TD></TR>
<TR><TD><B><IMG SRC="c-mi3-4.jpg" HSPACE=10 ALIGN="LEFT"></B>Para motivar a Guybrush (quien, por si a&uacute;n no lo sab&iacute;as, es el personaje que manejamos en el juego) en las acciones que nos gustar&iacute;a que llevara a cabo, disponemos de un interfaz similar al de <I>Full Throttle</I>. Movemos el puntero por pantalla buscando los objetos que podemos manipular. Cuando el puntero se ilumina, dejando pulsado el bot&oacute;n izquierdo del rat&oacute;n aparece un peque&ntilde;o men&uacute; que nos ofrece tres opciones: ojo (para examinar), boca (representa las acciones hablar, comer, morder, ...) y mano (coger, dar, usar, ...). Dicho men&uacute; tambi&eacute;n permite manipular los objetos del inventario que aparecen cuando pulsamos el bot&oacute;n derecho del rat&oacute;n. Es posible seleccionar los objetos para utilizarlos sobre elementos del entorno o para intentar combinarlos con otros objetos del inventario. Para las personas a las que este sistema les parezca demasiado tedioso, existe la posibilidad de utilizar el teclado para acceder directamente a las acciones.
<P>
En cuanto a los personajes, hay que reconocer que los artistas de la Lucas han hecho un gran trabajo y han conseguido mantener el esp&iacute;ritu de lo sprites originales. Especialmente conseguido Guybrush, aunque algo m&aacute;s alto y flacucho, sigue siendo el divertido pardillo de anta&ntilde;o. Elaine se presenta como una mujer algo m&aacute;s neur&oacute;tica y menos expeditiva que de costumbre. Y respecto a Le Chuck... si bien sigue siendo el canalla de siempre, esta ocasi&oacute;n muta a zombi retorcido algo m&aacute;s chulesco de lo habitual.<P>
Dos de los aspectos m&aacute;s cuidados en las aventuras de LucasArts son los puzles y los di&aacute;logos. Los di&aacute;logos de Monkey 3 son bastante graciosos y entretenidos, aunque no son ni mucho menos tan ingeniosos e innovadores como los de sus predecesores, y quedan lejos de aquellas desternillantes luchas de insultos en <I>Monkey 1</I> o de las divertidas disquisiciones de Herman Toothroot en <I>Monkey 2</I>. Los puzles no son tan complicados como en <I>Monkey 2</I>, pero tampoco son f&aacute;ciles. El interfaz ofrece tres opciones (ojo, boca, mano) que resultan muy gen&eacute;ricas y nada expl&iacute;citas (por ejemplo 'mano' engloba a los antiguos dar, coger, abrir, cerrar, encender, apagar, usar, empujar, tirar), por lo que en ocasiones el modo concreto en que un objeto se usa puede resultar del todo inesperado.
<P>
Oficialmente el juego solo funciona bajo Windows 95 pero tambi&eacute;n es posible correrlo bajo las &uacute;ltimas versiones del NT (pulsa <A HREF="#nt">aqu&iacute;</A> para ver c&oacute;mo); eso s&iacute;, en ambos sistemas es requisito impepinable tener el DirectX versi&oacute;n 5.0 o superior instalado y funcionando. DirectX es un conjunto de librer&iacute;as creado por Microsoft para ofrecer a los programadores de juegos una interficie de acceso al hardware eficiente. Lamentablemente se trata de un software bastante nuevo y da todo tipo de problemas de configuraci&oacute;n, especialmente a los que poseen equipos con hardware poco est&aacute;ndar. La moraleja de este p&aacute;rrafo es que antes de comprarte el juego pruebes que el DirectX se instala y funciona sin problemas en tu ordenador.
<P>
Inicialmente solo hacen falta unos pocos megas de espacio libre de disco duro, pero cada partida salvada ocupa medio mega adicional. No hay la posibilidad de instalar en disco duro parte del contenido de los CDs para acelerar el rendimiento del juego, cosa que ser&iacute;a de agradecer pues en algunos momentos las animaciones dan algunos parones.<P>
Este comentario quiz&aacute; da la impresi&oacute;n de que <I>Curse of Monkey Island</I> no es ninguna maravilla, y eso no es demasiado justo. &#161;Estamos compar&aacute;ndolo con dos de las aventuras m&aacute;s m&iacute;ticas de toda la historia! Pese a todas mis cr&iacute;ticas, ninguna demasiado grave, he de decir que el juego es un digno sucesor de la serie y que es de lo mejorcito que he visto en los &uacute;ltimos meses. Sin ir m&aacute;s lejos, ha sido por votaci&oacute;n popular el ganador del premio Meristation Magazine a la mejor aventura de 1997, y ha llegado a obtener altas puntuaciones en distintos reviews (por ejemplo un 88/100 en PC ZONE o un 96/100 en Just Adventure). Ahora s&oacute;lo nos queda esperar a <I>Grim Fandango</I> y, qui&eacute;n sabe, a <I>Monkey Island 4</I>...
</TD></TR>
</TABLE>
<HR>
<P>
<TABLE CELLSPACING="11">
<TR><TD><B><IMG SRC="c-mi3-5.jpg" ALIGN="RIGHT"></B><B>Lo mejor:</B>
<P>
La parte audiovisual.<P>
<B>Lo peor:</B>
<P>
Las comparaciones (con sus predecesores) son particularmente odiosas (por dolorosas).<P>
<B>Cosas que se han dicho:</B>
<P>
<I>&quot;&#161;Ahora ya puedo llamar a la serie 'Trilog&iacute;a Monkey Island'!</I>&quot; -- Nancyman.
<P>
<I>&quot;Puedes escoger modo f&aacute;cil o dif&iacute;cil para los puzles, y lo mismo para el cap&iacute;tulo 3, que es una secuencia de acci&oacute;n que incluye luchas de espadas estilo Monkey 1 y batallas navales que bien podr&iacute;an parodiar &quot;Pirates!&quot; de Mircroprose. De todos modos, he que decir que, si no haces trampas y escoges los puzles dif&iacute;ciles *y* las batallas m&aacute;s dif&iacute;ciles, tendr&aacute;s las treinta horas de partida que la caja del juego proclama. Jugadores expertos / novatos podr&iacute;an encontrarlo m&aacute;s corto / largo, desde luego. En mi caso, soy una de las personas que se lo acab&oacute; en un mero fin de semana, aunque, en modo f&aacute;cil tanto para puzles como para las secuencias de acci&oacute;n. (...) De cualquier forma, es un agradable juego que recomiendo sinceramente; como dije en un review por ah&iacute;, no me pareci&oacute; tan hilarante como Sam &amp; Max, pero es el que m&aacute;s me ha hecho re&iacute;r desde entonces, lo cual es mucho&quot;</I> - Techtite.
<P>
<I>&quot;Espero que sea el &uacute;ltimo juego para LeChuck. Por muy divertido que fuese el personaje, est&aacute; empezando a cansar. Yo voto por que retomen a Murray como el principal villano en el pr&oacute;ximo juego. Murray es sin duda el personaje m&aacute;s divertido en Monkey 3 y al fin y al cabo no par&oacute; de vociferar que iba a conquistar el mundo. &#161;Ap&aacute;rtate Lechuck ahora hay una nueva fuerza maligna a tener en cuenta BAH HA HA HA!!!!&quot;</I> -- Peter.
<P>
<I>&quot;Ninguno de los puzles es demasiado dif&iacute;cil o carente de l&oacute;gica, en mi opini&oacute;n. Todo tiene su l&oacute;gica, su propio tipo de l&oacute;gica. No necesariamente la l&oacute;gica que uno usar&iacute;a para resolver esos problemas en la vida real&quot;</I> -- Hatal.
<P>
<I>&quot;... es un buen juego, probablemente el mejor del a&ntilde;o. Pero no creo que est&eacute; a la altura de sus predecesores. Recuerdo haberme re&iacute;do hist&eacute;ricamente constantamente mientras jugaba Money Island 1 y 2. Y este juego, aunque tiene algunos momentos divertidos, y algunos simplemente hist&eacute;ricos, no parece tan consistente como los dos previos. Y creo que el combate de insultos no era tan ingenioso como en el primero. En fin, no lamento haberlo comprado, pero la impresi&oacute;n que obtuve leyendo este grupo hizo sonar el juego mucho mejor de lo que realmente es. La &uacute;nica verdadera queja que he o&iacute;do es que el juego era demasiado corto. Aunque eso es cierto, se me ocurren otras cosas que tambi&eacute;n podr&iacute;an decirse. Quiero decir, se me ocurr&iacute;an respuestas m&aacute;s ingeniosas que las que aparec&iacute;an en pantalla. Bueno, aun as&iacute; me gust&oacute;&quot;</I> -- Snowlock.
<P>
<A NAME="nt"><B>Almendruco's Truco: <I>Curse</I> y <I>Windows NT</I></B></A>
<P>
Oficialmente Curse no funciona bajo Windows NT, pero si tienes este sistema operativo con DirectX instalado podr&aacute;s jugar siguiendo los siguientes pasos:<OL>
<LI>Ignora el programa de instalaci&oacute;n del juego.
<LI>Crea en tu disco duro un directorio para salvar las partidas (por ejemplo C:\JUEGOS\CURSE)
<LI>Copia el archivo COMI.EXE (incluido en el directorio \INSTALL del primer CD de Curse) en el directorio de tu disco duro (C:\JUEGOS\CURSE)
<LI>Crea un acceso directo a C:\JUEGOS\CURSE\COMI.EXE
<LI>Modifica las propiedades del acceso directo y pon como directorio de inicio la letra de tu unidad de CD-ROM (por ejemplo, D:\)
</OL>
<P>
Utiliza el acceso directo para arrancar el juego.
</TD></TR>
</TABLE>
<P>
The Curse of Monkey Island, un comentario de <B>Ra&uacute;l &Aacute;lvarez
Garc&iacute;a</B>.
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]<BR>
</CENTER>
</BODY>
</HTML>
