<HTML>
<HEAD>
<TITLE>SQ Comentario: Normality</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#c0c0c0" VLINK="#c0c0c0">
<H6><CENTER><STRONG><FONT SIZE=7>NORMALITY</FONT></STRONG></CENTER>
</H6>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica en primera persona, con escenarios en 3D</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autor</FONT></B><FONT SIZE=2>: Ade Carless
<B>Casa</B>: Gremlin Interactive</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema m&iacute;nimo</FONT></B><FONT SIZE=2>:
PC 486DX 66Mhz, MSDOS o Windows 95, 8 Mb RAM, 16 Mb disco duro,
lector CDROM doble velocidad, rat&oacute;n </FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema recomendado</FONT></B><FONT SIZE=2>:
Pentium 90 Mhz, MSDOS, 16 Mb RAM, 50 Mb disco duro, lector CDROM
cuadr&uacute;ple velocidad, tarjeta de sonido, rat&oacute;n</FONT></CENTER>
<HR>
<P>
Todo es normal y gris en la ciudad de Neutr&oacute;polis. Sus
habitantes pasan las horas libres viendo programas televisivos,
aburridos pero sin causar problemas, siguiendo las normas que
el gobierno ha establecido. Todo aquello que se sale de la normalidad
es prontamente reprimido por el ej&eacute;rcito. Pero Kent no
se conforma con tener una vida insustancial y prosaica, y sabe
que en la ciudad hay otros como &eacute;l, gente afortunada, <I>anormal</I>,
que est&aacute; dispuesta a enfrentarse a la dictadura.
<P>
<IMG SRC="c-norm-1.jpg" ALIGN="LEFT" HSPACE=5>Parece que 1998
ser&aacute; el a&ntilde;o de las aventuras 'en 3D', a juzgar por
los lanzamientos que las principales casas dedicadas a la producci&oacute;n
de aventuras han anunciado. Aun as&iacute;, hace ya tiempo que
hemos podido disfrutar de otros juegos de este tipo, como 'Under
A Killing Moon' o el que ahora nos ocupa: 'Normality'.
<P>
Esta es una aventura gr&aacute;fica tradicional, de &eacute;sas
en las que hay que ir encontrando y usando objetos de maneras
relativamente curiosas, pero se caracteriza porque todo el escenario
y los personajes est&aacute;n realizados al m&aacute;s puro estilo
'DOOM'. Podemos explorar en primera persona todos los lugares
donde transcurre el juego, podiendo movernos en ellos con total
libertad. Podemos caminar alrededor de un edificio, dirigir la
mirada al suelo, acercarnos todo lo que deseamos a un objeto para
verlo con todo detalle,&#133; La novedad del juego est&aacute;,
pues, en que nos permite explorar mucho m&aacute;s detalladamente
todas las zonas visibles en pantalla, en contraposici&oacute;n
a los t&iacute;picos planos est&aacute;ticos de la mayor&iacute;a
de aventuras en los que podemos divisar un punto en la pantalla
pero no podemos acercarnos un poco para ver exactamente de qu&eacute;
se trata (lo cual es bastante poco realista).
<P>
<IMG SRC="c-norm-2.jpg" ALIGN="LEFT" HSPACE=5>Como no todo es
exploraci&oacute;n en una aventura, 'Normality' dispone de un
interfaz similar al que LucasArts us&oacute; en 'Full Throttle'.
As&iacute;, disponemos de un cursor que podemos mover por pantalla
y que nos indica cu&aacute;ndo un elemento del decorado es interactivo.
Al pulsar sobre &eacute;ste, aparece una especie de mu&ntilde;eco
vud&uacute; representando al protagonista del juego, Kent, y que
nos permite elegir entre las opciones cl&aacute;sicas: mirar,
hablar, coger, abrir y usar. En la parte superior derecha de la
pantalla aparece una mochila que permite acceder al inventario,
donde podemos elegir los objetos y examinarlos, usarlos con el
protagonista o sobre los elementos del decorado. En resumidas
cuentas, se trata de un interfaz c&oacute;modo y que permite las
interacciones t&iacute;picas en estos juegos.
<P>
'Normality' es una aventura gr&aacute;fica tradicional que tiene
la peculiaridad de estar realizada mediante gr&aacute;ficos renderizados
en tres dimensiones. Algo que pronto ser&aacute; la norma.
<HR>
<P>
<CENTER><TABLE ALIGN="CENTER">
<TR><TD ALIGN="LEFT" VALIGN="MIDDLE"><B>Lo Mejor:</B>
<P>
Se trata de un juego muy bien acabado.<P>
<B>Lo Peor:</B>
<P>
Los gr&aacute;ficos de los personajes: r&iacute;gidos monigotes que no se integran demasiado bien en los escenarios en 3D.<P>
<B>Lo Normal:</B>
<P>
El gui&oacute;n. 'Normality' es una aventura en 3D (algo relativamente nuevo, por ahora) pero que por lo dem&aacute;s no ofrece nada nuevo.<P>
<B>Lo Rarito:</B>
<P>
Kent, el protagonista. Los creadores del juego han confundido <I>cool</I> con hortera.
</TD><TD><B><IMG SRC="c-norm-3.gif"></B></TD></TR>
</TABLE>
</CENTER>
<P>
Comentario por <I>Ra&uacute;l &Aacute;lvarez</I>.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Atr&aacute;s</A>]</P></CENTER>
</BODY>
</HTML>
