<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Prisoner of Ice</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff" TEXT="#000080">
<P>
<CENTER><FONT SIZE=7>PRISONER OF ICE</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-pice.jpg" ALT="Imagen"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Infogrames
<B>Idioma</B>: Castellano <B>Precio</B>: 7.990 <B>Tipo</B>: Aventura
gr&aacute;fica</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores: </FONT></B><FONT SIZE=2>Hubert
Chardot, Christian Nabais, Michel Monteil, Philippe Chanoinat,
Fr&eacute;d&eacute;ric Cornet</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: 486 DX,
4Mb RAM, CD 2X, disco duro, VGA o VESA, DOS o Windows, rat&oacute;n</FONT></CENTER>
<HR>
<P>
&quot;Prisoner of Ice&quot; es la continuaci&oacute;n del juego
de Infogrames &quot;Shadow of The Comet&quot;. La historia, adaptada
de un relato de H.P. Lovecraft, cuenta las peripecias de un agente
secreto americano que investiga la apropiaci&oacute;n por parte
de los nacis de unas cajas que contienen poderes &quot;sobrenaturales&quot;.
<P>
Realizada exclusivamente para CD, esta aventura cuenta con una
impresionante realizaci&oacute;n: gr&aacute;ficos en alta resoluci&oacute;n
(a&uacute;n as&iacute; se puede jugar en modo VGA si se desea)
basados en dibujos realizados a mano; animaciones altamente realistas
capturadas de personas reales; banda sonora espectacular; &#133;
El interfaz cuenta con un &uacute;nico cursor &quot;inteligente&quot;
y es realmente f&aacute;cil de usar. Adem&aacute;s, el juego est&aacute;
totalmente adaptado al castellano.
<P>
Con todas estas caracter&iacute;sticas puede parecer que &quot;Prisoner
of Ice&quot; es una aventura que ara&ntilde;a los l&iacute;mites
de la perfecci&oacute;n, pero, lamentablemente, esto no es as&iacute;.
Y ello se debe a tres defectos que tiene el juego, uno de ellos
bastante grave. Primero, el juego es extremadamente lineal, no
dejando ning&uacute;n margen de maniobra al jugador. Segundo,
el doblaje de las voces al castellano, y aunque hay que agradecer
el esfuerzo, es de una calidad tan baja que hubiese sido preferible
que no se hubiera hecho. Estos dos defectos pueden parecer no
muy importantes. Al fin y al cabo la mayor&iacute;a de las aventuras
de hoy en d&iacute;a son bastante lineales, y si el doblaje del
juego no nos gusta basta con desactivarlo y jugar en modo texto
como siempre hab&iacute;amos hecho. La verdadera piedra de toke
de este t&iacute;tulo est&aacute; en el gui&oacute;n. Los autores,
pese a tener una buena historia, no han sabido contarla. El argumento
llega a hacerse realmente confuso en algunos momentos, lo cual
resulta ser un grave inconveniente dado que se trata de una trama
bastante compleja. 
<P>
El lema de la gente de Infogrames es que una aventura ha de tener
tres cosas: &quot;buen argumento&quot;, &quot;buen argumento&quot;
y &quot;buen argumento&quot;. L&aacute;stima que eso no sirve
de nada si no se sabe contarlo.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Excelente realizaci&oacute;n.
<P>
<B>Principal defecto:</B>
<P>
No han sabido contar la historia.
<P>
<B>La Pista:</B>
<P>
Sobre la mesa del doctor en el hospital hay una aguja bastante
dif&iacute;cil de ver.
<P>
<B>Comentario cortes&iacute;a de</B>: Ra&uacute;l Alvarez Garc&iacute;a.
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
