<HTML>
<HEAD>
<TITLE>SQ Comentario: A Puzzle of Flesh</TITLE>
</HEAD>
<BODY BGCOLOR="#800000" TEXT="#ffffff" LINK="#ffffff" VLINK="#ffffff">
<P>
<TABLE >
<TR><TD WIDTH=161><B><IMG SRC="c-pof-a.jpg"></B></TD><TD WIDTH=422><CENTER><B>PHANTASMAGORIA II</B></CENTER>
<P>
<CENTER><B><FONT SIZE=6>A PUZZLE OF FLESH</FONT></B></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Sierra On-Line <B>Tipo</B>: Aventura gr&aacute;fica</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autora</FONT></B><FONT SIZE=2>: Lorelei Shannon </FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma</FONT></B><FONT SIZE=2>: Ingl&eacute;s <B>Precio</B>: 8975 pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: Windows 95, DOS</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Hardware</FONT></B><FONT SIZE=2>: 486 DX4, 12 Mb RAM, 10 Mb de HD, CD 2X, SVGA, rat&oacute;n, tarjeta de audio.</FONT></CENTER>
</TD></TR>
</TABLE>
<HR>
<P>
Hace un a&ntilde;o que Curtis sali&oacute; del hospital psiqui&aacute;trico,
y todo parece ir bien. Recuperado del sentimiento de culpa que
le cre&oacute; que se madre se suicidara cuando &eacute;l ten&iacute;a
seis a&ntilde;os, la vida parece sonreirle, al fin. Pero todo
se desmorona cuando Curtis empieza a tener horribles alucinaciones
y una terror&iacute;fica voz le atormenta acus&aacute;ndole de
haber cometido violentos cr&iacute;menes&#133; &#191;se estar&aacute;
volviendo loco?
<P>
<B>Pol&eacute;mica y mark&eacute;ting</B>
<P>
&quot;Phantasmagoria&quot; cre&oacute; un peque&ntilde;o revuelo
en la puritana sociedad americana all&aacute; cuando fue publicado
hace un par de a&ntilde;os. Varias tiendas se negaron a vender
un juego de ordenador en el que la violencia y el sexo ten&iacute;an
(no) tanta importancia, y de hecho su distribuci&oacute;n fue
prohibida en varios estados norteamericanos. Se trataba de una
cosa de ni&ntilde;os comparada con cualquier pel&iacute;cula de
hoy en d&iacute;a, pero lo cierto es que la pol&eacute;mica contribuy&oacute;
a aumentar las ventas convirtiendo al juego en la aventura m&aacute;s
popular en la historia de Sierra, con m&aacute;s de un mill&oacute;n
de unidades vendidas en todo el mundo. As&iacute; que a la hora
de producir la secuela la consigna era clara: m&aacute;s controversia
= m&aacute;s ventas.
<P>
Adem&aacute;s &quot;Phantasmagoria&quot; supuso una nueva aproximaci&oacute;n
al g&eacute;nero de las aventuras, trat&aacute;ndose de un juego
orientado hacia una historia predirigida que el jugador hac&iacute;a
avanzar con sus acciones. Odiada por unos y amada por otros, todos
coincidieron, eso s&iacute;, en que el juego era demasiado simple
y corto.
<P>
<B>Pel&iacute;cula interactiva</B>
<P>
&quot;A Puzzle of Flesh&quot; no es una secuela, sin&oacute; una
aventura totalmente nueva con nuevos personajes e historia. Ha
sido escrita por Lorelei Shannon (especialista en horror y ciencia
ficci&oacute;n que adem&aacute;s ha trabajado en otros t&iacute;tulos
de Sierra como &quot;King's Quest VII&quot;). El juego pretende
aumentar la inmersi&oacute;n del espectador en una historia permiti&eacute;ndole
manejar al protagonista de &eacute;sta, llevando a cabo acciones
tales como hablar con personajes, usar objetos, resolver alg&uacute;n
que otro puzzle&#133; Para salir 'victorioso' hay que tomar el
papel de Curtis y actuar como &eacute;l lo har&iacute;a. Con esto
en mente, hay que decir que el juego funciona bastante bien; la
historia est&aacute; bien estructurada y consigue mantener un
buen grado de inter&eacute;s hasta la recta final, en la que el
juego da un giro algo inesperado. A diferencia de &quot;Phantasmagoria&quot;,
donde la tensi&oacute;n iba creciendo suavemente hasta alcanzar
su cl&iacute;max en la recta final, &quot;A Puzzle of Flesh&quot;
no ofrece pr&aacute;cticamente descanso al jugador, ya que escenas
horribles se suceden desde el principio. Si bien no es un juego
que ponga los pelos de punta, s&iacute; resulta una experiencia
francamente diferente a cualquier otra cosa que hayas podido experimentar.
El desarrollo es, en general, muy lineal, as&iacute; que en varios
momentos la dificultad est&aacute; en dar con la acci&oacute;n
exacta que te permite avanzar.
<P>
<CENTER><TABLE ALIGN="CENTER">
<TR><TD WIDTH=146><BR>
<BR>
<CENTER><IMG SRC="c-pof-b.jpg"></CENTER>
</TD><TD WIDTH=146><BR>
<BR>
<CENTER><IMG SRC="c-pof-c.jpg"></CENTER>
</TD><TD WIDTH=162><BR>
<BR>
<CENTER><IMG SRC="c-pof-e.jpg"></CENTER>
</TD></TR>
</TABLE>
</CENTER>
<P>
El interfaz es el t&iacute;pico de estos juegos, constando de
un puntero que pulsado sobre un objeto o personaje activa la escena
en la que el actor que interpreta al protagonista lleva a cabo
la acci&oacute;n relacionada con ese elemento. Tambi&eacute;n
consta de un inventario (sin limitaciones en el n&uacute;mero
de objetos y que permite combinarlos y mirarlos) y de la posibilidad
de revisar las escenas que ya se han visto. 
<P>
No han faltado las mejoras t&eacute;cnicas, que abarcan principalmente
dos aspectos: gr&aacute;ficos y sonido. La acci&oacute;n ha sido
rodada en escenarios reales, y la calidad del v&iacute;deo es
elevada (en color de alta densidad aunque en modo entrelazado).
Sonido y m&uacute;sica digital est&aacute;n en16 bits, 22KHz.
Se trata de un juego &iacute;ntegramente en ingl&eacute;s y que
no cuenta con ninguna clase de subt&iacute;tulo, sin duda un impedimento
para todos aquellos que no conozcan dicho idioma.
<P>
&quot;A Puzzle of Flesh&quot; te permitir&aacute; vivir las experiencias
del protagonista en lugares tan ex&oacute;ticos como la consulta
de una psiquiatra o un club de sadomasoquistas, y ser&aacute;
de tu agrado si lo que buscas es una claustrof&oacute;bica aventura
de ciencia ficci&oacute;n. Se trata en definitiva de un juego
no recomendado para ni&ntilde;os, no s&oacute;lo por sus contenidos
en sexo y violencia, sin&oacute; por su historia algo extra&ntilde;a
y <I>escapista</I>.
<HR>
<P>
<B>No se la pierdan:</B>
<P>
Todos aquellos que en la pel&iacute;cula &quot;La Escalera de
Jacob&quot; echaron en falta unas dosis de Clive Barker.
<P>
<B>Abstenerse:</B>
<P>
Personas f&aacute;cilmente escandalizables o que no soporten las
aventuras de este tipo (si no tienes ninguna gana de jugar NO
lo hagas).
<P>
<B>Lorelei y las claves:</B>
<P>
Un puzzle del que se ha abusado en este juego es el de las claves
(como el password que permite acceder a un ordenador). Tendr&aacute;s
que encontrar, adivinar o construir DIEZ para llegar al final.
<P>
<B>La Pista:</B>
<P>
Mira en las instrucciones c&oacute;mo combinar objetos del inventario
(especialmente martillos y destornilladores).
<P>
<B>&#191;Sab&iacute;as que&#133;</B>
<P>
El gui&oacute;n original del juego ten&iacute;a siete cap&iacute;tulos
(en lugar de los cinco filmados) e inclu&iacute;a un personaje
adicional (un ente fantasmal en Wyntech) y una persecuci&oacute;n
en el asilo psiqui&aacute;trico?
<P>
<B>Nota sobre la versi&oacute;n MS-DOS:</B>
<P>
Si posees la versi&oacute;n que s&oacute;lo funciona bajo Windows
95 y deseas jugar bajo MS-DOS, Sierra ha puesto en la secci&oacute;n
de parches de su web (<A HREF="http://www.sierra.com/">http://www.sierra.com</A>)
una ampliaci&oacute;n para poder jugar bajo este sistema.
<P>
<B>P&aacute;gina relacionada:</B>
<P>
<A HREF="http://www.ozemail.com.au/~larme/phantas.html">http://www.ozemail.com.au/~larme/phantas.html</A>
&quot;The Phantasmagoria Review page&quot; - todo lo que quer&iacute;as
saber (y m&aacute;s) sobre ambos <I>Phantas</I>.
<P>
<CENTER><B>Comentario escrito por Ra&uacute;l &Aacute;lvarez.</B></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
</BODY>
</HTML>
