<HTML>
<HEAD>
<TITLE>SQ Comentario: RAMA</TITLE>

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BACKGROUND="parch.jpg" BGCOLOR="#808080" TEXT="#ffffff" LINK="#ffff00" VLINK="#ffff00">
<P>
<CENTER><FONT SIZE=7>RAMA</FONT> </CENTER>
<P>
<CENTER><IMG SRC="c-rama-1.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo:</FONT></B><FONT SIZE=2> Aventura
gr&aacute;fica en primera persona <B>Casa: </B>Sierra</FONT> </CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma:</FONT></B><FONT SIZE=2> Ingl&eacute;s
<B>Precio:</B> 5000 pts</FONT> </CENTER>
<P>
<CENTER><B><FONT SIZE=2>Requerimientos del sistema:</FONT></B><FONT SIZE=2>
DOS 5.0, Windows 3.1, Windows 95 (recomendado). IBM &oacute; 100%
compatible 486 33Mhz o superior. 8 MB de RAM. Lector CDROM 2x.
Adaptador gr&aacute;fico capaz de mostrar 256 colores en resoluci&oacute;n
de 640 x 480. Tarjeta de sonido. Rat&oacute;n.</FONT> </CENTER>
<HR WIDTH="100%">
<P>
Antes de empezar el comentario he de confesar que no he le&iacute;do
ni una sola novela de Rama, de modo que no puedo juzgar si el
juego se ajusta a la palabra escrita. Pese a todo, puedo decir
con certeza que no tendr&aacute;s que leer ninguna de las novelas
para alcanzar la m&aacute;xima diversi&oacute;n. 
<P>
<B><FONT SIZE=4>El Trasfondo</FONT></B> 
<P>
Si est&aacute;s en la misma situaci&oacute;n que yo decirte que
b&aacute;sicamente la historia transcurre alrededor de un inmenso
objeto cil&iacute;ndrico (llamado Rama por los cient&iacute;ficos
de La Tierra) que de repente apareci&oacute; en nuestro sistema
solar. Un equipo de cient&iacute;ficos, ingenieros y personal
log&iacute;stico es enviado para investigar y su misi&oacute;n
es responder las grandes preguntas: &#191;Qui&eacute;n construy&oacute;
Rama, y por qu&eacute;? &#191;Qu&eacute; est&aacute; haciendo
aqu&iacute;? &#191;De d&oacute;nde vino y ad&oacute;nde va? 
<P>
En esta aventura con perspectiva en primera persona te unes al
equipo a bordo de Rama como reemplazo de una de las tripulaciones
anteriores cuyos integrantes &quot;misteriosamente&quot; murieron,
aunque esta es la excusa para llevarte a bordo ya que no hay ninguna
investigaci&oacute;n de las muertes. Una vez tu nave se acopla
a Rama y lees los mensajes que te env&iacute;an los otros miembros
de la tripulaci&oacute;n eres dejado en tus propias manos y puedes
explorar a voluntad. 
<P>
<CENTER><IMG SRC="c-rama-2.jpg"><BR>
&nbsp; <BR>
A veces te topar&aacute;s con los otros personajes en breves escenas
de v&iacute;deo y te hablar&aacute;n; estos interludios simplemente
sirven para hacer avanzar la historia y para conocer las personalidades
y las inquietudes pol&iacute;ticas y filos&oacute;ficas de tus
compa&ntilde;eros viajeros en el espacio. T&uacute; no tomas parte
en las conversaciones. La historia en s&iacute; misma se desarrolla
lentamente como trasfondo y no voy a discutirla aqu&iacute;, es
mejor que la descubras t&uacute;. B&aacute;sicamente, como miembro
de la tripulaci&oacute;n tu misi&oacute;n es explorar y aprender,
o sea que tendr&aacute;s que investigar la creaci&oacute;n Ramana
con detalle, examinando todo y reuniendo las pistas que encuentres.</CENTER>
<P>
<B><FONT SIZE=4>Exploraci&oacute;n y control del juego</FONT></B>
<P>
Rama no es una mera 'nave', es un inmenso mundo mec&aacute;nico
con ciudades en su interior que crean un paisaje artificial completado
con formas de vida alien&iacute;genas. A su lado, el USS Enterprise
parecer&iacute;a una pulga. Las naves alien&iacute;genas son por
supuesto fascinantes, as&iacute; que hay una buena motivaci&oacute;n
para explorar y una colecci&oacute;n de artefactos alien que examinar.
Para ayudarte en el camino, Wakefield, uno de tus compa&ntilde;eros,
te da un peque&ntilde;o robot llamado Puck. &Eacute;ste reside
en tu inventario y es capaz de darte informaci&oacute;n sobre
las estructuras alien&iacute;genas y dispositivos que encuentres.
Debes recordar usarlo siempre que puedas porque sus observaciones
pueden ser &uacute;tiles y ayudarte a entender qu&eacute; es lo
que est&aacute;s viendo. &Eacute;l m&aacute;s o menos act&uacute;a
como un 'icono ojo' muy astuto. 
<P>
En este sentido, Puck es el &uacute;nico 'icono de acci&oacute;n'
que hay en el juego. No hay iconos para cualquiera de las otras
acciones como 'usar' o 'recoger'. Para coger o utilizar objetos
el cursor cambia de forma a una mano y para moverse se transforma
en una flecha. Este sistema funciona sorprendentemente bien, a
pesar de esto yo prefiero cuando se puede elegir un icono de entre
los iconos de acci&oacute;n. 
<P>
<CENTER><IMG SRC="c-rama-3.jpg"></CENTER>
<P>
La parte de la pantalla dedicada a la acci&oacute;n en Rama es
dos tercios del total con un icono en la parte superior para acceder
a los t&iacute;picos controles como grabar, cargar, sonido, ajuste
de color, etc. Debajo de la ventana de acci&oacute;n hay un peque&ntilde;o
indicador de direcci&oacute;n junto con la barra con scroll y
los tres ojos &quot;Ramanes&quot; que te permiten mirar un objeto
m&aacute;s de cerca. Hay muchos, much&iacute;simos objetos para
coger (incluyendo montones de objetos que no sirven para nada)
as&iacute; que de vez en cuando se te quedar&aacute; el inventario
muy lleno. A m&iacute; eso no me molest&oacute; mucho porque puedes
ordenarlos para encontrar las cosas r&aacute;pidamente, y tener
tantos objetos a&ntilde;ade complejidad al juego (aunque supongo
que algunos no estar&eacute;is de acuerdo conmigo). <BR>
&nbsp; <BR>
Tu ordenador de mu&ntilde;eca es tu comunicador, pero s&oacute;lo
puedes recibir mensajes, no enviar. Tambi&eacute;n funciona como
un dispositivo mapeador que posiblemente encontrar&aacute;s &uacute;til
en la segunda mitad del juego. 
<P>
<B><FONT SIZE=4>La jugabilidad</FONT></B> 
<P>
El juego est&aacute; dividido en dos partes, cada una ocupa un
CD (1 y 2) as&iacute; que no hay problemas de cambio discos. En
el tercer CD no hay juego sino que contiene un pr&oacute;logo
y entrevistas con Arthur C. Clarke y Gentry Lee as&iacute; como
con los personajes de tu tripulaci&oacute;n. 
<P>
Gran parte de la jugabilidad de la primera parte reside en encontrar
las &quot;llaves&quot; que abren nuevas localidades. Esas llaves
son azulejos que encajan en una rejilla y en una secuencia espec&iacute;fica,
adem&aacute;s hay muchos otros dispositivos que manipular y puzles
de l&oacute;gica que resolver. Creo que &eacute;sta fue la parte
m&aacute;s f&aacute;cil, aunque una localidad presenta problemas
de tipo matem&aacute;tico y num&eacute;rico que s&eacute; que
habr&aacute;n producido dolores de cabeza a m&aacute;s de uno.
<P>
Como el manual estipula, no necesitar&aacute;s ser matem&aacute;tico
para resolver esos puzles de n&uacute;meros. Yo no tengo buena
base en matem&aacute;ticas aparte de la aritm&eacute;tica b&aacute;sica
y, tras el shock inicial, no los encontr&eacute; demasiado problem&aacute;ticos.
Si t&uacute; eres uno de &eacute;sos a los que le repudian las
matem&aacute;ticas te aconsejo que te tomes los puzles como si
fueran de l&oacute;gica en vez de matem&aacute;ticas (&#191;es
eso una tautolog&iacute;a?). Los puzles tienen demostraciones,
as&iacute; que no te asustes, respira hondo y sigue los ejemplos.
<P>
La segunda parte de Rama, transcurre en el &aacute;rea conocida
como &quot;Nueva York&quot;, me encant&oacute;. Aqu&iacute; tambi&eacute;n
hay muchas 'puertas' para abrir, pero no es s&oacute;lo cosa de
encotrar una llave por las cercan&iacute;as. Hay muchas localidades
donde buscar, cosas que encotrar y puzles que resolver a medida
que aprendes m&aacute;s acerca de las formas de vida alien&iacute;genas
que habitan en esta extra&ntilde;a nave. Muchos de los problemas
abarcan variaciones de los c&oacute;digos num&eacute;ricos y tus
conocimientos de los sistemas de numeraci&oacute;n que aprendiste
anteriormente, mientras que para resolver otros simplemente debes
observar y aprender. 
<P>
<B><FONT SIZE=4>Juega si es que puedes</FONT></B> 
<P>
Rama tiene algunas similitudes con Lighthouse: exploras un entorno
alien y sus puzles son a&uacute;n m&aacute;s abstractos, pero
los disfrut&eacute; mucho m&aacute;s. Puck es de gran ayuda porque
te permite encontrarle sentido a muchas de las cosas que hallas.
Pienso que el juego es excelente, aunque s&eacute; que no lo ser&aacute;
para todo el mundo. Algunos de los puzles son bastante complicados
y requieren de una cuidadosa observaci&oacute;n para operar en
los extra&ntilde;os dispositivos, as&iacute; que no lo recomendar&eacute;
para jugadores principiantes. Las secuencias de v&iacute;deo no
tienen subt&iacute;tulos, o sea que los que no tengan una percepci&oacute;n
auditiva fluida tendr&aacute;n que conformarse con las novelas.
<BR>
&nbsp; <BR>
<IMG SRC="c-rama-4.jpg" ALIGN="RIGHT">Mi mayor queja es la carrera
contra el tiempo en la parte final. Esta caracter&iacute;stica
no aporta nada al juego, creo, sino m&aacute;s bien lo contrario.
&#191;Cu&aacute;ndo se dar&aacute;n cuenta los dise&ntilde;adores
de aventuras de que lo que a los jugadores les gusta es explorar
y pensar en los problemas sin entrar en carreras contra el tiempo?
<BR>
&nbsp; <BR>
Es dif&iacute;cil de explicar, pero para m&iacute; Rama tiene
algo de la esencia de las viejas aventuras de texto. Y eso es
un cumplido. Parec&iacute;a dar el mismo sentido de consecuci&oacute;n
cada vez que abr&iacute;a una puerta y obten&iacute;a acceso a
una nueva localidad. Con las descripciones textuales puedo imaginar
v&iacute;vidas escenas; en Rama me pasaba justo al rev&eacute;s.
Pod&iacute;a imaginarlo en texto &quot;... Esto es un sal&oacute;n
inmenso. En el medio hay una criatura con m&uacute;ltiples ap&eacute;ndices
y delante de ella hay una peque&ntilde;a torre multi-color y un
dispositivo de visualizaci&oacute;n transparente. El dispositivo
muestra ahora mismo siete puntos rojos...&quot;&nbsp; 
<P>
Rama es perfecto para fans de la ciencia ficci&oacute;n inteligente,
sin embargo muchos otros aventureros encotrar&aacute;n tambi&eacute;n
mucha diversi&oacute;n. Como no se te identifica puedes jugar
como t&uacute; mismo (hombre o mujer) y experimentar una verdadera
inmersi&oacute;n en la historia. <BR>
No se da respuesta a las grandes preguntas planteadas inicialmente,
creo que para eso habr&aacute; que esperar a Rama II e incluso
Rama III, y deseo que la espera no sea demasiado larga. Yo tengo
mi propia teor&iacute;a, pero estoy interesada en conocer exactamente
qu&eacute; est&aacute; pasando ... y qu&eacute; le pas&oacute;
a mi predecesor ... 
<P>
<B>&nbsp;<I>Copyright</I> &copy; Rosemary Young 1996. Todos los
derechos reservados. </B>
<HR>
<P>
<CENTER><FONT SIZE=2>La versi&oacute;n original de este art&iacute;culo
fue escrita por <B>Rosemary Young</B> y publicada en </FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>&quot;<A HREF="http://www.iinet.net.au/~quandary">Quandary, The magazine for Adventure, Puzzle and RPG players</A>&quot;</FONT></CENTER>
<P>
<CENTER><FONT SIZE=2>y ha sido adaptada por <B>David Torrens</B>,
con la ayuda de Ra&uacute;l &Aacute;lvarez.</FONT></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</CENTER>
</BODY>
</HTML>
