<HTML>
    <HEAD>
        <meta charset="utf-8">
<TITLE>
            SQ: Comentario de Sacrificio por la Humanidad
        </TITLE>
        <META NAME="AUTHOR" CONTENT="Daniel Cardenas">
        <META NAME="DESCRIPTION" CONTENT="Spanish Quest: Comentario de Sacrificio por la Humanidad">
    </HEAD>
    <BODY BGCOLOR="#5B205C" TEXT="#FFFFFF" LINK="#FFA0F0" VLINK="#C0A0B0">

<CENTER>
<TABLE WIDTH=100% BORDER=0><TR><TD>

<CENTER>

<FONT SIZE=6>SACRIFICIO POR LA HUMANIDAD</FONT><BR>
<FONT SIZE=3><B>Compa&ntilde;ia</B>: LAST NIVEL (Toni Barroso, Frank Jones y Sergio Llata)</FONT><BR>
<FONT SIZE=3><B>Idioma</B>: Espa&ntilde;ol</FONT>
<FONT SIZE=3><B>Distribuc&iacute;on</B>: <I>freeware</I>, <A HREF="ftp://ftp.gmd.de/if-archive/games/pc/non-english/splh.exe">¡b&aacute;jatela!</A></FONT><BR>
<FONT SIZE=3><B>Tipo</B>: Aventura conversacional futurista</FONT>
<FONT SIZE=3><B>Sistema</B>: <SAMP>PC</SAMP></FONT>
</CENTER>
<HR>
<P>
Si te pones a contar las m&aacute;s recientes conversacionales que han
visto la luz &uacute;ltimamente para PC, posiblemente nombres la aventura que nos
ocupa sin haber agotado ni tan siquiera los dedos de la primera mano.
Es triste reconocerlo, pero 'Sacrificio por la Humanidad', una aventura
que ya tiene sus tres a&ntilde;itos, est&aacute; entre las aventuras m&aacute;s recientes...
Ante esta dram&aacute;tica situaci&oacute;n aventuras como &eacute;sta vienen a representar
un oasis en medio de un desierto, sobre todo si la aventura en cuesti&oacute;n
es buena, y &eacute;sta (al menos para mi gusto) lo es. Ve&aacute;mos que nos ofrece.
<P>

En 'Sacrificio por la Humanidad' seremos un cient&iacute;fico en una &eacute;poca
decadente y no muy lejana en el tiempo, a&ntilde;o 2017. Las diferencias entre
clases y el caos administrativo del gobierno han engendrado una
organizaci&oacute;n violenta conocida como la Rebeli&oacute;n, que trata que
la clase dirigente preste m&aacute;s atenci&oacute;n al pueblo llano. Mientras
tanto el control del primer planeta que va a ser colonizado por el
<A HREF="c-sacria.gif"><IMG SRC="c-sacria.gif" ALIGN=LEFT WIDTH=320 HEIGHT=200 VSPACE=11 HSPACE=10 ALT="Imagen del juego. Te detienes frente a la oxidada puerta met&aacute;lica de una tienda cerrada de electrodom&eacute;sticos. El fondo de la avenida se pierde difuminadamente entre la bruma de la poluci&oacute;n. Al oeste una siniestra callejuela se retuerce entre las sombras."></A>
hombre, Loida, es ansiado por muchos, por unas u otras razones. A partir
de aqu&iacute; los acontecimientos se precipitar&aacute;n, y en esta aventura ser&aacute;s
testigo y part&iacute;cipe de los mismos.
<P>

A todo esto empezamos en nuestra habitaci&oacute;n de hotel, encerrado y con
un dolor impresionante en la cabeza. Y nada m&aacute;s empezar, el
problema aventurero que se nos presenta es de a&uacute;pa... hay una bomba
a punto de estallar en el armario, y no podemos salir de la habitaci&oacute;n.
&#191;Alguna idea? Y esto es s&oacute;lo el principio, los problemas que poco a poco
se nos ir&aacute;n presentado son muy l&oacute;gicos y muy aventureros, de los que
en principio no tienes ni idea de como superar, y de encontrar la
soluci&oacute;n no delante del monitor, sino mientras reflexionas sobre ello,
por ejemplo, en el autob&uacute;s o en la ducha.
<P>

Pero no todo es tan bonito como parece, porque a pesar de estar
magn&iacute;ficamente pensados y estar perfectamente integrados dentro de
la propia historia y gui&oacute;n, algunos de estos problemas pueden resultar
incre&iacute;blemente costosos de solucionar a causa de que en cuanto a
parseado, la aventura es m&aacute;s bien pobre. Faltan definir nombres y verbos
sin&oacute;nimos, porque a veces aciertas a lo que hay que hacer, pero no se te
entiende y decepcionado pasas a intentar alg&uacute;n otro m&eacute;todo cuando
realmente lo que est&aacute;s probando es una idea que funciona. Otra raz&oacute;n
que puede conducir a confusi&oacute;n es que, a veces, est&aacute;s tratando
<A HREF="c-sacrib.gif"><IMG SRC="c-sacrib.gif" ALIGN=RIGHT WIDTH=320 HEIGHT=200 VSPACE=11 HSPACE=10 ALT="Mensajes incoherentes"></A>
con algo que es realmente imprescindible para la correcta resoluci&oacute;n del
problema y no cuenta ni tan siquiera con descripci&oacute;n propia.
<P>

Pero no debes preocuparte, lo m&aacute;s grave a&uacute;n no lo he comentado, aunque
eso s&iacute;, la culpa de lo siguiente me temo que no debe recaer en el
autor de la aventura, sino que se trata de alg&uacute;n oscuro bug del
SINTAC, el parser utilizado, que corrompe las tablas de mensajes
al cargar (o quiz&aacute; al grabar) las situaciones, y que se traduce
en mensajes incoherentes. Este frustrante error que a veces se da,
no es exclusivo de 'Sacrificio por la Humanidad', ya que tambi&eacute;n ha
sido detectado en otras aventuras realizadas con el mismo parser:
Nanuk y Hern&aacute;n Cort&eacute;s, por ejemplo.
<P>

Puede que este error s&oacute;lo salga a la luz en determinadas configuraciones,
pero est&aacute; ah&iacute; y ten por seguro que si se da el caso, lo mejor que
puedes hacer es salir del juego y volver a entrar (ves salvando
las situaciones a menudo). Lo del bug y la dificultad para resolver
esos problemas puede poner de los nervios a cualquiera, y como no te
lo tomes con calma no te extra&ntilde;e que acabes haciendo compa&ntilde;&iacute;a a ese
conocido colaborador del CAAD que escribe sus art&iacute;culos desde el
psiqui&aacute;trico...
<P>

Dejando de lado este tema, decir que los gr&aacute;ficos, a pesar de sus
16 colores, est&aacute;n a la altura de la trabajada historia. Adem&aacute;s, la melod&iacute;a
que acompa&ntilde;ar&aacute; nuestras andanzas est&aacute; bastante lograda y ayuda bastante
a crear ambientaci&oacute;n. A nivel t&eacute;cnico tambi&eacute;n citar que el comando
salidas ha sido sustituido por un peque&ntilde;o esquema que sale en la parte
superior izquierda de la pantalla y que nos muestra gr&aacute;ficamente las
direcciones que permiten el paso.
<P>

Para acabar aconsejar al que a&uacute;n no la tenga que se haga con ella
(si lo deseas la puedes conseguir en el CAAD), porque a pesar de los
ligeros problemillas, resulta 100% recomendable: buen gui&oacute;n y
una buena historia, en mi opini&oacute;n de lo mejorcito visto &uacute;ltimamente por
estos lares.
<P>

<HR>
<B>Lo mejor</B>: Que haya una historia, y el planteamiento de los problemas.
<P>
<B>Lo peor</B>: Que parezca mentira que estemos utilizando un PC, cuando el
<I>parseado</I> recuerda los tiempos del Spectrum.
<P>
<B>La pista</B>: Si no puedes salir quizá te puedan sacar...
<P>
<CENTER><I>Comentado por Daniel &quot;aquel que echar&aacute; de menos SQ&quot; C&aacute;rdenas</I></CENTER>
<CENTER><IMG SRC="c-sacric.jpg" ALT="Pantalla sacada de la intro del juego"></CENTER>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">M&aacute;s Comentarios</A>]</CENTER>

</TD></TR></TABLE>
</CENTER>
</BODY>
</HTML>
