<HTML>
<HEAD>
<TITLE>SQ Comentario: I Have No Mouth and I Must Scream</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#ffffff" VLINK="#ffffff">
<P>
<CENTER><B><FONT SIZE=5>I HAVE NO MOUTH AND I MUST SCREAM</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="c-scream.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Cyberdreams
<B>Tipo</B>: Aventura gr&aacute;fica <B>Autor</B>: Harlan Ellison
</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma</FONT></B><FONT SIZE=2>: Castellano
(voces y textos) <B>Precio</B>: 7990 pts.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: MSDOS,
PC 486DX 33, 8 Mb RAM, 15 Mb HD, CD 2x, VESA</FONT></CENTER>
<HR>
<P>
&quot;I Have No Mouth and I Must Scream&quot; es una oscura historia
&quot;para adultos&quot; que trata sobre la locura y sobre los
m&aacute;s ancestrales terrores del hombre. Partiendo de un cuento
corto de Harlan Ellison, el equipo de Cyberdreams (encabezado
en este caso por el propio Ellison) ha creado una original e interesante
aventura protagonizada por cinco mentes enfermas, por cinco humanos
que tendr&aacute;n que enfrentarse al ordenador megal&oacute;mano
y loco AM (&quot;soy&quot;) haciendo uso, precisamente, de la
poca humanidad que les queda. AM propondr&aacute; un juego a los
personajes y les obligar&aacute; a enfrentarse a sus m&aacute;s
&iacute;ntimos temores con la posibilidad de, en caso de salir
victoriosos, destruirle.
<P>
En contraposici&oacute;n a la mayor&iacute;a de aventuras de hoy
en d&iacute;a, &quot;I Have No Mouth&#133;&quot; no es lineal.
No s&oacute;lo podemos jugar los segmentos correspondientes a
los distintos personajes en el orden que deseemos, sin&oacute;
que adem&aacute;s, estos no est&aacute;n pr&aacute;cticamente
predirigidos y pueden tomar rumbos y desenlaces bastante variados.
<P>
El manejo del juego, aunque mejorable, es bastante adecuado, y
recuerda al antiguamente usado por LucasArts ya que est&aacute;
formado por varios verbos que se pueden combinar con objetos y
elementos del escenario para formar &oacute;rdenes. El juego cuenta
con las voces y los textos totalmente traducidos al castellano,
aunque no se trata de una adaptaci&oacute;n especialmente brillante.
<P>
La realizaci&oacute;n es buena, contando el juego con excelentes
y apropiados fondos en alta resoluci&oacute;n, una m&uacute;sica
t&eacute;trica y bastantes efectos de sonido. Lo que a&uacute;n
no se entiende es c&oacute;mo en Cyberdreams no consiguen hacer
animaciones realistas para sus personajes que, como en otros juegos
de la compa&ntilde;&iacute;a, se mueven de forma muy poco natural.
<P>
Se trata de una aventura que se deja jugar y que es bastante f&aacute;cil,
aunque posee una caracter&iacute;stica que la complica bastante:
muchas situaciones s&oacute;lo pueden resolverse si la moral de
los personajes es alta, y, subir la moral, en un mundo de pesadilla
como es el de AM, no es tarea f&aacute;cil.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Es una aventura <I>diferente</I>.
<P>
<B>Principales defectos:</B>
<P>
Algunos errores de programaci&oacute;n y un manejo algo impreciso.
<P>
<B>Aventura no recomendada para:</B>
<P>
Personas con tendencia a la depresi&oacute;n.
<P>
<B>La Pista:</B>
<P>
En muchos momentos del juego los personajes no pueden realizar
una determinada acci&oacute;n porque no tienen suficiente moral.
En estos casos lo mejor suele ser recomenzar la parte correspondiente
al personaje procurando no realizar nada que haga descender su
autoestima y procurando hacer que el personaje <I>se crezca</I>
al m&aacute;ximo.
<P>
<I>Comentado por Ra&uacute;l (mucha moral) Alvarez.</I>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
