<HTML>
    <HEAD>
        <meta charset="utf-8">
<TITLE>
            SQ Comentario: Shannara
        </TITLE>
        <META NAME="AUTHOR" CONTENT="Daniel Cardenas">
        <META NAME="DESCRIPTION" CONTENT="Spanish Quest: Comentario de Shannara">
    </HEAD>
<BODY BGCOLOR="#000000" TEXT="#F0FF9F" LINK="#FF00FF" VLINK="#FF00FF">
<CENTER>

<TABLE WIDTH=97%><TR><TD>
<CENTER>
<TABLE><TR><TD>
<IMG SRC="c-shan-1.jpg" ALIGN=MIDDLE WIDTH=180 HEIGHT=249 ALT="Gr&aacute;fico con el careto del malo del juego"></TD>
<TD>
<CENTER>
<H1>Shannara</H1>
<B>Casa:</B> Legend Entertainment Company
<B>Autores:</B> Corey Cole, Lori Cole, Jim Katic, Bob Heitman, Douglas Herring,
y Duane Beck<BR>
<B>Tipo:</B> Aventura gr&aacute;fica
<B>Idioma:</B> Ingl&eacute;s
<B>Precio:</B> 4000 ptas<BR>
<B>Requerimientos:</B> 486/33, Windows 95 (<SAMP>8 Mb RAM</SAMP>) o
<SAMP>MS-DOS 5.0</SAMP> (<SAMP>4 Mb RAM</SAMP>), <SAMP>SVGA</SAMP> y
<SAMP>3.5 Mb</SAMP> de disco duro
</CENTER>
</TD></TR>
</TABLE>
</CENTER>
<HR>
<P>
Con un argumento t&iacute;pico donde los haya, Legend nos presenta esta
aventura de corte fant&aacute;stico con los ingredientes de toda la vida: mucha magia,
elfos, humanos, enanos, druidas, etc., muchas tensiones y desconfianza
entre todas estas razas, la chica a la que hay que rescatar (esta vez
atrapada bajo de un tronco, que poca imaginaci&oacute;n...) y como no pod&iacute;a
ser de otra forma el malo de turno, un tal Brona.
<P>
El argumento nos cuenta que antes de que naci&eacute;ramos, nuestro
padre elimin&oacute; a Brona, pero al volver &eacute;ste a la vida y nuestro
viejo ya no estar para estos trotes, ahora nos tocar&aacute; a nosotros
eliminarlo para siempre. Para ello, deberemos reconstruir la espada
de Shannara, con la cual le podremos derrotar. Tambi&eacute;n contaremos
con la ayuda de unos compa&ntilde;eros que a medida que avancemos se nos
ir&aacute;n uniendo en la misi&oacute;n.<BR>
<P>
Como veis todo esto ya est&aacute; muy visto, aunque hay que tener en
cuenta que este juego tiene ya sus dos a&ntilde;itos. Esto se nota en
el interface que a&uacute;n es una mezcla de lo conversacional y del
m&aacute;s puro estilo point&click. Este juego abandona un poco m&aacute;s
el estilo marcado por ejemplo con los Spellcasting,
e irremediablemente se sigue encaminando al estilo m&aacute;s comercial
de Sierra o Lucas.
Lo que no se puede negar es que ha evolucionado, pero que el
interface sigue recordando muy mucho al <I>viejo estilo</I>.
<P>
Los gr&aacute;ficos son realmente monos, con un colorido espl&eacute;ndido. El
trato con los PSIs es simpl&oacute;n, con el t&iacute;pico escoge una frase
<IMG SRC="c-shan-2.jpg" ALIGN=RIGHT WIDTH=250 HEIGHT=188 VSPACE=10 HSPACE=5 ALT="Rodeado de libros en Tyrsis">
entre estas cuatro, con toda la conversaci&oacute;n grabada para la que la puedas
escuchar (317 Mb de nada) y con unas voces muy majas. Cuando
hables con los personajes ver&aacute;s su careto excelentemente realizado y
moviendo la boca, pero la pega est&aacute; en que el juego es tan poco
realista en este aspecto que siempre tienen la misma expresi&oacute;n
neutra, cuando deber&iacute;an estar contentos no r&iacute;en y cuando est&aacute;n tristes
siguen igual. Realmente (para mi gusto) se conseguir&iacute;a mucho m&aacute;s
realismo trabajando varias caras para cada personaje seg&uacute;n su
estado de &aacute;nimo, pero parece que los autores prefirieron que
escuch&aacute;ramos la voz... Ahora mismo se me viene a la cabeza un
juego japon&eacute;s de <SAMP>MSX</SAMP> llamado <I>Xak</I> que lo ten&iacute;a y, a pesar
de no tener voz, se consegu&iacute;an personajes mucho m&aacute;s vivos y reales.
<P>
Volviendo al interface hay que decir que es c&oacute;modo, de lo
mejorcito que he visto en los &uacute;ltimos a&ntilde;os, dando bastante m&aacute;s
libertad de la que estamos acostumbrados a ver, pero tampoco
tanta, no os vay&aacute;is a creer... Es de agradecer que la mayor&iacute;a
de acciones m&aacute;s o menos l&oacute;gicas est&aacute;n contempladas, y que
cuando no funcionan, se nos d&eacute; una respuesta l&oacute;gica de por qu&eacute;
no sirven. Por otra parte los puzzles no son dif&iacute;ciles, sino m&aacute;s bien todo
lo contrario.
<P>
Otro fallo que se le puede achacar a Shannara es que es tan lineal
que a veces hasta resulta molesto. Pero a&uacute;n m&aacute;s molesto resulta el
toque dram&aacute;tico que se le quiere dar al asunto (sobretodo aproxim&aacute;ndonos
al final) donde se producen una serie de sacrificios, que supongo
pretenden transmitir pena y aflicci&oacute;n al jugador por los compa&ntilde;eros
perdidos, pero que en ning&uacute;n momento resulta porque con esos
compa&ntilde;eros no llevamos m&aacute;s que media hora, y porque la interacci&oacute;n y la
credibilidad de estos resultan tan pobres que lo que verdaderamente
da pena a veces es el gui&oacute;n... Por citar otro ejemplo (esta vez
m&aacute;s conocido) citar&eacute; <I>La Diosa de Cozumel</I> donde por desgracia
llegaba un momento donde Zyanya, nuestra compa&ntilde;era, mor&iacute;a y eso si
que me dio pena, porque la interacci&oacute;n con ella era muy jugosa (en el buen
sentido de la palabra), y por tanto, su credibilidad era mucho
mayor que en el caso de los personajes que ahora nos ocupan.
<P>
<IMG SRC="c-shan-3.jpg" ALIGN=LEFT WIDTH=250 HEIGHT=188  HSPACE=5 ALT="En el main hall, con el mayordomo del rey Menion">
A parte se le pueden encontrar otra serie de fallos, como por
ejemplo que en determinadas conversaciones se te da informaci&oacute;n
que no deber&iacute;as saber, citando hechos que a&uacute;n no han acontecido.
O tambi&eacute;n un error que padec&iacute; un par de veces mientras estaba
viajando en el mapa, que por cierto sale cuando hay que viajar
entre dos lugares lejanos, y en el cual sali&oacute; cierto gr&aacute;fico que
tampoco deb&iacute;a haber visto y que me adelant&oacute; acontecimientos...
<P>
Por otra parte los combates, que los hay, est&aacute;n mal planteados. En los
mismos va saliendo una animaci&oacute;n con el bicho (o el grupo de bichos)
y tu <I>party</I>, y resulta que esas animaciones a parte de malas y repetitivas, vuelven
medio majara al CD, que no para de rodar durante la misma, al menos
con un <SAMP>CD 3X</SAMP> y con la instalaci&oacute;n m&iacute;nima. Los combates se dividen
en turnos, en los cuales la interactividad es muy tonta y no hay 
la estrategia que se nos promete en el manual. Al final todo se reduce a la
suerte, o con esa linealidad presente siempre, si hay alg&uacute;n
evento previsto durante el transcurso del combate, pues no hay manera de
evitarlo y se producir&aacute;: si tiene que morir alguien... el que sea
morir&aacute;, si tiene que sacrificarse alguien... lo har&aacute;, y si tienes que ser
salvado pues fallar&aacute;s hasta que te maten y, efectivamente, ser&aacute;s salvado.
Adem&aacute;s cuando hay muchos combatientes en liza, algunos de estos turnos
se alargan demasiado, resultan aburridos, y lo mejor es, como cuando
interrumpen con anuncios nuestro programa favorito en la tele, o bien hacer zapping
o bien irse a la nevera o al lavabo.<BR>
<P>
No pretendo ser demasiado duro con el juego, que en s&iacute; puede llegar a
ser divertido, pero es lo que hay. En mi caso pas&eacute; dos tardes entretenidas,
no m&aacute;s. Resulta relajante de jugar siempre que no le busques las
cosquillas y, sin duda, es uno de esos juegos que vienen bien para
desconectar un rato: m&uacute;sica agradable, gr&aacute;ficos monos, argumento no
muy rebuscado y puzzles con el nivel de dificultad adecuado.
<BR>
<HR>
<P>
<TABLE><TR><TD>
<TD>
<B>Lo mejor</B>: Los gr&aacute;ficos y las voces.<P>
<B>Lo peor</B>: &#191;Quien se sacrifica ahora? Po fale. Y por cierto...
&#191;no lo pudiste hacer antes?<P>
<B>La pista es</B>: Si te quedas atascado habla con todos tus compa&ntilde;eros,
te suelen dar pistas.<P>
<B>Otros datos:</B> Los Cole dise&ntilde;aron la serie Quest for <I>Glory</I>,
y <I>Castle of Dr. Brain</I>. Este juego est&aacute; basado en una de las
obras m&aacute;s conocidas y vendidas de Terry Brooks, <I>The Sword of Shannara</I>.<P>
</TD>
<TD>
<IMG SRC="c-shan-4.jpg" WIDTH=180 HEIGHT=181 ALT="La dulce cara de nuestra compa&ntilde;era Shella">
</TD>
</TR></TABLE>
<CENTER>
<I>Comentado por Daniel C&aacute;rdenas</I><BR>
<HR><BR>
[<A HREF="coment.htm">M&aacute;s Comentarios</A>]
<BR>
</CENTER>
</TR></TD></TABLE>
</CENTER>
</BODY>
</HTML>
