<HTML>
<HEAD>
<TITLE>SQ Comentario: Simon The Sorcerer II</TITLE>
</HEAD>
<BODY>
<P>
<CENTER><FONT SIZE=7>Simon the Sorcerer II</FONT></CENTER>
<P>
<CENTER><FONT SIZE=6>El Le&oacute;n, el Mago y el Armario</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-simon2.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: Adventure
Soft.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Autores</FONT></B><FONT SIZE=2>: Simon
y Michael Woodroffe.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: MS-DOS,
PC 486, VGA , 4 Mb RAM, 2 Mb HD, CD 2x, Tarjeta de Audio.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Idioma</FONT></B><FONT SIZE=2>: Castellano.</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Precio</FONT></B><FONT SIZE=2>: 6990 pts.</FONT></CENTER>
<HR>
<P>
Despu&eacute;s del lanzamiento de los dos &quot;Monkey Island&quot;,
y dada la excelente acogida que estos juegos tuvieron entre los
usuarios, los chicos de Adventure Soft decidieron repetir la f&oacute;rmula
creada por Ron Gilbert y LucasArts. Cambiaron los piratas por
magos, y las islas ex&oacute;ticas por bosques encantados; mantuvieron
la misma estructura de juego, con una l&iacute;nea argumental
similar, con toneladas de divertidos puzzles, extra&ntilde;os
objetos, estrafalarios personajes y absurdas situaciones&#133;
y el resultado fue &quot;Simon The Sorcerer&quot;, una excelente
(aunque no especialmente original) aventura de la que ahora nos
llega la continuaci&oacute;n. En esta ocasi&oacute;n el adolescente
Simon vuelve a ser transportado (a trav&eacute;s de un armario
m&aacute;gico) al mundo donde vivi&oacute; sus primeras aventuras,
para enfrentarse una vez m&aacute;s a S&oacute;rdido (el villano
de la primera parte) y conseguir regresar a su verdadera dimensi&oacute;n&#133;
<P>
Esta nueva entrega de las aventuras de Simon cuenta con una gran
cantidad de enigmas y situaciones, y dado que adem&aacute;s el
nivel de dificultad no es demasiado elevado, el juego resulta
muy jugable y entretenido tanto para aventureros experimentados
como para noveles. Sin embargo, y pese a ser una aventura bastante
abierta que da acceso desde el principio a una gran cantidad de
localidades, hay que decir que es algo m&aacute;s lineal de lo
que de entrada parece.
<P>
La versi&oacute;n espa&ntilde;ola se ha sacado s&oacute;lo en
CD (la inglesa tambi&eacute;n est&aacute; en disquettes) y cuenta
con todos los di&aacute;logos hablados en castellano. El doblaje
se ha hecho con una calidad bastante aceptable (cosa poco frecuente
hasta ahora), por lo que resulta extremadamente divertido escuchar
el juego. Para aquellos que lo prefieran (o para discapacitados
auditivos) el juego cuenta con una opci&oacute;n para subt&iacute;tulos.
<P>
T&eacute;cnicamente el juego no ofrece ninguna novedad destacable,
pero s&iacute; se han mejorado todos los peque&ntilde;os detalles
que fallaban en Simon 1. As&iacute;, se ha mejorado el interfaz,
substituyendo los verbos de acci&oacute;n por iconos; se han incluido
mapas que facilitan enormemente el movimiento a trav&eacute;s
de los muchos escenarios de que consta el juego, la velocidad
del desplazamiento de Simon (algo lenta en la primera parte) ahora
es m&aacute;s r&aacute;pida y fluida, &#133; Otra util&iacute;sima
funci&oacute;n que se ha incluido es la posibilidad de resaltar
los objetos &quot;interactivos&quot; de cada localidad pulsando
la tecla F10. Con todas estas mejoras &quot;El Le&oacute;n, el
Mago y el Armario&quot; resulta una aventura muy maniobrable y
muy agradable de jugar.
<HR>
<P>
<I>Recomendado especialemente a: </I>
<P>
Amantes de las aventuras estilo Monkey Island, con toneladas de
puzzles, objetos y personajes.
<P>
<I>Principales virtudes:</I>
<P>
No tiene nada brutalmente espectacular, pero todo lo que hay est&aacute;
muy bien acabado. Es una aventura muy agradable de jugar, aunque
no aporta absolutamente nada nuevo.
<P>
<I>Principales (pr&aacute;cticamente &uacute;nicos) defectos:</I>
<P>
Un par de enigmas algo oscuros.
<P>
<I>La Pista:</I>
<P>
El repartidor de globos no te dar&aacute; un segundo o tercer
globo mientras lleves alguno en tu inventario. Tendr&aacute;s
que dejarlos atados en alg&uacute;n sitio&#133;
<HR>
<P>
<B>&quot;No puedo, no puedo</B>&quot; - Ra&uacute;l Alvarez Garc&iacute;a.
<P>
<CENTER>[<A HREF="coment.htm">Volver</A>]</P></CENTER>
</BODY>
</HTML>
