<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: The Last Express</TITLE>
<META NAME="DESCRIPTION" CONTENT="Review de The Last Express">
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#ffffff" LINK="#c0c0c0" VLINK="#c0c0c0">
<P>
<CENTER><FONT SIZE=6 FACE="Arial Black">THE LAST EXPRESS</FONT></CENTER>
<P>
<CENTER><IMG SRC="c-tle-1.jpg"></CENTER>
<P>
<CENTER><B><FONT FACE="Arial">Tipo:</FONT></B><FONT FACE="Arial">
Aventura Gr&aacute;fica <B>Idioma:</B> Castellano <B>Autores:</B>
Jordan Mechner, Tomi Pierce</FONT></CENTER>
<P>
<CENTER><B><FONT FACE="Arial">Casa:</FONT></B><FONT FACE="Arial">
Broderbund / Smoking Car Productions <B>Distribuidor:</B> Electronics
Arts <B>Precio:</B> 7990 pesetas</FONT></CENTER>
<P>
<CENTER><B><FONT FACE="Arial">Sistema:</FONT></B><FONT FACE="Arial">
MSDOS o Windows 95, 486 DX/2 66 (Pentium 90 recomendado), 8 MB
RAM (16 MB recomendados), tarjeta de sonido Sound Blaster 16 o
100% compatible, 35 MB espacio de disco duro libre, v&iacute;deo
SVGA / Local Bus / PCI funcionando en 640x480 con color de 16
bits, unidad de CDROM 4x o superior, rat&oacute;n.</FONT></CENTER>
<HR>
<P>
<FONT FACE="Arial">Puede que decir que un juego es original en
la mezcla, pero no en sus componentes, no sea el modo m&aacute;s
adecuado de describirlo. Pero no puedo resistir la tentaci&oacute;n
de establecer paralelismos con otras aventuras gr&aacute;ficas:
el ambiente y los puzzles al estilo de Laura Bow o Cruise for
a Corpse; el interface gr&aacute;fico de Riven; una perspectiva
subjetiva como en el Doom o el Ultima Underworld... Naturalmente,
el tratamiento gr&aacute;fico es m&aacute;s novedoso, mostrando
unos rostros muy expresivos. Vayamos paso a paso.<BR>
</FONT>
<P>
<IMG SRC="c-tle-2.jpg" ALIGN="RIGHT"><FONT FACE="Arial">La trama:
un aventurero con problemas con la ley acude a la cita, a bordo
del Orient Express, con un compa&ntilde;ero suyo que ha reclamado
su ayuda, en v&iacute;speras de la Primera Guerra Mundial. A partir
de aqu&iacute; se desarrolla una complicada trama de espionaje,
tr&aacute;fico de armamento, terrorismo, arribismo y coleccionismo
de arte [curiosa mezcla, &#191;no?] que est&aacute; salpicada
de referencias hist&oacute;ricas ver&iacute;dicas, que la hacen
m&aacute;s interesante, m&aacute;s veros&iacute;mil. <BR>
</FONT>
<P>
<FONT FACE="Arial">El ambiente: se ha cuidado con un detalle extremo
la decoraci&oacute;n de este Orient Express virtual del a&ntilde;o
1.914, recurri&eacute;ndose a expertos en trenes. Pero adem&aacute;s,
tanto el vestuario, como el hecho de que los personajes recurren
a conversaciones en sus respectivos idiomas, algunos de los cuales
el protagonista entiende, apareciendo entonces subtitulados...
todo se a&uacute;na y confabula para hacernos profundizar en esta
&quot;realidad virtual&quot;, en este mundo cosmopolita de traiciones,
alta pol&iacute;tica y tensiones entre pa&iacute;ses que nos propone
Broderbund.<BR>
</FONT>
<P>
<FONT FACE="Arial">La interface: los primeros momentos, tras ver
las flechas, uno se &quot;teme&quot; estar inmerso en otra copia
de Riven. Pero s&oacute;lo hay un par de puzzles de manipulaci&oacute;n
de objetos. Y en el primer caso, se suministra una pista bastante
clara de c&oacute;mo resolverlo. En el otro... &#191;no sab&eacute;is
desactivar bombas a estas alturas? Las flechas para desplazarse,
dar la vuelta o mirar a los lados, as&iacute; como los objetos
que aparecen en pantalla, y que a diferencia de Myst/Riven, pueden
depositarse en un inventario para ser usados en otro momento,
son bastante intuitivas, y desde luego ya familiares de otros
juegos... no s&oacute;lo de Myst... &#191;alguien recuerda el
Dungeon Master para el Atari o el Amiga? O m&aacute;s recientemente,
los Ultima Underworld. &#191;Referencias a juegos de rol o casi
hablando de aventuras gr&aacute;ficas? &#161;Quememos a El B&aacute;rbaro
en la hoguera ahora mismo!<BR>
</FONT>
<P>
<FONT FACE="Arial">El juego: los puzzles son algo enrevesados,
dif&iacute;ciles... sino se tienen en cuenta la multitud de pistas
que la lectura de diarios, peri&oacute;dicos y etc as&iacute;
como el escuchar las conversaciones del resto de pasajeros del
expreso. Por un lado, el juego prev&eacute; diversas soluciones
al mismo problema (incluso tiene dos finales distintos) en m&aacute;s
de una ocasi&oacute;n, con resultados que hacen diferir ligeramente
la acci&oacute;n. No estoy diciendo que tenga un elevado valor
de &quot;vuelta a jugar una vez acabado&quot;, pero s&iacute;
que, para ser un juego que transcurre &quot;sobre ra&iacute;les&quot;
no es precisamente del todo lineal. &#191;Ejemplos? &#191;De qu&eacute;
hablo? Pues si os hab&eacute;is librado r&aacute;pidamente de
&quot;cierto cad&aacute;ver&quot;, probad a ocultarlo bajo la
cama... Por otro lado, hay muchos detalles que descubrir, pero
que no son imprescindibles para terminarlo, y que s&oacute;lo
sirven para crear atm&oacute;sfera o alimentar la curiosidad del
jugador.<BR>
</FONT>
<P>
<FONT FACE="Arial">La valoraci&oacute;n: la verdad es que nunca
hubiese esperado que este juego llegara a gustarme. Que maldec&iacute;
la dificultad de llegar sano, de una pieza, con todo lo que se
supone que hay que hacer, a Viena... pero la verdad es que este
juego deja un regusto agradable en la boca cuando lo concluyes;
que funciona deliciosamente tanto bajo DOS como bajo Windows 95
[eso &uacute;ltimamente es noticia]; que tiene multitud de peque&ntilde;os
detalles, de peque&ntilde;as cosas que no son necesarias para
resolver el juego, pero que ayudan a entender porqu&eacute; suceden
las cosas, son informativas, crean ambiente o simplemente son
divertidas. Puede que no est&eacute; en el Top Ten de todos los
tiempos, pero al menos s&iacute; puede recomendarse, como m&iacute;nimo
a nivel de prueba.<BR>
</FONT>
<P>
<FONT FACE="Arial">Lo malo: ante todo, es extra&ntilde;o el requerimiento
de una Soundblaster 16 compatible al 100% Muchas buenas tarjetas
de sonido, mejores que la SB16, existen en los PCs de este cruel
mundo, pero s&oacute;lo son capaces de emular una SB de 8 bits.
Olvidaos del juego, en ese caso. El sistema de salvar partidas
y recuperarlas es kafkiano, obtuso, improcedente y en mi caso
[o soy muy bueno jugando o muy malo grabando partidas] no llegu&eacute;
a dominarlo hasta casi concluida la aventura.<BR>
</FONT>
<P>
<FONT FACE="Arial">Conclusi&oacute;n: este juego es posible que
sea un avance de lo que pueden ofrecernos los motores gr&aacute;ficos
tridimensionales para las aventuras gr&aacute;ficas. Este juego
es tan tridimensional como Doom [o sea: que no lo es, pero lo
parece, como la castidad de la mujer de...] pero lo importante
es que el resultado es una aventura divertida, interactiva y refrescante.
La recomiendo a los aventureros que disfrutan con los juegos de
detectives e investigaci&oacute;n. A los que disfrutan con las
aventuras con mil y un detalles, esta vez de tipo hist&oacute;rico,
ciertos, consultables en las bibliotecas y hemerotecas; de tipo
art&iacute;stico y, naturalmente, de tipo ferroviario. Veremos
qu&eacute; provecho saca Sierra de sus desarrollos tridimensionales:
servidor era bastante pesimista al respecto, pero tras ver este
ejemplo, creo que hay esperanza.</FONT>
<P>
<B><FONT FACE="Arial">Comentario por</FONT></B><FONT FACE="Arial">
el &uacute;nico, el inigualable, <B>El B&aacute;rbaro</B>.</FONT>
<HR>
<P>
<CENTER><FONT FACE="Arial">[<A HREF="coment.htm">Volver</A>]</FONT></CENTER>
</BODY>
</HTML>
