<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Las Aventuras del Quinto Mosquetero.</TITLE>
</HEAD>
<BODY>
<P>
<CENTER><B><FONT SIZE=6>TOUCHE: LAS AVENTURAS DEL QUINTO MOSQUETERO
<BR>
<IMG SRC="c-touche.jpg"></FONT></B></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Casa</FONT></B><FONT SIZE=2>: US Gold
<B>Autores</B>: Graham Lilley, Paul Cockburn, Susan de Nimbes
</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Tipo</FONT></B><FONT SIZE=2>: Aventura
gr&aacute;fica<B> Idioma</B>: textos en castellano, voces en ingl&eacute;s
<B>Precio</B>: 6995 pts </FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=2>Sistema</FONT></B><FONT SIZE=2>: MS-DOS,
486, 4 Mb RAM, CD 2x, VESA, rat&oacute;n</FONT></CENTER>
<HR>
<P>
&quot;Touch&eacute;&quot; es otra aventura heredera del esp&iacute;ritu
&quot;Monkey Island&quot;, tanto en desarrollo como en realizaci&oacute;n.
De hecho, al contemplar las primeras pantallas uno tiene la sensaci&oacute;n
de estar jugando a un remake en SVGA de la famosa saga de LucasArts&#133;
De cualquier forma, tiene suficientes novedades como para que
valga la pena jugarlo. Adem&aacute;s de los ya mencionados gr&aacute;ficos
en alta resoluci&oacute;n, cuenta con un nuevo interfaz que se
basa en una serie de men&uacute;s de verbos que aparecen cuando
pulsamos sobre los objetos interactivos del escenario o sobre
los objetos de nuestro inventario. Es c&oacute;modo, f&aacute;cil
de usar, y bastante flexible. El doblaje del juego (en ingl&eacute;s)
es de buena calidad y los subt&iacute;tulos est&aacute;n en castellano.
<P>
Se trata de una aventura de dificultad media, con algunos enigmas
algo (no excesivamente) enrevesados, harto entretenida y agradable
de jugar. El dise&ntilde;o es muy tradicional, el juego se basa
en ir de un sitio a otro recogiendo objetos y resolviendo enigmas
con ellos. Si bien no es especialemente novedoso, es bastante
entretenido mientras uno no se cansa de hacer todo el rato lo
mismo.
<P>
Ambientado en Francia en el a&ntilde;o 1562, el juego narra las
peripecias un mosquetero en su b&uacute;squeda de unos documentos
cruciales para el futuro de su pa&iacute;s. Si te gustan las aventuras
gr&aacute;ficas a la antigua usanza, probablemente &quot;Touche&quot;
ser&aacute; de tu agrado.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Es una aventura entretenida y bien realizada.
<P>
<B>Principal defecto:</B>
<P>
Un final un poco pobre y con poca fuerza.
<P>
<B>La Pista:</B>
<P>
Despu&eacute;s de la primera visita en la que entras por el balc&oacute;n,
para poder ver a Juliette deber&aacute;s deshacerte de su posesivo
padre, mostr&aacute;ndole la carta que un pretendiente de su hija
ha escrito.
<P>
<I>Comentario por Ra&uacute;l Alvarez (&#161;otra vez!)</I>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver atr&aacute;s</A>]</P></CENTER>
</BODY>
</HTML>
