<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comentario: Torin's Passage</TITLE>
</HEAD>
<BODY>
<P>
<CENTER><B><FONT SIZE=6>TORIN'S PASSAGE</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="c-torin.jpg"></CENTER>
<P>
<CENTER><B><FONT SIZE=1>Tipo</FONT></B><FONT SIZE=1>: Aventura
gr&aacute;fica<B> Casa</B>: Sierra On-Line <B>Autor</B>: Al Lowe
</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=1>Idimoma</FONT></B><FONT SIZE=1>: Ingl&eacute;s
con subt&iacute;tulos en castellano <B>Precio</B>: 7.000 pts</FONT></CENTER>
<P>
<CENTER><B><FONT SIZE=1>Sistema</FONT></B><FONT SIZE=1>: DOS &oacute;
Windows, 486 DX, 8 Mb RAM, 2 Mb HD, CD 2x, VESA, rat&oacute;n,
tarjeta de audio compatible con SoundBlaster &oacute; Windows.</FONT></CENTER>
<HR>
<P>
Al Lowe, padre del lig&oacute;n m&aacute;s famoso del mundo de
los PC, Larry Laffer, deseaba crear una nueva aventura con la
que poder jugar con su hija de once a&ntilde;os. Una aventura
con una historia sencilla, ambientada en un mundo fant&aacute;stico,
y con una buena dosis de humor.
<P>
La acci&oacute;n transcurre en Estrata, un curioso planeta que
est&aacute; compuesto por cinco &quot;capas&quot;, cada una de
las cuales es un mundo independiente, con poblaci&oacute;n, vegetaci&oacute;n
y caracter&iacute;sticas propias. Los cinco mundos est&aacute;n
intercomunicados por unos extra&ntilde;os cristales que permiten
viajar de uno a otro.
<P>
El juego comienza con un pr&oacute;logo que explica el origen
del protagonista, Torin, un muchacho que recorrer&aacute; los
cinco mundos de Estrata en busca de sus padres adoptivos, que
han sido secuestrados por una hechicera. Esta b&uacute;squeda
representa el viaje de la ni&ntilde;ez a la edad adulta, y en
ella Torin desubrir&aacute; que las cosas, y las personas, no
son simplemente lo que parecen.
<P>
&quot;Torin's Passage&quot; cuenta b&aacute;sicamente con dos
tipos de puzzles: los cl&aacute;sicos problemas de inventario,
del estilo &quot;usar el objeto X con Y&quot;, y juegos l&oacute;gicos
bastante divertidos. Se trata de una aventura sencilla, que, adem&aacute;s,
cuenta con una opci&oacute;n de &quot;pistas&quot; para aquellos
que no tengan ganas de quedarse bloqueados. Sierra ha creado un
producto &quot;para toda la familia&quot;, con las ventajas e
inconvenientes que eso suele suponer: gr&aacute;ficos y animaciones
tipo dibujo animado bastante conseguidos, excelente banda sonora
compuesta por Michel Legrand (ganador de tres Oscars y cinco Grammies),
un simpl&iacute;simo interfaz, &#133; La adaptaci&oacute;n espa&ntilde;ola
es bastante mediocre pues s&oacute;lo se han traducido los subt&iacute;tulos.
<P>
Pese a que el conjunto es bastante aceptable y que posee varias
virtudes, me ha resultado una aventura bastante corta y poco interesante,
y cuyo mayor defecto es, posiblemente, una acusada falta de car&aacute;cter.
<HR>
<P>
<B>Principal virtud:</B>
<P>
Una gran variedad de opciones que el jugador puede configurar
a su antojo.
<P>
<B>Principal defecto:</B>
<P>
El personaje central, Torin, no tiene suficiente fuerza.
<P>
<B>Recomendado especialmente para:</B>
<P>
Familias que deseen una aventura con presentaci&oacute;n &quot;Disneyana&quot;
y humor netamente americano.
<P>
<I>Comentado por Ra&uacute;l &quot;si no est&aacute;s de acuerdo
m&aacute;ndanos tu opini&oacute;n&quot; Alvarez.</I>
<HR>
<P>
<CENTER>[<A HREF="coment.htm">Volver atr&aacute;s</A>]</P></CENTER>
</BODY>
</HTML>
