<HTML>
<HEAD>
<meta charset="utf-8">
<TITLE>SQ Comparativa: Zork Grand Inquisitor vs Riven</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<BODY BGCOLOR="#ffffff" TEXT="#000000" LINK="#808080" VLINK="#808080">
<P>
<CENTER><FONT SIZE=6 FACE="Arial">Zork Grand <BR>
Inquisitor</FONT></CENTER>
<P>
<CENTER><FONT SIZE=5 FACE="Arial">vs</FONT></CENTER>
<P>
<CENTER><FONT SIZE=7 FACE="Arial">Riven</FONT></CENTER>
<P>
<I><FONT FACE="Arial">Aqu&iacute; estamos, dispuestos a asistir
al combate de lucha libre entre dos aspirantes al t&iacute;tulo
de mejor aventura de 1.997 y 1.998. En el rinc&oacute;n oeste,
portando ba&ntilde;ador de cinco colores, Riven. Al otro lado,
es decir, el este de all&aacute;, con pantal&oacute;n azul m&aacute;gico,
Zork Grand Inquisitor, ZGI para los amigos.</FONT></I>
<P>
<I><FONT FACE="Arial">Ambos aspirantes est&aacute;n bastante igualados,
&#191;cu&aacute;l de los dos se llevar&aacute; el pec&eacute;
al agua?</FONT></I>
<P>
<I><FONT FACE="Arial">Empieza el combate, y parece que, para tantearse,
ambos contendientes est&aacute;n usando los gr&aacute;ficos y
otras exquisiteces multimedia para medir las fuerzas contrarias.</FONT></I>
<P>
<FONT FACE="Arial">Los gr&aacute;ficos en Riven est&aacute;n hechos
en un alarde de prerenderizaci&oacute;n. Todo parece estar hecho
en una Silicon Graphics, de modo que el visionado de tales dibujos
produce dolores en la quijada al hacernos abrir la boca hasta
la extenuaci&oacute;n, con emisi&oacute;n de babas y envidia de
los vecinos con un 486. Riven usa peque&ntilde;as localizaciones
dentro de un mapeado m&aacute;s grande, por las cuales nos desplazamos
dando saltitos como si fu&eacute;ramos un canguro cibern&eacute;tico.
Los gr&aacute;ficos son importantes, pues dan pistas sobre las
acciones que debemos desarrollar o que se supone que hay que hacer
a continuaci&oacute;n. Por no hablar que transmiten una atm&oacute;sfera
alien&iacute;gena, extra&ntilde;a, extraterrestre.</FONT>
<P>
<FONT FACE="Arial">Los gr&aacute;ficos de ZGI son tambi&eacute;n
detallados, bonitos e impactantes, pero se quedan a una cierta
distancia tecnol&oacute;gica de los de Riven. Sin embargo, el
modo panor&aacute;mico bautizado como Zvision, que permite echar
vistazos de trescientos sesenta grados alrededor de una localizaci&oacute;n
concreta, permite hacernos m&aacute;s r&aacute;pido una idea de
d&oacute;nde estamos y los caminos y salidas, algo que en Riven
cuesta mucho m&aacute;s. As&iacute; que puede concluirse que los
gr&aacute;ficos son algo menos espectaculares en ZGI, pero en
cambio, son mucho m&aacute;s pr&aacute;cticos a la hora de jugar.</FONT>
<P>
<CENTER><TABLE ALIGN="CENTER" BGCOLOR="#000000">
<TR><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><FONT SIZE=4 COLOR=#FFFFFF FACE="Arial">Zork Grand Inquisitor</FONT></CENTER>
</TD><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><FONT SIZE=4 COLOR=#FFFFFF FACE="Arial">Riven</FONT></CENTER>
</TD></TR>
<TR><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-1.jpg"></CENTER>
</TD><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-4.jpg"></CENTER>
</TD></TR>
<TR><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-2.jpg"></CENTER>
</TD><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-5.jpg"></CENTER>
</TD></TR>
<TR><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-3.jpg"></CENTER>
</TD><TD ALIGN="CENTER" VALIGN="MIDDLE"><CENTER><IMG SRC="c-zvsr-6.jpg"></CENTER>
</TD></TR>
</TABLE>
</CENTER>
<P>
<FONT FACE="Arial">&#191;Qu&eacute; decir del audio? En ambas
aventuras las filigranas sonoras no s&oacute;lo requieren sonido
de diecis&eacute;is bits y est&eacute;reo, sino que tener las
orejas bien tiesas y preparadas para escuchar los murmullos y
ruidos reverberantes que saldr&aacute;n de vuestros altavoces
es imprescindible para terminar ambos juegos sin ayuda de soluciones
completas. Por no hablar que en los dos casos, las digitalizaciones
y la m&uacute;sica son excelentes y de alt&iacute;sima calidad,
especialmente en Riven. En este caso, no redirigir el sonido hacia
una cadena musical es un pecado, digno de mandar al infractor
directamente al Hades de ZGI.</FONT>
<P>
<FONT FACE="Arial">Para acabar con el tema filigranero, mencionar
que ambos usan animaciones a toda pantalla en plan pel&iacute;cula,
en Riven basadas en la tecnolog&iacute;a Quicktime, que por un
lado permite interactuar, y de otro, es la responsable de varios
de los fallos que tiene el juego a nivel t&eacute;cnico, y para
los cuales existen parches para bajarse en el web de Broderbund&nbsp;;
de otro lado, las animaciones de este tipo en ZGI son simplemente
para explicar retazos de la historia pero sin interactividad con
el jugador.</FONT>
<P>
<I><FONT FACE="Arial">Tras zafarse de la aparente superioridad
t&eacute;cnica de Riven, ZGI consigue escapar del cuerpo a cuerpo
sin haber perdido sus opciones a vencer en el combate, mas Riven
tiene una ligera superioridad debida a tales argucias... momento
que aprovecha ZGI para contraatacar con su fuerte&nbsp;: el gui&oacute;n
y la historia.</FONT></I>
<P>
<FONT FACE="Arial">La verdad es que el que suscribe este supuesto
art&iacute;culo ha dicho m&aacute;s de una vez que le gustan las
aventuras gr&aacute;ficas porque se reducen los dolores de cabeza
que produce hasta el m&aacute;s bendito y amigable de los parsers.
Por desgracia, tambi&eacute;n suele suceder que toda la aventura
deviene excesivamente f&aacute;cil o con puzzles gastados ya de
tanto usarse.</FONT>
<P>
<FONT FACE="Arial">ZGI es una especie de bocanada de aire fresco.
No es que los puzzles sean todos novedosos o el colmo de la originalidad,
pero m&aacute;s de una vez probar todos los objetos de tu inventario
sobre un lugar concreto no servir&aacute; de nada [como nos advierte
el Can Cerbero]. Hay que usar la l&oacute;gica &quot;zorkiana&quot;
constantemente. Dicha l&oacute;gica consiste en meterse en la
cabeza de alg&uacute;n loco y preguntarse qu&eacute; har&iacute;a
&eacute;l en la misma situaci&oacute;n. Del mismo modo que para
jugar un Larry hay que tener una mente perversa y obsesa [no como
la m&iacute;a, claro... ejem], en ZGI hay que emplear bastante
una l&oacute;gica de ni&ntilde;o de p&aacute;rvulos, de humorista,
de gag de Monty Phyton, t&aacute;chese lo que no proceda.</FONT>
<P>
<FONT FACE="Arial">En Riven, en cambio, no partimos de una historia
excesivamente estructurada, ni es &eacute;sta necesaria para resolver
los puzzles del juego. Para ello, hay que tener mentalidad de
ingeniero de caminos y ser muy, pero que muy observador, estableciendo
relaciones constantemente entre las diversas y sutiles pistas
que se nos proporcionan a lo largo del juego. Hay algo m&aacute;s
de argumento que en su antecesor y padre, Myst, pero al igual
que en &eacute;l, eso no es lo importante.</FONT>
<P>
<FONT FACE="Arial">Se podr&iacute;a resumir diciendo que en Riven
estamos ante un juego atmosf&eacute;rico y l&oacute;gico, mientras
que ZGI es una aventura humor&iacute;stica. &#191;Hay m&aacute;s
diferencias&nbsp;?</FONT>
<P>
<I><FONT FACE="Arial">Ambos contendientes se han hecho mutuamente
una presa con las manos, mientras tratan de vencer al contrario
usando la fuerza bruta, y de vez en cuando la cabeza para asestar
duros golpes de testa en la frente del adversario...</FONT></I>
<P>
<FONT FACE="Arial">La interface de usuario es en ambos casos tremendamente
semejante. En Riven apenas hay inventario, mientras que en ZGI
s&iacute; existe... pero por lo que respecta al resto de posibilidades,
en ambos juegos se avanza, se gira, se accionan objetos o se recogen
exactamente del mismo modo. Ambos parten de sus ancestros, heredando
sus respectivos interfaces de sus anteriores ediciones de la misma
saga, as&iacute; que se puede hablar de una convergencia adaptativa,
como los delfines y los tiburones, que se parecen mucho, pero
no se han copiado entre ellos.</FONT>
<P>
<FONT FACE="Arial">Los requisitos de sistema son tambi&eacute;n
muy parecidos&nbsp;: ambos requieren Windows 95 y usan la maldita
API DirectX, versi&oacute;n cinco, as&iacute; como ser&aacute;
menester poseer un lector de CD ROM rapidito [a partir de x8 aunque
ellos digan que con menos, pasas... &#161;&#161;&#161;mentira&nbsp;!&nbsp;!&nbsp;!&nbsp;!]
Ambos requieren aproximadamente un Pentium a 100Mhz, 16 MB de
RAM y m&aacute;s o menos el mismo espacio de disco duro, tampoco
demasiado teniendo en cuenta otras aventuras contempor&aacute;neas
al estilo de Blade Runner.</FONT>
<P>
<I><FONT FACE="Arial">Finalmente, ambos luchadores, exhaustos,
caen sobre la lona sin poder articular palabra, cansados de luchar
el uno contra el otro, extenuados, agotados,... se me han acabado
los sin&oacute;nimos, &#191;alguien tiene por ah&iacute; un diccionario&nbsp;?</FONT></I>
<P>
<FONT FACE="Arial">&#191;Cu&aacute;l elegir&nbsp;? Honestamente,
creo que es m&aacute;s una cuesti&oacute;n sobre qu&eacute; tipo
de aventuras prefieras. Si eres de los que disfrut&oacute; como
un ni&ntilde;o con zapatos nuevos [o videoconsola nueva, para
poner el dicho al d&iacute;a] con Myst y sus otros descendientes
ileg&iacute;timos [Lighthouse, por ejemplo] no dudo en recomendarte
Riven. Por otro lado, si eres un adepto al mundo zorkiano, o te
gustan las aventuras con sentido del humor, seguro que disfrutar&aacute;s
mucho m&aacute;s de ZGI, m&aacute;s, por ejemplo, que con Curse
of Monkey Island, francamente.</FONT>
<P>
<FONT FACE="Arial">Esquivando los tomates, El B&aacute;rbaro.</FONT>
<P>
<CENTER><FONT FACE="Arial">[<A HREF="coment.htm" >Volver</A>]
<BR>
</FONT></CENTER>
</BODY>
</HTML>
