<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.6 [en-gb] (Win98; I) [Netscape]">
   <title>SQ: El estudio de un aventurero (I)</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#000080" vlink="#800080" alink="#800080">

<div align=right><i><font face="Arial"><font size=+0>Art&iacute;culo escrito
por</font></font></i>
<br><b><i><font face="Arial"><font size=+0><a href="mailto:kilivor@geocities.com">Daniel
C&aacute;rdenas</a></font></font></i></b></div>

<center>
<p><br><font face="Arial"><font size=+3>El estudio de un aventurero (I)</font></font></center>

<p><font face="Arial">En este art&iacute;culo vamos a citar algunas de
las cosas que pueden ayudarte a montar tu propio estudio aventurero, el
'estudio' que instalado en tu propia casa va a permitirte hacer aventuras,
esos mundos virtuales donde los jugadores viven mil y una aventuras. De
ninguna manera el montarlo te va a costar un past&oacute;n ya que no hace
faltar tener ninguna super estaci&oacute;n de trabajo, ni tampoco despilfarraremos
nuestros poco presupuesto en software comercial, limit&aacute;ndonos a
usar algunas de esas excelentes herramientas gratuitas que existen.</font>
<p><font face="Arial">Se suele decir que en la &eacute;poca de los 8 bits
cualquier aficionado pod&iacute;a acercarse e incluso superar a lo comercial,
principalmente porque la limitada memoria y la poca potencia gr&aacute;fica
de las m&aacute;quinas de anta&ntilde;o permit&iacute;a disimular sin problema
un escaso talento gr&aacute;fico. Hoy d&iacute;a esto ya no es posible,
los juegos de la actualidad tienen un aspecto gr&aacute;fico francamente
excepcional, que queda fuera del alcance de cualquier aficionado que trabaje
en solitario, e incluso de un grupo de aficionados que cuente con grafistas
en su equipo. Hay que tener en cuenta que los macroestudios de las casas
de soft tienen un buen n&uacute;mero de grafistas, modeladores 3D y dibujantes
trabajando ocho o m&aacute;s horas diarias, e intentar superar su calidad
es verdaderamente ut&oacute;pico. Sin embargo no debes preocuparte por
ello: en una conversacional los gr&aacute;ficos suelen ser accesorios,
y como prueba ah&iacute; est&aacute;n las mejores obras conversacionales,
que la mayor&iacute;a son puro texto.</font>
<p><font face="Arial">Y ojo, que si bien en nivel gr&aacute;fico se parte
con una clara desventaja, no es as&iacute; con el argumento y la historia.
En una conversacional donde te trabajes estos aspectos, y plantees un buen
desarrollo, unos ricos personajes y un buen mundo de trasfondo, puedes
dejar por los suelos cualquiera de los juegos actuales. Ciertamente, muchos
de los juegos m&aacute;s aclamados &uacute;ltimamente dejan mucho que desear,
no se sabe si por dejadez de los dise&ntilde;adores, o por ser estos unos
patanatas, o porque realmente nosotros los usuarios hemos bajado nuestro
list&oacute;n de exigencias en cuanto a gui&oacute;n se refiere. Y recordemos
que estos productos se suelen vender por 7000 cuquillas o m&aacute;s...</font>
<p><font face="Arial">Pues eso, que si trabajando con tu obra con todo
amor y cari&ntilde;o, ya sea dise&ntilde;&aacute;ndola sobre papel o pas&aacute;ndola
a la m&aacute;quina, te diviertes ya estar&aacute; muy bien. Que despu&eacute;s
sea m&aacute;s o menos buena, a qui&eacute;n le importa; pues nada la pr&oacute;xima
ya saldr&aacute; mejor... LO IMPORTANTE ES QUE T&Uacute; TE DIVIERTAS.
Y cr&eacute;eme, ese cari&ntilde;o a buen seguro se dejar&aacute; notar
en el producto final, lo que har&aacute; que tu obra sea agradable y maja
de jugar. Recibir&aacute;s sugerencias para poder mejorar y felicitaciones
de esos valientes que se introdujeron en tu mundo y compartieron tu fantas&iacute;a,
y que te animar&aacute;n a seguir adelante... &iexcl;y eso no tiene precio!.
Desde luego, ese amor al arte sit&uacute;a a ese peque&ntilde;o y humilde
estudio, seguramente tu habitaci&oacute;n, muy por encima de cualquiera
de los estudios comerciales que puedan existir.</font>
<p><font face="Arial">Y ya no me enrollo m&aacute;s...</font>
<p><b><font face="Arial"><font size=+2>E</font>l <font size=+2>E</font>quipo
<font size=+2>M</font>&iacute;nimo</font></b>
<p><font face="Arial">Para desarrollar aventuras te bastar&aacute; con
un s&iacute;mple 386, aunque a m&aacute;s procesador obtendr&aacute;s m&aacute;s
r&aacute;pidez al realizar compilaciones con un parser o tu lenguaje preferido.
De todas formas, lo de tener tal o cual equipo no es ning&uacute;n requisito,
ya que se han hecho maravillas con equipos te&oacute;ricamente de risa,
como 8086 o Spectrum's. La cuesti&oacute;n es superar esas limitaciones
con ingenio y un pel&iacute;n de paciencia, eso es todo.</font>
<p><font face="Arial">Hardware adicional que puede resultarte &uacute;til
es tener una tarjeta de sonido y micr&oacute;fono para grabar voces para
la aventura, o un scanner o c&aacute;mara digital para meter gr&aacute;ficos.
Y como los precios suelen ser bastante asequibles (al menos compar&aacute;ndolos
con el de un par de a&ntilde;os atr&aacute;s) una grabadora de CDs puede
ser interesante por si vas a distribuir tu aventura en CD-ROM.</font>
<p><b><font face="Arial"><font size=+2>E</font>l&nbsp; <font size=+2>C</font>asi
<font size=+2>I</font>mprescindible
<font size=+2>P</font>arser</font></b>
<p><font face="Arial">D&iacute;ficil cuesti&oacute;n la de <i>"&iquest;cu&aacute;l
es el mejor parser?"</i>. A algunos aventureros les suele llevar algo de
tiempo el decidirse por uno de esos fant&aacute;sticos parsers gratuitos:
NMP, Caecho?, Sintac, SKC, Inform, y tantos otros. Depende de lo que quieras
hacer, uno te resultar&aacute; mejor o peor, y lo mejor que se puede hacer
es baj&aacute;rselo, echar un vistazo a su documentaci&oacute;n y trastear
un poco con &eacute;l.</font>
<p><font face="Arial">Inform, en su adaptaci&oacute;n al espa&ntilde;ol
(InformATE o Inform Ahora Totalmente en Espa&ntilde;ol) es sin duda el
m&aacute;s potente, aunque su orientaci&oacute;n a objetos, que es ampliamente
aceptada en el mundillo de la Interactive Fiction, no acaba de arraigar
del todo entre los aventureros espa&ntilde;oles, demasiado acostumbrados
al estilo de programaci&oacute;n del viejo PAWS (un programa de hace ya
casi quince a&ntilde;os del Spectrum, todo un mito y ya una religi&oacute;n
en este pais: Professional Adventure Writing System). A Inform se le atribuye
una cierta complejidad, pero en cuanto te adaptes a su nueva filosof&iacute;a
de programaci&oacute;n de conversacionales, resulta una de las formas m&aacute;s
intuitivas de programarlas. Su p&aacute;gina oficial es </font><font face="Arial,Helvetica"><a href="http://www.geocities.com/TimesSquare/Fortress/9939">http://www.geocities.com/TimesSquare/Fortress/9939</a></font>.
<p><font face="Arial">Si no pretendes hacer nada t&eacute;cnicamente excepcional,
sino que te conformas con que el crear la aventura sea un proceso sencillo
desde el principio, lo mejor que puedes hacer es esperarte a la salida
de Visual Sintac, el nuevo parser 'visual' de Javier San Jos&eacute;. Pronto
entrar&aacute; en fase beta, por lo que te aconsejamos que vigiles esta
direcci&oacute;n: <a href="http://personales.jet.es/jsjlogin/sintac/">http://personales.jet.es/jsjlogin/sintac/</a>.</font>
<p><font face="Arial">Si quieres estudiar alg&uacute;n otro parser, puedes
pasarte por el directorio de /if-archive/programming/ de <a href="ftp://ftp.gmd.de/if-archive/programming">GMD</a>
o alguno de sus mirrors: (<a href="http://ifarchive.org/">1</a>) &oacute;
(<a href="ftp://ftp.funet.fi/pub/misc/if-archive/programming">2</a>).</font>
<p><b><font face="Arial"><font size=+2>E</font>ditores</font></b>
<p><font face="Arial">Si el parser que vas a emplear no cuenta con entorno
propio (como CAECHO?) una opci&oacute;n es usar un buen editor de textos
que te permita trabajar c&oacute;moda y eficientemente. El poder definir
colores para las palabras reservadas, los comentarios y las 'cadenas' es
algo para muchos esencial. Tambi&eacute;n lo es el poder compilar desde
el propio editor, y capturar los posibles errores que pudieran existir.
Todo esto se encuentra en la mayor&iacute;a de editores digamos que serios,
y s&oacute;lo es cuesti&oacute;n de que investigues un poco en su ayuda
para descubrir estas capacidades. El tiempo que pierdas en esta investigaci&oacute;n
te aseguro que lo recuperar&aacute;s m&aacute;s tarde, cuando empieces
a trabajar con todo configurado a tu gusto.</font>
<p><font face="Arial">Como en el caso de los parsers, tampoco existe el
editor perfecto. Lo mejor es que te los mires y te quedes con el que m&aacute;s
te convenza. Notas: (1) A continuaci&oacute;n del nombre y entre par&eacute;ntesis
aparece la plataforma. (2) Los editores shareware que siguen son plenamente
funcionales a&uacute;n estando sin registrar.</font>
<p><font face="Arial">WinEdit (Windows): Bastante potente y configurable.
L&aacute;stima del precio, que es de locos (nada m&aacute;s y nada menos
que 100 d&oacute;lares), aunque no se desactiva tras el periodo de prueba
de 21 d&iacute;as:
<a href="http://www.windowware.com">http://www.windowware.com</a>.</font>
<p><font face="Arial,Helvetica">UltraEdit (Windows): Un editor con muchas
posibilidades, similar a WinEdit pero superior en muchos aspectos (incluso
en el precio, 's&oacute;lo' 30 d&oacute;lares). En su versi&oacute;n sin
registrar, &uacute;nicamente lo puedes usar durante 45 d&iacute;as y se
encuentra en <a href="http://www.ultraedit.com">http://www.ultraedit.com</a>.</font>
<p><font face="Arial,Helvetica">WinEdt (Windows): A pesar de tener un nombre
casi id&eacute;ntico con su 'competidor' WinEdit, tiene pocas cosas que
ver con aqu&eacute;l. &Eacute;ste est&aacute; orientado a la edici&oacute;n
de ficheros TeX (TeX es algo as&iacute; como un compilador para realizar
documentos), pero tambi&eacute;n se puede usar para programar aventuras.
El precio asciende a 40 d&oacute;lares y el per&iacute;odo de pruebas es
de 31 d&iacute;as, una vez pasado el mismo el editor empieza a sacar recordatorios
para registrarse: <a href="http://home.istar.ca/~winedt/">http://home.istar.ca/~winedt/</a>.</font>
<p><font face="Arial,Helvetica">Programmer's File Editor (Windows): Gratuito,
y lo que es m&aacute;s importante, el autor suele mantenerlo y mejorarlo
a partir de las sugerencias de los usuarios, por lo que poco a poco va
a&ntilde;adiendo m&aacute;s capacidades <a href="http://www.lancs.ac.uk/people/cpaap/pfe">http://www.lancs.ac.uk/people/cpaap/pfe</a>.</font>
<p><font face="Arial,Helvetica">Emacs (m&uacute;ltitud de plataformas):
Como hace poco comentaba Zak en la lista del CAAD 'alguien dijo una vez
que usar emacs para escribir es como usar</font>
<br><font face="Arial,Helvetica">un autom&oacute;vil para escuchar la radio'.
Con &eacute;l se puede hacer casi de todo y tambi&eacute;n est&aacute;
disponible gratuitamente (en tu distibuci&oacute;n Linux lo encontrar&aacute;s
con toda seguridad). Para las versiones Windows visita la p&aacute;gina
<a href="http://www.cs.washington.edu/homes/voelker/ntemacs.html">http://www.cs.washington.edu/homes/voelker/ntemacs.html</a>
y para el resto p&aacute;sate por <a href="http://www.gnu.org/software/emacs/emacs.html">http://www.gnu.org/software/emacs/emacs.html</a>.</font>
<p><font face="Arial,Helvetica">SET (Linux y Ms-Dos): El editor de Salvador
Eduardo Tropea, que tambi&eacute;n es bastante completo, de hecho &eacute;l
es el coraz&oacute;n del entorno RHIDE para <a href="http://www.delorie.com/djgpp/">DJGPP</a>
(el fant&aacute;stico compilador gratuito de C/C++). Lo puedes encontrar
en&nbsp;</font> <font face="Arial,Helvetica"><a href="http://www.geocities.com/CapeCanaveral/Runway/6218/index.html">http://www.geocities.com/CapeCanaveral/Runway/6218/index.html</a>.</font>
<p><b><font face="Arial"><font size=+2>D</font>iccionarios</font></b>
<p><font face="Arial,Helvetica">Est&aacute; claro que al escribir una aventura
puedes mandar a hacer g&aacute;rgaras a todos los puristas que se echan
las manos a la cabeza ya sea al contemplar faltas, ver palabras que se
usan con una significaci&oacute;n que no es la que le corresponde, o al
importar palabras de otras lenguas. Y es que no hay por qu&eacute; dar
un significado absoluto a las palabras, ya nos lo dec&iacute;a Lewis Carroll
(el autor de Alicia en el Pa&iacute;s de las Maravillas): <i>"cualquier
escritor de un libro est&aacute; perfectamente autorizado para atribuir
el significado que quiera a cualquier palabra o frase que pretenda usar...,
y mantengo que todo escritor puede adoptar sus propias reglas siempre que
sea consecuente consigo mismo y con los hechos aceptados de la l&oacute;gica"</i>.</font>
<p><font face="Arial,Helvetica">As&iacute; pues si quieres dar significados
nuevos a las palabras, adelante porque para eso es tu aventura; si quieres
invent&aacute;rtelas pues tambi&eacute;n adelante; y si para t&iacute;
'bueno' es 'vueno', 'caber' es 'caver' y la 'luna llena' es la 'luna nueva'
adelante, que por algo ES TU AVENTURA, aunque como dice Carroll has de
ser consecuente.</font>
<p><font face="Arial,Helvetica">Ahora bien, si vas a hacer una aventura
en la lengua digamos que 'establecida', resulta fundamental que tengas
un diccionario al lado y lo consultes siempre que tengas dudas acerca del
significado real de una palabra o de c&oacute;mo se escribe tal o cual
palabra. A mucha gente le rompe la ambientaci&oacute;n el ver faltas de
ortograf&iacute;a, y tampoco est&aacute; demasiado bien visto. As&iacute;
pues, el diccionario siempre al lado y cogerlo siempre que nos pongamos
a escribir, que es precisamente lo que recuerdo nos aconsejaba la profesora
de catal&aacute;n en bachillerato, <i>"coged siempre el Pompeu -el diccionario
'oficial' de catal&aacute;n-, antes de sentaros a hacer los ejercicios,
que para ir a la nevera a coger un refreso os levant&aacute;is, pero para
consultar el diccionario os da pereza y seguro que os qued&aacute;is sin
mirarlo"</i>.</font>
<p><font face="Arial,Helvetica">Tambi&eacute;n en una aventura es extremadamente
&uacute;til el diccionario de sin&oacute;nimos, que te ayudar&aacute; a
escribir descripciones y di&aacute;logos sin repetir una y otra vez la
misma palabra, y a que tu parser entienda m&aacute;s entradas, al definir
t&uacute; esos sin&oacute;nimos en la aventura.</font>
<p><font face="Arial,Helvetica">Y, por cierto, aqu&iacute; me estaba refiriendo
a diccionarios de 'papel', pero siempre puedes acudir a diccionarios multimedia.
Hay algunos que han sido regalados en revistas y peri&oacute;dicos, por
lo que quiz&aacute; hasta tengas uno por ah&iacute;. A esto hay que a&ntilde;adir
m&uacute;ltitud de herramientas y diccionarios que hay disponibles por
la red, s&oacute;lo tienes que buscar un poco y acabar&aacute;s encontrando
algo &uacute;til.</font>
<p><b><font face="Arial"><font size=+2>L</font>a<font size=+2> L</font>ibreta
de<font size=+2> G</font>uiones</font></b>
<p><font face="Arial">A la hora de preparar el gui&oacute;n no es recomendable
trabajar con el ordenador delante, porque como bien dice nuestro amigo
Luis David Arranz es m&aacute;s dificil pensar recibiendo una ducha radiactiva
de 75 kHz. Lo preferible es trabajar en un lugar en el que nos sintamos
c&oacute;modos y tranquilos, y trabajar sobre papel (una libreta espec&iacute;fica
para 'aventuras', por ejemplo, o tambi&eacute;n un bloc), y en l&aacute;piz
si solemos equivocarnos o retocar una y otra vez.</font>
<p><font face="Arial">Lo ideal es trabajar siempre con un mapa tambi&eacute;n
dibujado a mano, y que all&iacute; marquemos tanto psis como objetos m&aacute;s
importantes. Dadas las continuas anotaciones y marcas que practicaremos
al mapa (y alg&uacute;n que otro cambio), no resulta demasiado aconsejable
llevar un mapa actualizado en un programa mapeador. Al final, cuando el
mapa sea ya definitivo, si quieres ya podr&aacute;s pasarlo a un programa
de este tipo, pero no antes.</font>
<p><font face="Arial">Por tanto, totalmente desaconsejado el trabajar con
ordenador en etapas previas de la aventura: cuantas m&aacute;s cosas est&eacute;n
detalladas sobre papel, antes de ponerse a teclear, mucho mejor.</font>
<p><b><font face="Arial"><font size=+2>T</font>eor&iacute;a <font size=+2>A</font>venturera</font></b>
<p><font face="Arial">Nunca est&aacute; de m&aacute;s leerse esos documentos
que te comentan todos los pasos de la creaci&oacute;n aventurera, desde
la primera idea hasta la distribuci&oacute;n. Siempre hay algo que aprender
de esos textos, y de la mayor&iacute;a de las lecturas surgen ideas que
podemos aprovechar en nuestras creaciones. De obligada lectura resultan
los siguientes tres textos, que fueron escritos por tres magos de esto
de la aventura...</font>
<p><font face="Arial"><a href="http://www.cir.es/caad/samudio/index.html">El
Mundo de la Aventura</a>. Fant&aacute;stico curso de Andr&eacute;s Samudio,
que apareci&oacute; hace ya alg&uacute;n tiempo en la difunta Microhobby.
Recientemente ha sido transcrito a formato HTML por Tony Vera D&iacute;az,
Jose Manuel Hinojosa Pi&ntilde;a, Josetchu Malanda Uriarte y Sergio Costas
Rodr&iacute;guez. A todos ellos... &iexcl;gracias!.</font>
<p><font face="Arial"><a href="ftp://ftp.gmd.de/if-archive/programming/general-discussion/Craft.Of.Adventure.txt">The
Craft of Adventure</a> (ingl&eacute;s) [<a href="ftp://ftp.funet.fi/pub/misc/if-archive/programming/general-discussion/Craft.Of.Adventure.txt">mirror</a>].
Son cinco art&iacute;culos obra de Graham Nelson que versan sobre el dise&ntilde;o
de aventuras.</font>
<p><font face="Arial"><a href="ftp://ftp.gmd.de/if-archive/programming/general-discussion/authorship-guide.base">Whizzard's
Guide to Text Adventure Authorship</a> (ingl&eacute;s) [<a href="ftp://ftp.funet.fi/pub/misc/if-archive/programming/general-discussion/authorship-guide.base">mirror</a>].
Complet&iacute;sima gu&iacute;a aventurera escrita por Gerry Kevin Wilson.</font>
<p><font face="Arial">A parte de estas tres joyas existe cantidad de material
que en su mayor&iacute;a proviene de las p&aacute;ginas de fanzines como
el CAAD y Zona Zero. Todos ellos est&aacute;n recopilados en la biblioteca
de Pro-Imagyna, en su secci&oacute;n 'Textos y Documentos Te&oacute;ricos'
<a href="http://www.geocities.com/TimesSquare/5787/textos.html">http://www.geocities.com/TimesSquare/5787/textos.html</a>.</font>
<p><b><font face="Arial"><font size=+2>C</font>readores de
<font size=+2>G</font>r&aacute;ficos</font></b>
<p><font face="Arial">Si tu aventura va a incorporar gr&aacute;ficos, los
programas generadores de paisajes 3D te resultar&aacute;n de extrema utilidad.
Te permiten generar paisajes muy preciosistas en poco tiempo, y si tienes
un poco de habilidad y le dedicas un poco tiempo puedes hacer cosas realmente
majas. Este tipo de programas suelen demandar bastantes recursos, en especial
los que renderizan, que son los que obtienen mejores resultados.</font>
<p><font face="Arial">Programas de este tipo hay muchos, desde el sencillo
dise&ntilde;ador de jardines e interiores hasta el m&aacute;s sotisficado
programa de dise&ntilde;o 3D. Entre la infinidad existente citemos, por
ejemplo, Animatek's World Builder, Visual Home, 3D Landscape, 3D Kitchen
&amp; Bath (unas 11.000 ptas los tres &uacute;ltimos) y Bryce 3D (50.000
ptas).</font>
<p><font face="Arial">Si te interesa este terreno y no te puedes permitir
el alto precio de estas aplicaciones (como el que esto escribe), permanece
atento a algunos CDs de portada de las revistas, donde a veces se incluyen
versiones de estos programas. Por ejemplo, hace poco se regal&oacute; el
Bryce 2, el antecesor de Bryce 3D, con el que puedes generar paisajes fant&aacute;sticos
de manera bastante sencilla.</font>
<p><font face="Arial">Otra posibilidad quiz&aacute; m&aacute;s econ&oacute;mica
es la de usar editores de niveles de... estooooo... er... cu... cua...
Quake y similares. Seg&uacute;n anunci&oacute; Carlos Sis&iacute; en la
lista del CAAD, &eacute;ste es el m&eacute;todo que est&aacute; empleando
para su thriller Dante's Mill: "<i>hacer mapas para Quake y Quake2 es mi
gran pasi&oacute;n, y siempre estoy haciendo algo con ellos. Con algunas
utilidades espec&iacute;ficas consegu&iacute; dibujar mis propias texturas
e incorporarlas en las escenas (al fin y al cabo, Dante&acute;s Mill transcurre
en un pueblecito, y no en una base espacial llena de Stroggos), luego descubr&iacute;
algunos sitios web llenos de modelos y me baj&eacute; mesas, sillas, extintores,
l&aacute;mparas de ara&ntilde;a y un sinf&iacute;n m&aacute;s de cosas
que me han ido de perlas. Cuando una escena dada estaba lista, la ejecutaba
y sacaba una captura. Ajustando su tama&ntilde;o y el FOV, ya ten&iacute;a
el formato de la mitad de 480 que precisaba para Dante's Mill</i>".</font>
<p><font face="Arial">Y para conseguir modelos 3D ya fabricados ah&iacute;
van un par de direcciones facilitadas por Javier San Jos&eacute;: <a href="http://3dfiles.com/">http://3dfiles.com/</a>
y <a href="http://avalon1.viewpoint.com/">http://avalon1.viewpoint.com/</a></font>.
<p><font face="Arial,Helvetica">En cuanto a soft de tratamiento gr&aacute;fico
uno de los cl&aacute;sicos es el Paint Shop Pro (<a href="http://www.jasc.com">http://www.jasc.com</a>),
aunque hay muchos m&aacute;s. Para visualizar gr&aacute;ficos y aplicar
sencillos efectos, cambiar tama&ntilde;os y resoluci&oacute;n, pasar de
un formato a otro, etc. recomendamos una excelente aplicaci&oacute;n gratuita
llamada IrfanView, cuya homepage puedes encontrar en <a href="http://stud1.tuwien.ac.at/~e9227474/">http://stud1.tuwien.ac.at/~e9227474/</a>.
&iexcl;IrfanView es de obligatoria instalaci&oacute;n!</font>
<p><b><font face="Arial,Helvetica"><font size=+2>U</font>n <font size=+2>P</font>lan
de <font size=+2>C</font>opias de <font size=+2>S</font>eguridad</font></b>
<p><font face="Arial,Helvetica">&iquest;Cu&aacute;ntos proyectos se han
ido al garete tan s&oacute;lo porque el programador descuid&oacute; ir
realizando copias de seguridad? Desgraciadamente muchos... demasiados.
Hacer copias de seguridad es de absoluta importancia: si un virus te formatea
el disco, cometes un descuido al hacer un 'deltree *', o el disco duro
se aver&iacute;a (un rayo puede hacerlo)... se pierden decenas de horas
de trabajo, y el rehacer ese trabajo es tan duro que a veces se acaba abandonando
el proyecto definitivamente.</font>
<p><font face="Arial,Helvetica">Y realmente hacer una copia de seguridad
no cuesta nada, con una simple copia de los ficheros vitales de tu aventura
(como la base de datos, o el fuente Inform) a un diskette o a un disco
removible ya basta. Esta copia la debes hacer semanalmente o, mejor a&uacute;n,
diariamente. Lo m&aacute;s pr&aacute;ctico es montarte un fichero BAT y
comprimir el directorio de proyecto y todo lo necesario en un fichero comprimido
con nombre 'mesdiaa&ntilde;o.zip', por ejemplo. En el caso de realizar
la copia de seguridad sobre diskettes procura hacerla por duplicado en
dos diskettes diferentes porque, como muy probablemente ya habr&aacute;s
experimentado, este medio no es del todo fiable, ya que tienden a estropearse
con suma facilidad.</font>
<p><font face="Arial,Helvetica">Y ya sabes, cuando acabes tu proyecto,
la mejor copia de seguridad que puedes hacer es difundirlo bien difundido,
si es con c&oacute;digo fuente mucho mejor. As&iacute;, en caso de que
lo pierdas, probablemente dispongan de &eacute;l varios miles de personas,
habr&aacute; aparecido en una buena cantidad de CDs share y estar&aacute;
en una decena de <i>ftp sites</i> y sus respectivos <i>mirrors</i>, con
lo que recuperar tu proyecto ser&aacute; cosilla de minutos.</font>
<p><font face="Arial,Helvetica">Bueno, y tambi&eacute;n cuando acabes tu
proyecto acu&eacute;rdate tambi&eacute;n de comentar a Spanish Quest tu
obra... &iexcl;qu&eacute; para eso estamos!</font>
<p><font face="Arial,Helvetica">Continuar&aacute;...</font>
<center>
<p><font face="Arial">[<a href="../sumario.htm">Volver</a>]</font></center>

<p><layer src="http://www.spidersoft.com/ads/bwz468_60.htm" visibility=hidden id=a1 width=600 onload="moveToAbsolute(ad1.pageX,ad1.pageY); a1.clip.height=60;visibility='show';"></layer>
</body>
</html>
