<html>
<!-- #BeginTemplate "/Templates/Contingut.dwt" --> 
<head>
<!-- #BeginEditable "doctitle" --> 
<title>Reacciones simples a las colisiones - Gravedad</title>
<!-- #EndEditable --> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="estilos.css" type="text/css">
</head>
<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td> 
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr> 
          <td valign="top"> 
            <p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Autor: 
              <a href="mailto:is04732@salleurl.edu">Carles Ros Mart&iacute;nez</a></font></b></p>
            <p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Fecha: 
              13-07-01</font></b></p>
          </td>
          <td align="right" valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "TituloParte" -->PARTE 
            3: REACCIONES SIMPLES A LAS COLISIONES<!-- #EndEditable --></font></b></td>
        </tr>
      </table>
      <h1><font face="Verdana, Arial, Helvetica, sans-serif" size="4"><!-- #BeginEditable "TituloSeccion" -->Gravedad<!-- #EndEditable --></font></h1>
      <!-- #BeginEditable "Contenido" --> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Aplicar la 
        fuerza de la gravedad forma parte del sistema de din&aacute;mica de la 
        aplicaci&oacute;n; pero para simulaciones sencillas, se pude simular la 
        gravedad aplic&aacute;ndola directamente al vector de velocidad del objeto. 
        As&iacute;, al vector de velocidad que se pasa junto con el objeto al 
        sistema de tratamiento de colisiones ahora se le suma la velocidad proporcionada 
        por la gravedad.</font></p>
      <p>&nbsp;</p>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Pero ahora 
        puede que un objeto que antes sub&iacute;a ciertos obst&aacute;culos gracias 
        a la reacci&oacute;n por deslizamiento, ya no sea capaz de subirlos al 
        haber a&ntilde;adido al vector de velocidad una componente en sentido 
        hacia abajo. Esto puede que no sea el efecto deseado. En este caso existe 
        la posibilidad de pasar el objeto dos veces por el sistema de tratamiento 
        de colisiones: una con el vector de velocidad original y una segunda con 
        s&oacute;lo el vector de gravedad. Esto har&aacute; que la gravedad se 
        aplique despu&eacute;s de que el objeto se haya deslizado debido al vector 
        de velocidad.</font></p>
      <p>&nbsp;</p>
      <table border="1" cellpadding="3" cellspacing="0" align="right">
        <tr> 
          <td width="337"><img src="images/parte3/figura3a.gif" width="337" height="150"><br>
            <img src="images/parte3/figura3b.gif" width="337" height="150"></td>
        </tr>
        <tr> 
          <td class="figura" width="337"><font size="1"><b>De arriba abajo, figuras 
            3a y 3b</b>: Los dos m&eacute;todos para simular la gravedad pasan 
            dos veces por el sistema de tratamiento de colisiones</font></td>
        </tr>
      </table>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Podr&iacute;a 
        parecer que esto representa un doble coste en el tratamiento de colisiones, 
        pero fij&aacute;ndonos bien en como son en general las escenas se puede 
        ver que realmente suele representar el mismo coste. Las figuras 3a y 3b 
        muestran un ejemplo de aplicar la gravedad junto o separada del vector 
        de velocidad. En ambas figuras se aprecia como ha sido necesario pasar 
        dos veces por el sistema de tratamiento de colisiones. En la figura 3a 
        se ha detectado una colisi&oacute;n, lo que conlleva a tener que volver 
        a pasar por el tratamiento de colisiones para el intervalo posterior a 
        la colisi&oacute;n; mientras que en la figura 3b no se detecta ninguna 
        colisi&oacute;n para el vector de velocidad y s&iacute; para la segunda 
        pasada con el vector de gravedad; pero como en esta segunda pasada se 
        devuelve un vector de deslizamiento nulo se puede dar por finalizado el 
        tratamiento de colisiones.</font></p>
      <p>&nbsp;</p>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Con una correcta 
        combinaci&oacute;n de la gravedad, la reacci&oacute;n de deslizamiento 
        y la fricci&oacute;n se puede conseguir que un objeto permanezca quieto 
        en superficies poco inclinadas y resbale en otras con pendientes m&aacute;s 
        pronunciadas.</font></p>
      <!-- #EndEditable --> <br clear="all">
      <hr noshade size="1">
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr> 
          <td valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Anterior" -->&lt;&lt; 
            <a href="parte3_03rebote.htm">Anterior: Rebote</a><!-- #EndEditable --></font></b></td>
          <td align="right" valign="top"><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><!-- #BeginEditable "Siguiente" --><a href="parte3_05precision.htm">Siguiente: 
            Error de precisi&oacute;n</a> &gt;&gt;<!-- #EndEditable --></font></b></td>
        </tr>
        <tr> 
          <td valign="top" colspan="2" height="4"><img src="images/sangria.gif" width="24" height="4"></td>
        </tr>
      </table>
    </td>
  </tr>
</table>
</body>
<!-- #EndTemplate -->
</html>
